{"fileName":"All Fathom Transcripts.txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/All Fathom Transcripts.txt","type":"transcript","priority":"medium","content":"\n2024-09-17T20:00:00Z 00:00:04 - Tina Marie (profitdriversinc.com) Hey, Patrick. 00:00:05 - Patrick Shahverdian (sweetlaw.com) How are you doing? Good. How are you? 00:00:08 - Tina Marie (profitdriversinc.com) Good. I'm trying to get on my windows up in real quick. saw you sent your assignment. I haven't got it yet. Microsoft. I'm gonna move this over to Google Docs for myself. I won't even let me copy it. Oh, dude. I don't want to go through all those steps. Um, yeah. I'll just look at it here, I guess. Um, how long did it take you to do this? 00:01:08 - Patrick Shahverdian (sweetlaw.com) I had a new guy that came, I basically did this with him for, believe, the other week. Yeah, because I was just explaining what we do, so I kind of already did it with him, so I just had to put it on in writing. 00:01:28 - Tina Marie (profitdriversinc.com) Okay, do you feel that there was anything useful about it when you did the exercise? Did you think anything? where's it just recording? 00:01:40 - Patrick Shahverdian (sweetlaw.com) This is what it is. I mean, it's always good to know. Like, just get some cases to make sure that you know exactly what steps need to be done on each case. It's easy to like skip one and then. 00:02:00 - Tina Marie (profitdriversinc.com) like the health insurance stuff for the distributions are out like it'll come up because accounting needs those to process the distributions but I mean we did we do so many cases like you pretty much already know what needs to be done yeah and I only have two other people on my team so it's not like the tasks are broken up to like four different people yeah my gosh I hate I have a Microsoft account but I just never use it I have a PDF I might ask you to send it some other way because I actually have like three accounts I've got my school account because I'm a student I've got one for my mission and I've got my personal fun and they don't make logging in easy like you can't just anyway yeah Uh, yeah, if you would mind just copying pasting it, even into an email is fine. Oh, that should do it actually, let's see. I'm gonna try to get it signed in. Oh my gosh, always it makes me like reset my password. Chirping, oh gosh. That an allergy is my eyeball sting, sting, allergies suck. don't know you have allergies, but they suck. My little sister doesn't have a little. that's you so lucky. Everything makes my body just go bleh. right you emailing that to me yeah thank you let me open up see what i'm going to do i will make a new spreadsheet is what i think i'll we need a lot of like copy and paste in light bro calm down thank you what the heck Oh, good. Okay. I was like, it wasn't letting me crowd it. Okay, so I want to do this until I want to do it. I'm going to share my screen. So I want, that's everyone. And then I'm going to Actually, so introduction call. I'm just going to kind of do this stuff together. Um, because it'll make it easier to kind of sort and track this time. Did I do that right? I'll see does this and does them the best. Okay. So nobody is assigned to that. Oh, so he never mind. It's just in a different row. Um, sending defendant insurance. 00:06:28 - Patrick Shahverdian (sweetlaw.com) Cynthia does that. Okay. 00:06:33 - Tina Marie (profitdriversinc.com) Sometimes the formatting like breaks in between things. Like this. Okay. Cynthia, he does it best. The job doing us by the way and thank you for that. That'd be helpful. Well, she and Cynthia are able to do the same. Okay. I'll see limits, other policy limits level is that or same level. Never mind. Okay. I'm trying to like fry in my brain. I got like four hours of sleep and not for good reason. I mean, kind of it's tucked in my sister and we're ridiculous cackling into like one o'clock in the morning, like 12-year-old, but making red jokes like 10-year-old. 00:07:35 - Patrick Shahverdian (sweetlaw.com) It's plenty of to wake up in the morning. 00:07:38 - Tina Marie (profitdriversinc.com) Oh, 540. So that's who worked out so well for me. I'm a little punch drunk, Patrick. But it's okay. She had to get up at four o'clock. 00:07:54 - Patrick Shahverdian (sweetlaw.com) She works at a methadone clinic. 00:07:56 - Tina Marie (profitdriversinc.com) She's a nurse and she has a 45-minute drive. I have to, when she comes home, she's going to be dead driving on these windy roads. I kind of, I know kind of like, I do feel bad about that, depending on what the call is regarded. Right. See. Soon. And now this is tedious. I'm just doing this and that seems always full of the time, but it's not because formatting it will just do some things I want to get into kind of creating a structure for time. Okay. And this will be better for kind of visualizing it and making a correlation to case-in-case volume. My daughters' birds are going nuts, it's got parakeets, okay, let's see, so introduction call. now bear with me because systems optimization, all of this is a case-by-case kind of process, right? So there are fundamental things that I look for and ways at approaching it, but it gets customized is for multiple reasons, team, time, and also the person who's running the system or the people who are running the system. So, for example, I know you don't want to read books. There are, you're not the only one. I use this example because it's the first thing that comes to my mind of, like, Mark, I wanted to have him do a gratitude practice just to help him be in a more positive mindset because it works really well. He's like, Tina, he tried for a few weeks. didn't really push back. He just really didn't do it. He's like, it's not really my thing. I said, that's you got to tell me that because, you know, just because I suggested doesn't mean I think I know all the things and it has to be one way. It has to be the way that you will do it, the way that you can buy into it. If you don't buy into it, you're not going to do it. You're not going here. Continuing client. Elsie does this and does it best. Okay, we'll go back here. I can tie. Does it best? Okay, and client doctor. gonna guess that's also Elsie. Patrick and Elsie depending on what the calls regarding. Oh wait, I put that in there. I'm gonna just didn't get it actually there. Now this is why putting things in a good format to begin with, which I did not specify as far as she might have actually, but it's okay. Just because later. So Um, preparing demand letters, why I know you just have to do that. That's Mark wants you to do that. Right. 00:12:13 - Patrick Shahverdian (sweetlaw.com) Uh, all the attorneys right there demands. 00:12:16 - Tina Marie (profitdriversinc.com) Yeah. We just had the conversation screw looking at AI demand writing services, negotiating and finalizing new settlements, doctor reductions and distributions. Now, I know that at least the distributions can be done by someone else. What about not necessarily on your team that you have somebody on your team that can do this, but these things could be done theoretically by someone else, right? Doesn't have a turning. Okay. At knowing who's on your team and definitely don't think anybody else would be. That's what is that? So one, two, four, what did I do? Yes, property damage. Copy and pasting would not be that difficult. Patrick, right, I'm just not. OK, all right, um, let me go into little bit a real question. Do not update the password. That's how I get locked out a bit of I could use. There's some stupid things. See. Is that this one? If I mess this up, I'm taking that out to you and I think it might be just one refresh. I the last 60 days or not. Actually, I think I want to know I want reset the parts. How would you be by attorney? All of the cases like attorney are matters by team. And then team Patrick. So you have 114. Oh. Then, let's set up 22 negotiations. What's it? 00:15:10 - Patrick Shahverdian (sweetlaw.com) It's one we like to disperse the money, but we keep a little bit, as we're still waiting on something. Like a health insurance link to pay, but we can distribute the client funds and take our portion without having to like wait for it. 00:15:32 - Tina Marie (profitdriversinc.com) I'm to do one more thing. So, Mark just took some of your cases right and put them somewhere else. 00:15:53 - Patrick Shahverdian (sweetlaw.com) Yeah, we saw some things too. 00:15:56 - Tina Marie (profitdriversinc.com) Hank, right, okay. How many? I have a number of that skewed, so let me text Marco because I need him to give you guys a report and I keep forgetting to ask Mark. Hey, when are you going to get me a report that the attorneys can look at with all the stats I asked about? Like weeks ago. I need a saucy face. Whoops. Come on, man. I'm dictating. Okay, so I need that because this should have a correlation to the closed date. But it'll be interesting to, let's see how we made that correlation. Again, I know that it seems like a very scattered frame, but this is the time that we spend creating the process and kind of putting structure on where the time goes is worth it. And it is kind of, I don't know, not just like it's disjointed, like there's trying to wrap around everything. So I'll see, I'll see. Cynthia, Cynthia ordering final medical records, initial documents, sending different insurance inquiries, um, and or policy limits. I also need people's time reports. okay. So Cynthia works in the office or at home or, okay. They're both in the office. And she's there every day. 00:18:48 - Patrick Shahverdian (sweetlaw.com) Cynthia, I'll see why it's a week is home. 00:18:54 - Tina Marie (profitdriversinc.com) Okay. I'm just going to put nuts for myself. I'm just getting like overall operational structure so that I wrap my head around it. So do you think that you have a ballpark average estimation of how long these particular tasks take average, right? Obviously, there will be outliers, some that go very quick, some go very long. If I put a column here, do you think that you could give that? 00:19:42 - Patrick Shahverdian (sweetlaw.com) Is that just like property damage, like let's say just for one client, it could be like over the period of like two, three weeks to get it done? 00:19:56 - Tina Marie (profitdriversinc.com) Okay, so here's what we'll do because time has to be We'll go to complete, like so, or phase, because I kind of like these different phases, and then um, estimated time, um, like, minutes, hours spent, like this task type, right? So, like, how, ordering the policy limits, I mean, like anything where you've got to call insurance, sometimes those calls, like, take a while, right? chasing clients down, and so I know that that's not going to have a real number two, but it'll give me some kind of ballpark, and it'll help, it'll just help in the mental process of kind of creating this, and then trying to figure out basically what is the best type of flow throughout world. the day in terms of like blocking types of tasks. And then also looking at it and going, how often do we need to go through this cycle for all the cases that you have so that we're not waiting two or three weeks before we check on the next thing? Does that make sense? Because I don't think right now that you have anything where you do that, like where you look at a checklist, basically, and everybody just mentally goes through a checklist. The problem with that is we are statistically human beings are terrible self reporters. So if you mentally are saying you went through the thing, right, you don't check on it, you don't look at something, we're going to forget or assume the other thing is, it's like the bystander effect that that we assume that somebody else has done the thing. As as Especially if there's a thing where there's, there's two people who do it. So I'll see in Cynthia. I'm like, oh, well, I'll see mine is done then or whatever. So if we have a list and we just kind of go through it and and you've got a list of your cases, checking off whatever things are done. And then whatever stage that we're in now. Do you have something like that in Lidified that has all of these statuses. Yeah, I didn't think so. Okay. And you don't have anything that that you could just go through and say it's in this section. It's in this status. It's in this status. Right. And can some of these be happening simultaneously? Yeah. Okay. So that's another thing that I want to know. So, um, um, can happen. currently it so we'll do that and I'm going to let's see yeah okay so let's see the concurrent first introduction calls obviously it's first thing one of the things can be happening whoa at the same time let's go down that row confirming coverages and liability I feel like that's kind of its own thing that has to happen first and then true it has to happen so none of these like these are all standalone right and then yeah assessing property damage you can probably be working on that while you're setting up for treatment yep okay so this is not for let's see let's say that can happen I'm going do number three for sending defendant insurance inquiry request or D&D. That can also happen, right? Same time-ish. You don't have to wait for setting up treatment and property damage to do sending defendant insurance inquiry or do you? 00:24:19 - Patrick Shahverdian (sweetlaw.com) So typically you wouldn't be doing the treatment if you're sending those insurance and because basically we're trying to see if there's any insurance. 00:24:29 - Tina Marie (profitdriversinc.com) Okay, so this goes before treatment? 00:24:34 - Patrick Shahverdian (sweetlaw.com) Yeah. 00:24:36 - Tina Marie (profitdriversinc.com) Okay, so I'm going to cut these, bring them down here, drag everything up, change this. Okay, let's go through the order then first in case there's anything else that can't be done before the thing above it. Can you hear these first? Yeah, I got to make sure the doors are closed next time. 00:25:33 - Patrick Shahverdian (sweetlaw.com) Okay. It looks like no, it's in order. 00:25:37 - Tina Marie (profitdriversinc.com) Okay, now it's an order. Okay, so one, two, the defendant. Insurance inquire request or DMV insurance chart request. So that will disregard the numbers. Actually, I'm going to go like this. One. Hey, that's not what was supposed to work, dude. Appreciate that. Okay. So any defendant insurance, um, is there anything else that happens with this or is that like preliminary that has to be done before we get to the next steps. 00:26:29 - Patrick Shahverdian (sweetlaw.com) Um, I guess you can do the intro call and stuff or it would already be done. 00:26:37 - Tina Marie (profitdriversinc.com) Um, so do we need to change this order again? 00:26:43 - Patrick Shahverdian (sweetlaw.com) No, I mean, typically the intro call would be done at that point. The intro call is like the first thing. So. 00:26:57 - Tina Marie (profitdriversinc.com) So do we send the this before confirming or are they. 00:27:00 - Patrick Shahverdian (sweetlaw.com) It kind of does in techno can't be so like you do the intro call and you know, you they don't have the defense insurance information Actually number four order initial documents as police reports you would put that before setting defendant insurance thing Okay Could Since it's both Cynthia, okay, what else So ordering policy limits medical referrals You can do those simultaneously Okay 00:28:00 - Tina Marie (profitdriversinc.com) five, six. I'm just going to do this together, five, six. Okay. Um, what else? 00:28:24 - Patrick Shahverdian (sweetlaw.com) seven, eight, nine and six can all be done together. 00:28:35 - Tina Marie (profitdriversinc.com) six, seven, eight, two, one, two, five, ten. Wait, now that's right. Oh, I'm thrown off because the rest of that. Oh, that's why I'm sorry. Never mind. This is definitely its own thing, own thing, own thing, own own thing, right? property damage weight. 00:29:12 - Patrick Shahverdian (sweetlaw.com) Property damage you can do with five, six, three. 00:29:40 - Tina Marie (profitdriversinc.com) Okay. Then can three be done with five and six also. 00:29:55 - Patrick Shahverdian (sweetlaw.com) Yeah. 00:29:58 - Tina Marie (profitdriversinc.com) So, because what I mean when I. say done with it is like basically it's not contingent, like you can't, you don't have to wait for anything. Okay, just want to make sure we're on the same page. Okay. So, do you feel like most of the work is done linearly, like people thinking that it's this step, then this step, rather than here's all the things that we could be doing for this case right now, what do you think is more likely that is happening? 00:30:38 - Patrick Shahverdian (sweetlaw.com) Probably like step by step. 00:30:41 - Tina Marie (profitdriversinc.com) Okay. So, just this right here would probably could probably really help the flow of the cases. Knowing how many cases you have now, here's what I don't know is how long it takes and how much waiting there is and how good it is, but. What I would guess is that there's a lot of time people are just not really working super hard and at stuff and sitting there just thinking about the cases maybe and just glancing at the records and not really pushing it forward. What do you think? Do you think that because obviously I'm not, I don't want anybody. I'm making a wild assessment. 00:31:30 - Patrick Shahverdian (sweetlaw.com) I'm sure there's like times in the day where it's just like things slow down. Obviously, happens with me too. But I do think like some of these things like policy limits, like that takes like five minutes. You know, so it's like, let's say you're, or you just got off a long call and you don't want like take a call right now or something. You don't want to make a call. could like do the policy limit real quick. It takes five minutes. You just didn't put the info. 00:32:04 - Tina Marie (profitdriversinc.com) So here's where I'm getting out with this. And this is my hard- slide that people don't really like, but you'll have no problem with your team. don't know. And and also you're kind of laid back. So if you're not looking at it this way, but my guess would be, especially based off of the conversations I've had with Mark about how things go, is that there are probably several gaps throughout the day, every day of the week, where not much is getting done and could be getting done. Because if you have 116 cases, and most of them are in a status of needing to get something, there are probably 116 calls that could be made somewhere in the team throughout the day. they're hourly, right? You're not, right? Or are you hourly? No, but they are, right? Um, I would bet that all the billable time is not used very effectively or, um, I would just bet that there was a lot of just about 10% level effort. Being put, and this isn't talking about your team statistically. I'm talking about people in general. And I think part of the nature of it is not necessarily laziness or unwillingness to work. I think it is the volume of things to do and the mental effort. And I think it's a lot. I would not do this job. This would be tedious. I would hate it. But, you know, that's me, I didn't go into this. but what I think could happen is if we work through this for a little while, go through it with Lorenz and get an idea, I would love to see you do is kind of create some structure and say, look, here's the list of cases that we have, even if you put it in a spreadsheet and if you're using Microsoft Office, you probably have a sweet lot account, right, with Microsoft. So, it's secure. Everything stays on your own drive, stays, you know, where only sweet lot people could get to it. You could check it with Lidify. You could have some other kind of identifier. don't know if Lidify doesn't have, like, case IDs. does matter IDs. Okay. that would get really confusing. I feel like I'll ask Mark if we could do this. And based off of other work that we've done together, I feel like he would be okay with that. And I'll show him this and see what he thinks. But honestly, I think that this could be really useful across all of Sweet Law. Because just the mental taxing effort of trying to track all the different, like you only have 160, but 116 is a lot. And some of the other teams have 300, you're going to have more. And whatever state that they're in, somebody needs to be checking to see, is it waiting on us? Is it waiting on them? If it's waiting on them, one was the last contact point. If it's more than 24 hours or two business days or whatever, you deem appropriate that we do follow up. So just going through a checklist of here's the things that have to get done. Here's the list of cases. Here was the last touch. So then there were be another column that's okay so like we would have this as a checklist while people just kind of get used to it like oh yeah I could be doing this here's all the things that have to be done and there's a spreadsheet with all the matters on it and then so I really want to see what you guys look at letify what do you do and letify what do you guys record and letify what do you use it for everything like the whole case is on there yeah so all the notes um so like you could go in here like click the matter yeah so this is what I see when I open the case so there's highlight activity can I click on activity I mean I can but so it'll show the last time somebody We touched it, but not necessary. I tried to call and nothing happened, right? 00:37:07 - Patrick Shahverdian (sweetlaw.com) Um, you could pull like left a voicemail still pending, whatever. 00:37:13 - Tina Marie (profitdriversinc.com) Okay. timeline. No. How would you, um, like, no, what's the, what's going on? Yeah. What's the last thing that happened? 00:37:32 - Patrick Shahverdian (sweetlaw.com) Who, who touched it last? So, on the left side, this big, like, paragraph, how you do it there first. Okay. 00:37:45 - Tina Marie (profitdriversinc.com) So, yeah. So these are all the notes. 00:37:49 - Patrick Shahverdian (sweetlaw.com) These are, they use this side for like, made, like bigger points. Like she's got an injection. So I want to know like that. And then on the right side, the, um, the activity. But if you scroll down, these are more like calls, email the sent out, things like that. 00:38:07 - Tina Marie (profitdriversinc.com) OK, so let's you look at both. OK, let's just let's just run through these real quick and look at something. So this was last touch yesterday. We're going to go like boom, boom through a lot, really quickly. Last touch three months ago. OK, tell me what we are going look at to go. Why was this only the last note three months ago? 00:38:37 - Patrick Shahverdian (sweetlaw.com) Can you go to the conversations? I know he's still treating, so we could sound like a follow-up text just to keep it on the I loop on what's going on with the case, but he's still in treatment. 00:39:06 - Tina Marie (profitdriversinc.com) Okay. So, um, do you know when treatment is supposed to be over? 00:39:14 - Patrick Shahverdian (sweetlaw.com) Um, can you scroll up to the damages? 00:39:19 - Tina Marie (profitdriversinc.com) And tell me like, scroll over here and then the far left. Oh, here. Click on it. 00:39:31 - Patrick Shahverdian (sweetlaw.com) Yeah. 00:39:41 - Tina Marie (profitdriversinc.com) This doesn't total it for you, huh? But it should, because you are trying to hit policy limits, right? 00:39:47 - Patrick Shahverdian (sweetlaw.com) It does on the other page. But this. Yeah. Okay. Right. 00:39:57 - Tina Marie (profitdriversinc.com) There are total damages. And. And where does it say what the policy limits are here? 00:40:04 - Patrick Shahverdian (sweetlaw.com) Yeah, if you go to insurance on it right there. So it's 150. 00:40:14 - Tina Marie (profitdriversinc.com) So I'm 50,000. 00:40:16 - Patrick Shahverdian (sweetlaw.com) Yeah. 00:40:17 - Tina Marie (profitdriversinc.com) OK, so that's not likely. would think to hit a policy limit. So then, um, um, I'm not sure how much more I'm to do under this. Yeah, so it again, I know this much, right? So I'm just asking questions. How would you know? I mean, OK, you know that he is in treatment, but if there's no contact for three months, how do you know that they're still going? 00:41:00 - Patrick Shahverdian (sweetlaw.com) you know that they haven't so is there a time period that a person can stop going for treatment that affects the case yeah more so in the beginning like if they don't go to treatment like a month and it's like the big red flag but not later it kind of depends but like if they're waiting for a surgery or something it's obviously going to take some time to schedule it and stuff like that but so as long as the initial doctor's assessment is there that has said these are all the things that they need they kind of have a window a significant window to accomplish it like basically they should be going consistently up until like the pain management visit after that it's like take some time to schedule injections or surgeries or things like that so there's some like I guess there, but like initial appointment, there shouldn't be any gaps really. 00:42:09 - Tina Marie (profitdriversinc.com) So is there a reason why it wouldn't make sense to have at least a monthly follow up with somebody or every couple of months at a particular stage help me figure out like, if you were to look at this and just make sure you're on top of it and not assuming that things are going a particular way, what could you do that's not really bugging the client but is being proactive and making sure that things are going along a schedule? 00:42:43 - Patrick Shahverdian (sweetlaw.com) Like a quick text? Yeah. Every 30 days or something? 00:42:49 - Tina Marie (profitdriversinc.com) Do you think that that's reasonable to at least have your team attend every 30 days? Okay. So we're just going to put this down here, attend. Well, so let's say we don't hear back for every 30 days. So let's say, okay, it's in 30 days, we send a text message. If we don't hear back, then do we check a week later and just keep doing it every week until we do hear back, just to make sure that we're still connecting? 00:43:18 - Patrick Shahverdian (sweetlaw.com) Yeah. 00:43:20 - Tina Marie (profitdriversinc.com) Um, let's see the text. Um, in the case with no contact. Um, well, I'll say example, in treatment. Really, that's probably the only thing, because everything else you'd be talking to a doctor or insurance, or you need to be talking to them about distributions, right? So this would probably be the only time that there's just an okay period to not be talking for a while and not managing the time. 00:44:00 - Patrick Shahverdian (sweetlaw.com) Is that correct during treatment? Yeah, I mean, you want to make sure they're going and stuff, but like, there's a certain point where It's less required because like, let's say, they can appointment for like October 28 for an injection, right? Right. It's kind of like It's a month away. 00:44:20 - Tina Marie (profitdriversinc.com) There's no point. Yeah. Okay. Yeah. What I'm saying is, is there any other status here that the case could be in where It's acceptable to not hear or not have any communication efforts for even more than a few days. 00:44:40 - Patrick Shahverdian (sweetlaw.com) Negotiations like I got a 30 days for the insurance to respond. So There's not really not going to be much update until I hear back type of thing. 00:44:52 - Tina Marie (profitdriversinc.com) Okay. So that makes sense. Um, but if the insurance has responded, then you're in a new state. 00:45:00 - Patrick Shahverdian (sweetlaw.com) Anyway, right or you're still dealing with it. No, it's still negotiations, but I have to update the client on what the offer was things like that. 00:45:38 - Tina Marie (profitdriversinc.com) Okay. I better. Yeah. Okay. Um, all right. So we were going back in here. Let's just go ahead and. don't want that. Look at a few more cases real quick. Last one September 13, just a few days ago. So, um, mailing insurance, companion matter, oh, um, like, incidences in the same, like, multiple people. Okay, like Yeah. Okay. Yesterday, Saturday, four months ago. 00:46:31 - Patrick Shahverdian (sweetlaw.com) And this one, I texted her recently. 00:46:37 - Tina Marie (profitdriversinc.com) Okay. I'm stations. 00:46:40 - Patrick Shahverdian (sweetlaw.com) Right. Go back. 00:46:48 - Tina Marie (profitdriversinc.com) Okay. And you would think that that would be more useful on the home page, just immediately there, but okay, so that's been touched. Good job. This is what we want to see though is that, that says July 24th, don't go to conversations. 18th year to go. Okay, well actually, let me ask you a question. 00:47:28 - Patrick Shahverdian (sweetlaw.com) So he's just still in treatment. 00:47:31 - Tina Marie (profitdriversinc.com) Yeah. I'm going to keep getting them until three months out, because it's all up, okay, three months out. I didn't pay attention to which one I was on, I'm just going to look down here. July 24th. Two months ago. So. Um, what should we look at to see, like, uh, still have back pain and decided to get that after all? Uh, that was three months ago, which I'm gonna call, yeah, I mean, that seems like that should be followed up with what do you think? 00:48:34 - Patrick Shahverdian (sweetlaw.com) Yeah, was there a note on the website at all? 00:48:37 - Tina Marie (profitdriversinc.com) Um, details right here, July 24th was the last thing. 00:48:45 - Patrick Shahverdian (sweetlaw.com) Yeah, so this one has to be touched. 00:48:48 - Tina Marie (profitdriversinc.com) So here's what I would recommend for you just to, again, so we're just trying to figure out what helps you get things done the quickest without being tedious. Now, the amount of volume that you have, maybe you spread it out across a couple of days, but this wouldn't take very long, especially if you did this every week and just literally went in, clicked on all of them real quick, because what would happen is if you started doing that and you started following up with your team, they should be doing this. They should be checking on their stuff and you go look at it and go, yeah, they're on it. And then you just start to do it as just kind of randomly going through the cases as a audit and just be like, hey, is there anything that has gone too long without being touched? And if so, who did it? Why are we unclear about what the expectations are? just think that we shouldn't, but is there a disagreement internally about whether we should or we shouldn't? is there not enough clarity about what requires a response? Is it that some people just feel like they're bothering clients? And, and, and does that need to be trained because like, who's bothered by getting the job done for them that we're supposed to do, getting it wrapped up posted up that type of thing. 00:50:11 - Patrick Shahverdian (sweetlaw.com) Yeah. 00:50:12 - Tina Marie (profitdriversinc.com) be something that you'd be willing to do is just just go like once a week, just once a week. And you can split it across two days if it just is annoying, but honestly, that should go really quick. I think, I think you could be done with all your cases in an hour. Just click, get out. Because most of them, you're going to see, yep, they touched it. Yep, they touched it. Yep, they touched it. There should only be a few where you're like, that's a long period, or you know that you looked at that last week. And you know that they're not at a time period that, because you already looked at it, right, that we should be messaging out. It's going to be a few more weeks. So after the first couple of times, it shouldn't take you very long. Yeah. But the insight into the gaps should be really quick and really clear. Would you do that? 00:51:01 - Patrick Shahverdian (sweetlaw.com) Yeah, I mean, my file reviews are basically that. 00:51:04 - Tina Marie (profitdriversinc.com) Okay. 00:51:06 - Patrick Shahverdian (sweetlaw.com) So, once you've clicked our older cases, I should focus on those. But typically, on the new ones, I'll just check like the intro call was done. We've found insurance to take set liability. Basically, get the case, like the green light to start treating it. Middle ones are more, you know, where are they at? Are they going? going? Do they fall off? Are they missing? And then the really old ones is typically settled or we're just like waiting on health insurance, lean type of things. yeah, mean, I pretty much do what you just asked. But yeah, this case needs to be touched for sure. 00:51:55 - Tina Marie (profitdriversinc.com) So, what is your schedule for doing that and making sure you've covered that? 00:52:00 - Patrick Shahverdian (sweetlaw.com) all the cases, like what's the frequency? I try to do it at least every other day. 00:52:09 - Tina Marie (profitdriversinc.com) All the cases? 00:52:10 - Patrick Shahverdian (sweetlaw.com) Not all of them, but like we'll go through a portion of my case list. The other week we've got like a bunch of new files. like, you know, I went ahead and went through all those, make sure like what first of all see what the case is. Is it like a big case, small case? What potential issues we might have with it? Where to send a client for treatment? 00:52:37 - Tina Marie (profitdriversinc.com) So would you just be willing then, let's say this is a starter, top to bottom, I'm looking at the way that we just looked at it. then also, and because we're running out of time, I don't know there's enough for you to tell me all of this, but like I'd like to understand all the things that you look at when you do file review. Now, we did talk about, would you be willing to do file review with your team yesterday? You did. And how many files did you go through? 00:53:13 - Patrick Shahverdian (sweetlaw.com) We just felt like we did like 40 minutes. I think we went through like 10 cases. 00:53:19 - Tina Marie (profitdriversinc.com) Okay, so that's a long process. So my version of this audit is definitely not as thorough as what I think that you were doing. But there were two cases that probably should have been touched that we found in the first few. And like you said, they were older. So what I would like is just once just go through everything top to bottom. And then next week when we're all meeting, of give me some insight as to what you discovered and realize, okay, we should be doing it this way. And maybe it's by the age of the case. Maybe it's by a status or something like that, but. How can we just make sure that we're not going too long without touching the case and making contact with the client? And yeah, it's just about making sure because there are so many moving pieces, so many cases, so many different things to do, so many different reasons, it's not a fluid process, right? Because there's so much waiting on insurance, on doctors, on the patient, the client. So it could be really easy to have for things to fall through the gaps. So having a very specific process that makes sure that the only way to not have things fall through the cracks is top to bottom. could do that broken up as long as you're sorting the cases by date, right, by the day that they open, not because until they're closed. And so let's say you starting with the most recent cases up to like the most recent 50 cases, and then the next one, the next day, the next review, whatever, within that week, two weeks max, you're getting to the next 50. But then, so what I also think is two types of fire review. is just the quick glance, did it get touched, which you could go through all those 116 cases, probably in an hour. And you wouldn't have to go through all of them every week because they're, you know, they'd be really quick. So there's that version of it, and then there's the thorough, are there opportunities for us to like, do we need to do something different? But what I think will happen preemptively, is that as you go through in your skin, you'll go, you know what, we don't need to review that as a team, I saw enough of it, it's good. So then you can mark the cases that you probably should review as a team, have some questions about or somebody else you saw, there was a question that somebody on your team had, and then save those for the team power reviews because there's potentially something to discuss, whereas if everything looks good, you can just be like, you know what, nothing to discuss there, so you don't need to waste the team's time with basically managerial kind of oversight effort, which would be better with you for the most part anyway. So how do you think, how do you feel about that? 00:56:42 - Patrick Shahverdian (sweetlaw.com) Yeah, I think that's the best way to do it because naturally we all go through our cases just to see what's, you know, available to be settled or, you know, these cases are my responsibility at the end of the days, so I need to know, you know, where they're at. and make sure that they get maximized. no, I think you'd write, it's the best way just to go through each one. 00:57:10 - Tina Marie (profitdriversinc.com) Okay, so let's give that a try. I would love by the time that we meet next Tuesday that you had a chance to just go through everything and look at that and just kind of note anything. One thing I would love to note is how many cases had not been touched in more than 30 days. Do you remember that? Yeah. Okay. And just anything else that might have stood out and let's do the longest. Like, so whatever you notice, like, so there's one that hasn't been touched for three months. If you see anything longer than that, like, I want to know what's the longest that they had reached out just to check and make sure. and then here's our next step, just kind of restating the expectations of how the case will proceed. Does that make sense? Just people are people, know, and especially if they're going through hard things, there's a huge difference for really it's just a little amount of effort. It could just be the text message, right? And you could even have fairly canned text messages that are but let me fix this before putting in the number and or I guess if you're using the automations, it's already there so just be careful. But just it's that feeling of we are aware of you and we're at and we're checking in on you. It's a human nature nurture. 00:59:50 - Patrick Shahverdian (sweetlaw.com) no, I get it. I mean, we don't really think about it because, you know, we see the cases every day but it's a business perspective for you, but nearby. 01:00:00 - Tina Marie (profitdriversinc.com) like something traumatic and bad happened to me and all of this sucks and somebody called to check on me and it made my day, you know? 01:00:08 - Patrick Shahverdian (sweetlaw.com) Yeah. 01:00:09 - Tina Marie (profitdriversinc.com) It could do a lot for us and it can also increase referrals possibly if we just really made somebody feel good. It's a little thing. It could have a big impact over time and a compounding effect too as we gained that reputation for just really kind of holding, it's not hand holding, it's 30 days, but compared to just waiting through things, you know, make them not feel like it's a number and a transaction, that type of thing. Okay. Well, we were able to have that whole conversation because you did all of this, so great job. 01:00:48 - Patrick Shahverdian (sweetlaw.com) I'm here to see Lorenz have stuff that I didn't know on there. 01:00:52 - Tina Marie (profitdriversinc.com) Yeah, so we're all meeting next week and we will take a look at it and I think that that is going to be useful too. I'm really glad that you guys want to do that. the the working together thing because I think it's going to be insightful and even if it's just like a five percent difference um but if you give him five percent of your good stuff and he gives you five percent of his good stuff you know none you're both you're both just getting better and and then we're all getting better insight into the whole thing it's good you know that's not good you got to fix that i know that's what navies are for i can't take it out though because i have conversations every day or no no i can't because i just lift super heavy until i can't and then i can't walk for a few days but my strength increases i lose weight i still have more energy my like i did some studying and it's crazy like it's like kind of a new hack. I don't have to exhaust myself. So yes, I I could do better. My last lake press was 390 though, and it was smooth like butter. So I was pretty happy with that, okay? 01:02:13 - Patrick Shahverdian (sweetlaw.com) Okay. I'll be able to work out every day. You won't stay up late because you'll hate yourself afterwards. 01:02:19 - Tina Marie (profitdriversinc.com) I know, but I'll be so tired all the time. I ain't trying to be like that. And I just no. Naps are cool. Did you know I'm gonna leave you with this? It's like 80 reduction in cardiovascular events for people, especially men who take naps three or more times a week of at least 20 minutes. Massive benefit. 01:02:45 - Patrick Shahverdian (sweetlaw.com) I don't know I'm a weekend for sure. 01:02:47 - Tina Marie (profitdriversinc.com) Okay, you gotta get, you gotta get one in the middle of the week, just a little 20 minute. Maybe not. You're still young, but you're not up there like grandma here. All right, it was great talking to you. 01:03:02 - Patrick Shahverdian (sweetlaw.com) What time is it? 01:03:02 - Tina Marie (profitdriversinc.com) two. Yeah, oh, we're over. I will nag mark for the report again. He did this emoji. 01:03:11 - Patrick Shahverdian (sweetlaw.com) Good luck. Have a great day. I'll talk to you next week. Good to see you. You too. Bye-bye. Bye. patrick@sweetlaw.comPatrick\n00:02:00 - Tina Marie (profitdriversinc.com) You Thank you. Hi, how are you? 00:04:31 - Maria Gudelis (Maria Gudelis) How are you? 00:04:33 - Tina Marie (profitdriversinc.com) Sleepy. I'm not fully awake yet. didn't eat yet. daughter took my, well, older daughter took my younger daughters to seminary. So got to sleep in a little bit, but I was up till two working. So. No, it's just the way my body works better like that. Yeah, but also I have a missionary training at nine o'clock. So, are we going to have to check? Sure. think I do. I do. So, anyway, what were we talking about yesterday? 00:05:12 - Maria Gudelis (Maria Gudelis) Oh, yeah, yeah, yeah, yeah. We were talking about mama bear marketing, um, talking about the, um, the Google Doc we have on there in the community and how to build the offers and all that stuff. then your boxers, just listened to and yeah, so I did have a fun night last night. Thank you. And, um, and then this morning, I actually was at my mom's for bit and then, but you know, I feel a little off-kilter and then after this call after I picked my dog up because I didn't do my Bible journaling or anything this morning because I just got off and went straight to artwork and then helping my mom. Um, but uh, yeah, so in the chat chat stuff, yeah, that's cool too. I remember Ravi doing that when I used to work for him a couple years ago. So, and yeah, that was cool. I think me and Karina were going to launch a AI thing for e-com for Shopify stuff. I know we were building a little bit of about two, but we never really launched it per se, except everyone still goes to the free version. But I get what you mean, like what would Maria say? Like, that is, it is powerful. 00:06:17 - Tina Marie (profitdriversinc.com) Um, Yeah. Um, I was trying to figure out if I could figure out who I'm bear marketing was. Cause I remember there's this lady that's been around a long time also. 00:06:30 - Maria Gudelis (Maria Gudelis) And her name is Barb Ling. Oh, Barb Ling. Yeah. 00:06:34 - Tina Marie (profitdriversinc.com) She goes by mama bear now. 00:06:37 - Maria Gudelis (Maria Gudelis) So, oh, I thought she used to be just barbelling marketing or something. 00:06:42 - Tina Marie (profitdriversinc.com) Yeah. might be, but she on Facebook now, she's mama bear B. Oh. 00:06:49 - Maria Gudelis (Maria Gudelis) Yeah, I'm a barbelling authority marketing coach. Yeah, she bought some stuff for me in the back of the day. And then she also, it was in the worry form of doing good offers. Like she's just a decent person, you know? that offers. 00:07:06 - Tina Marie (profitdriversinc.com) I'm on her page and she doesn't say mama bear on her website but she just shows coffee. That's why I remember her. She's really in the coffee. That's right. 00:07:20 - Maria Gudelis (Maria Gudelis) yeah, she says on apology baby blue word 23 plus year veteran marketer coffee appreciator moose wrangler and more virtual coach. yeah, she doesn't have mama bear anywhere here but you're right. Maybe she just recently really branded. 00:07:35 - Tina Marie (profitdriversinc.com) Oh, no, this is um, if you go to facebook.com slash mama bear entrepreneur. That's her. 00:07:56 - Maria Gudelis (Maria Gudelis) Oh, yeah, I would. 00:07:59 - Tina Marie (profitdriversinc.com) Yeah, and I think that that's That's her old profile that she switched over. 00:08:04 - Maria Gudelis (Maria Gudelis) Oh, Fred's. Oh, she can't use that because that's a personal page, not a business page. 00:08:10 - Tina Marie (profitdriversinc.com) Yeah. And I can't switch mine to a professional page, not, not business, but professional. It's not an option for me, which is weird. 00:08:25 - Maria Gudelis (Maria Gudelis) Anyway, yeah. Yeah, I'm just shocked to see that it's not a page page. Did they take that functionality away? Because it used to be pretty easy that you could switch it over to a professional page. 00:08:37 - Tina Marie (profitdriversinc.com) I don't know when I have more than 500 followers and half for a long time. 00:08:43 - Maria Gudelis (Maria Gudelis) So I don't know why I wouldn't be able to. But I mean, it's been years since I've had a client do that. But yeah, I'm going to try to get maybe there was a glitch. I always think something's not working that should work on Facebook. Then it's a glitch and go back next day and try. 00:08:58 - Tina Marie (profitdriversinc.com) Oh, any of it, I've been looking at it for months because. they have analytics now. 00:09:01 - Maria Gudelis (Maria Gudelis) And it's not a business page, it's a newer thing. It's not, it's gone. 00:09:07 - Tina Marie (profitdriversinc.com) Anyway, um, so I want to be paying attention to the time with my brain. I did want to share with you though, one thing that Dan sent me, I'll just put it in the notes. Um, it's okay, I bought it, and I would share it with you if you wanted it, but um, hold on a second, gonna find chat here. Really inexpensive, and I think the only thing I'd probably use it for would be maybe some quick um, graphic type creation. I haven't gone through everything yet. their sales page, showed that they have some automations for graphics, but a lot of variety. And they do have AI. I'm playing with it to see. I don't like to finish products. don't think it's quality enough to be representative me, but I do think this type of stuff is sometimes good for repurposing old things. And one of the tests that I wanted to run was kind of a side-by-side faceless type of campaign to see what can be done because there's a lot of faceless marketing. People don't care about knowing, liking, and trusting if it's not a huge investment. They care about, are you teaching me something useful? And I got, I don't know if I still have it, businessprofessor.ai, where I would basically repurpose the same content and just change the voice a little bit to not necessarily be about the mom's side and the personal details as much, but still the same. The value of the content. tactics, principles, things like that, because the duplication shouldn't be that difficult if I get low cost, you know, assistant. And then if I'm duplicating it, but under a different brand sufficiently, it shouldn't be anything that's penalized and it would be like diversifying, basically. But it's an experiment I want to run because the audiences are so much bigger than they were, even just a few years ago, even pre-COVID. And it keeps growing this world of, you know, people wanting to side hustle, things like that. was thinking about, you know, even when I was a kid, my mom did, Mary Kay, Tupperware, Avon, what else did she do? But there was, women were selling things. And then there was, you know, the candles and the melaleuca and the amway and all that type of stuff. So, but now they've got the internet. I just think that it's, and the statistics are there, but there's just so many people to get to who aren't internet marketers per se, who are maybe they sell at the farmers market on the weekend. they could be taught about profit margins and simple things like that. So anyway, kind of thinking about how to expand stuff. Instead of, I always feel like I get trapped in the high ticket world and high value and high level. I, there's only, like I said, there's only so much of that you can do anyway, because high level clients require high level performance and investment. And so, you know, there's only a few of that. Everything else needs to be leveraged. And I just realized, like, there's a lot of people who know almost nothing and just to be able to teach them. So, anyway, those thoughts. But, and then, okay, so we were talking about potentially starting something with both of us as a kind of like a baseline foundation and being able to. And I mean, even at the same time, parallel, while we're not working together, kind of duplicate some of that work. Like, we could create a school group or a high level community that's similar and just start piping people in and figuring out a very low level schedule like where once a week we show up and answer questions. And, but because high level has rocking, like, let's say you make a reference from your existing group that you're building into this group, that link would be a tracking link. So those people are tracked from day one. So if those people buy anything, no matter what they buy, you get the higher level commission. And because like I have Facebook followers, that would just come in and do things. And we can decide if we want to create it as a free group or, you know, maybe it's $20 a month and it's low cost. And we're going to show up and talk to each other anyway. But how scalable is that? How many people would want to come in? I'm thinking volume of people who have trusted enough to give a credit card for $20 and to make a commitment for $20 a month. I think that could add up pretty quickly. But then, as we're talking to them every week, figure out, okay, what are you guys interested, what are you responding to? Where does the conversation not where does it consistently go? 00:15:02 - Maria Gudelis (Maria Gudelis) Let's offer that. 00:15:04 - Tina Marie (profitdriversinc.com) Let's make a training. Okay, this training is going to be $200 and this is what we're going to do. And we don't even have to like we can go run ads separately to bring people into that training. But if we have a group full of people who have already paid $20 a month and half of them have said, I really need to know this. And you and I know it doesn't matter what they want to know, we're going to be able to teach it quickly, live probably. And then provide some really good resources which we can take to VAs. I've got a ton of them of different sorts, video graphics, PDFs, all the works where we can take the live content that we made and then go make some pretty visual supports for them. And then that becomes an evergreen product that already exists in the members area. like, hey, you have this problem. Here's all our testimonials, these people. we give this to them and and you can have it now and it does not have to be a live training and if then you know if something goes really well we can say we'll do the live training again in a few months whatever if people want live more because they can do Q&A then we charge more that's the thing but there's so many different topics we could just do that on repeat but then so the Maria Tina version is always going to be a little different than just Maria riffing all by herself and just Tina riffing all by herself but especially if we really kind of like if it's a marketing question I'm glad Maria go at it and I'll have a little bit pieces and if it's a business management operations kind of stuff then I'll go at it and you contribute when you have a little something to say you might have a lot to say but if we agree that we're going to kind of let the other one shine in a particular area but give the other space and go So, yeah, I actually have really something good to contribute I want to share so that we get a well-rounded thing, know, so we're not competing, but we are kind of compartmentalizing so that we can establish separate brands under one roof for our personal benefits while still serving the community really well. I think that that could work and just flow, especially because I'm not going to get offended that if you've got some great ideas, I'm going like, that's awesome, and I can have eyes. 00:17:35 - Maria Gudelis (Maria Gudelis) Yeah, yeah, yeah, I think that's, there's something there, yeah, I can't get my full hand around it of all the tracking, know, because I also don't want to fall down from it, you know. 00:17:51 - Tina Marie (profitdriversinc.com) It won't be hard, and we could ask Dan for it, but it won't be hard. It's really, all it is, is anybody that comes into us has to to be tracked once because the source tracking so they're either coming in from an ad that we did which we would be tracking where they're coming in from one of our personal links and we just need to make sure if we want credit for it right that each of those links are trackable so if you're you would just have one group or you could have multiple links and I would show you how to do it so that you know it and I could even set them up for you if you don't even want to touch it and just be like Maria this is it and we'll go do a test test like source right and make sure that they're tagged as came from Maria we'll just put Maria something like that right and then show you so then if that person makes a purchase we'll have to figure out how to how to do their reporting and the commission structure but for sure Dan would help with that and if he didn't do it for free I'd hire somebody to do it but high level does that really easily okay yeah that's one of the great benefits of it And if the community is in high level and the sales are in high level, it's all there. Yeah. So, yeah, it would actually be really not quite as simple as doing it without the tracking, but the tracking is not going to be difficult. 00:19:17 - Maria Gudelis (Maria Gudelis) Okay. Well, that's cool. That's cool. So, and just on another note, when you brought up Designer, I shared screen real quick. 00:19:27 - Tina Marie (profitdriversinc.com) I've been using it since 2016. 00:19:29 - Maria Gudelis (Maria Gudelis) Oh, yeah. 00:19:31 - Tina Marie (profitdriversinc.com) Let me share screen right now. 00:19:32 - Maria Gudelis (Maria Gudelis) So, I don't, haven't used AI, AI, AI part. See that 2016, I created the e-commerce email promotions, like it's a product I used to sell, don't know, for like seven bucks, low ticket offer. that's really big. something's worth about it. Anyway, but yeah. and actually just the recent YouTube video that did really well, I made the product here, the 100 digital offers. So I made it obviously in chat should be T first and some of my own input. And then I used the template and just like put in my own graphic here of the screenshot. And then it's just super, super simple. 00:20:20 - Tina Marie (profitdriversinc.com) It's not as pretty as camera. 00:20:22 - Maria Gudelis (Maria Gudelis) but it did the job and I needed done like in about 10 minutes before I put it in the community. See, I bought, I haven't pinpointed it yet. Where is marketing master account? need to re send it to my school community. But anyway, so yeah, that's cool. 00:20:36 - Tina Marie (profitdriversinc.com) I've done that. I want to share something with you too so you can see I need to feed it more data to this library. 00:20:49 - Maria Gudelis (Maria Gudelis) But what does Dan think? what we should be offering and all that stuff? he have any ideas input? Because sometimes I'm going to be honest, sometimes I get too confused. you know, when I start thinking about all the things, and maybe just because I'm not centered, because I haven't done my bible stuff here. 00:21:07 - Tina Marie (profitdriversinc.com) Meditations are journaling this morning. I didn't ask him, but we could if you want to do, I think he is a massive Maria fan and Tina fan. So ask, ask, um, pretend you're a person that has a business question, fairly simple, um, about business operations or principles or strategies or even problem solving. Let's see how this AI does. 00:21:42 - Maria Gudelis (Maria Gudelis) Oh, um, how do I get traffic from YouTube marketing? 00:21:49 - Tina Marie (profitdriversinc.com) I haven't, it will be my kind of content, like, um, just, just not marketing specific, like, um, what should I pay my stuff? hiring people, how should I choose what to work on? um, yeah, pretty much anything that's not marketing strategy specific. 00:22:11 - Maria Gudelis (Maria Gudelis) How could I get more productive in my business, family? 00:22:40 - Tina Marie (profitdriversinc.com) I told you not to say, ah, would never say that. 00:22:43 - Maria Gudelis (Maria Gudelis) Look at that. It affects hourly rate now for the game changer. yeah. 00:23:12 - Tina Marie (profitdriversinc.com) Now, go make that magic. 00:23:14 - Maria Gudelis (Maria Gudelis) You got this. 00:23:17 - Tina Marie (profitdriversinc.com) I mean, if for just being able to ask a question that that would give if somebody had never experienced that. Yeah, that we get them started. Anyway, so I haven't vetted all of my content yet, because you can only give it 10 files. So what I have to do, and I'm going to hire a VA to do this, is combine multiple transcripts into a single file, because it's not really, I don't know what the limit to the eyes of the files is, but I haven't anywhere near approached that. Okay, so just putting it into single files. And then I've also included the transcripts of testimonials from clients. Really long ones on YouTube that give details as to like what I can do for them. So anyway, yeah, just this. So I want to use this to when it's trained properly create short pieces of content for me based off of things I've already created and done. So if I want to pick a topic in any, I don't necessarily want to just use it as it comes out. For sure, I would edit some of these things all the time the struggle. No, that's no. Tell me your AI without telling me your AI that. But and take something, put some bones on it and go like, Oh, yeah, okay, well, tweet this, tweet this, even ask it a question because it's asking it from my library of vast library of information once I get all my calls in there and then be able to repurpose it according to okay well this is a Twitter post I wanted to and I know you can do threads on Twitter but if I wanted to make it shorter and make it like one line each so I can break it up into Instagram quotes and then go send it to a VA who plugs it into some images from you know really quickly there's like four and five dollar an hour VA is still that are good at Canva and I don't know if they're as fast as maybe eight or ten dollar VA's so that's an experiment I'm going to be playing with and I usually hire a couple people and just kind of try them against each other see what ends up being most profitable just because people are cheaper for our doesn't mean that they're cheaper for our. got it, got it. Yeah. So anyway, but yeah, um, what, what would help you get some clarity on the opportunity of what it would look like to do work together. Um, so that's, well, so that it's clear and then you can decide, do you want to put any mental energy into it or not. 00:26:30 - Maria Gudelis (Maria Gudelis) Um, I think, I think just like, so we got the free community, right? 00:26:36 - Tina Marie (profitdriversinc.com) It can be free. It can be paid. It can be paid from, from the beginning, just low cost, like really low cost, but so that we know that we've got people who want to be there enough with their money, who have enough trust to pass over a credit card. 00:26:54 - Maria Gudelis (Maria Gudelis) Okay, so it's almost like, uh, I kind of do this when I. Great offers for people who share screen. know you got to go like a little minutes. Share screen. It'd be sort of is one that I've done with us for I'm possible. So basically like customer journey map like like like these are different. So like you know step one was micro offer magic you know then or about social group and five so step one could be like a community five bucks month. Maybe we make it like one buck a month or five bucks a month or whatever ten bucks a month and then what in their customer journey what is it like what step to what's that offer there and like what are we thinking right like what so we can kind of yeah so so like and if I go I don't know who else I've done a few of these four. or community. 00:28:03 - Tina Marie (profitdriversinc.com) So I have a quick idea for that the first variation. think the first version is you come into the community and we both have free pieces of content that they can consume so that they can get familiar with us and just kind of have a place and we encourage just talking. So it's basically another version of an email list, kind of. We can communicate with them. But it's in a place where so high level has an app, I think. And it's like lead something, whatever. But it's mobile and they have magic links so that people can open some things right from their email and go straight to the paid member area. And I'm OK with using school and paying for that too, if they need me. for sure, we'd want to charge like $5 a month or something. The first level is, we're going to put in lots of our content, pre-existing content, and you have access to it, and then the second level could be also not very much, and it could be either, like for me, could be they get the profit time, energy maximizer, and maybe one of your products, that is a paid product, but low cost. In addition, we'll have weekly meetings and you can show up to it, and so we maybe put the recordings in the free group, but they don't get to ask questions unless they're in the paid group, or in the like the five dollar month group, they get recordings, and let's say $20 or $40 a month group, you can come in and ask questions and we will answer your questions. So, the lower level group is you get our content, not our time. The next level up is you get our content and our time. And the next level up could be something much more high level once we figure out and we start talking to people. 00:30:07 - Maria Gudelis (Maria Gudelis) Good. 00:30:09 - Tina Marie (profitdriversinc.com) else are you going to go get 20 year veterans in business, women, know, that have been online veterans. It's not very, it's not easy to find. 00:30:24 - Maria Gudelis (Maria Gudelis) No, I know I'm going to have an analyze them and I probably should join their community. 00:30:29 - Tina Marie (profitdriversinc.com) If I go to school discovery. 00:30:32 - Maria Gudelis (Maria Gudelis) There's one woman that. I imagine in this grandma is making a lot and has all these people in that community. It's really right at the top of your digital growth community. It's number one for engagement and yeah, she's got. You know, you you you know, to build a daily pay customer base digitally. 00:31:06 - Tina Marie (profitdriversinc.com) Yeah. 39,000 members and what's the cost? 00:31:10 - Maria Gudelis (Maria Gudelis) This one might be her free group, let's see, proven six-figure. 00:31:13 - Tina Marie (profitdriversinc.com) says paid. 00:31:15 - Maria Gudelis (Maria Gudelis) Where? Right there. yeah, but here, because there's joint group, okay. So, yeah, what email did you use to purchase? Okay, so she's then selling it via sales page, okay. Only how people to pay the joint here, live weekly mentoring support, giving monthly networking events, zero of six-figure online is six months. That's her promise. She looks really good, actually. That's fine, I don't know her name is. Payment methods. Are you saying that? 00:31:43 - Tina Marie (profitdriversinc.com) what's right there. 00:31:44 - Maria Gudelis (Maria Gudelis) Are you early, 423? And she's new system IO, isn't it, she's system Ha ha. That's her name. And she has any love us? 00:32:00 - Tina Marie (profitdriversinc.com) How many do you have math real quick? 39, what was the note was 47? Yeah, so 39,000 times 47. That's 829,000 a month. 00:32:15 - Maria Gudelis (Maria Gudelis) Holy crap. 00:32:17 - Tina Marie (profitdriversinc.com) And it's more than that because it's almost 40,000. 00:32:22 - Maria Gudelis (Maria Gudelis) So road map to attract daily pay customers digitally, build an impactful email list, create a well-known brand and proven six figures in six months formula. 00:32:36 - Tina Marie (profitdriversinc.com) So my thing about wanting to do this stuff together is that both you and I have gone to the point where, and because we can still, like I said, have our separate stuff and feed it so that you're not risking building everything around me. And vice versa, not that I'm even worried about it, but that's just this smart thing to do because anything can happen, right? But the roadblocks that both of us will have, we'll get to them so much faster. We'll doing something together. And I mean, I'm all about leverage. To me, it would be so leverage because we have different skill sets, but we have very similar skill sets too. And one of them is so few people just show up and work all the time. And I don't mean all the time. don't actually work all the time, but I show up every day. I move the needle every day. lot of people, most people honestly, really don't do that. I've worked with tons of people. There's a lot of inconsistency, even with high-level performers, because they burn themselves out. so it cycles a burnout. I don't get burnt out. I don't let burnout happen to me. Because I nap. A lot. I can nap three times a day. I will nap three times day if that's what it takes. You feel good. I take time off. I take little trips like so and I don't work long hours, but yeah, I do show up consistently. I pay for help. I pay for good help. I train good. Most people pay for help. And then they don't train well. And so it's not useful. I'm not getting any help. I dig in and I get to thorough training quickly. Screen sharing, video sharing, then so we're doing it together. I'm showing you and then you tell, you show me that you can do it. And then you go be released to do the work. And we have constant communication and feedback. So like, some people, most people abdicate. 00:34:41 - Maria Gudelis (Maria Gudelis) I delegate. Yeah. 00:34:44 - Tina Marie (profitdriversinc.com) and they think that they're delegating, but they're abdicating anyway. And now your brain is always considering about marketing and offers. I hate starting there. also, you, yeah, I mean, you just love the part that I like. 00:35:00 - Maria Gudelis (Maria Gudelis) to go about a lot. 00:35:03 - Tina Marie (profitdriversinc.com) And I think where you have friction is clarity and should it be this or this and also anchoring because if you're trying something every month and that's your habit that I know that it's just your tendency to kind of bounce around. So what you would need support with is how does your spirit get the freedom to explore? Because obviously that's important to you. Without that sabotaging what you're already doing by distracting you too much. You get to play and get that outlet but you've got somebody helping you go okay. Now that you've played you have to make a decision. Do you keep playing there or can you bring something back to here because this is what you chose first or are you switching and if you're switching be real clear about why you're switching and make sure that it's aligning with your values because Sometimes we need permission to switch, and we give ourselves permission, right? Sometimes that's the thing to do too, but that logical conversation, I can have in my sleep. Yeah. You get really clear and really confident and peaceful, because that's the part that slows things down is trying to figure it out, you know, do what I want to do and don't I want to do it. And the usually it's a why, but sometimes that why is not very clear. And so the probing questions that have you get to that why, that's what I'm really gonna add. 00:36:35 - Maria Gudelis (Maria Gudelis) Okay. Okay. I love based on what we just saw. I think we just have one community that's a little ticket, maybe start at $5 and bring it up to $47 and be like that girl. Like I think we just saw maybe a path. 00:36:49 - Tina Marie (profitdriversinc.com) Yeah. 00:36:50 - Maria Gudelis (Maria Gudelis) Sorry. Between the two of us like there's like, yeah, like people get so much value out of it. 00:36:57 - Tina Marie (profitdriversinc.com) That's what I was thinking something about too is just starting. really level and bringing it up and be like, okay, the price is increasing, the price is increasing until we get to kind of a place where the conversions drop and we keep increasing it. That way we can get numbers in because there's nothing like an empty group trying to talk to an empty group. And then we learn as we grow, but I think that that's the rocket fuel is getting the people to come in and tell us how we can serve them that were already attracted to us for whatever reason at a low level cost. And then we serve them really well and we can let them be grandfathered in or say, you get this price for this next year, but for this year, you know, but next year we're raising prices because in place and whatever, nobody, yeah, groceries don't get it locked in, rent rarely doesn't like occasionally, but most things in class. Yeah. got it. So I think the next steps would be to to kind of create like a very simple map like that, right? what the offer is and what the content would be. So like, I think if I have that profit time, energy maximizer to serve to the community, I feel like you think number one, I feel like I've brought a valuable contribution that earns whatever my low level portion of it is, right? And I'll keep bringing it. You bring something of yours. And but that's impactful that you know that they're going to go. Something is going to be they'll have an aha moment or something tactical that they can implement right away, but not your best stuff, right? And then we just put together an offer put together some graphics and images and start piping people in for $5 the first time for like, and Honestly, we'll see that the issue with school is that there's a few issues. First of all, people can very easily see how much you're making and how much money you have because of how many people are in your group and what your paid price is. Yeah, that's just one thing. Competitors, whatever. There's that. School does pipe people in, but you can only charge one price a month per group. So if you raise the price, you can't let one group. If you charge it through school, so what she did was she charged off-site and let them in for free or however it worked out, but because school only lets you charge one price per person. So if you say it's $5 for you guys, but it's $35 for you guys, you can't do that. 00:39:58 - Maria Gudelis (Maria Gudelis) School, I'll let you do that. 00:39:59 - Tina Marie (profitdriversinc.com) So anyway... We would just have to figure out the tactical approach around that and she does it, which is charging the money off of school and then letting them into it. 00:40:10 - Maria Gudelis (Maria Gudelis) So, yeah, stuff to think about, yeah, all right, we'll have fun. Okay, you're going to your, your study? 00:40:24 - Tina Marie (profitdriversinc.com) No, I'm late, it's a missionary training, but they record it so I can still get it. maria@mariagudelis.comTina MarieMaria & Tina\n00:00:07 - Tina Marie (profitdriversinc.com) Hello, how are you? 00:00:12 - Dan Ryan (3) Cleaners day and up on the poetry of my various furry friends. 00:00:17 - Tina Marie (profitdriversinc.com) I like it. 00:00:21 - Dan Ryan (3) Doing calls, doing meetings, look out. 00:00:26 - Tina Marie (profitdriversinc.com) It's good, it's good. I got a full night's sleep and groceries just got delivered. My older daughter took my younger daughter to seminary and she's making dinner tonight. And there's a flipping spider on my ceiling. Hopefully I must go with this. A comment? I don't want to get it. I don't like spiders. But I am the only spider killer. I guess you get to live for a while. I don't feel like dealing with it. 00:00:59 - Dan Ryan (3) I don't want to live. 00:01:04 - Tina Marie (profitdriversinc.com) It's, it's no spiders. Anyway, what, uh, was it a work call you had just now? 00:01:12 - Dan Ryan (3) Two, then I, uh, talked to developers at, uh, SOD at nine, and then I just had a meeting with Circle, because I was like, you know what, I'm going to look at these other community platforms, and I'm officially sold on Circle, Tina. It is. 00:01:30 - Tina Marie (profitdriversinc.com) Really? Yeah. Taylor, well, to agree with you. 00:01:35 - Dan Ryan (3) Uh, okay. Uh, probably not for the reasons. I'm sure Taylor really didn't evaluate it and just copy Brandon Burshaw or something. Uh, I'm like talking to the guy like, okay, what if I want to send a, you know, I didn't, I was like, I have a CRM and what if I want to send people over from my CRM? So they're going to opt in. through this lead thing, and that's where I'm going to send them emails, and that's where I'm going to make offers and pitch ship and, right, because they don't really have massive email or whatever. mean, yeah, I don't think they even have it. And I go, and then I want to get them over and I want to tag them with the three things that I'm collecting in the form. He's like, yep, API, don't use apps. I go, okay, great, that could be that. And then I was like, all right, let's say I want to have a free level, and then I want to have different paid tiers. So let's have paid tier one is like a group coaching thing, or whatever, or, or it's one on one coaching, or let's say I want to do a cohort. So there's like a six week cohort. He's like, let me show you, opens up all these sites. He's like, you can do everything you just said. was like, God damn, really? It's like, okay, how do I generate the payment? it's like the payments here. You can make it. a month to month. So you can make it a full page, you can make it a month to month. You've got a link at the end. Okay, so I have that link. So if I'm on a sales call, for example, I can downsell to the page, that payment plan is ID up, and you just send in this link, I know it's in the link through the fee around, I go, okay, what if I want to, what if I want to take, I got this is further down the I go, if I want to take activity from, from circle and update my record in my CRM. So using mom as an example, I met with him and I talked about Ninja and mom. Not so much because I thought I would use it for Ninja, but he literally, the reason I said Brendan Bouchard is because he showed me Brendan's thing. So what they're releasing right now is a headless API, that you can take circle components and put it inside. Buddy balls, basically. So when he opened up Brendan's side, And was like, that's body boss. And he's like, it is? And he's yep. But he's like, well, that's what Brent. And he's like, I don't know who he's doing it for him. But he's like, they're doing it. So see, they had circles just iframed inside body boss, which looked good, as a matter of fact. And but now you can take components, like the feed component, and then have that in there. And your users are in body boss, but you're using circle. And I was like, he's like, so you don't have to pay millions of dollars to develop these widgets, because you can use ours. I'm like, oh, that's dope. I didn't know you could do that. He's like, it's not out. It's coming out like two weeks. He's like, you're just showing me because it sounds like you would get it. I definitely get it. So then Brendan's got someone doing it for him. 00:04:47 - Tina Marie (profitdriversinc.com) like, I'm pretty sure I can find out who did that. 00:04:50 - Dan Ryan (3) And then go talk to them. So yeah, I'm like, man, this is high levels. They're never going to catch up. of this. Schools never going to catch up to this. Like, these guys are way, way further ahead. 00:05:05 - Tina Marie (profitdriversinc.com) Yeah, but I went and just got that snapshot yesterday. 00:05:09 - Dan Ryan (3) That's okay, because I do still think like you could do the sales calls. 00:05:13 - Tina Marie (profitdriversinc.com) Wait, you got what's natural? Community one that you showed me. 00:05:18 - Dan Ryan (3) I think that can work. I do think that can work still, but for mom, because mom to me is going to be extremely complicated. So it's going to have, it's going to have all the things that I just said. You want a free tier, then you want a paid tier, then you want a government tier, then you want a dedicated error for fan flow users, then you want a dedicated area for people that are in. But we're, I don't know if this is going to be the name, but we have this continuous release strategy. So it'd be like, hey, no, you're going to pay to be in the continuous release strategy cohort. One, which starts in January, two starts in February 3 starts in March, and in that group, you are releasing a song every 8 to 12 weeks with whoever's in that 20-person cohort, whatever. So those would all need to be separate paid tiers and separate private groups. And I'm like, yeah, so at that level, I love them, right? I don't know. have no idea. 00:06:26 - Tina Marie (profitdriversinc.com) I think you leave it out with the communities, because if you can't do that, then that would be a deal breaker for me too, because I want multiple tiers. And one thing that Circle can do that I don't know if you came across it, but it gives you stats of who's logged in and what information they've consumed. 00:06:48 - Dan Ryan (3) Yeah, you have to actually build some of that, he showed me that. Yeah. Interesting. The other thing that they have that is perfect for mom is spotify interest. I was like, oh, that's dope, and then they do mp3s, which we need, which high level doesn't support. So I was like, okay, but it's also like, you could do this headless thing and put it inside of high level. I was like, oh, that would be interesting. So you can still use high level and then just have circle inside of high level and he showed me another version of that. And it was just like the E card and he was saying, yeah, if you owe off, he kind of lost me. It was not super off on oh off, but he's like, imagine you just owe off your high level log in that you give them. It's the exact same log in for circles and they log in high level, they log in circle, they just don't know. It's like, yeah, that would be great. So yeah, but I'm not totally sold, but I was like, oh. of this headless API is super interesting. 00:08:04 - Tina Marie (profitdriversinc.com) What is a headless API? 00:08:08 - Dan Ryan (3) I mean, it's like you're not you're not using the wrapper, right? So you're not using the container of it of circle. So you're using the compound, you're getting access to the components. You can do with WordPress too. So it's like, it's super lightweight. There's not a lot of other code. It's just a thing. It's fairly new. I hadn't really ever heard. I'd heard of it for WordPress. I had not heard of it for like one of these standalone softwares that was surprisingly said that I was like, oh, okay. I did not see that coming. 00:08:54 - Tina Marie (profitdriversinc.com) Interesting. Maybe. Oh, 00:09:00 - Dan Ryan (3) But I'm looking at it more for, because we've been talking to these dudes grooved for the bands. So then I was like, I don't like those guys. And there's no way they're going to catch up to any of these people's school. You know, whether it's school or circle or it might be networks. But these guys are starting out and they're not even called Pepsi Sprite. They're nothing. They're like Fanta. They're never going to. But they're trying to target just musicians. that's sort of the value problem. But tech wise, they're texting. 00:09:43 - Tina Marie (profitdriversinc.com) Who's texting? 00:09:45 - Dan Ryan (3) They're called groups. 00:09:50 - Tina Marie (profitdriversinc.com) I was like, wait, what is the group? 00:09:53 - Dan Ryan (3) Okay, never run. Yeah, but it's the, it's those, I mean, props. It's those TikTok influencers. They're like, they got so much reach on TikTok. now they're like, oh, we do communities for all audiences. And they've gotten some of the biggest TikTokers to be on the platform. And they're, they're using that to attract other people. But the problem is the software itself stinks because it's a bunch of TikTokers developing software. Like, yeah, it's not good. It's not going to go well long term. 00:10:29 - Tina Marie (profitdriversinc.com) I think the, um, man, it's always so complex. There's so many things that have to be measured. So like the speed of implementation. So school is super fast to implement. That's really, to me, the only draw about it. There's a lot of drawbacks, including analytics, you have to pay for every community, um, they don't integrate, the communities don't integrate with each other really well, where you could do that with like circle. I think Circle is pretty quick to integrate, but also has a lot of complex features that you could do and it doesn't have a native app, but it does have an app. So that's good. You don't know if it has a magic link, which I think is really good for people that don't want to use the app and just want to be able to go straight to their content without having to log in and remember a password because a lot of people don't use password managers and they don't have an efficient login process. Yeah. But what I'm looking at in this high level community is it is convoluted. That was my issue with high level to begin with is that it's convoluted. It's there's. It's not pointing click. You know what I mean? It's not intuitive. And then same with Buddy Boss was the same thing. 00:11:51 - Dan Ryan (3) So yeah, Buddy Boss is not intuitive at all. 00:11:54 - Tina Marie (profitdriversinc.com) no, you've got to have somebody who knows exactly what they're doing. And that is. 00:12:00 - Dan Ryan (3) Not super easy to come by thing Yeah, what you need is like well, I mean, I think you got right the snapshot for high level is gonna have Hey do this or it's gonna build a bunching for you You would need something like that force you would need something like that for circle too But there's no snapshots right it's gonna be Build and you'd need someone that like he took me in a community that was clearly a coach and then doing individual coaching so like You would have like a damn thing so when I log into circle as like Let's say I'm like so I'm your high ticket level right so it's like you log in I'm high ticket I get access to everything like the courses or all the logs for me, but then I also have a dedicated damn coaching in the area they call it a coaching, but it's not literally the coaching area. And then inside that you could have Dan, Mark, blah, blah, blah, but Mark can't see Dan and Dan can't see Mark. So all I see under coaching is Dan. And then it's a dedicated stream of Dan and Tina. I was like that's interesting not be group. 00:13:23 - Tina Marie (profitdriversinc.com) He goes, yeah. 00:13:25 - Dan Ryan (3) Okay, I didn't see I didn't see that coming. I can say in the video, I asked him to send me the recording. 00:13:33 - Tina Marie (profitdriversinc.com) It's all it's interesting. So what are your priorities for the membership for mom? 00:13:45 - Dan Ryan (3) So I've already proven I can generate a lead for under two dollars. And then they I think like 80% of them opted to join the Facebook group. But now I'm like, okay, I can just force and I can ask them if they want to join the community, if they assent, yes, and I can automatically go create the record in wherever I can do it in high level, I can do it in a circle. So then I go automatically create that record. So I'm not just putting in everyone, I'm putting in all the people that say yes, and then I'm tagging them as whatever, yes. And then the people that say no, I'm tagging them as no to invite them later. And then you would deliver potentially deliver the thing through the group and through email. So they're opting in, think I did two of the things I did, royalty release checklist and I did, no, I'm sorry, did a royalties checklist and then a release checklist. So they could get the thing in the group, or they could get the thing in the email either way. then ultimately they're for each, now we're going to Fletcher, if each thing is actually tied to a course, then you could sell them the course and deliver the course inside wherever, wherever that can be used. Then you have a free community that's just a bunch of people that are in the independent music space. And then I'm tagging them based on the first things that they tell me and then you'd enrich that, we let them enrich that through their profile, right? So the only thing I really ask them on the way in is what are you? And they're either a producer, engineer, an artist, a band, where those options are. So you would immediately be able to identify someone who's a band, come on up on that, possibly genre, and then you'd give them the ability to, hey, this is my Spotify thing. Because part of me has been mutilating, I forget who did this back in the day. I think it might have been Justin or somebody else. But... it was like in the community, they would go juice people's Facebook posts, right? just put up this ad, can you guys go like it? And then a bunch of people would just go like the ad and back at that time, that was an indicator to push the ad further for Facebook. So it was like the community was participating in juicing other things within the community. So my version of it is like, you earn credits. So you can, if you do it, you get a credit. And then you can then, once you have that credit, that credit can be spent when it's time to promote your song. It's like, okay, you have 10 credits, so you can now get 10 clicks. Something like that. So when someone released this song, it's Spotify. It's like, hey, my song's out, Ghost Treatment. That's the signal to Spotify. People are interacting, it's Ghost Treatment, whatever else, whatever the things are. So, or you don't do that. It's just that. community is supporting, right? I came and released this out, and one go go support it. 00:17:09 - Tina Marie (profitdriversinc.com) Yeah, um, I don't know. They're so whatever. So, the circle has like gamification features in there. I think you're what you were talking about that they do actually. 00:17:28 - Dan Ryan (3) But they have, they have a bad game and stuff, but it's not game. It's not game. It's your, you decide. So you can build an automation in the background that hands out badges and stuff. It's not, it's not like built in. It's your user. So you could be like, completed the cohort completed the course that he showed me that those are these options. Automations that you build. There's nothing made of. That's like, oh yeah, we automatically have this game of occasion component. Hmm. Yeah. 00:18:10 - Tina Marie (profitdriversinc.com) Well, but and I don't know all the different ways that you could do it, but the idea that you have where the community supports each other with those credits for like listening to songs, downloading songs, whatever. I don't know. But I don't know that I heard the answer for like, like, if you were going to rank, first of all, if you were going to list the features that you want and then rank them, but I guess it doesn't matter if you found a solution that does everything that you want, but in the search for things, if you hadn't found everything, I would be curious to know what were the things that you had been looking for. 00:18:56 - Dan Ryan (3) So, was it my list? 00:18:58 - Tina Marie (profitdriversinc.com) it was Marx. 00:19:00 - Dan Ryan (3) So, Mark was always shooting down this or the other so like the last thing he sent was oh MP3 and then not sport it was like do beyond having a dream and like yeah, we do That's kind of a deal breaker for a music community because everyone's dealing in mp3 or mp4 so there's no music no music in bed and and then Circle also just happen on Spotify. was like oh, that's even better But not or not because when you're when you're in the pre-production phase Imagine you're in a group that's producing it while I'm working on a producing a song to be released You can only have mp3s of that while you're saying okay. Here's the first mix. It's gonna be an mp3 It's not it's not publicly available. You could put it on SoundCloud, but you probably don't want to It did have a SoundCloud integration too, which I was like god damn really but So yeah, Mark, it was that and it was he doesn't like when you put a video in, he wanted like a full full video post, I love Facebook and school doesn't do that, high level doesn't do that. So that was more of like just a UI sort of thing. School doesn't do it and high level is copying school, so therefore they don't do it. Circle doesn't. Mighty networks did it. Then as far as like, then there was just having the different, the pride of any sort of paywall, right, so I don't know school has a paywall. So having the free thing and then a paywall. 00:20:53 - Tina Marie (profitdriversinc.com) So yeah, I think I like this. It's one or the other. You can either have a free group or a paid group, but you cannot have two tiers. 00:21:00 - Dan Ryan (3) Oh, see, school, you can have like nine, you can have unlimited tears. You mean circle? Um, circle, yeah. Um, and then the main thing he doesn't like about high level is it's built around courses, as opposed to being courses is part of it. So it's not really community, it's courses plus community, and he wants community first, there might never be courses, right? So what if, especially if you're dealing with just a band, a band is never going to have a course ever. Right. So he's like, we tried to, he's actually building community and more on that, um, trying to see how it goes. But that was the main sticking point is that it's like, uh, he's like, no, that doesn't fit for a band. What is a band teaching someone? 00:21:55 - Tina Marie (profitdriversinc.com) It's like, no, you're right. 00:21:57 - Dan Ryan (3) But I was like, we could use this for mom. He could put our core like it totally fits for forces first teaching first community second, but the this scenario is completely flip-flop. It's community first forces second. like, okay, then it makes sense. I mean, I guess that's probably the best way to look at it is that. Yeah, it's it's it's need community forward, not forces forward. So I like I went through this dude. 00:22:33 - Tina Marie (profitdriversinc.com) I took him through like ninja explain what ninja was.-hmm. 00:22:37 - Dan Ryan (3) it was like the ninja falls apart with our MCQ product. He's like, yeah, no. like, you're you'd never be like, he's like, I'm not saying you can't you have developers probably could. But he's like, then that's when he showed me Brandon Bouchard's thing and I said, was like, that's buddy boss. I was like, oh, okay, that's kind of interesting. So we could head this. BPS circle into because I think buddy bosses community stuff stinks It's like oh This could be better And then we can do the stuff like you know, we log them into our MCQ software from within buddy boss They don't know that they left. 00:23:18 - Tina Marie (profitdriversinc.com) He's like, oh, never gonna be able to do that Yeah, For me and and and also why which I know you think is proactive avoidance, but for me, it's really it's it's tactical learning Because it's hard for me to comprehend the user experience without having the user experience and Trying to create a list of what are the features that matter most like I can think of some things for me The course is the most important thing but community is really important as well because Because if I can leverage the conversation of other people in the community to kind of create almost like a gravitational pull towards the content, because there's also other people there. but but then you don't even know until you've done it does that work or not, you know, yeah, and so it's all theoretical. And it's just, it's just thoughts upon thoughts upon thoughts until you do it and experience it. And that's the biggest thing is that I, um, whatever, I think if the list of the main things are there, then whatever else trade offs that you make, like, we know nothing's going to be perfect. But as long as the main features that you need are there and they're solid, then, you know, you don't have to move. But if you do move. I don't know, it's a whole nother thing. It's so hard just trying to build on something. 00:25:07 - Dan Ryan (3) And also for you, you're like going top down. You might never get down, right? if you're currently at high ticket. 00:25:15 - Tina Marie (profitdriversinc.com) Explain what you mean down. 00:25:17 - Dan Ryan (3) Right, so the opposite would be free low ticket, mid ticket, high ticket, right? And you're at high ticket. So community is really more for the free, right? 00:25:28 - Tina Marie (profitdriversinc.com) That's where the community still is going Agreed. 00:25:31 - Dan Ryan (3) So if you had me and Mark and someone's in Quasimodo or whatever that guy's name is, like, if they were all... 00:25:36 - Tina Marie (profitdriversinc.com) Oh, wait, wait, who's Quasimodo? I don't know, but the doctor. Oh, Boogie. Boogie. 00:25:44 - Dan Ryan (3) So if like me and Mark, right? If you're trying clients, we're in a community. 00:25:50 - Tina Marie (profitdriversinc.com) We're not going to go in the community. 00:25:53 - Dan Ryan (3) No. No, I might go in there, I might go in there because there's something there for me, right? Right. You're like, hey, log in. I need you to log in and watch this video. Like we're going to talk about this next week. Yeah, I'm going to be in there for that. And so there, but there might be some discussion. I could see Mark, you know, Mark loves to talk, right? And me too, right? I might comment back to someone, right, in that context. we're not going to get in this back and forth discussion. 00:26:21 - Tina Marie (profitdriversinc.com) No, I wouldn't even have my high level clients would never be there. Because first of all, I'm not giving somebody access to all my people, right? And be like, hey, guess what? These are all the people for you to try to coach or something like that. I'm not really afraid of it. It's just kind of the thing that I have embedded in my mind because of the texture. But also, it's super high touch. Like why would I downgrade our interaction? 00:26:45 - Dan Ryan (3) Well, I'm not saying it's to downgrade. 00:26:47 - Tina Marie (profitdriversinc.com) So my point was that you have those people. 00:26:50 - Dan Ryan (3) And yeah, you could be like, hey, the stuff's here. And I would go do this thing, right? And then when you go down to the next level, and what is the next level? The next level is like course buyers. Even them, even them, whoever they are, it's not going to be super cheap, but it's still going to be whatever. And a lot of what your stuff teaches them is antithetical to wasting time in the community, right? It'd be like, you need to be in your business. So I don't see you ever going down to this tier where there's like, just community, right? Like, like, what's exactly what's going to happen to my mom? Mom's going to start. We're going to try and turn free people into customers. 00:27:35 - Tina Marie (profitdriversinc.com) You're not. No, I am. I am. And here's why, because it's more of a kind of give back type of thing. It's not about the logical approach to getting high level clients, although it does happen because I'm that person. And I've seen other people do it where they go buy the free thing, really high level people and just go like, oh, they know what they're talking about. But then they circumvent it. They don't go by the course or do anything else like that. They're like, hey, how do I hire you, that type of thing. But for me, it's the long term play, right? It's the ascension. It might take two, three, four, five years for somebody to get to, they become a high level client, but I've been teaching them the whole time. And it's also more of instead of having a blog where it's just one-sided and or instead of sending out emails, it's just a content home. It's a content medium source, and that, for me, is more about energy. It just feels like, right? It's not different. Email would work just as well. A blog could work just as well, Facebook just as well. It's just a preference of psychologically what it feels like to put it inside of something called a community. You know what I mean? Yeah. But then are you going to go like live once a week, teeny hours, like, so I'm not doing it by myself. I'm going to do this with Maria. 00:29:10 - Dan Ryan (3) She loves this. This is what I saw in one of groups like, so one of the groups that he showed me was for Alcatraz North, and I might have been with him, to be honest, and that I could see like, you know, their calendar or whatever, what I was going to get. Yeah. So I imagine they are doing that. They're saying, hey, get in on this on a time block freebie. And then, you know, then they're in the community and you go from there. 00:29:39 - Tina Marie (profitdriversinc.com) Yeah. Um, exactly that we, and I've been talking about it with her because, so she bounces all over the place. 00:29:47 - Dan Ryan (3) That's her biggest issue. 00:29:48 - Tina Marie (profitdriversinc.com) I hardly noticed that about her. And my biggest issue is I don't want to be on video. I don't want to do all these things, but they're really good at drawing in people fast because you can connect. Now, I don't, it's not that I mind being on video so much, it's just, I don't want to talk to myself or talk to a camera. It's just so weird. And it's so, I'll have human conversations all day long. So I want to have somebody to talk to and do it with, and I want somebody else's brain that I can access frequently. And so, anyway, if we do it with, she needs all the conversation, wants to have all the conversations. And she does marketing, I do business operations, all the mental stuff. So it's a really good blend. And that's been a huge other part of reason why I haven't done this because I'm like, I don't want to do it by myself. I've never wanted to do it by myself. I do enjoy the community. do enjoy people. love teaching, answering questions. don't even mind having live conversat","contentPreview":"\n2024-09-17T20:00:00Z 00:00:04 - Tina Marie (profitdriversinc.com) Hey, Patrick. 00:00:05 - Patrick Shahverdian (sweetlaw.com) How are you doing? Good. How are you? 00:00:08 - Tina Marie (profitdriver...","processedAt":"2025-05-04T03:40:52.639Z"}