{"fileName":"Blog Posts .txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/written_content/Blog Posts .txt","type":"marketing","priority":"medium","content":"﻿How Setting Firm Rules and Personal Boundaries Can Liberate You\r\n 20 September 2017  0 Comments\r\n\r\n\r\nI feel that every person, in every station in life, and in every aspect in life, should take the time to define and enforce rules of operation–rules that define how they will operate and how they expect everyone else around them to operate…\r\n\r\n\r\nAnd I think they should enforce those rules.\r\n\r\n\r\nThis might sound like a recipe for conflict, but I believe it’s actually a recipe for greater peace.\r\n\r\n\r\nWhy?\r\n\r\n\r\nMOST CONFLICT IS A RESULT OF A POWER STRUGGLE.\r\n\r\n\r\nWith the exception of where one person’s set of rules includes that they are the only rule makers, this power struggle can be avoided with a few steps.\r\n1 – Define your rules\r\n2 – Understand the rules of your counterparts\r\n3 – Decide if the mutual rules are compatible\r\n4 – If they are not compatible, discover if one is WILLING to yield to the other set of rules or make a new rule.\r\n5 – If one will not yield to the other or make a new rule in order to cooperate… move on\r\nThe more you practice this, the less you will experience power struggles.\r\n\r\n\r\nFor someone who’s never done this, it may seem very rigid and cold.\r\n\r\n\r\nBut the truth is…\r\n\r\n\r\nTHIS IS A LIBERATING PROCESS.\r\n\r\n\r\nYou see… all people are not compatible with all people in intimate situations or even professional situations.\r\nThink marriage, or business partnerships, or even employees that you hire, or clients that you take.\r\n\r\n\r\nWhen rules are incompatible, anxiety strikes.\r\n\r\n\r\nThe thing is…\r\n\r\n\r\nMany people have a “Sense” of their own rules, but they haven’t consciously defined them…\r\n\r\n\r\nOR…\r\n\r\n\r\nThey haven’t yet chosen to enforce those rules.\r\n\r\n\r\nThose people fall into the victim category.\r\n\r\n\r\nAnd it doesn’t matter if you are the victim or have to deal with one…\r\n\r\n\r\nVictim mentality causes stress.\r\n\r\n\r\nWhich is why one of my rules is that I will not operate with anyone who chooses to remain in a victim mentality.\r\n\r\n\r\nPeriod.\r\n\r\n\r\nI’m simply not compatible with that mindset.\r\nI’m not compatible with manipulation.\r\nI’m not compatible with lies.\r\nI’m not compatible with disrespect.\r\nAs I’ve chosen these rules and began to enforce them…\r\n\r\n\r\nI have discovered that others have made the same rules.\r\n\r\n\r\nBecause I had not yet defined my own rules, I had less exposure to people who had shared them.\r\n\r\n\r\nYES – SOME PEOPLE’S RULES ARE RIDICULOUS\r\n\r\n\r\nThat’s where you get to decide to disengage.\r\n\r\n\r\nIs it your employer?\r\n\r\n\r\nSomeone with authority over you?\r\n\r\n\r\nIt’s too hard you say?\r\n\r\n\r\nTHAT’S A CHOICE.\r\n\r\n\r\nPeriod.\r\n\r\n\r\nI’ve walked away from all income four times in a period of four years as a single mother because of incompatible rules.\r\n\r\n\r\nI knew that I was better able to give my girls what they need without money than I was without self respect and satisfaction.\r\n\r\n\r\nA BROKEN SPIRIT TAKES MUCH LONGER TO HEAL THAN A BROKEN BANK ACCOUNT.\r\n\r\n\r\nThe life you want is yours to define and to take.\r\n\r\n\r\nYou don’t have to plow through others to get it.\r\n\r\n\r\nYou don’t have to be abusive.\r\n\r\n\r\nAnd you don’t even have to be inflexible.\r\n\r\n\r\nYou just have to be rigid with the things that matter most.\r\n\r\n\r\nChoose what is flexible in advance.\r\n\r\n\r\nChoose what is not.\r\n\r\n\r\nNever yield those core values.\r\n\r\n\r\nTo do so is almost certainly going to cause suffering.\r\n\r\n\r\nThe only exception would be when your core values were created from a … let’s say… “less-enlightened” place… and you get a sense that you need to evolve.\r\n\r\n\r\n— SET YOUR RULES\r\n— LIVE BY THEM\r\n— BE LIBERATED BY THEM\r\n\r\n\r\nThere is a saying there are those who act, and those who are acted upon.\r\n\r\n\r\nThere is a strong correlation to those who are acted upon and those who don’t set rules.\r\n\r\n\r\nDecide which one you want to be…\r\n\r\n\r\nOr it will be decided for you.\r\n* End post -\r\nWhy You Aren’t Happy In Your Business\r\n 20 September 2017  0 Comments\r\n  \r\n\r\nChances that is has less to do with how much money you are making and how much time you are working and has much more to do with:\r\n* Lack of clarity\r\n* Lack focus\r\n* Lack of goals and\r\n* Lack of priority\r\nLet me break down each step and tell you why it’s these things and not just being broke and burnt out that’s making you miserable.\r\nFirst of all, understand that being broke and being stressed in work, as well as being miserable, are all SYMPTOMS and not a cause.\r\nThe above items I stated are the actual cause of the problems, and knowing this is what’s going to help you actually SOLVE THE PROBLEM.\r\nFirst, lack of clarity.\r\nClarity is crucial in order for the next three items to be achieved.\r\nUnfortunately, but not uncontrollably, people don’t take the time to get clear. (While it’s not uncontrollable, sometimes people just can’t get there alone… more on this later)\r\nGetting clear is about asking yourself the right questions.\r\nWHAT DO I WANT OUT OF MY BUSINESS?\r\n1. Do you want a certain kind of schedule? If yes (it should be yes) why? What is it that you want to do when you aren’t working?\r\n2. Do you want a certain amount of money? If yes… why? How much money do you need to do what you want to do?\r\n3. Do you want to make a difference in the market? Your community? The world? If so… what EXACTLY is it that you want to do and WHY?\r\nOnce you have answered these questions, make sure you have CLEAR answers. Not wishywashy, lukewarm, flexible answers. This is CRITICAL to getting the business that gives you an extra spring in your step and spice in your life. (Yes, it can really be that great.)\r\nWhen you answer these questions, the answers should EXCITE YOU, when you think about having the business that does what you want it to do.\r\nIMAGINE WHAT YOUR BUSINESS WILL BE LIKE WHEN IT’S “ALL GROWN UP”…\r\nIn other words, when you have created the business of its FULLEST POTENTIAL… no matter how long that takes… what does it look like?\r\nNOW you know what you are creating.\r\nNOW you know where you are going.\r\nBut what you also need to know some boundaries…. And THAT is crucial too.\r\nWhat ELSE do you want out of life?\r\n* Time with your family?\r\n* Time to travel?\r\n* Time to learn a new language or instrument?\r\n* Workout?\r\n* Get more rest?\r\nIt’s important that, when you set HUGE goals, like the one to create YOUR DREAM BUSINESS, you make time for a quality life NOW.\r\n***NOTE… if you’re a “I gotta grind while everyone else sleeps” person… either read and learn or go on about your way… your future heart attack and break up are waiting for you***\r\nMake sure that you have an “off” time and protect that time.\r\nThat will not force you to get less done… it just encourages you to be more efficient at doing what matters most.\r\nWhich leads to the next three items.\r\nLACK OF FOCUS:\r\nThis is NOT the same as lack of clarity. Clarity is having a clear vision. Focus makes sure you never forget that vision.\r\nDON’T ALLOW YOURSELF TO SWITCH TO AUTOPILOT… EVER!\r\nEvery morning, every afternoon, every evening, remind yourself of what’s important in all areas of life. Remember your health, remember your relationships, remember your mindset, and remember your vision for these and how your business will feed them. Plan your day, week, month etc, accordingly.\r\nNext…\r\nLACK OF GOALS\r\nIf you don’t know where you’re going, how are you going to get there?\r\nYes, you set your vision and got clarity (RIGHT?!?!)…\r\nBut you can’t just quantum leap to that destination.\r\nYou have to break it down into steps, into legs of the trip.\r\nReverse engineer and work backwards from that vision.\r\nWhat has to be true?\r\nWhen you answer that question, ask yourself, “Does anything else have to be true, FIRST?”\r\nWhen you have broken that process down to the final thing which has no other prerequisites, BEGIN THERE FIRST.\r\nYou should have LONG TERM goals, 5 and ten years down the road.\r\nYou should also have yearly, quarterly, monthly, weekly and daily goals.\r\nThe trick is, set your HUGE vision goals and WORK BACKWARDS.\r\nWhen you ask yourself “If I reach this goal, what has to be true?” … and from each answer, ask yourself what else has to be true.\r\nWork backwards until you find the thing that has to be true that is nearest to where you are now.\r\nIn other words, what’s the FIRST thing that has to be true?\r\nMake that your first goal.\r\nFor example… If you’re going to be a millionaire… the first thing that has to be true is you have to have a plan, right?\r\nSo start with the plan.\r\nThen you may need to acquire skills… so acquire those skills.\r\nYou may need to create products.\r\nRaise prices.\r\nHire people.\r\nWhatever has to be true next to get to the next level… THAT becomes your next goal.\r\nMake sure you set goals for all areas of life:\r\n* Set progress goals\r\n* set financial goals\r\n* set “quality of life”goals\r\n* set growth goals\r\nMake sure that the way you spend your time takes all of these goals into account.\r\nFinally… the last lack that keeps you from being happy in your business is…\r\nLACK OF PRIORITY\r\nHow many times have you started out the day, unsure of what to do, and you got “busy” checking emails, reading blog articles, “engaging” on social media, and found yourself zero percent richer or happier?\r\nIt’s because you have decided what your priority is in work tasks.\r\nDecide what activities will get you closer to your goals fastest and do those first (more on this in a future post, stay tuned) and if nothing else gets done at the end of the day, you will still have moved the needle forward.\r\nAnd THAT is whats going to create more happiness and less stress in your life.\r\nIt’s impossible to measure progress without a clear destination.\r\nHow could you possibly know if you are closer if you haven’t even defined where you are going?\r\nWe are destined to evolve as human beings.\r\nThe pull to do that is innate.\r\nFeeling like we are not progressing leaves a dissatisfaction to the soul that is absolutely toxic.\r\nYou DON’T have to be brilliant to make this work.\r\nYou just need to be focused, decisive, and consistent.\r\nThese are all things you can choose to be, and choose to improve on.\r\nFOCUS ON DECIDING WHAT’S IMPORTANT\r\nThen, with a series of deep questions to yourself figure out…\r\nWHY IS THAT MOST IMPORTANT\r\nThen… simply…\r\nDO WHAT IS MOST IMPORTANT, FIRST\r\nAt the end of the day, you will feel the energy and satisfaction and confidence that comes from progress.\r\nAt the end of several days like this, you will grow more confident and hopeful.\r\nAs you continue to be consistent in these processes, YOU WILL QUICKLY BE ABLE TO MEASURE THE GROWTH THAT IS HAPPENING.\r\nAt that point, people tend to get hooked to the process.\r\nIf you have to be hooked on something, growth is the best addiction.\r\nSIMPLE BUT NOT EASY. I CAN HELP\r\nThese steps are SIMPLE… Not very complicated.\r\nBut that doesn’t mean they are easy, or achieved without difficulty.\r\nSometimes you can’t see the forest for the trees.\r\nSometimes getting clarity, the first step, eludes you for so long that you give up on the rest.\r\nI offer a consultation call that will help you get this clarity, regardless of what level of business you are at.\r\nIt’s $299, a two hour, very in depth call that has been likened to drinking from a fire hose because I’ll teach you so much…\r\nBut you’ll get the call recorded, notes, and, if my track record continues with it’s 100% success record, tremendous clarity on where you want to go, why, how you should get there, what you should do first, and for the next few months.\r\nThis or my group coaching program is my entry level access.\r\nIt’s the first step to making sure you get on track for the business and life you desire.\r\nContact me if you’re interested 🙂- end post - \r\n* Hiring for Small Businesses – Know the Order of Operations\r\n*  28 September 2017  0 Comments\r\n* * Hiring for small businesses can be a little like Algebra.\r\n* * Remember how many people were absolutely in LOVE with math in school?\r\n* * Especially those arithmetic expressions that looked like this? 4 + 2×3 = (4 + 2)×3 = 6×3 = 18?\r\n* * Let’s not even get into Calculus.\r\n* * Some people loved it, absolutely ate it up. But MOST people can’t hack basic math, much less advanced math.\r\n* * Running, and hiring for small businesses is very similar in a couple of ways.\r\n* First… Most people can’t hack it. It’s over their heads. Oddly… that doesn’t keep many people for thinking they can go into business for themselves and succeed.\r\n* * Second… Running a successful business is absolutely all about the order of operations. If you do it wrong… things just don’t add up correctly.\r\n* * For any business, but this is especially crucial to smaller businesses, it is important that you identify the most important position for being filled within your company and fill that role first.\r\n* * The position should not be one of convenience as much as productivity directly related to the bottom line.\r\n* * Let me give an example.\r\n* * Joe owns a small business and he’s making some money. Joe feel like he’s not getting enough “stuff” done and also feels like he’s not making as much money as he could be.\r\n* * Joe needs help… and Joe is fairly average… not immediately strategic about all moves. Like the average Joe he is, he translates “I need help” to “I need an assistant”.\r\n* * Joe gets a little excited about the thought of hiring his own assistant. It makes him feel important and he thinks he can sluff off his work to some lackey and now… he’s going to get some serious business done.\r\n* * The problem is… the things Joe isn’t getting done isn’t just minor administrative duties. Joe has a few problems.\r\n* * First – he’s bleeding money and doesn’t know it because he doesn’t track his finances properly. He just knows he should have more money than he does. (Sound familiar?)\r\n* * Second – He’s got a new product to launch that he knows his buyers will eat up based on the market but he’s had it for a year and not done anything with it because he doesn’t like doing the technical work to get it live and able to take orders. It took him two years just to get his first product to market.\r\n* * Third – People are starting to ask for refunds just because they can’t get an answer fast enough when they have a question, and they don’t feel supported.\r\n* * All of these things are affecting Joe’s bottom line.\r\n* * Joe is not addressing any of them… and it’s not because taking the time to schedule appointments or pay bills or do research (typical assistant work) is keeping him from it.\r\n* * Joe doesn’t do this stuff because he doesn’t like it and he can’t convince himself to do it.\r\n* * But, if Joe DOESN’T fix these issues, 1) he will never grow far and 2) he could be out of business soon.\r\n* * As soon as Joe hires an assistant… He’s immediately losing hundreds to thousands of dollars a month. Is that investment going to return to him immediately? In time or money? Is that going to improve his bottom line? Is it going to give him back enough time that his earning potential will balance out?\r\n* * What might be a better first hire?\r\n* * Joe doesn’t even know where all of his money is going. The first thing he needs to do is correct that. Hiring a financial assistant or CPA to manage his books should quickly point out what the next hire should be for Joe.\r\n* * Yes, it will also show him some money management flaws he has and help him to get a better grasp on finances, helping direct him in other ways…\r\n* * But it will also help Joe decide if what he should be doing next is hiring a customer support person or someone to get his product to market.\r\n* * How?\r\n* * Numbers.\r\n* * The CPA loves that math that most of us hate. (Weirdo. God Blessed Weirdo.)\r\n* * You need to know how much you make and how much you spend and more importantly… how much you are bleeding. I define bleeding is money that’s going out without giving you a return on your investment or too little of a return to justify the expense. Nearly every single client I’ve ever consulted with (possibly with ONE exception in 14 years) has had a standing expense on their books that was not earning them a return.\r\n* * Getting a very clear grasp of numbers is an absolute eye opener. Sometimes people find out how easily they could improve their bottom line by just making a few cuts to wasteful areas. Other times they realize they aren’t putting enough money into something… for example, running ads that are performing well.\r\n* * As you can see… hiring someone to help you get clear on your numbers can have a much more profound impact on your revenue, and almost instantly.\r\n* * It is not likely that hiring a personal assistant will have as quick and powerful of an impact if this area is being neglected.\r\n* * In business, a numbers expert is definitely one of the positions you want to fill first when you’re building your team.\r\n* * From there, you want to hire the roles that will make the most significant impact on your bottom line in the shortest amount of time. This person might be the head of sales and marketing, fulfilment, IT or customer service… often in that order.\r\n* * When you’ve taken the time to learn your numbers first, you know what you can afford for each of these positions and you should have a good idea as to what kind of ROI you can get when you fill the role.\r\n* Do everything you can to make sure that your return on investment when hiring can happen within the first month. To that end, part of your onboarding process should include very clear expectations of roles and responsibilities, outline their decision making power and autonomy clearly, and make the targets very clear that they need to hit and by what date.\r\n* * It’s not your job to tell them HOW to hit the target unless you can’t afford an expert and are going to train someone. In which case, (and it happens in startups with low initial capital) make sure you give them the outline and resources to learn what they need to learn.\r\n* * Of course the “where” and “how”  of hiring for small businesses is a process all of it’s own. There’s a book that provides some fantastic insight into this process called “Topgrading” which (although bulky, in my opinion) can be extremely helpful to someone who’s new to the hiring process.\r\n* * In my experience, I find that small business owners will take action on the least amount of information they feel necessary to make a decision. While learning HOW to hire is absolutely an important step towards success… It’s the second step.\r\n* * First, you have to figure out WHO to hire. What’s the most important role to fill first? What does your company need most?\r\n* * Even a bad hire can offer some relief and if nothing else, necessary experience for growth.\r\n* * But hiring someone who cannot earn the company back their investment could put you out of business before you ever get a chance to grow past two people.\r\n* * That’s the danger of being out of order.\r\n* * End post -\r\nHow Being An Entrepreneur Saved My Life\r\n 17 November 2017  0 Comments\r\n\r\n\r\nThe life of an entrepreneur is guaranteed to be crazy.\r\nWe’re not really “normal” people.\r\n\r\n\r\nWhile normal people stop dreaming like they did as a child…\r\n\r\n\r\nThe entrepreneur is still designing their superhero costumes that they will save the world in.\r\n\r\n\r\nUsually, they are surrounded by those normal people in the process.\r\n\r\n\r\nThose sleepwalkers.  The ones who are happy with things “just the way they are”.\r\n\r\n\r\nThose ones that want YOU to be happy “just the way things are.”\r\n\r\n\r\nBut if you did that… you’d never… EVER… get to fly in that amazing cape you’re making, right?\r\n\r\n\r\nOkay… that might not be 100% realistic…\r\n\r\n\r\nBut it’s a fairly good analogy.\r\n\r\n\r\nEntrepreneurs feel a power coursing through their veins.\r\nThey feel something calling to them that tells them… “You can do more!  You can BE more!”\r\n\r\n\r\nAnd that’s when the trouble happens.\r\n\r\n\r\nTrouble… like the kind that Martin Luther caused for the Roman Catholic church.\r\n\r\n\r\nTrouble, like Harriet Tubman caused for slave owners in the south.\r\n\r\n\r\nWait a minute… there I go romanticising entrepreneurialism again.\r\n\r\n\r\nLike we’re all heroes who do great things.\r\n\r\n\r\nYou might think…  I know a few of them… that’s not at all what they are.\r\n\r\n\r\nAnd I get that…\r\n\r\n\r\nBut if you keep reading… I’ll tell you how this is more true than not… and how being an entrepreneur truly did save my life… no embellishment necessary.\r\n\r\n\r\nSee…\r\n\r\n\r\nI’ve been an entrepreneur since I was 10.\r\nFrom mowing lawns to babysitting, from digging tulip bulbs out of the Skagit Valley fields in clumps of hard, finger-mangling dirt at the age of 12 to having a newspaper route…\r\n\r\n\r\nI’ve been working towards becoming a  superhero.\r\n\r\n\r\nBecause *I* needed to have a superhero.\r\n\r\n\r\nAs a young child…\r\n\r\n\r\nI witnessed the murder of my infant brother at the hands of our own father.\r\n\r\n\r\nI grew up in a house full of violent anger, substance abuse  and poverty.\r\n\r\n\r\nI wanted more.\r\n\r\n\r\nNot just more “Stuff”\r\n\r\n\r\nI wanted more power.\r\n\r\n\r\nMore freedom.\r\n\r\n\r\nI wanted more control over my life.\r\n\r\n\r\nI found that work… whether in school or for money, gave me that.\r\n\r\n\r\nI worked to be a better student because I wanted to get a scholarship since I knew that was the only way I would get to college. I could never afford it otherwise.\r\n\r\n\r\nFrom the same age I started working for money, I was college bound.\r\n\r\n\r\nWhen I finally got my full ride to college, though…\r\n\r\n\r\nI was a little to caught up in the mistakes that my “finally achieved” freedom (of turning 18) gave me.\r\n\r\n\r\nAdditionally…\r\n\r\n\r\nI realized I now had to deal with even more people with their own agendas being shoved down my throat in the form of college professors.\r\n\r\n\r\nThe combination had me dropping out of college.  They invited me back with my scholarships intact… and I tried two more times, and still quit before ever completing a second term.\r\n\r\n\r\nI was done.  \r\n\r\n\r\nThere were too many restrictions I couldn’t live with.\r\n\r\n\r\nAnd I, like many other of my kind…\r\n\r\n\r\nTook a harder road than I had to.\r\n\r\n\r\nBut  how is it that being an entrepreneur saved my life?\r\nThis is that story.\r\n\r\n\r\nPatterns love to repeat themselves.\r\n\r\n\r\nThe pattern of abuse is no different.\r\n\r\n\r\nI ended up marrying what was familiar to me. Someone who treated me horribly and was full of rage.\r\n\r\n\r\nI won’t get into how a person of my level of intelligence and strength tolerated that for as long as I did.  Sufficeth to say, I had a lot to learn and it took a long time to learn it.\r\n\r\n\r\nI had four children, whose lights were dimming in the environment we were in.\r\n\r\n\r\nI was afraid for them.\r\n\r\n\r\nFor their pain.\r\n\r\n\r\nFor their breaking spirits.\r\n\r\n\r\nAnd I was afraid of what would happen to us if I tried to leave.  (The threats and the anger were very real and intense)\r\n\r\n\r\nI had been working from home for 8 years… but I only had supplemental income.  It wasn’t enough to live off, even if it was subsidized by welfare aid.\r\n\r\n\r\nIf my ex didn’t kill me… lack of money was sure to.\r\n\r\n\r\nIt wasn’t until I realized I felt dead inside anyway that I decided, I really had nothing to lose.\r\n\r\n\r\nAnd so… I went back to work on my superhero cape.\r\n\r\n\r\nThat is to say, I got up the courage to leave.\r\n\r\n\r\nSlowly, over time…\r\n\r\n\r\nThrough fierce and intense and very REAL battles…\r\n\r\n\r\nI DID become the superhero I needed.\r\nAnd I became the hero my children needed.\r\n\r\n\r\nIt’s been nearly 7 years since I left.\r\n\r\n\r\nWe went from our first “Safe house” of 900’ sq with the five of us, right next to the airport and railroad, with no yard and no room to breathe…\r\n\r\n\r\nTo a brand new, never lived in before, large, beautiful, house on the hill. It has 15’ vaulted, pine ceilings and overlooks the city, lakes and mountains.\r\n\r\n\r\nI’ve created a 6 figure business that I only work while they are at school, and not even that entire time.\r\n\r\n\r\nI’m there to wake them up gently in the morning…\r\n\r\n\r\nCook for them…\r\n\r\n\r\nClean for them….\r\n\r\n\r\nCoach soccer…\r\n\r\n\r\nAnd stay up in the middle of the night when someone needs to talk.\r\n\r\n\r\nI set my own schedule.\r\n\r\n\r\nI employ friends who cannot get work otherwise.\r\n\r\n\r\nBut most importantly…\r\n\r\n\r\nI wake up peaceful, safe, free, and full of hope EVERY. SINGLE. DAY.\r\nI know not everyone that goes down this path gets to this place.\r\n\r\n\r\nWhich is why I do what I do…\r\n\r\n\r\nHelp others find this same kind of freedom.\r\n\r\n\r\nIf you need help sewing your superhero costume…If you’re the entrepreneur who is a hero waiting to be born…\r\nBut you just don’t know how to bring it all together yet…Reach out to me.  I can help.\r\n\r\n\r\n* End post-\r\nWhy Writing Down Your Entrepreneurial Vision Matters\r\n 21 November 2017  0 Comments\r\n\r\n\r\nHere it is… unsolicited advice.\r\n\r\n\r\nMy knee-jerk reaction to unsolicited advice is to return it it with unsolicited advice.\r\n\r\n\r\nLike… “Let me tell you where you can put that advice”.\r\n\r\n\r\nUnless… of course… someone takes the time to explay “WHY” that advice is something I should listen to AND they manage to get me to see their point as valid.\r\n\r\n\r\nIf I’m not on board…\r\n\r\n\r\nThat advice goes in one ear and out the other.\r\n\r\n\r\nSo, in true “Golden Rule” form…\r\n\r\n\r\nI want to get you to understand why this advice is pertinent to you and get YOU on board so that you not only listen… you DO.\r\n\r\n\r\nWhy?\r\n\r\n\r\nBecause if more visionaries could actually COMPLETE their quests to fulfill their visions and bring them to reality… then MY world becomes richer. I will get to reap the rewards of more creativity being brought to life.\r\n\r\n\r\nI want to see that happen.\r\n\r\n\r\nHere’s the thing…\r\n\r\n\r\nThe process of you writing down your entrepreneurial vision is likely the first step to making your vision take a physical form.\r\nIt’s now stepped out of the ether and onto paper… or some digital equivalent thereof.\r\n\r\n\r\nI mean, ask yourself, honestly… How many “visions” have you imagined for your business(s)…\r\n\r\n\r\nAnd how many of your visions have actually ever come to fruition?\r\n\r\n\r\n1%?\r\n\r\n\r\nLess than 1%?\r\n\r\n\r\nMy experience in working with hundreds of business owners tells me that for most people… 1% would probably be generous.\r\n\r\n\r\nGranted…\r\n\r\n\r\nA good portion of ideas just aren’t GREAT ideas and shouldn’t necessarily be brought to life.\r\n\r\n\r\nBut…\r\n\r\n\r\nUntil you START bringing your visions to life…  How do you learn how to recognize which ideas are viable and which ones are not?\r\n\r\n\r\nTHAT kind of knowledge only comes from experience…\r\n\r\n\r\nExperience that most people never get to because they are too busy being busy… too busy planning… too busy doing… well … anything but bringing their visions to life.\r\n\r\n\r\nThat’s the power of writing down your entrepreneurial visions.\r\nDid you know the word “entrepreneur” is derived from the French verb entreprendre, which means “to undertake”?\r\n\r\n\r\nAnd one of the definitions of “undertake” is attempt. Another definition is to “Commit to”\r\n\r\n\r\nSo, one could say that an entrepreneur is one who commits to attempt to do something.\r\n\r\n\r\nOne may also say that wording explains why most of them never actually COMPLETE anything.\r\n\r\n\r\nOh… the opportunities for judgement and criticism here are ENDLESS.\r\n\r\n\r\nAnd won’t we be happy to pass that judgement on ourselves, and stop all progress?\r\n\r\n\r\nAnd if not, won’t others be more than willing to pass that judgement on us, and halt the train…\r\n\r\n\r\nIf you want to become one of those visionaries who makes great things happen…\r\n\r\n\r\nYou want to START by bringing your vision to life as fast as possible.\r\n\r\n\r\nThat starts with writing it down.\r\n\r\n\r\nYes… it may fail.\r\n\r\n\r\nBut better to have failed through the experience of trial rather than to die in the mind before ever having a chance at life.\r\n\r\n\r\n* End post -\r\nExtract More Money From Your Small Business – Part 2\r\n 29 December 2017  0 Comments\r\n\r\n\r\nRemember, I don’t know exactly what you’re doing and what you’re offering OR how good you are.\r\n\r\n\r\nIf you feel like you’re not good enough to charge some of these prices… lower them. Then… improve your skills.\r\n\r\n\r\nThat being said…\r\n\r\n\r\nHere’s a good rule of thumb to follow.\r\n\r\n\r\nIf you’re offering one on one consulting time or group coaching (and you’re not a TOTAL narcissist…\r\n\r\n\r\nTake the highest price you’re comfortable with charging and then ADD 10% to that price.\r\n\r\n\r\nOnce you start getting sales at your price, incrementally increase your price by 5-10% for every new customer you take on until you stop getting conversions.\r\n\r\n\r\nDON’T BE THE ONE TO TELL YOURSELF NO!\r\n\r\n\r\nLet your customers tell you what they will pay.\r\n\r\n\r\n*note – correct pricing and packaging for value isn’t going to be enough if you don’t know how to pitch your offer.  If pitching is hard for you, study the book called”Pitch Anything” and work on that skill.  It will serve you well in many areas of life to improve this one skill.\r\n\r\n\r\nLet’s talk about the different types of products and services you might offer.  This is going to relate to digital products and virtual services.  Any physical products could be added in as well… just remember to calculate your profit margins accordingly.\r\n\r\n\r\nFirst of all, I’m a big believer in leading with value.   \r\n\r\n\r\nYou’re reading my “lead by example” version of that right now.\r\n\r\n\r\nI want you to get some value from me and KNOW I’m worth investing in before I ever ask you to invest.   If I can’t do that, I’ll probably not convince you I’m worth your time anyway and that’s just not a foundation\r\n\r\n\r\nI can build on.\r\n\r\n\r\nSo find a way to create something of value for your market that you can give away.  Create something that complements OR supplements what you already do.\r\n\r\n\r\nI grow businesses in many different ways.  One of them is helping entrepreneurs craft solid offers and clear their head trash so they can actually pitch them and make money.\r\n\r\n\r\nI found that is SUCH a common problem that I decided I would give as much help with that as possible, free of charge.  Obviously, it would work better one on one… but this is a way I can serve my market and find potential leads.\r\n\r\n\r\nDO THE SAME THING FOR YOUR MARKET.\r\n\r\n\r\nThe next thing you will create to ascend them up your value ladder is a low level offer, sometimes referred to as a trip wire.\r\n\r\n\r\nYou can have many different entry points into your marketing “eco system” … it does not have to be simply linear… but for the sake of simplicity and what I like to focus on, “Fastest Path to Cash” lets consider a linear value ladder starting with free, to low cost and upwards.\r\n\r\n\r\nYour low cost product should be something that can solve ONE specific problem for them.  It should be easily digestible within one to two hours and should allow them the ability to implement within a day.\r\n\r\n\r\nThe price here is between $6-$20.  There’s so many ways you can validate that your product (ebook or video training work really well) is worth more than dinner for two.\r\n\r\n\r\nIt may take you a while to think about why… but think it out…. Write up those bullet points and look at it.  When you look at that and say “That’s a no brainer” … You’ve got a winner.  \r\n\r\n\r\nDON’T OVER CREATE!\r\n\r\n\r\nREMEMBER to make it easily and quickly digestible and actionable!\r\nThe problem you will want to solve is not so much how to give value, not if you know your stuff.\r\n\r\n\r\nIt’s going to be more about demonstrating the value in a product they haven’t seen yet well enough to get them to part with their money.  So focus on this part!  \r\n\r\n\r\nPretend it’s your best friend and you want them to understand why they HAVE to have this.  You would tell them:\r\n\r\n\r\nBenefit!\r\nBenefit!\r\nBenefit\r\nBenefit!\r\nBenefit!\r\nWhat are the benefits of your product?  Get CLEAR on that and making the pitch will be a lot easier, as will choosing the price.\r\n\r\n\r\nThe next offer is going to be your CORE offer.\r\n\r\n\r\nThis is the one that should bring you the majority of your income.  All of your marketing and products will be leading up to THIS product or service that allows you to give max benefit to max audience size.\r\n\r\n\r\nMy preference is that this is scaleable, so it’s a digital product or training that modulated and self-paced (online membership course etc) with possible weekly trainings, live videos, q and a etc inside of a group.\r\n\r\n\r\nThis lets you leverage your time while being able to serve more people at a solid price point.\r\n\r\n\r\nFinally, you have your upsell offers.\r\n\r\n\r\nUpsells are not created to be just one more possible way to squeeze money out of a prospect.\r\n\r\n\r\nIt has to be purposeful and make sense for your market.\r\n\r\n\r\nKeep this in mind… people that pay the least expect the most.\r\n\r\n\r\nIt’s harder to sell people on free and $5 than it is to sell the RIGHT person on $200 or more.\r\n\r\n\r\nThe person who’s focused on VALUE rather than dollars (no, they are not the same) is going to be willing to spend more.\r\n\r\n\r\nOnce you’ve shown them value at each level, they are much more likely to want more from you and be willing to pay higher prices if you continue to offer them what they want.\r\n\r\n\r\nUpsells are going to solve a problem that not everyone in your market need solved, but the ones who do need it solved understand the value of it.\r\n\r\n\r\nI’ll use one of my own value ladders as an example:\r\n\r\n\r\nFree Optin/Lead Magnet – 10 Ways to $10k\r\n\r\n\r\nTripWire offer – Projects in a Box –\r\n\r\n\r\nPre-mapped out project templates for multiple business scenarios to help the “organizationally challenged” get organized fast. $17 per template\r\n\r\n\r\nCore Offer – My Freedom Systems – $97\r\n\r\n\r\nFour modules in a membership site teaching people Email management (email overwhelm KILLS productivity) Time management, Project Management (next level on what to do with the templates you bought) and Outsourcing (so you can hire the people to actually do the work ☺ )\r\n\r\n\r\nUpsell 1 – Group Coaching $199/month or $999 for 6  months (one month free)\r\n\r\n\r\nI offer 15 minute one on one calls twice a month and a weekly q and a call that’s recorded for all members of the group.  \r\n\r\n\r\nUpsell 2 – Business Consultation Call $299\r\n\r\n\r\n90-120  Minute call with me to create a clear plan for what’s next in the business to increase cash and freedom.\r\n\r\n\r\nRARE UPSELL – (I offer this to less than 1% of my audience)\r\n\r\n\r\nRetainer client agreement. Price varies  They get weekly calls with me and I speak to them and their team to keep projects on schedule and optimize profits and time.  I’ll spend 1-5 hours a week with clients from $2500-$10,000 a month.  It’s not for everyone.  The ones who want it are the ones who make enough that my optimization skills validate the investment.\r\n—\r\n\r\n\r\nApplying This To Your Offers\r\nThe strategy is to segment what you offer into a value ladder that you can ascend your customers up through.\r\n\r\n\r\nUse benefit bullet points to help you figure out what a price is for these offers.\r\n\r\n\r\nThink about how much time and stress your product or service will save them.  \r\n\r\n\r\nUse reference points like minimum wage hours worked vs. expert hours.  If you gave them, effectively, an hour worth of your time, is that not worth twice minimum wage?  \r\n\r\n\r\nIs it worth dinner for two?\r\n\r\n\r\nIs it worth … Well… What is it worth?\r\n\r\n\r\nThink hard and DON’T undervalue yourself.\r\n\r\n\r\nOkay… Here’s the worksheet to help you with some numbers and seeing HOW fast things can add up to $10k a month for you.\r\n\r\n\r\nDid I just hear you say “Finally!!!!”???\r\n\r\n\r\nI better not have!\r\n\r\n\r\nI had to warm you up to know what to plug in there, Speedy Gonzales.\r\n\r\n\r\nWithout context, the numbers don’t mean anything.\r\n\r\n\r\nIf you got to this point and skipped the rest above… Slap yourself on the wrist!\r\n\r\n\r\nThen go back up and read it.\r\n…\r\n\r\n\r\n…\r\n\r\n\r\n…\r\n\r\n\r\nAll done?  Good ☺ Let’s move on.\r\n\r\n\r\nScenario One –Lowballed\r\n\r\n\r\nWhen you’re too afraid to charge much… do you see how many sales you have to make in order to hit $10,000 a month?\r\n\r\n\r\nProduct        Price        Monthly Sales        Monthly Revenue\r\nTripWire        $5        750        $3,750\r\nCore Offer        $20        150        $3,000\r\nUpsell 1        $67        50        $3,350\r\nTotal Revenue        $10,100\r\nAsk yourself… is it harder to charge more and get fewer people to say yes or to charge less and get more people to say yes?\r\n\r\n\r\nScenario Two:\r\n\r\n\r\nProduct        Price        Monthly Sales        Monthly Revenue\r\nTripWire        $10        500        $5,000\r\nCore Offer        $27        100        $2,700\r\nUpsell 1        $67        35        $2,345\r\nTotal Revenue        $10,045\r\nHere, doubled the TripWire cost, but it’s still only $10.  We bumped the Core Offer price $7 and left the upsell the same.\r\n\r\n\r\nHere’s the thing.  With this offer, you need 315 LESS “yes’s” to get to $10k a month.\r\n\r\n\r\nWhen you think about what’s harder… getting a yes or a yes at a few buck higher… usually it’s just the “yes” that’s scariest.\r\n\r\n\r\nI told you… MATH IS YOUR FRIEND!\r\n\r\n\r\nSCENARIO THREE:\r\n\r\n\r\nProduct        Price        Monthly Sales        Monthly Revenue\r\nTripWire        $12        475        $5,700\r\nCore Offer        $37        75        $2,775\r\nUpsell 1        $67        25        $1,675\r\nTotal Revenue        $10,150\r\nAgain… just a few tweaks to the price and now we need even less sales to hit that number.\r\n\r\n\r\nSomething to think about is the percentage of conversions that take the offer.\r\n\r\n\r\nThe higher you can increase your conversion rate from TripWire to Core Offer to Upsell, the more sales you get, the higher value each of your new customer becomes.\r\n\r\n\r\nAs that happens, you can afford to invest more to acquire each new lead.\r\n\r\n\r\nSCENARIO FOUR:\r\n\r\n\r\nVIP Prices\r\n\r\n\r\nProduct        Price        Monthly Sales        Monthly Revenue\r\nTripWire        $12        450        $5,400\r\nCore Offer        $37        45        $1,665\r\nUpsell 1        $97        10        $970\r\nUpsell 2        $997        2        $1,994\r\nTotal Revenue        $10,029\r\nThis is a powerful example of what happens when you have higher ticket offers available.\r\n\r\n\r\nWith only TWO sales, you just added nearly $2k to your monthly revenue total.\r\n\r\n\r\nSee how fast that can add up?\r\n\r\n\r\nOnly two sales out of your 450 customers.  Improve your conversion rate and that generates a lot more money very quickly.\r\n\r\n\r\nEXCITING, ISN’T IT?  \r\n\r\n\r\nBet you wanna call up your old math teacher and thank them!  \r\n\r\n\r\nToo much?\r\n\r\n\r\nYeah… okay.  ☺\r\n\r\n\r\nSCENARIO FIVE:\r\n\r\n\r\nProduct        Price        Monthly Sales        Monthly Revenue\r\nTripWire        $12        300        $3,600\r\nCore Offer        $67        40        $2,680\r\nUpsell 1        $197        15        $2,955\r\nUpsell 2        $997        1        $997\r\nHere we upped the Core offer $20 and doubled the upsell price.  \r\n\r\n\r\nRemember, these are mock scenarios just to give you an visual idea of what happens when just a few numbers change.\r\n\r\n\r\nSCENARIO SIX:\r\n\r\n\r\nProduct        Price        Monthly Sales        Monthly Revenue\r\nTripWire        $20        275        $5,500\r\nCore Offer        $67        40        $2,680\r\nUpsell 1        $197        5        $985\r\nUpsell 2        $997        1        $997\r\nTotal Revenue        $10,162\r\nUpped that TripWire and BOOM.  More $$\r\n\r\n\r\nSCENARIO SEVEN:\r\n\r\n\r\nProduct        Price        Monthly Sales        Monthly Revenue\r\nTripWire        $20        300        $6,000\r\nCore Offer        $67        40        $2,680\r\nUpsell 1        $147        8        $1,176\r\nUpsell 2        $497        1        $497\r\nTotal Revenue        $10,353\r\nSome different price points. Lower Upsell prices need a few more front end offers, but not much.\r\n\r\n\r\nSCENARIO EIGHT:\r\n\r\n\r\nProduct        Price        Monthly Sales        Monthly Revenue\r\nTripWire        $20        300        $6,000\r\nCore Offer        $47        45        $2,115\r\nUpsell 1        $147        10        $1,470\r\nUpsell 2        $497        1        $497\r\nTotal Revenue        $10,082\r\nLowered the Core Offer price… still making $10k.\r\n\r\n\r\nSCENARIO NINE: – MORE PLEASE!\r\n\r\n\r\nProduct        Price        Monthly Sales        Monthly Revenue\r\nTripWire        $20        500        $10,000\r\nCore Offer        $47        50        $2,350\r\nUpsell 1        $147        10        $1,470\r\nUpsell 2        $497        1        $497\r\nTotal Revenue        $14,317\r\nWant to earn more than $10k a month?  Getting those $20 sales on automation isn’t that hard with a good content or ad strategy.\r\n\r\n\r\nEven with a ten percent conversion rate on upsells, the profits look pretty nice.\r\n\r\n\r\nSCENARIO TEN: – HIGH ROLLER\r\n\r\n\r\nProduct        Price        Monthly Sales        Monthly Revenue\r\nTripWire        $20        500        $10,000\r\nCore Offer        $47        50        $2,350\r\nUpsell 1 3 PAY        $297        10        $2,970\r\nUpsell 2        $997        1        $997\r\nTotal Revenue        $16,317\r\nA few years back, Digital Marketer did a study that found that they could charge THREE Times the price if they divided that price into three payments and it converted almost as well, only a 2% difference.\r\n\r\n\r\nInstead of charging $97, they charged three payments of $97 and only lost two percent of sales.\r\n\r\n\r\nPayment Plans are DEFINITELY something you want to consider adding to your model.\r\n\r\n\r\nSomething else you want to consider is making sure that your tripwire cost balances out your ad budget.\r\n\r\n\r\nWork on your conversion rate and prices so that you break even on any ad costs with trip wire sales.\r\n\r\n\r\nIn other words… If it costs you $2 for a new lead and your tripwire is $20, you need to convert every tenth lead into a customer to break even.\r\n\r\n\r\nOr… lower your lead cost.\r\n\r\n\r\nOr… raise your tripwire cost … but that could hurt you if you go above $20 depending on your market.  \r\n\r\n\r\nIf you’ve served them well with your free offer, you may be able to get more.\r\n\r\n\r\nBOTTOM LINE:\r\n\r\n\r\nMATH IS YOUR FRIEND!\r\n\r\n\r\nPlay around with your numbers to find out how to make YOUR  personal targets happen.\r\n\r\n\r\nI’ve included a link to a SUPER SIMPLE calculator that you can download to try different number scenarios.\r\n\r\n\r\nGrab it Here:\r\n\r\n\r\nJust adjust the price column and the number of sales column, don’t touch the totals, as that’s a formula that will automatically change as you change the price and total number of sales.\r\n\r\n\r\nTHAT’s IT!\r\n\r\n\r\nChanging the way you think about numbers is a POWERFUL way to change the kinds of numbers you have in your bank account each month.\r\n\r\n\r\nInterested in getting one on one help?\r\n\r\n\r\nClick Here to Book a Two Hour call with me to get some rocket fuel for your business.\r\n\r\n\r\nBecause, after all, there are way more than just 10 Ways to $10k. ☺\r\n\r\n\r\n– Tina Marie\r\n-end post-\r\n\r\nA SIMPLE PATH TOWARDS POWER, PURPOSE, PROSPERITY AND PEACE – AT YOUR OWN PACE\r\n 14 January 2023  0 Comments\r\nhttps://youtu.be/UuNFR_M2BFs\r\n\r\n\r\nI’m going to break down a little bit of how I’ve been able to create space to be there for my girls ANY time they need me, both in time and financial support.\r\nI am not the flashy sort. I’m weird by almost every standard. Always have been, always will be. And I’m okay with that.\r\n\r\n\r\nI have had people look at me and shake their heads more times than I can count and just say “You are so weird.”\r\n\r\n\r\nI do things differently because a lot of what other people do just doesn’t make sense to me. I can sound really smart but I can also sound REALLY dumb. It can take me a while to wrap my head around some things.\r\n\r\n\r\nDespite this, I’ve reached a level of success that most will never acheive, when compared to the general population. I won’t quantify that because frankly, it’s private. Suffice it to say I have an incredible amount of freedom in my life due to what I earn and how little time I have to spend earning it.\r\n\r\n\r\nThe first thing to understand is this did not happen FAST.\r\nPart of that is because I got started in 2002 on DIAL UP and NOTHING about the internet could have been considered FAST at that time.\r\n\r\n\r\nExcept for how quickly people could waste time, lose their money or find someone to destroy their marriages with. Some things haven’t changed in that regard.\r\n\r\n\r\nEven though I had a full-ride scholarship, I dropped out of college three times after only getting past the first term.\r\n\r\n\r\nAnother example of how I can be really smart and REALLY stupid.\r\n\r\n\r\nI graduated with honors in high school but I never did homework and always did the minumum work to get good enough grades that I *could* earn a scholarship because I wanted a different life so badly.\r\n\r\n\r\nThe pattern of doing *just enough* to get where I wanted to go has been consistent throughout my life.\r\n\r\n\r\nIn some ways, I’ve felt ashamed of that.\r\n\r\n\r\nI’ve felt like I never really lived up to my potential because I never had the discipline to reach mastery in any particular area.\r\n\r\n\r\nCase in point, I spent less than an hour on this post between writing, recording, and making the image.  There are MUCH MORE polished people than I. That said… I’m pretty happy with my less-than-polished efforts and results.  \r\n\r\n\r\nOver the years and decades of adulthood and watching people climb their different ladders… I noticed something about most of those who DID acheive mastery levels.\r\nThey had more stress.\r\nThey beat themselves up a lot.\r\nThey were hard on themselves AND others.\r\nIt took a toll on their health and relationships.\r\nI also noticed that a pattern I would observe in most tenacious Goal Getters was how hard they would work to push towards their goals, even when it seemed like the powers of the universe had conspired to slow them down by any means necessary.\r\n\r\n\r\nAnd that’s when I realized…\r\n\r\n\r\nThere is a natural rhythm to life that does not respond well to brute force.\r\nThere’s a pace at which things seem to have their own “will” to be flowing at.\r\n\r\n\r\nI learned that if I stopped trying to brute-force my way to the things I wanted, I would get there just as fast, but with less battle scars.\r\n\r\n\r\nThat was one of my experiments. I “tested” what it would be like to cool my jets and push things as far as I could… not to the point of resistance but to the point of PUSH BACK\r\n\r\n\r\nResistance is a word people use a lot but I’ll replace it with friction. That uncomfortable feeling of heat from the grinding efforts of pushing forward against a barrier. I never let friction stop me.\r\n\r\n\r\nWhat I *do* work to recognize is the point at which my pushing is not getting me any further and now I am on a hamsterwheel, running without going anywhere, or falling down and flying off the wheel completely.\r\n\r\n\r\nI have experimented with abandoning goals that didn’t seem to be achievable.\r\n\r\n\r\nI have experimented with letting things take their cool down periods or go at a slower pace periods and just refocusing my energy elsewhere for a while.\r\n\r\n\r\nWhat I have found is that many times, inspiration or  opportunity will come that allows me to start making more progress towards a goal again, or allows the progress to resume at a faster pace.\r\n\r\n\r\nDuring the cool down periods or slower pace periods… I haven’t stopped thinking about what I wanted and how I can get there.\r\n\r\n\r\nI starting taking off any fixed/hard deadlines about when things had to happen.\r\nThe side effect of taking off what are essentially ARBITRARY DEADLINES is that I removed the desparation from the equation.\r\n\r\n\r\nI shifted the expectation from WHEN something has to happen to just having something happen.\r\n\r\n\r\nI have applied this practice to business goals, health goals, spiritual goals and relationship goals.\r\n\r\n\r\nI have PRIORITIZED PROGRESS OVER DESTINATION AND DEADLINE.\r\nI found that when I took the desparation out, I had more room for INNOVATION and EXPERIMENTATION.\r\n\r\n\r\nHere’s the thing…\r\n\r\n\r\nWhen you are working on a deadline you want to go with the thing you THINK is going to get you the best results.\r\n\r\n\r\nThat is almost always going to be something you learned from someone else. You know about it and think it will work because you saw someone else do it.\r\n\r\n\r\nWhat you LOSE in that type of behavior is the opportunity to make your own magic.\r\n\r\n\r\nIf you are less focused on HAVING to do something by a certain time, you can explore the different paths you can take to get there.\r\n\r\n\r\nWhen you go slower, you have more time to observe  your surroundings.\r\nYou have more time to experiment with different tools and resources and processes.\r\n\r\n\r\nYou can make the journey to  your destination that much richer.\r\n\r\n\r\nAnd I would encourage you to strongly consider that.\r\n\r\n\r\nThe truth is, none of us knows when we will draw our last breath.\r\nI can think of nothing sadder than ending this life full of regret and wishing I had better used the time I had here making my own kind of magic.\r\n\r\n\r\nI test EVERYTHING in my life.  I am always looking to strike a balance between a fulfilling level of growth and improvement with an optimized level of energy and peace.\r\n\r\n\r\nI have learned I cannot be happy if I don’t have enough work to do in my life.  It does not all need to be income producing but I MUST be employed in purposeful action for the majority of my day or I will languish.\r\n\r\n\r\nI have learned that if I do too much, my health and relationships suffer, and axiety abounds.\r\nI have also learned that some days and some seasons I can do more than other times.  So I test my capacity often and do not ever assume that what I can do today is the same as yesterday, or that tomorrow will be the same as today.\r\n\r\n\r\nThrough simple little tests, and a willingness to remove arbitrary deadlines that were set “because I want to” or think that’s what they “should” be, I have created a life and business of power, purpose, and peace.\r\n\r\n\r\nI hope that you can find some value in these things and grow in power, purpose and peace yourself. 💙\r\n-end post-\r\nI’m Tina Marie, and I’m a business consultant\r\nthat has helped several startups grow to million\r\ndollar businesses within a year, and others to\r\nmulti-million dollar companies in under three years\r\nfrom their inception.\r\nTo tell you how I got here, I’d have to go back a\r\ngood 30+ years. I was entrepreneurial and geeky\r\nfrom the beginning. At 8, I was learning how to\r\nwrite programs in BASIC on a Radioshack TRS80\r\n(think floppy disk and cassette tape drives... oh\r\nyeah!) Lemonade stands were a little too social for\r\nmy taste, back in the day, so at ten, I was mowing\r\nlawns and babysitting. By 11 I had a paper route\r\nand made a good $65 a month. From that point\r\non, if I wanted something, I was the one who made\r\nit happen.\r\nI worked in fields picking crops with migrant\r\nworkers. I worked in school cafeterias and then\r\nhustled my way into a job at a Law office as a 16\r\nyear old runner for 5 local attorneys when I had\r\ndecided I wanted to go into law.\r\nI managed to get a full ride to college and then\r\nquit.. Three times before quitting for good, when\r\nI realized I couldn’t stand the agendas and\r\npropoganda that came with the education.\r\nInstead, I found a way to get paid to learn, and\r\nstarted working in a call center that housed tech\r\ngiants like Intel, Apple, Adobe and the likes. While\r\nI started as a technician, I rapidly moved up the\r\nranks to account management during my 6 years\r\nthere. I learned that I have a knack for improving\r\nany environment I worked in via optimization.\r\nMy systems saved jobs and accounts before I even\r\nrealized the power of what I had created.\r\nAfter the birth of my second (of four) daughters,\r\nI decided to figure out how to replace my full\r\ntime income from home. While I went down the\r\n“SQUIRREL!!!” path that most entrepreneurs find\r\nthemselves on, I quickly (Within a year) realized I\r\ncould take my existing skills and find a home for\r\nthem online.\r\nI’ve been growing companies as a secret weapon\r\non the inside ever since... all while having the time\r\nto raise my girls, cook their meals, coach them in\r\nsports and do the things that matter most to me.\r\nAnd now... 16 years after starting online and 17\r\nyears after my first child, I’m sharing my systems\r\nwith as many entrepreneurs as I can so that others\r\ncan be as happy, fulfilled, and liberated as I am.\r\nWorking smarter and not harder is not cliche...\r\nIt’s an anthem to live by.\r\nFollow me, and I’ll show you :)\r\n1. Math is Your Friend\r\n2. Start with “Why?”\r\n3. Mindset\r\n3.1 You Actually Are Expert Enough\r\n3.2 Being Broke Helps No One\r\n3.3 Why You and Not Some Other Expert\r\n4. Pricing and Packaging\r\n4.1 10% Rule of Thumb\r\n4.2 Lead With Value\r\n4.3 Map a Value Ladder\r\n4.4 Don’t Overthink It\r\n4.5 Your Core Offer\r\n4.6 Upsells\r\n5. Example Scenarios\r\n5.1 Scenario One –Lowballed\r\n5.2 Scenario Two - Bump the Core Offer\r\n5.3 Scenario Three - Bump in Price + Conversion\r\n5.4 Scenario Four - Vip Pricing\r\n5.5 Scenario Five - Double the Upsell Price\r\n5.6 Scenario Six - Tripped Up\r\n5.7 Scenarios Seven - Lower Upsell Price\r\n5.8 Scenario Eight - Lower Core Offer Price\r\n5.9 Scenarios Nine - More Please\r\n5.10 Scenario Ten - High Roller\r\n6. Bottom Line\r\nTable of Contents\r\nMath Is\r\nYour Friend.\r\nChapter 1\r\nMost entrepreneurs do not go into\r\nbusiness because they love crunching\r\nnumbers and balancing the books.\r\nIt is impossible to tell someone you are not\r\nspeaking to personally exactly how they should\r\nprice and package their offers.\r\nThis is my solution to that problem.\r\nI am going to give you ten customizable scenarios\r\nwith different types of products and packages that\r\nyou can plug into your business (with a little brain\r\npower from yourself) that should help you see\r\nwhat you can change to get more profits out of\r\nyour business, with very little additional work other\r\nthan creating the offers and writing them up.\r\nMost entrepreneurs get started because they are\r\nunsatisfied with the status quo in some way or\r\nanother and find the only solution is to create their\r\nown paths.\r\nWe venture out on it and learn as we go. And while\r\nthere are tons of great programs that teach how to\r\nSELL or even WHAT to sell...\r\nThere is very little spoken about how to package an\r\noffer and what prices to use to hit your goals.\r\nThere is a reason for that...\r\nStart With\r\n“Why”?\r\nChapter 2\r\nWhy is it so hard to charge the right\r\nprice?\r\nIf they cannot do it at all... obviously you have\r\nvalue.\r\nIf you can do it FASTER or BETTER than they\r\ncan... you have verifiable value.\r\nWhen YOU are your product, how you value yourself\r\nhas EVERYTHING to do with this struggle.\r\nHere are some things you need to consider in\r\nyour mind when you figure out your value to your\r\nclients:\r\nCould they do what you (or your product or\r\nservice) will do for them, or as well or as fast as\r\nyou could?\r\nMindset.\r\nChapter 3\r\nYou Actually Are\r\nExpert Enough.\r\nChapter 3: Part 1\r\nMost unpaid experts don’t yet consider\r\nthemselves expert enough to charge\r\nmoney.\r\nEasy deal, right? That food is going to cost him\r\nmoney and time, and you’re okay with that, right?\r\nWhy? Because you gave him value and you both\r\nknow it.\r\nWell... when you’re giving value to a complete\r\nstranger who you are only interacting with\r\nthrough websites, text, videos and other marketing\r\nmaterials... even socially on the interwebs...\r\nTrading BBQ for your genius skills isn’t really going\r\nto pan out. And the bottom line is: If you don’t\r\ncharge properly you will end up broke.\r\nIf you know more than the average person does,\r\nand you can help them do something they could\r\nnot do as fast or as well as you can help them to\r\ndo, then you are expert enough to charge money.\r\nMoney is simply the currency used to exchange\r\nvalue\r\nLook, let’s say your neighbor wants you to come\r\nhelp him on the computer because he’s a\r\ntechnoob and well, you’re awesome. But, because\r\nhe’s your friend and lives next door... he doesn’t\r\noffer money, he offers to send you over some of his\r\nkiller BBQ when he grills this weekend.\r\nBeing Broke\r\nHelps No One.\r\nChapter 3: Part 2\r\nYou are not going to be around to help\r\nanyone because you’re broke and\r\ndepressed.\r\nBut the economy needs you to contribute!\r\nYou have a serious obligation to go out there and\r\ncompete for business and serve YOUR MARKET.\r\nYou know... the ones who don’t want to do business\r\nwith that douchebag Steve who may be as good\r\nor even a little bit better at what you do, but isn’t\r\nworth the investment.\r\nSound a little brutal? I know. But... YOU KNOW I’M\r\nRIGHT.\r\nSo stop arguing with me and with yourself and\r\nlisten up.\r\nGetting paid properly is the way to feel free and\r\nhappy AND it’s the way to ensure you have the\r\nresources you need to continue to hone your\r\ncraft and offer your products and services to the\r\nmarketplace.\r\nI don’t want this to go to your head or anything...\r\nWhy You and\r\nNot Some Other\r\nExpert?\r\nChapter 3: Part 3\r\nThere are a ton\r\nof reasons why\r\npeople will want\r\nto pay you and\r\nnot someone else.\r\nI don’t want to spend a long time on this so just\r\nthink about how you’ve chosen one person over\r\nanother simply on feeling instead of value. If you\r\nshow up and do the work, you can find a way to\r\nget a piece of the market.\r\nThat’s my pep talk.\r\nIf you need one on one advice, you can always some time with me for a little tough love.\r\n(Paid of course... I KNOW MY VALUE)\r\nPricing and\r\nPackaging.\r\nChapter 4\r\nRemember, I don’t\r\nknow exactly\r\nwhat you’re doing\r\nand what you’re\r\noffering or how\r\ngood you are.\r\nIf you feel like you’re not good enough to charge some of these prices... lower them.\r\nThen... improve your skills. That being said... Here’s a good rule of thumb to follow.\r\nIf you’re offering one on one consulting time or group coaching (and you’re not a\r\nTOTAL narcissist)...\r\n10% Rule\r\nof Thumb.\r\nChapter 4: Part 1\r\nTake the highest price you’re\r\ncomfortable with charging and then\r\nADD 10% to that price.\r\nLet’s talk about the different types of products\r\nand services you might offer. This is going to\r\nrelate to digital products and virtual services. Any\r\nphysical products could be added in as well...\r\njust remember to calculate your profit margins\r\naccordingly.\r\nOnce you start getting sales at your price,\r\nincrementally increase your price by 5-10% for\r\nevery new customer you take on until you stop\r\ngetting conversions.\r\nDON’T BE THE ONE TO TELL YOURSELF NO!\r\nLet your customers tell you what they will pay.\r\n*note – correct pricing and packaging for value isn’t going to be\r\nenough if you don’t know how to pitch your offer. If pitching is hard\r\nfor you, study the book called “Pitch Anything” and work on that\r\nskill. It will serve you well in many areas of life to improve this one\r\nskill.\r\nLead With\r\nValue.\r\nChapter 4: Part 2\r\nFirst of all, I’m a big believer in leading\r\nwith value.\r\nI grow businesses in many different ways. One of\r\nthem is helping entrepreneurs craft solid offers and\r\nclear their head trash so they can actually pitch\r\nthem and make money.\r\nI found that is SUCH a common problem that I\r\ndecided I would give as much help with that as\r\npossible, free of charge. Obviously, it would work\r\nbetter one on one... but this is a way I can serve my\r\nmarket and find potential leads.\r\nDo the same thing for your market.\r\nYou’re reading my “lead by example” version of that\r\nright now.\r\nI want you to get some value from me and KNOW\r\nI’m worth investing in before I ever ask you to\r\ninvest. If I can’t do that, I’ll probably not convince\r\nyou I’m worth your time anyway and that’s just not\r\na foundation I can build on.\r\nSo find a way to create something of value for your\r\nmarket that you can give away. Create something\r\nthat complements OR supplements what you\r\nalready do.\r\nMap a Value\r\nLadder.\r\nChapter 4: Part 3\r\nThe next thing\r\nyou will create to\r\nascend them up\r\nyour value ladder\r\nis a low level\r\noffer, sometimes\r\nreferred to as a\r\ntrip wire.\r\nYou can have many different entry points into your marketing “eco system”... it does not have to be simply\r\nlinear... but for the sake of simplicity and what I like to focus on, “Fastest Path to Cash” let’s consider a linear\r\nvalue ladder starting with free, to low cost and upwards.\r\nYour low cost product should be something that can solve ONE specific problem for them. It should be easily\r\ndigestible within one to two hours and should allow them the ability to implement within a day.\r\nThe price here is between $6-$20. There’s so many ways you can validate that your product (ebook or video\r\ntraining work really well) is worth more than dinner for two.\r\nIt may take you a while to think about why... but think it out.... Write up those bullet points and look at it. When\r\nyou look at that and say “That’s a no brainer”... You’ve got a winner.\r\nDon’t\r\nOverthink It.\r\nChapter 4: Part 4\r\nRemember to\r\nmake it easily and\r\nquickly digestible\r\nand actionable!\r\nThe problem you will want to solve is not so much\r\nhow to give value, not if you know your stuff.\r\nIt’s going to be more about demonstrating the\r\nvalue in a product they haven’t seen yet well\r\nenough to get them to part with their money. So\r\nfocus on this part!\r\nPretend it’s your best friend and you want them to\r\nunderstand why they HAVE to have this. You would\r\ntell them:\r\n• Benefit!\r\n• Benefit!\r\n• Benefit!\r\n• Benefit!\r\n• Benefit!\r\nWhat are the benefits of your product? Get CLEAR\r\non that and making the pitch will be a lot easier, as\r\nwill choosing the price.\r\nYour\r\nCore Offer.\r\nChapter 4: Part 5\r\nThe next offer is going to be your core\r\noffer.\r\nThis is the one that should bring you the majority\r\nof your income. All of your marketing and products\r\nwill be leading up to THIS product or service that\r\nallows you to give max benefit to max audience\r\nsize.\r\nMy preference is that this is scaleable, so it’s a\r\ndigital product or training that modulated and\r\nself-paced (online membership course etc) with\r\npossible weekly trainings, live videos, q and a etc\r\ninside of a group.\r\nThis lets you leverage your time while being\r\nable to serve more people at a solid price point.\r\nUpsells.\r\nChapter 4: Part 6\r\nUpsells are not created to be just one\r\nmore possible way to squeeze money\r\nout of a prospect.\r\nOnce you’ve shown them value at each level, they\r\nare much more likely to want more from you and\r\nbe willing to pay higher prices if you continue to\r\noffer them what they want.\r\nUpsells are going to solve a problem that not\r\neveryone in your market need solved, but the ones\r\nwho do need it solved understand the value of it.\r\nI’ll use one of my own value ladders as an example:\r\nIt has to be purposeful and make sense for your\r\nmarket.\r\nKeep this in mind... people that pay the least\r\nexpect the most.\r\nIt’s harder to sell people on free and $5 than it is to\r\nsell the RIGHT person on $200 or more.\r\nThe person who’s focused on VALUE rather than\r\ndollars (no, they are not the same) is going to\r\nbe willing to spend more.\r\nTripWire Offer – Projects in a Box\r\nPre-mapped out project templates for multiple business scenarios to help the “organizationally challenged”\r\nget organized fast. $17 per template\r\nCore Offer – My Freedom Systems - $97\r\nFour modules in a membership site teaching people Email management (email overwhelm KILLS\r\nproductivity) Time management, Project Management (next level on what to do with the templates you\r\nbought) and Outsourcing (so you can hire the people to actually do the work)\r\nUpsell 1 – Group Coaching $199/month or $999 for 6 months (one month free)\r\nI offer 15 minute one on one calls twice a month and a weekly q and a call that’s recorded for all members of\r\nthe group.\r\nFree Optin/Lead Magnet – 10 Ways to $10k\r\nUpsell 2 – Business Consultation Call $299\r\n90-120 Minute call with me to create a clear plan for what’s next in the business to increase cash and\r\nfreedom.\r\nRARE UPSELL – I offer this to less than 1% of my audience\r\nRetainer client agreement. Price varies. They get weekly calls with me and I speak to them and their team\r\nto keep projects on schedule and optimize profits and time. I’ll spend 1-5 hours a week with clients from\r\n$2500-$10,000 a month. It’s not for everyone. The ones who want it are the ones who make enough that my\r\noptimization skills validate the investment.\r\nApplying this to your offer.\r\nThink hard and DON’T undervalue yourself.\r\nOkay... Here’s the worksheet to help you with some\r\nnumbers and seeing HOW fast things can add up\r\nto $10k a month for you.\r\nDid I just hear you say “Finally!!!!”???\r\nI better not have!\r\nI had to warm you up to know what to plug in there,\r\nSpeedy Gonzales.\r\nWithout context, the numbers don’t mean anything.\r\nIf you got to this point and skipped the rest above...\r\nSlap yourself on the wrist! Then go back up and\r\nread it.\r\nThe strategy is to segment what you offer into a\r\nvalue ladder that you can ascend your customers\r\nup through.\r\nUse benefit bullet points to help you figure out what\r\na price is for these offers.\r\nThink about how much time and stress your\r\nproduct or service will save them.\r\nUse reference points like minimum wage hours\r\nworked vs. expert hours. If you gave them,\r\neffectively, an hour worth of your time, is that not\r\nworth twice minimum wage?\r\nIs it worth dinner for two? Is it worth ... Well... What is\r\nit worth?\r\nExample\r\nScenarios.\r\nChapter 5\r\nScenario One:\r\nLowballed.\r\nChapter 5: Part 1\r\nLowballed.\r\nWhen you’re too afraid to charge much... do you see how many sales you have to make in order to hit $10,000\r\na month? Ask yourself... is it harder to charge more and get fewer people to say yes or to charge less and get\r\nmore people to say yes?\r\nProduct Price Monthly Sales Monthly Revenue\r\nTripWire $5 750 $3,750\r\nCore Offer $20 150 $3,000\r\nUpsell 1 $67 50 $3,350\r\nTotal Revenue $10,100\r\nScenario Two:\r\nBump the Core\r\nOffer.\r\nChapter 5: Part 2\r\nBump the Core Offer.\r\nHere, doubled the TripWire cost, but it’s still only $10. We bumped the Core Offer price $7 and left the upsell\r\nthe same. Here’s the thing. With this offer, you need 315 LESS “yes’s” to get to $10k a month.\r\nWhen you think about what’s harder... getting a yes or a yes at a few buck higher... usually it’s just the “yes”\r\nthat’s scariest. I told you... MATH IS YOUR FRIEND!\r\nProduct Price Monthly Sales Monthly Revenue\r\nTripWire $10 500 $5,000\r\nCore Offer $27 100 $2,700\r\nUpsell 1 $67 35 $2,345\r\nTotal Revenue $10,045\r\nScenario Three:\r\nBump in Price +\r\nConversion.\r\nChapter 5: Part 3\r\nBump in Price + Conversion.\r\nAgain... just a few tweaks to the price and now we need even less sales to hit that number.\r\nSomething to think about is the percentage of conversions that take the offer. The higher you can increase\r\nyour conversion rate from TripWire to Core Offer to Upsell, the more sales you get, the higher value each of\r\nyour new customer becomes.\r\nAs that happens, you can afford to invest more to acquire each new lead.\r\nProduct Price Monthly Sales Monthly Revenue\r\nTripWire $12 475 $5,700\r\nCore Offer $37 75 $2,775\r\nUpsell 1 $67 25 $1,675\r\nTotal Revenue $10,150\r\nScenario Four:\r\nVip Pricing.\r\nChapter 5: Part 4\r\nVip Pricing.\r\nThis is a powerful example of what happens when you have higher ticket offers available. With only TWO\r\nsales, you just added nearly $2k to your monthly revenue total. See how fast that can add up?\r\nOnly two sales out of your 450 customers. Improve your conversion rate and that generates a lot more\r\nmoney very quickly. EXCITING, ISN’T IT? Bet you wanna call up your old math teacher and thank them!\r\nProduct Price Monthly Sales Monthly Revenue\r\nTripWire $12 450 $5,400\r\nCore Offer $37 45 $1,665\r\nUpsell 1 $97 10 $970\r\nUpsell 2 $997 2 $1,994\r\nTotal Revenue $10,029\r\nScenario Five:\r\nDouble the Upsell\r\nPrice.\r\nChapter 5: Part 5\r\nDouble the Upsell Price.\r\nHere we upped the Core offer $20 and doubled the upsell price.\r\nRemember, these are mock scenarios just to give you an visual idea of what happens when just a few\r\nnumbers change.\r\nProduct Price Monthly Sales Monthly Revenue\r\nTripWire $12 300 $3,600\r\nCore Offer $37 40 $2,680\r\nUpsell 1 $197 15 $2,955\r\nUpsell 2 $997 1 $997\r\nTotal Revenue $10,232\r\nScenario Six:\r\nTripped Up.\r\nChapter 5: Part 6\r\nTripped Up.\r\nUpped that TripWire and BOOM. More $$.\r\nProduct Price Monthly Sales Monthly Revenue\r\nTripWire $20 275 $5,500\r\nCore Offer $67 40 $2,680\r\nUpsell 1 $197 5 $985\r\nUpsell 2 $997 1 $997\r\nTotal Revenue $10,162\r\nScenario Seven:\r\nLower Upsell\r\nPrice.\r\nChapter 5: Part 7\r\nLower Upsell Price.\r\nSome different price points. Lower Upsell prices need a few more front end sales, but not much.\r\nProduct Price Monthly Sales Monthly Revenue\r\nTripWire $20 300 $6,000\r\nCore Offer $67 40 $2,680\r\nUpsell 1 $147 8 $1,176\r\nUpsell 2 $497 1 $497\r\nTotal Revenue $10,353\r\nScenario Eight:\r\nLower Core Offer\r\nPrice.\r\nChapter 5: Part 8\r\nLower Core Offer Price.\r\nLowered the Core Offer price... still making $10k.\r\nProduct Price Monthly Sales Monthly Revenue\r\nTripWire $20 300 $6,000\r\nCore Offer $47 45 $2,115\r\nUpsell 1 $147 10 $1,470\r\nUpsell 2 $497 1 $497\r\nTotal Revenue $10,082\r\nScenario Nine:\r\nMore Please.\r\nChapter 5: Part 9\r\nMore Please.\r\nWant to earn more than $10k a month? Getting those $20 sales on automation isn’t that hard with a good\r\ncontent or ad strategy.\r\nEven with a ten percent conversion rate on upsells, the profits look pretty nice.\r\nProduct Price Monthly Sales Monthly Revenue\r\nTripWire $20 500 $10,000\r\nCore Offer $47 50 $2,350\r\nUpsell 1 $147 10 $1,470\r\nUpsell 2 $497 1 $497\r\nTotal Revenue $14,317\r\nScenario Ten:\r\nHigh Roller.\r\nChapter 5: Part 10\r\nHigh Roller.\r\nA few years back, Digital Marketer did a study that found that they could charge THREE Times the price if they\r\ndivided that price into three payments and it converted almost as well, only a 2% difference.\r\nInstead of charging $97, they charged three payments of $97 and only lost two percent of sales. Payment\r\nPlans are DEFINITELY something you want to consider adding to your model.\r\nProduct Price Monthly Sales Monthly Revenue\r\nTripWire $20 500 $10,000\r\nCore Offer $47 50 $2,350\r\nUpsell 1 - 3 PAY $297 10 $2,970\r\nUpsell 2 $997 1 $997\r\nTotal Revenue $16,317\r\nSomething else you want to consider is making sure that your tripwire cost balances out your ad budget.\r\nWork on your conversion rate and prices so that you break even on any ad costs with trip wire sales.\r\nIn other words... If it costs you $2 for a new lead and your tripwire is $20, you need to convert every tenth lead\r\ninto a customer to break even.\r\nOr... lower your lead cost.\r\nOr... raise your tripwire cost... but that could hurt you if you go above $20 depending on your market.\r\nIf you’ve served them well with your free offer, you may be able to get more.\r\nBottom\r\nLine.\r\nChapter 6\r\nMath is your friend!\r\nInterested in getting one on one help?\r\nClick Here to Book a Two Hour call with me to get\r\nsome rocket fuel for your business.\r\nBecause, after all, there are way more than just 10\r\nWays to $10k.\r\nPlay around with your numbers to find out how to\r\nmake YOUR personal targets happen.\r\nI’ve included a link to a SUPER SIMPLE calculator\r\nthat you can download to try different number\r\nscenarios. Grab it here.\r\nJust adjust the price column and the number of\r\nsales column, don’t touch the totals, as that’s a\r\nformula that will automatically change as you\r\nchange the price and total number of sales.\r\nThat’s it!\r\nChanging the way you think about numbers is a\r\nPOWERFUL way to change the kinds of numbers you\r\nhave in your bank account each month.\r\n---- end post -","contentPreview":"﻿How Setting Firm Rules and Personal Boundaries Can Liberate You\r\n 20 September 2017  0 Comments\r\n\r\n\r\nI feel that every person, in every station in life, and in every aspect in life, should take the t...","processedAt":"2025-05-04T03:40:52.646Z"}