{"fileName":"Done Transcript for Basis Integration_Sweet Law(1).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Basis Integration_Sweet Law(1).txt","type":"transcript","priority":"medium","content":"00:00:00 - Tina Marie (profitdriversinc.com)\nCan you hear me? I can't. How are you doing today?\n00:00:05 - mark sweet\nI'm trying to take time to make things at once, you know, you know, Yeah. to figure out some of the travel that's coming up. It's going to get a little intense, but should be okay.\n00:00:21 - Tina Marie (profitdriversinc.com)\nOh, work stuff or work plus the crazy 24 hours.\n00:00:28 - mark sweet\nOh, no, that's my part. think that more work stuff. trying to factor in a couple of things like next, we're going to be in St. Louis, Missouri. But I have him as my grandma a long time. She doesn't want us to consider for her birthday and Myrtle Beach is only about an hour flight from there. So trying to figure out how to get there and then get back the next day. And then we've got.\n00:00:52 - Tina Marie (profitdriversinc.com)\nAfter that.\n00:00:54 - mark sweet\nSo we've got New Mexico coming up and then. See. St. Louis, Arizona on that Friday in a copy event on that Thursday, New Mexico on the 30th, Seattle on the second and third, and someone up there. So yeah, we've got a lot of stuff coming up, but it's okay.\n00:01:19 - Tina Marie (profitdriversinc.com)\nOkay, that was way too fast for me to capture it. What's that Dan?\n00:01:27 - Dan’s iPhone (danddcompany.com)\nAbout them.\n00:01:28 - Tina Marie (profitdriversinc.com)\nOh yeah, I was just trying to get it going though. It wasn't it didn't launch right away for some reason. Also, it's not super perfect. So I can't visualize that like on a calendar, but why do you have so much going on? Is it good?\n00:01:51 - mark sweet\nit necessary? What? No, I'm just dumb as and some of the stuff I can't control.\n00:01:58 - Tina Marie (profitdriversinc.com)\nSo can you elaborate?\n00:02:00 - mark sweet\nOkay, like I can't plan when a mixer is going to be, so it's not just up to and just everything tends to happen around the same time for whatever reason. And then I'm like, oh, well, I'm already here. So what if I also do these seven other things I want.\n00:02:19 - Tina Marie (profitdriversinc.com)\nAnd how's that working out for you.\n00:02:23 - mark sweet\nThat's how I like to do stuff.\n00:02:27 - Tina Marie (profitdriversinc.com)\nOkay, so it's busy and hectic and you're cool with that.\n00:02:30 - mark sweet\nYes, Mike. Okay, just being clear on that, because if that's how it is, then I won't dig into it at all, but I'm just like sleep for like two days.\n00:02:42 - Tina Marie (profitdriversinc.com)\nIt's cool. Is it cool though, because I'm, you know, words matter, truth matters.\n00:02:48 - mark sweet\nIt's a lot easier to go and visit someone that's an hour away than try to figure out a six plus hour trip.\n00:02:58 - Tina Marie (profitdriversinc.com)\nOkay, well, that. I see. It's the premise that the most important thing is that you go visit a person or go do this thing.\n00:03:05 - mark sweet\nLike, don't know how much longer she's got.\n00:03:08 - Tina Marie (profitdriversinc.com)\nYou're grounded.\n00:03:09 - mark sweet\nOkay, that's a whole different thing.\n00:03:11 - Tina Marie (profitdriversinc.com)\nYeah, I'm just saying, but okay, for example, how many activities, how many travels traveling? Traveling activities you have in the next three weeks.\n00:03:23 - mark sweet\nOne this week. One, two, next week. One more the week after first. That's four. Yeah, that's Okay, all right, how long are those trips? One night, I'll just cram everything I can. So I'll leave it like six in morning and come back at like 10 or 11 at night.\n00:04:06 - Tina Marie (profitdriversinc.com)\nWhat are the three for next week? Hello?\n00:04:15 - mark sweet\nHold on.\n00:04:16 - Tina Marie (profitdriversinc.com)\nOh, OK.\n00:04:20 - mark sweet\nThe three next week are so on 24th of Missouri, so it takes like the whole day to get there. Just unfortunately, time change, that was 6.45 AM played, Atlanta 3.15, mixer starts at like four something, so go and do that. Then that Thursday, we have an event in Newport Beach. So I don't come back until Wednesday, or potentially Thursday if I search things out. And then Friday, there is a personal injury mixer in Phoenix. So I'm going to take Hank with me to God. It's a lot of the doctors we work with and some of our lawyers and stuff.\n00:05:05 - Tina Marie (profitdriversinc.com)\nSo is there a week where there's a break with no traveling?\n00:05:10 - mark sweet\nThat was last week.\n00:05:12 - Tina Marie (profitdriversinc.com)\nOkay. And when's the next one?\n00:05:15 - mark sweet\nIn a while.\n00:05:18 - Tina Marie (profitdriversinc.com)\nBe more vague, please.\n00:05:30 - mark sweet\nI think the week of Halloween.\n00:05:35 - Tina Marie (profitdriversinc.com)\nAll right.\n00:05:36 - mark sweet\nAnd Halloween is not too bad.\n00:05:39 - Tina Marie (profitdriversinc.com)\nOkay. So this mixer in Missouri is for getting doctors.\n00:05:45 - mark sweet\nYeah. So the 26 different doctors who work with up there are going to be together. This is also a good chance now that we've had some cases going, like 30 plus cases going and we haven't seen anything come the other way. So you go and kind of talk to some of these doctors. Doctors are like, hey, what's going on with this case or that case, or what have you? And also to just kind of reinforce that we would like to see some love the other way.\n00:06:15 - Tina Marie (profitdriversinc.com)\nOkay, so the other way you're saying you send them stuff, they're not sending you anything?\n00:06:21 - mark sweet\nCorrect. We have not received a single doctor or phone as areas again.\n00:06:25 - Tina Marie (profitdriversinc.com)\nOkay.\n00:06:26 - mark sweet\nRelatively new, they haven't seen them gone paid out on anything yet. They're not like working out, but part of the whole reason to do this was these doctors have a lot of unwrapped cases and I haven't seen them.\n00:06:42 - Tina Marie (profitdriversinc.com)\nOkay, that's good. I mean, that you have a plan and you're working on it and we'll see how that goes. So I see me have, I don't assume, but anyway, do you have to try to figure out how to ask this? Do you have a specific plan or strategy when you show up other than just, you know, talking with them, obviously you're good at what you do. People love you. send you business like you have that's working. But what I'm wondering is, um, how much of that is off the cuff and how much of that is, I know that this particular tactic works well.\n00:07:21 - mark sweet\nIt really depends on what the setting is. I don't have like a cookie cutter method, right? Because like this mixer in Arizona is like 300 people, lawyers and doctors and the whole ecosystem that goes on the legal field. So that one more, my goal is to try to meet additional people that I haven't met before, right? another journey as we can work for cases too. And like just again, be part of the community more than anything else. That's my goal on that type of event. The Missouri one, it's more direct of. I'm going to make sure that I seek out the doctors that we've already sent cases to and make a point of. making sure that I spend time with each of those to again kind of reiterate, hey, we're here, we're doing these things to talk about these cases and you know further push remind them because there are going to be other attorneys there but for that one that's going to be the specific focus and of course meeting some of the other doctors as well but that's going to be the primary focus one there for that one. The Christian event we're going to there literally picked one of the cases that Sam had worked on that we got like 900 grand on so we're going to be kind of a center of attention on that one to some level that I'm just more just going in and it's just it is what it is I don't have a lot of expectation on that thing it's more just supporting a friend.\n00:08:42 - Tina Marie (profitdriversinc.com)\nYeah okay well it sounds like there's plan and strategy and necessity and these are the things I think that you enjoy doing most and they definitely um well we still really haven't gotten a really great doctor. report yet, but I would say that the efforts that you put in meeting and looking to acquire new doctor referrals does work when we look at this.\n00:09:12 - mark sweet\nIt's definitely going up. I've been having America really follow up on the paid info and setting up lunches and everything else is also helping me spur some of this. On top of that, the HANA Center is back to having more events, so we're definitely sending more doctors to events and that has a direct impact as well.\n00:09:38 - Tina Marie (profitdriversinc.com)\nI'm working on, I know I've been talking about it, but it's kind of a big undertaking. I don't even know what to call it, but it's basically a progress tracker from the beginning, where I've got links to all the different spreadsheets that we have all under one roof, because I think America's got those things that she's working on. I've got one more. a track of the attorneys and their teams and all of these different things, but that's what I want to do is look at how just everything that we've got for tracking the things that you do because we talk about so many different things and in one way it's okay because you can only work on so much at one time but just being a little bit more clear when when new things come up like if you're suddenly spending a lot of time traveling just making sure that it's within the realm of evidence that that works and by working very specifically defined as increasing revenue through for like doctors referrals more doctors or existing doctors sending more referrals otherwise it's just a waste of money and And also, trying to figure out, are there different types of events that get you better results? smaller ones do better? Do bigger ones do better? That type of thing. If you go just because, well, two reasons, because it's business, but also because it's fun and you enjoy that part of it, then it's less necessary to really look at that at such a deep level.\n00:11:27 - mark sweet\nBut if it comes down, the building relationships with the doctors does pay dividends when we need things from them.\n00:11:35 - Tina Marie (profitdriversinc.com)\nYeah, I mean, I've watched the numbers go up. It's slow, but it does go up. And regardless of whether it's slow or not, so has been getting new cases, but it's been slow and steady. And the we know that the most basically around the business is lead sources. So all of that has to be massaged. And what what I'm talking curious about though is I think I would think that the money that you spend and traveling and doing stuff with ultimately is cheaper per retainer but we've never really done the map on how much money you spend on doctors be it traveling or gifts or whatever things that you might do and comparing that to total amount of doctor cases referred and seeing if what the average cost per retainer is for the source of all doctors and we should do you have any way that you do um it would probably be tedious sort of and one of the things where we do keep like marketing in general um that we keep it and obviously we've got travel and entertainment but\n00:13:00 - mark sweet\nTravel and entertainment is a large box for lack of their term, because that also, you know, stuff that we're doing for staff and things that are internal. You know, each month we spend about 1200 to 2000 on lunches for the different doctors and travel various depending on the month. The travel is not insanely expensive. mean, it's usually one or two tickets in a hotel for a night. So you're talking about probably another two grand reached trip on a higher end.\n00:13:38 - Tina Marie (profitdriversinc.com)\nOkay.\n00:13:40 - mark sweet\nSo even if you fact journaled say five grand a on those things, our cost proposition is still there.\n00:13:47 - Tina Marie (profitdriversinc.com)\nRight. Yeah. Do you think that that's all it is? how many trips do you take each month?\n00:13:57 - mark sweet\nOn average, probably one to two. Okay, so even if it wasn't enough about five Four to six doctors for each like day of trip more than that and it becomes really difficult to see everyone and spend the time You're supposed to without like watching here watch which It's little rude right So as long as we can get four to six doctors is worth it if it's only one doctor unless it's someone amazing reason It's generally not worth going for and are you tracking how many doctors you get from each trip? How many doctors I visit Yeah, well you said how many we get so I'm trying to figure out. Oh, how many like doctors we can see?\n00:14:41 - Tina Marie (profitdriversinc.com)\nYeah, so how many doctors can you see on each trip on average?\n00:14:46 - mark sweet\nSo four to six is where I limited I could be directly see more but like the Sacramento trip that I had we tried to put six people lost like an attorney lunch in the middle and I was like running like everything and it's just a little bit rude.\n00:15:03 - Tina Marie (profitdriversinc.com)\nWell no and I mean obviously the way that you communicate with people and handle it is effective in the from what I can tell about people that I've interacted with you that interact with you you know you matter to them so something you know that's that's something anyway the dirty math suggests that it's cost effective that's all I cared about but yeah really even done anything roughly for that for a long time so I just wanted to see because all that trouble just kind of put that on the radar again um that's good okay so 52 incidents already we're on that today's like the 15th right 16th that's not bad two retainers out monkey let's look at this monkey valiant walker okay walker coming back and monkey kind of dipping yeah\n00:16:00 - mark sweet\nI want to give it to a little bit.\n00:16:02 - Tina Marie (profitdriversinc.com)\nLet's do this more a little bit.\n00:16:04 - mark sweet\nYeah, but if we get the two out, sign back in, that'll be at what, seven?\n00:16:09 - Tina Marie (profitdriversinc.com)\nYeah, for half the month though.\n00:16:11 - mark sweet\nYeah, so it's a little bit lower than I would like it to be.\n00:16:15 - Tina Marie (profitdriversinc.com)\nYeah, because last month they were 25 for the whole month. Right. So we're. Yeah, I mean, that would be on pace for. A few several.\n00:16:28 - mark sweet\nLike 14 ish. So yeah, it would be lower, but. My expectation is monkey is always kind of hovering around the 20.\n00:16:37 - Tina Marie (profitdriversinc.com)\nOkay. Walker. Good. Valiance. Awesome. I mean, that is just really blue still remind me who that is. That's quantified. Okay. I'm going to keep asking. It's just an all. The code names. All right. right. Alright, what, Felipe? Oh, that's not like new Felipe though, right? That's okay. Alright, um, before I get into any other questions, Dan, you have some updates for us?\n00:17:18 - Dan’s iPhone (danddcompany.com)\nI'm not heard from Josh, but he usually communicates with Stacings. we finish the first faces out of town, by the way. Uh, the first SEO page is written. Those guys are building it. We built the other like internal linking, I'll call it practice areas template. so Abishik and Vijay will now go build. I think there were like 16 practice areas. they'll build the 16 practice areas and then we're going to update the home page to include the practices on the home page and becomes part of the new internal linking strategy. Then those guys will probably just start cranking out the other the content pieces which are actually not the update has to wait for the 16 content pieces because those are the practice areas. The other template is basically it's a blog categories template so the writers don't actually use categories so they're sticking everything in just well let's put this way there's a couple categories but they really don't use them so if there's an accident it's like hit and run there's no hit and run yeah there's an accident that's whatever right so what Gert wants to do is I'm not exactly sure how we're doing this but it will be programmatically we will go back categorize all of the accident posts and apply at least probably one category and I would imagine it would be at least one, probably no more than one because I like it kind of too linky. So let's just say it's one. Apply one category to every post and then those category pages. So you'll have a link from the home page that's going to go to categories parent page and then that's going to link to each individual category. So basically you're then making every accident post two clicks from two click depth from the home page which is I guess the ideal depth or three clicks from that home page which is the target depth that he wants. Actually not that's wrong. It's two because when you go to the category page it's going to load the most recent 12 or 15. posts, which most of them will be already out of date by that point, but it makes it two clicks on that page. And then that structure is like what he thinks will start can give an edge on getting accident posts to rank fast and higher than other people. It seems like other people aren't really trying to SEO their posts, those posts. It's more like the strength of their structure probably, but he thinks that this structure is going to be the one to beat them. I do too. Well, he's killing it for us. Like, we're on the front page, we're on the front page for a bunch of other stuff today, and then we expand it to like. 50 other he helped me see another whole path that I was not ignoring, but I just haven't thought about so we quickly expanded from like them doing 50 to 60 pages to like a hundred and we're doing like a hundred and six or a hundred and ten now um and I'm just seeing leads like steadily increase over time Oh, and then I Somehow I don't have access to my AdWords accounts anymore and AdWords Yeah, I actually well, you know, they so they did like a verification thing And it's an account. don't use So I'm in the process of getting two accounts re-verified and into my manager But so I went to run ads. It's like you can't I was like, well Yeah, so It's kind of funny. was looking at someone, I was looking at accounts that I have access to, still, that people never took me off of, and their ads turned off two and a half months ago. pretty sure they have no idea. I guess those ads really weren't working, so it's a boon for you. But yeah, so I don't have access to like three accounts. So waiting for them to, so I submitted some stuff and they're waiting for them to improve it.\n00:22:31 - Tina Marie (profitdriversinc.com)\nOkay.\n00:22:32 - Dan’s iPhone (danddcompany.com)\nYeah, good times.\n00:22:36 - Tina Marie (profitdriversinc.com)\nThat pivot table you were talking about having Stacy work on with the turn down reasons. Any movement on that? No, she's out of time. No, like there was last week.\n00:22:52 - Dan’s iPhone (danddcompany.com)\nNo, she left the Thursday, I think. I think it was, it was not planned. She just randomly announced. I'm going to New Orleans. I'm like, oh, okay.\n00:23:04 - mark sweet\nYou know, everything okay, though?\n00:23:06 - Dan’s iPhone (danddcompany.com)\nOh, yeah, yeah, no, no, it was I'm going to order New Orleans for fun. And I swear to you, I swear to you, she said she's coming back on Sunday. And then last night she texts me about how she's not going to be on meetings today.\n00:23:19 - Tina Marie (profitdriversinc.com)\nAnd I'm like, I don't know, Orleans is going that well.\n00:23:24 - Dan’s iPhone (danddcompany.com)\nSo maybe sure you said you were going to be back by Monday or Sunday, but she's still there.\n00:23:29 - Tina Marie (profitdriversinc.com)\nAll right.\n00:23:30 - Dan’s iPhone (danddcompany.com)\nShe may never come back.\n00:23:32 - Tina Marie (profitdriversinc.com)\nWho knows?\n00:23:34 - Dan’s iPhone (danddcompany.com)\nIt's sucked in by the cage and cage and this of an old.\n00:23:38 - Tina Marie (profitdriversinc.com)\nYeah, well, it's hurricane season.\n00:23:40 - Dan’s iPhone (danddcompany.com)\nSo we'll see how long that last. That was what was funny. He left and it just hit. So it like, oh, like Patricia or Francis or whatever, just this rolled through there.\n00:23:52 - Tina Marie (profitdriversinc.com)\nOkay. Mark, did you try any of the demand writers that I demand writers?\n00:24:00 - mark sweet\nYeah, all should.\n00:24:01 - Tina Marie (profitdriversinc.com)\nOh, sure. What did you try?\n00:24:05 - mark sweet\nprefer from the same issue. Well, similar issues, I guess you should say not exactly the same, which is you have to sit there and upload every single document. And so by the time you get through like going there and naming it and putting it in whatever order needs to be in. It doesn't shirkness saving ton of time. The stuff that goes around the medical records, it's all just template. Like that's not the special part. So really it seems like all these AI demand writers do is the same thing, which is summarizing the medical records. Actually, that's about it and putting chronology and pulling out the bills.\n00:24:45 - Tina Marie (profitdriversinc.com)\nhave to build them out. Which you could do with chat DPTL by itself.\n00:24:49 - mark sweet\ncopy paste. I believe so. Alexis is already doing it. They all do it in slightly different forms and fashions and they also their thing is special and unique, but looking. And all three of these, like, I didn't see, I wasn't impressed. of them I was like, oh, this is really cool. Are you guys really spending a lot of time with this?\n00:25:09 - Tina Marie (profitdriversinc.com)\nYeah.\n00:25:13 - mark sweet\nOK, so if it was built into our system, and might be better than one, built into a file line. don't know how well it works, but I don't that would be cool. There's none that are built in automatically to let it apply. And even then, I don't know how well it works.\n00:25:40 - Tina Marie (profitdriversinc.com)\nYeah, I mean, six months to a year from now, it could be a completely different thing between both the APIs and just better processing.\n00:25:52 - Dan’s iPhone (danddcompany.com)\nBut are all the bugs PDFs in our system? Yes. Yeah.\n00:26:01 - Tina Marie (profitdriversinc.com)\nI mean, because could you not and I don't know if you could do it and it be have a compliant, but create a hook like zap or something that exported it did all the stuff basically automated and then spit it out and send it back. don't know. It's that document and it would be exported as a PDF so whatever you get, if it's sent to you from a doctor, I don't know the logistics of it and the pieces of it, but whatever information that you get in that you would have fed to the demand If that could be exported as a PDF. So let's say that the trigger event is a new case was created and a new medical record. it was appended. And then something like ZPRM8.com is checking as it does, chron jobs or whatever, every 10, 15 minutes or however the frequency can be set so it's different for loads. But it checks, oh, there's a new report. Okay, I'm going to create a command that says export that as a PDF, upload it to here, have this thing, summarize it, give all the information, sort it, name it, stuff that you don't actually have to do, then spit it back to you, complete it.\n00:27:39 - Dan’s iPhone (danddcompany.com)\nSo there is no, right, Littipa doesn't make such a doc, everything is individual docs, so they're, you'd have to like combine it into like whatever case file doc. But I don't even, I don't think Littipa can do that. So that's Mark's primer. issues that you have to download, upload. You want to like, type it from Lidify into the thing. And then it would do exactly what you're saying.\n00:28:11 - Tina Marie (profitdriversinc.com)\nThat's what I was saying. Like, is there a way that there could be something where that action, because like the action of file and export that has to manually be done, can that be done through a zap?\n00:28:30 - Dan’s iPhone (danddcompany.com)\nI just see what I don't know if that's this thing.\n00:28:36 - Tina Marie (profitdriversinc.com)\nI don't know what the or could it be like, just a simple in between API? That's like, somebody, you could hire somebody to code?\n00:28:47 - Dan’s iPhone (danddcompany.com)\nWell, the thing is, it's probably, I don't know that you can manipulate Lidify where you'd have to able to be like, send to the thing, or if you'd have to Build like a little like a little middleware that's like their language which I was at the name of, right? So you can build a Salesforce app like a light Salesforce app that would potentially do that. Yeah, it would be something like that. I mean the trick the PDF Summarizer is like baked into chat TV team already. Yeah, I've never used it. I don't know how well it worked. So that's really the thing. It's like to me would be figure out how to do a PDF summary thing and then upload just the medical stuff and figure out what's the prompt to get this to spit out. And no particular great fashion, but just to spit out timeline that's correct and can it can to do that just out the gate?\n00:30:06 - Tina Marie (profitdriversinc.com)\nWe talked about this session being a chat GPT like kind of AI session. We can take some sort of PDF PDF and do a summary like I don't know how it works. Does it just work? Yes, I've never done it. So I need something they know to work with if anybody has such a thing.\n00:30:31 - Dan’s iPhone (danddcompany.com)\nWell, we need something that has dates or like you need something that's very similar to one of these files or I don't know if you can mark just do it like do one of these files. Ultimately you want to test it on the thing. So that was my question like is this thing doing OCR or whatever and then I looked into it later and I'm like oh wait that DPT just does this. I mean I'm sure it had something to do with their DARPA engineer and\n00:31:00 - mark sweet\nthat and the built-in stuff that's already there to be used yeah yeah totally do you have something we could use mark yeah i mean we've got lots of medical records sure use my code dig up my files don't give me a pdf somewhere you have my HIPAA approval okay yeah we can definitely do that okay um there was one more that i got a call to actually today at 3 30 called even up they're the most expensive one yeah they that was the one that um when you were on with it they were complaining about how it's charged like if credits depending on how big a file is yeah but they are the only one that million dollars on a series b dude i would have started right there what what what well no because the dudes on the phone said they charge them seven grand to do one and i was like yeah that's not great they're the most expensive they're also the ones most out there um so i want to start with some of the smaller ones to figure out what i can figure out first so okay are you working on emailing me a pdf or something oh right now yeah yeah right now oh okay let's do this i'm just going to give you one to all those records then you'll have um let's see uh\n00:33:00 - Dan’s iPhone (danddcompany.com)\nDid you get the email from Google to do whatever you should have me know today? It's like invent something or other. They want you to read, reconfirm your identity or some crap or LSA's.\n00:33:20 - mark sweet\nThat's something last week, I'm forwarding to you.\n00:33:24 - Dan’s iPhone (danddcompany.com)\nRight, so today they're working on the thing with Isaac, so Isaac is getting stuff to fix the jury. then Aronza said that Google is requesting an identity check today, and then I sent her your email address and she said you should get an email today about that.\n00:34:02 - mark sweet\nThis is going to be coming from Google with your own data.\n00:34:18 - Dan’s iPhone (danddcompany.com)\nI'm going to say action required to complete your identity verification with Google. It's from evident. I don't know what that means.\n00:34:41 - mark sweet\nI'm just going to say action required. The best go count. Someone wants to buy nurses, barbie car.\n00:34:57 - Dan’s iPhone (danddcompany.com)\nI will tell them that they're not gone.\n00:35:04 - mark sweet\nNo, else starts with the action. mean, would you say LSA or something?\n00:35:10 - Dan’s iPhone (danddcompany.com)\nYeah. No, it says Google Local Service Ads. It's like spelled out.\n00:35:36 - Tina Marie (profitdriversinc.com)\nSo much for getting me a.\n00:35:40 - mark sweet\nAs has updated his verification requirements, but I was back in 2022.\n00:35:46 - Dan’s iPhone (danddcompany.com)\nI just got an email from.\n00:35:51 - Tina Marie (profitdriversinc.com)\nWhat?\n00:35:53 - Dan’s iPhone (danddcompany.com)\nWhat? I just got an email from market.\n00:35:56 - mark sweet\nOkay, cool. No, not seeing anything that has Google Local Services. and you go to my emails.\n00:36:02 - Dan’s iPhone (danddcompany.com)\nAll right, well, I'm to tell them that I know if can say they sent it over again. I love when she doesn't show up. Sent you an email.\n00:36:16 - mark sweet\nThere was an email, so one night September 9, local server-side verification steps have been updated for your industry. But nothing meant for your work.\n00:36:27 - Dan’s iPhone (danddcompany.com)\nYeah, no, this is definitely sent today.\n00:36:30 - mark sweet\nThat was the one I sent to you.\n00:36:32 - Dan’s iPhone (danddcompany.com)\nYeah, yeah, no, that's it. It's all I got.\n00:36:38 - Tina Marie (profitdriversinc.com)\nIs there, oops, is there any particular file I should be downloading or set of files?\n00:36:45 - mark sweet\nAll of it.\n00:36:47 - Tina Marie (profitdriversinc.com)\nAll of it. You want it all summarized?\n00:36:50 - mark sweet\nWell, no, sorry, that's how it's going to kind of look in our system. And so one of the hiccup-y things is doctors sometimes send us bills and peace mail.\n00:37:02 - Tina Marie (profitdriversinc.com)\nOkay, like broken apart.\n00:37:04 - mark sweet\nYeah, we're like, hey, this is each time that they came to visit the simplest one, probably the chiropractor. That'll be easiest to bring together. So that's just one hill. So that would be next to last.\n00:37:35 - Tina Marie (profitdriversinc.com)\nAnd then it gets you on my way. Attached on computer, downloads, and deal with the actual file. What was it called? Oh, no. What was it called? Oh, go here. No, I don't want that. That's not the way to do it. Oh, my gosh. It's in my downloads. Okay. There is. There it is. Okay. what do you want? What kind of information do you want to extract out of it? That informs the prompt.\n00:38:42 - mark sweet\nSo a few things. One, a total number of dates of service. Number two, the summarization of medical records. is number three, the average costs per visit.\n00:39:22 - Tina Marie (profitdriversinc.com)\nAnything else?\n00:39:23 - mark sweet\nThat was mostly the end.\n00:39:40 - Tina Marie (profitdriversinc.com)\nThat's a tongue.\n00:39:56 - Dan’s iPhone (danddcompany.com)\nOh, par so good. What the hell do you He's got to build exactly nothing.\n00:40:04 - mark sweet\nIt just ends up in putting it in with all the other doctors as well, and yeah.\n00:40:11 - Dan’s iPhone (danddcompany.com)\nBut that's why they have to upload it separately, because each file is considered like the little mini database.\n00:40:27 - mark sweet\nIt's not exactly perfect, it didn't give you an added cost to visit it.\n00:40:36 - Dan’s iPhone (danddcompany.com)\nBut this is my last line of leverage.\n00:40:46 - Tina Marie (profitdriversinc.com)\nThat's the word. Now, I will tell you, these calculations, like I would have to go through and look at it manually and make sure that it's correct because chat GPT has been doing some stupid stuff lately and anything working on OpenAI might be having the same kind of things.\n00:41:37 - Dan’s iPhone (danddcompany.com)\nIs that thing linked to something?\n00:41:39 - Tina Marie (profitdriversinc.com)\nWhat is the footnote that you're doing? It's the analysis.\n00:41:43 - Dan’s iPhone (danddcompany.com)\nOh, it's the mouse.\n00:41:45 - Tina Marie (profitdriversinc.com)\nYeah, so one of them was $280, $280, else. Nope, almost $255, else is 130.\n00:41:54 - Dan’s iPhone (danddcompany.com)\nSo that's that those numbers are correct and would be correct. Totally.\n00:42:01 - Tina Marie (profitdriversinc.com)\nSo, and another way that you could do that is give me the dates of service with the costs for each of the dates of service, you can ask it to form at it in a way that you could put it and export it into a spreadsheet. There's all kinds of different ways that you can break this down. You can ask for the most expensive visit, the least expensive visit. So, initial visit was the only one that was $2.80, reevaluation was $2.55, everything else was $130, and it even says how long it was, and what it was. What else would you want to know?\n00:42:48 - mark sweet\nSo, I just want all the dates of service, I just want to know the total number of visits they had. Okay. They started this date, they stopped this date, they had this many sessions.\n00:44:00 - Tina Marie (profitdriversinc.com)\nIt didn't add the whole rest of the summary, which I wanted it to do, but that's okay. But we could create it. So we could start it the exercise again. We could get a different document. what I wanted to show you was some different ways that you could use chat TPT. Let's say you have a really long file, your team could use it, or AI, or just to kind of feed the idea of how you could create something else of your own if you wanted to, so that you can see the logic for it. The problem is simple. You basically tell it what you would tell a person. Occasionally, it will give you some convoluted response where you have to break it down and specify. And it feels like the last couple months, it's been getting worse. don't understand what's happening with it.\n00:45:00 - mark sweet\nOkay, we'll just have to mean one.\n00:45:02 - Tina Marie (profitdriversinc.com)\nHuh?\n00:45:04 - mark sweet\nChechi, we see just launched its new AOI something like that.\n00:45:09 - Tina Marie (profitdriversinc.com)\nOh, well, might explain it. Make everything else not as good so that you go by the new one. I'll go look into that because I didn't know that. Um, anyway, either one of you, because you were talking about either a demand writer or um, some of this doctor visit stuff. What else would it be a good, um, kind of like practice thing to look at and see, could it do this? we do that?\n00:45:46 - Dan’s iPhone (danddcompany.com)\nWell, I'm looking to see if you can create a PDF, right? So theirs was creating, what did they create? They created like a word doc is what theirs put out at the end.\n00:45:59 - Tina Marie (profitdriversinc.com)\nYeah.\n00:46:00 - Dan’s iPhone (danddcompany.com)\nExactly. correct? Is that what you would want? Or is it PDF better?\n00:46:06 - mark sweet\nPDF is theoretically better, but it's not, it's not a big enough difference to care if that makes sense.\n00:46:14 - Dan’s iPhone (danddcompany.com)\nYeah, I'm just saying like, is that a PDF is downloadable? And so I was looking, there is a service try to be treated PDF. So it goes back to, so I guess the question I would have is, is it in fact faster, right? So can you get someone's plural to time themselves doing the the thing, the way that it's done right now? Like, okay, write a demand, whatever, you tests is, how long does it take them to do that? then you go, okay, that's this times hourly rate. And then you go, okay, now go do do it with the dudes that we met with. Because there's at least spit out the right document, right? The linking thing was cool. And then have someone go do that. And then you just go, how long did it take? Rate. That takes that. are already rate. Then cost of producing the demand itself. And then you go, OK, is it comparable? Is it less? And at the end, do you have a good, better, equal to? Demand as a result. And then my big question for those guys, and I couldn't really understand what they were saying, is how much of the demand are you supplying? It sounded to me like you supply a lot of it. So it's like, am I really just supplying you with all the in-between content, and then you fill in the summarization portions? OK, What does that look like? Do I have to submit to paragraphs that are reusable?\n00:47:55 - mark sweet\ndon't know. No, so the initial templates are all, sorry, the initial demands are pretty much all two. templates.\n00:48:01 - Dan’s iPhone (danddcompany.com)\nBut were they saying they gave you one or that you had to help them build it? I thought they said you had to help them.\n00:48:08 - mark sweet\nOkay. So you can either use theirs or if you want to use your own, you can use your own. So they were you have to use ours or you have to build your own. We've got what we think is a great template, but if you think yours is better for XYZ reason, you can use yours, you can combine it too. So whenever you join, we spend time figuring out how to combine or make it.\n00:48:30 - Dan’s iPhone (danddcompany.com)\nSo you do that, you use theirs, and then you use it on one of the cases that Salco's involved with, and you hand it to him, you go, dude, this is the best demand I've ever seen. And then watch him lose his mind. And then get such valuable feedback from him. Maybe with a loud voice, but then you go, oh, those are all good points, Salco. And then give that to you.\n00:48:54 - mark sweet\nSo to put it in perspective, Salco's demands are these sea attached for medical work. That's it.\n00:49:01 - Dan’s iPhone (danddcompany.com)\nThat's hilarious.\n00:49:03 - Tina Marie (profitdriversinc.com)\nSo what?\n00:49:05 - mark sweet\nSo, his initial demands are. Please see attached medical records. So his is not like technically correct or the best way. You will use that, you know, templates don't really matter. And I don't necessarily disagree per se. There's only two areas that you really kind of mess around with, which is. Call causation, so liability, who's at fault. Generally speaking, it's fairly straightforward in most of our cases. And then we're spending the most amount of time is on the medical side.\n00:49:42 - Dan’s iPhone (danddcompany.com)\nRight. So, I mean, I would, I would figure out, like, is it faster? Is it cheaper faster, cheaper? And then it would be. Can you? I mean, if, you know, if could you start a test and go, okay, I want you to use. demand A, demand B, demand A is the one that you've developed with these, or you could have A, B, C. Demand A is theirs, demand B is yours, demand C is sell goes. And then just make a note of that and be like, okay, it doesn't really make that big a difference. Like, as an thing, does it make a difference at all? And if you're like, you know what, A, B and C gets the same results, C can be produced the fastest, we should just start using C all the time, because there's no point in A and B. And then you're at this point where you're like, okay, do I really need this? But then it just comes down to then you're, if it were C, then it would be, oh, we're saving a bunch of time. Because now this thing just we're just using it to do all the medical records. And then it would also put you on the path of, all right, this is what needs to be built. We need to just do a thing that does this. And you're, you basically scope your version by using someone else's software and hopefully save yourself time in the process. Maybe your demand people, whoever does that like you better. So they're like, oh, this is easier.\n00:51:15 - Tina Marie (profitdriversinc.com)\nI mean, when I give it to boss. Huh?\n00:51:23 - mark sweet\nThe demand itself is not overly special. I'm going to tell you there's no one's demand is perfect. one's demand is great. It all comes down to the medical workers you're presenting and then if there's an argument over fault, do you have somebody to overcome it? All the other stuff is just like terms and conditions.\n00:51:44 - Tina Marie (profitdriversinc.com)\nWhat you said right there is part of what you can put into the prompt, by the way.\n00:51:52 - mark sweet\nSo it wouldn't go into the prompt per se because really all that's going to happen is you have. It's called like the phones or the container for like a better term, right? The containers, the containers, the container, that part doesn't generally change. What goes into the container changes. And I'm talking more like a physical container, not like a coding container. So the stuff that's inside the container changes, and that's what we need the AI for, but the container itself, all you have is the AI just put it into the container.\n00:52:25 - Tina Marie (profitdriversinc.com)\nOh, okay. Not process it at all. Because what I'm saying is, and I don't know if you know or have considered this, and maybe you're not interested in it, but it could scan an entire report, look at what happened, and use conditional logic to say and make a suggestion to your person who should then approve it or agree with it, disagree, whatever, fault along with a persuasive reason to explain why. this was the fault, who was that fault, whatever.\n00:53:02 - mark sweet\nThere's definitely some that we can look into, and I don't want to just agree with it. Generally speaking, 85 percent plus of our cases, there's no argument on my vote.\n00:53:13 - Tina Marie (profitdriversinc.com)\nOkay. So it's not a need, really?\n00:53:15 - mark sweet\nIt's not a front-end center issue, but it's not a non-adlucent issue. Right. The only other thing to point to from what if I would be the names of the insurance company and the adjuster and everything else, so they don't have to be typed?\n00:53:29 - Tina Marie (profitdriversinc.com)\nSo one thing to consider that 15 percent, let's say that 15 percent, and Lorenz has some of it, and he goes slowly, where you have to use more mental effort in that type of conditional logic, along with persuading. I don't know how quick he is at that, but if he gets four, five cases a month that needs that kind of effort, if it took him half a day, and you could turn that into half an hour.\n00:54:00 - Dan’s iPhone (danddcompany.com)\nthat adds up over time sure who's doing it right so the bulk of the work is the summarization of medical correct yep who does that he is turning yeah there that's like yeah that just sounds like homework to me so of course it takes them hours in behind it hold on no no I'm saying I get I get why they do it I'm just saying it's reminiscent of I had this conversation with my daughter last night she's trying to tell me that she has ADD I'm like that would have shown up a while ago yes you don't have that but what does she have ADD related to math homework I'm like that's not how it works I'll bet the attorneys have ADD when it comes to this they must hate this go oh god I have to go pull all this data together so you should percure work\n00:55:00 - mark sweet\nYes, but, and this is the large caveat and this is where training is incredibly difficult with the system. It's not just summarization of what's in there, it's pulling, especially when you talk about the hospital records, bad stuff out. Yeah, I can paint the rosiest of the rosiest picture, and it's not wrong. I can't do that in litigation. I got to give them everything. So, rejecting mess abuse, I'm redacting that they just got another collision. I'm redacting all these things. That's where the attorney providing their value.\n00:55:35 - Tina Marie (profitdriversinc.com)\nI still think that you could do a basically blank space saver. Okay, so the attorney still have to do the job, but you can train it to give it specific scenarios and say, okay, in this scenario, this is what needs to happen, and this is the conditional logic as to why. The other thing you have to get around is it has its own kind of rules and ethics built into it. So you have to give it a reason why it needs to perform a certain way, right, for the protection of the patient. We cannot include this much information or we can't, whatever, that type of thing. But it can be trained. And then like if you had a custom GPT, that logic would be stored in memory. So it may get things wrong, but it would still probably be, you know, 70% faster than your attorney's doing it without assistance.\n00:56:38 - mark sweet\nYes. As long as I'm... it needed? Yeah, exactly.\n00:56:45 - Dan’s iPhone (danddcompany.com)\nYeah. When... When you were that, would it be that like, like, we just saw my summary. Let's say in my summary, I got in a car accident. and while I was going to him, and then I started going in more, you would want to pull that out, right? You'd be like, yeah. So, yeah, you'd have to, you'd almost have to teach it to know what that would look like. Yeah, it would take time. It's not just going to get it right, but you could, you could teach it that, and you could try to teach the things that seem that they're not related to the accident, and then you'd have the output be output the whole thing. So, what they're going to get is a summary of what happened and go, yeah, that looks good. Or, yeah, you're right. That stuff is bad. don't want that. Now kick it all back to me for the demand or whatever.\n00:57:46 - Tina Marie (profitdriversinc.com)\nAnd then manually go do whatever you have to do and think of it as an assistant, not the thing that does the job. Think of it as a time saver, but not something that just does the job.\n00:57:56 - mark sweet\nAnd as we talked about, it's going to take you 300 plus.\n00:58:00 - Tina Marie (profitdriversinc.com)\nYeah, learn these things and I don't think it will take that much No, and I let me let me say this way.\n00:58:09 - Dan’s iPhone (danddcompany.com)\nI don't think it will take that much to be useful and to say time Yeah Did the what she's names is did the brothers do the production it didn't they were they're lit Yeah, they just hear about litigation.\n00:58:22 - mark sweet\nYeah, they just throw the whole thing in there Yeah, and one of the dumbest by tech centers floor as I know uses them.\n00:58:30 - Dan’s iPhone (danddcompany.com)\nSo it must be great.\n00:58:31 - Tina Marie (profitdriversinc.com)\nYeah Well, if you wanted to give me anybody on your team to teach them how to use chat TVT and do this or Use my time that you are already investing in I'm down to help because I think it will make a big difference and we only have so many leverage points in the business where we can get more out of What you have existing? This would be one of them. I don't know how big but enough to I mean it should be thousands of dollars worth of your money at least by that\n00:59:00 - Dan’s iPhone (danddcompany.com)\nand that the year is not monthly. Well, as a matter of fact, now that I think about it, we were testing the new AI bot. So before we had a just, it was like a decision, it was like a manual decision tree bot. Basically, we were writing everything and saying, OK, if they do this, then do that, right? was an AI at all. It was automated, but not AI or TPT, whatever. So then we put the chat TPT one in, where we wrote the prompt, and yaddiana, and we push that at only overnight people. then Eric did an analysis of it. And the non-chat TPT version, I think it was across 300 contacts, had gotten one retainer. One lead that turned into a book called the Turn the Retainer. So the AI's job is to book a call. the non AI version got one, the AI version got four. And I was like, oh , how do we get that? We need to test that during the day now. So we're trying to figure out how to like, I think we're gonna do monkey. We're gonna pull some monkey stuff because we have the most data on them. But there's the advantage of AI, right? So that didn't save time, that created revenue. But now you're over here saving time which could create revenue. And it's like, if you, it would be interesting to know how big of a bottleneck this is for the attorneys. It sounds like it's part of their biggest bottleneck, but I don't know.\n01:00:41 - mark sweet\nOh, no, it definitely is, it takes a lot of their time. Yeah, no, there's zero doubt in that regard. Okay. That takes a good amount of time to do. No, yeah, of course they do it faster as they get more and more used to it.\n01:01:00 - Dan’s iPhone (danddcompany.com)\nBut... Right, and if you were piping this into your own dedicated thing, then it can learn, and you can, like, regift, geez, wonder if, oh, I wonder if we can use that same company, so we bought it for Ninja for our CBA stuff, and we're about to roll it out, and we fed it all the questions and answers from our MCQ software, all our book, our videos, everything per section, right, so there's six sections to the exam, so we fed it one section, and then we get questions from people who we have an instructor, so they will go right into him, and then he'll email him back, so we started taking those and running them into the the AI and the responses they give are just as good as him, if not better. And then, but they also can reference, hey, you can go find this on this page of the book. Hey, if you go watch this video at this time, So we're rolling that out all this week to people, but I never thought about using it here. I'll hit them up because you feed it all the data. So what we just paid for the upgrade and the upgrade is the for a hundred bucks. Great, crazy. The upgrade is that you can attach example files to it and say, hey, here are all the MCQ questions and answers. And then if you change one question or answer, you just change the doc that it has the new data. So it's sort of like we talked about like two weeks ago, which I didn't really. It's like they don't people aren't hooking these things up to databases. They're hooking them up to these. attic files that are treated as a data repository. So you could, I don't see why you couldn't just have a here, here are a bunch of hit and run demands in one gigantic hit and run demands file. And you decide which demands are the right ones. And then you're when it's going to do these summaries or whatever, it could, it would reference your data and go, okay, got it. I'll use that I just don't know if this thing can output. It probably can't, I don't know if it could output a PDF, but it would probably make it things a lot smarter because you get to, you're not dealing with chat GPT, you're dealing with you're using an LLM on your data sets. Yeah, do have the owners email address. I'll find out. Oh , I'm leaving, that's needing.\n01:04:02 - Tina Marie (profitdriversinc.com)\nOh, holy crap, what did that happen? Wait, did you see this without a PDF?\n01:04:07 - Dan’s iPhone (danddcompany.com)\nI did not. Oh yeah, look at that. I see it. Wait, you just did that straight up from chat TPT?\n01:04:16 - Tina Marie (profitdriversinc.com)\nI went like this. Give me this and put it in a PDF.\n01:04:21 - Dan’s iPhone (danddcompany.com)\nAnd it gave me that right now, this one. Oh, all right. gotta go because I'm late for my six minute play. Yeah, me too. Okay.\n","contentPreview":"00:00:00 - Tina Marie (profitdriversinc.com)\nCan you hear me? I can't. How are you doing today?\n00:00:05 - mark sweet\nI'm trying to take time to make things at once, you know, you know, Yeah. to figur...","processedAt":"2025-05-04T03:40:52.632Z"}