{"fileName":"Done Transcript for D&D Co & Profit Drivers - Weekly Review(5).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for D&D Co & Profit Drivers - Weekly Review(5).txt","type":"transcript","priority":"medium","content":"00:00:03 - Tina Marie (profitdriversinc.com)\nI'm just looking at my bathroom no highlights and they are so weird because they're a I yeah but like one of them is NHH semi colon period KKKG you know you don't remember that for four minutes you didn't you did not get that done yet my bad my one that one was super important I was crazy it was so important I had to be in my top secret code okay I forgot my decoder mean right wonder twin powers cannot activate yeah and then the other lovely benefit is that I'm pretty sure I didn't save notes again because I don't have notes from last week and I'm on my laptop not my desktop so it's okay But, we've been on the same kind of thread for a while anyway, which is just talking about another 71, the things that you're doing because I want to poke and prod into that. You were, I think you had figured out the cost per acquisition was, I wrote down $17, but I feel like that was not the right number, that it was like 20.\n00:01:27 - Dan’s iPhone (danddcompany.com)\nI think I mean, no, it's, it's around there, I think I had an initial number and then I revised it. Okay. Because I found something more at times, I think it was initially 14 or something. But it's in that neighborhood.\n00:01:43 - Tina Marie (profitdriversinc.com)\nSo and we were talking about getting reliable data. And so, has there been any movement towards that?\n00:01:56 - Dan’s iPhone (danddcompany.com)\nNo, I did figure out. I did figure out that the GA4 is working. Those changes that I made are actually now populating variation data. In there, it just isn't part of the default reporting. You have to go create a report to see it. like, oh, and I don't know how to, this goes to the Mercer thing. I don't know how to get a widget to show up. I figured, I ran the report and it was there and I go, the data's here. Granted, I didn't really try to figure it out. just was like, oh, the data's here. It is registering. Check. don't need to go back to funnel kit. I just need to now go learn how to build either custom reports or see if they like. This should be so great when other people could build reports. That's.\n00:03:05 - Tina Marie (profitdriversinc.com)\nOkay, so you could go the Dan does it route or you could let me introduce you to win.\n00:03:15 - Dan’s iPhone (danddcompany.com)\nRight. Yeah, you can do that because now I know the day is in there. The problem before was I didn't think it was in there. It was in there.\n00:03:35 - Tina Marie (profitdriversinc.com)\nYeah, I met a bar, like thing in the kitchen here and the stool is really uncomfortable. It's just all I miss my desk. I miss my story. But I love the 113 degree weather. Is really though? Oh, yeah, it is and I really love it.\n00:03:56 - Dan’s iPhone (danddcompany.com)\nI go outside like every hour.\n00:03:58 - Tina Marie (profitdriversinc.com)\nWow. Yeah. I did not love it, but love it. I love it. I hate the cold. It makes me want to keep people. Okay, let's see. All right, so let me just, how do I want to do this? I need to set a reminder for myself to introduce you to win, so let me do that. I want to think about it more than just pop up an email right now because yeah, that will be good. I'm really interested to see just like if you could just have a conversation with him what that would yield. just, like I've said before and I want to, you know, waste time repeating it, but I do think. think that there's um you would just really enjoy him as a person and his brain but also what he knows and you would want to plug into that because like he's just really good at understanding all of it. I think he probably is smarter than Mercer.\n00:05:19 - Dan’s iPhone (danddcompany.com)\nNo sir.\n00:05:20 - Tina Marie (profitdriversinc.com)\nYeah okay so let me go back and look at this one oh okay so I'm framing the question hold on we still need the data basically I'm thinking about the the um well so now I can turn to like segmenters and go all right that's going to be my first step do I think do I trust what's in there and what what is it showing me\n00:06:00 - Dan’s iPhone (danddcompany.com)\nI don't know, but now I can go over it a bit. Well, yeah, and I also need to figure out like where, I don't know if it pulls sales data from Blue or it does from Blue for sure, but well, I guess I determined that when I make a report. So I would use Blue data. The other bit was, yeah, when I just need to figure out I need to be adding any additional info. OK.\n00:06:42 - Tina Marie (profitdriversinc.com)\nOK, it is not just my other computer.\n00:06:46 - Dan’s iPhone (danddcompany.com)\nYour guard. I live really just walked away from my phone. My phone don't. But you just disappeared like, come on. I just got to remember where I left it. Okay, we're back, we're back, we're yes, who's back, that good game. Yeah, so I just need to now go poke around and figure out. I did poke around and met her and saw my phone and stuff, and there was interesting, but nothing crazy. Okay, and we're waiting for, what's today's day, today's the 20th, so this whole, like this weird thing that's in the 20th, we have to wait, I was like, okay, and then the week after the 25th, we'll know if things are normal, oh no we won't. because that'll be Fourth of July and sales are gonna go down.\n00:08:04 - Tina Marie (profitdriversinc.com)\nOh yeah.\n00:08:04 - Dan’s iPhone (danddcompany.com)\nWe have to wait for a week after that and then we'll know. There's constantly like these weird interruptions, so that's gonna be in another one. We're like averaging 40 sales a Nice. Which was my target. And I started running more ads anyway.\n00:08:33 - Tina Marie (profitdriversinc.com)\nI remember when it was like 35 or 31 or something and then 35 now.\n00:08:40 - Dan’s iPhone (danddcompany.com)\nIt was like 51 at the beginning of the month. But now I think it sounds like between 39 and 40.\n00:08:47 - Tina Marie (profitdriversinc.com)\nNo, no, I mean the target.\n00:08:50 - Dan’s iPhone (danddcompany.com)\nOh, 31.\n00:08:52 - Tina Marie (profitdriversinc.com)\nYeah, it was 31. Yeah.\n00:08:55 - Dan’s iPhone (danddcompany.com)\nI've actually never reset it because then we fell off it. we're trying to get back to it.\n00:09:01 - Tina Marie (profitdriversinc.com)\nHave you done the math to figure out um how many daily subscriptions would get you to the 1% market share increase?\n00:09:11 - Dan’s iPhone (danddcompany.com)\ndon't remember doing that math. So here's the thing that I figured out and I kind of want to hit this guy up and be like well that was wrong. Just see what his reaction is. He's like the subscription guru expert. I ran his formula. His formula is incorrect. So his formula said hey you'll cap out and let's say it's 3600. We're 300 over that. Like dude that's a pretty big wrong. Like if it was you know 3625 or you know within 100 but if it's 300 off I'm like that's way too big enough and we keep going up.\n00:09:58 - Tina Marie (profitdriversinc.com)\nWait it's just getting more wrong.\n00:10:00 - Dan’s iPhone (danddcompany.com)\nI'm confused So forever I was looking for What I was calling like In weirdly, this is actually his language which I thought was really funny that The the proverbial glass ceiling like at some point The math is going to be that like no you're going to reach a Level of stasis, right? how do I figure that out? So for years, I never could find anything like I've found all kinds of other formulas around stasis and whatnot and Subscriptions and then there's this dude Robert Scrobe who I stumbled on to maybe two years ago and He has this formula. Hey, this is the the glass ceiling formula or the subscription ceiling point or whatever and And I had not forgotten about it, but I was just not using it because we were in the doldrums, but when I realized, you know, month ago, that, oh, wait a minute, I rediscovered it. And I threw it in a spreadsheet with some other , like data. And then I ran it. I was like, Oh, okay, well, we're averaging whatever 31 today, whatever the number was, right? So the formula is how many new subscriptions who were adding a day. And then you factor in your churn. So I actually used a churn that I would say is, this could be actually not a lot of this could be the reason. Our churn was falsely inflated. Really? So what I should do is go back in and reduce our historical churn. I would say is 21 2021. churn as a result of 2023 had crept up to 25, but it's really not real. So if that's not real and I revise that down to 21, I'll bet it gets closer. Then the question would be, do we go past that? But using the data on hand, it was like, you're going to be, you're done at 3,600. we already surpassed that.\n00:12:22 - Tina Marie (profitdriversinc.com)\nYeah.\n00:12:24 - Dan’s iPhone (danddcompany.com)\nWow. Which, thanks to Mass, tells us something's wrong, so it has to be the churn. The only thing that can be wrong. Good work, Tina. Literally never thought of that before.\n00:12:36 - Tina Marie (profitdriversinc.com)\nwas like, oh, wait a minute. Isn't it funny how I really, I mean, I do some work, some of the actual calculations, formatting, some setting up, some things, but so much of it is just unlocking you by asking the question. didn't ask yourself, or you asked yourself, but you didn't make yourself answer.\n00:13:00 - Dan’s iPhone (danddcompany.com)\nI mean, I wasn't even I wasn't even asking myself that I was just sort of whatever. Yes, exactly.\n00:13:06 - Tina Marie (profitdriversinc.com)\nAnd that is the whole point.\n00:13:07 - Dan’s iPhone (danddcompany.com)\nIt's right. It's like You I can't it's that. I mean, that's why I go solve other people's puzzles.\n00:13:15 - Tina Marie (profitdriversinc.com)\nRight.\n00:13:17 - Dan’s iPhone (danddcompany.com)\nIt makes me ask questions.\n00:13:18 - Tina Marie (profitdriversinc.com)\nwouldn't normally ask. And that's what I needed to I'm on the hunt for finding that person for me now because I really do want to build a scalable thing. Okay, for just just like two seconds. So Maria, Maria had that offer. So it's just how people do what they do what they're good at what they're not good at what. So she's really good at selling, but not so great at the follow up because I bought that and the follow up email, which she actually does a really good job of that. She must have an amazing Send her score because she's always about that hit that reply and say Yahoo, blah, blah, but um, so I bought it and it says, okay, and I'm creating a calendar for you, which was a default. all to everybody who bought it, right? To schedule your four hour VIP day. That was over a week ago. And there's been no further emails, no further follow up. So if I'm a person, now I'm just chill about it cause I know something about her and I've talked to her and I know you, but if I was a brand new customer, now I got ghosted for a week after spending $2,000 for somebody, I'd be like, what is going on here?\n00:14:32 - Dan’s iPhone (danddcompany.com)\nAnd my first thought is something's broken.\n00:14:35 - Tina Marie (profitdriversinc.com)\nWell, and what I think though, also with the lack of communication with her is either somehow I pissed her off and she doesn't like me or, and I think that this is the bigger thing is she sells and can't fulfill really well, like she's overstretched.\n00:14:51 - Dan’s iPhone (danddcompany.com)\nI think that's definitely part of it. I was gonna say that her and I's interactions like we have one, one hour call or whatever or two hour call. And then she banged out some coffee and then I banged on the coffee and then I never talked to her again I just would text her, but you know me like I Prefer not to talk to people right and then I could get it done via text and we communicated in the doc, but I Was like most people wouldn't go for this I'm not most people right so I was like, I don't know so it listens to you right now. I go well Yeah, think that is kind of the way she rolls I think I think she has this a bit I would say probably a bit of a scarcity mindset That's why she's always making offers Yeah And that's the thing that's why she's She gets Games right it seems like when I think when I was talking to her she had just she just lost the gig right so she's doing these sort of Fractal blah blah blah see I'm all over the hill you want to call it and then those come and go right so it's like when they go and you're making five grand off of one big hit and then all of a sudden she's hustling doing offers like what you got like I did not wait yeah I was the VIP they went did you I suppose you didn't get the father's day offer or didn't know no because you know what good for her good for her good list segmenting yeah no I did get the father's day offer oh you did bad list segmenting and it is well it's not really though because at discount as a discount no it's funny that she that I'm even on that list it's like girl why are you sending me a 27 dollar office like yeah now that that whole segmenting um yeah and\n00:17:00 - Tina Marie (profitdriversinc.com)\nThe whole thing is like, I don't think I'd want my higher end clients to be getting like that.\n00:17:07 - Dan’s iPhone (danddcompany.com)\nRight.\n00:17:07 - Tina Marie (profitdriversinc.com)\nRight.\n00:17:09 - Dan’s iPhone (danddcompany.com)\nAnd I literally was expecting a higher price.\n00:17:12 - Tina Marie (profitdriversinc.com)\nfunny.\n00:17:13 - Dan’s iPhone (danddcompany.com)\nI, when I clicked her, was like, really, you're like, this is, you're sending me up your entry level offer.\n00:17:20 - Tina Marie (profitdriversinc.com)\nLike what are you doing? she's had somebody dub her like the low ticket queen or something like that, low offer queen. And so I feel like she's just kind of leaning into that, which actually the time from the things that I'm seeing in the market, that's the trend and, yes, again, but I think that the difference is that because buyers are so much more savvy, they now want to sample and where it used to be a tried and true, those that pay the least expect the most. I'm watching that those that pay the most have been burned so much by just handing over money to salespeople that they're like, where's your proof dude?\n00:18:00 - Dan’s iPhone (danddcompany.com)\nyou're not getting my money until I get referrals and all the money you say that I agree.\n00:18:05 - Tina Marie (profitdriversinc.com)\nI think I've seen a bit of that lately, too. Yeah, where it used to be like, you know, just somebody make a recommendation or whatever, here's $50,000. And now, yeah, it's just, there's definitely a shift in it. Because of that, though, it's even more imperative to do testing and not make assumptions. But I've always leaned more towards the low to high ascension anyway. I feel like if somebody wants to refund at a low level, whatever, it causes you some merchanting issue. But I think that it's really easy to over-deliver on that and kind of negate it. But if somebody buys three different things from you ascending up and then they want to refund, it's pretty clearly that it's them, not you. So I feel like just, the standard operating for business and this might be relative to what you're doing with the music stuff because you do have an ascension I think potential there that having something super low ticket next to like under ten dollars then twenty thirty dollars then what I saw her conversion rate was crazy because she showed me some of the back end stuff so when she tried front end at twenty dollars the conversion rate was like five percent same exact thing at three dollars the conversion rate was seventy five percent but this was what was crazy the conversion rate for the twenty five dollar offer same thing after that so as an upsell was fifty five percent to the cold traffic compared to three percent to cold traffic when it was the front end So now that's just one thing once, right? it's definitely can't be a standard for all things. But it was really interesting how much that. And then the conversion rate to a $2,000 after that was like 15%. So for cold traffic, that was still really solid conversion rates. Anyway, just lots to be thinking about. But it doesn't matter if you're going to ruin your reputation by not fulfilling stuff. That gets bad really fast. Anyway, fascinating. so the original question was, what's the matter for subscriptions in relationship to obtaining a 1% market share? You went to, there was this ceiling, this map that this guy had this formula. So you're going to revisit it to come back with that answer, right?\n00:20:59 - Dan’s iPhone (danddcompany.com)\nI've never done that calculation. So that's like the sort of gold that I laid out was that, but the problem is based, like, you know, me do it. I have to revisit the 1%. So the 1% calculation I did before is now incorrect because as part of my recent five, our, this is the thing, this sucks, all these eppin changes that they made. I'm like, don't know if I can trust this. So there's two ways I can go about this. I can take the 1% calculation that I did before, which is old data and use that because that data while old or three ways I could do this. I could go revisit that calculation and then, oh, , no, I can't, I can't go. I don't think I could go back and use like 2018, 2018, So that's like the sort of gold that I laid out was that, but the problem is based, like, you know, me do it. I have to revisit the 1%. So the 1% calculation I did before is now incorrect because as part of my recent five, our, this is the thing, this sucks, all these eppin changes that they made. I'm like, don't know if I can trust this. So there's two ways I can go about this. I can take the 1% calculation that I did before, which is old data and use that because that data while old or three ways I could do this.\n00:22:50 - Tina Marie (profitdriversinc.com)\nI could go revisit that calculation and then, oh, , no, I can't, I can't go. I don't think I could go back and use like 2018, 2018, 19. So I was like, Oh, just use pre COVID.\n00:23:02 - Dan’s iPhone (danddcompany.com)\nNo, all the numbers are F. I guess the best case scenario was would be revisited, do a lifetime calculation that accounts for everything and changes global pandemic. Right. Huge screw up somewhere in the fall of whatever the hell you hear that was. Well, actually, no, that would be in it. So it'll be whatever has happened with a ninja. I just do it in ninja. I don't do another 71. I just, that's all crash data. I just don't use it. But when I recently did, I revisited the lifetime value, it was way higher. And I was like, Oh, , that's way higher, like, over $100 higher.\n00:23:44 - Tina Marie (profitdriversinc.com)\nSo that then changes. I guess that doesn't actually change the 1%.\n00:23:50 - Dan’s iPhone (danddcompany.com)\nThat just changes the value of the one person. Right. You're right. Right.\n00:23:57 - Tina Marie (profitdriversinc.com)\nThere has to be fixed based off of\n00:24:00 - Dan’s iPhone (danddcompany.com)\nof how many people are in the market, not how valuable they are to you.\n00:24:04 - Tina Marie (profitdriversinc.com)\nYeah. So the problem with 1% is we're already exceeding that. The rate at which we are right now is way above 1%.\n00:24:12 - Dan’s iPhone (danddcompany.com)\nSo I'm like, I can't increase 1% when I'm increased over that already. Like, I don't know where we're going to land to say, okay, this is our actual average. And then I want increase that 1%. When I was trying to increase 1% from 31, well, it's already done. We're 10% about that.\n00:24:35 - Tina Marie (profitdriversinc.com)\nSo I'm like, okay, well, we can't really increase 1% and I've increased 10. But I'm not even sure I've increased 10.\n00:24:43 - Dan’s iPhone (danddcompany.com)\nWait a minute. Okay.\n00:24:44 - Tina Marie (profitdriversinc.com)\nLet me just keep clear here though, because are you talking about a 1% increase in your business with your target? Because I thought you were trying to get 1% more of the market. Oh, yeah, good point.\n00:24:57 - Dan’s iPhone (danddcompany.com)\nSo I need to.\n00:24:59 - Tina Marie (profitdriversinc.com)\nAnd what I'm a. So that goes back to how many buyers does that equate to because that should be relatively easy map If you knew what the market size was by a number which you'd have to know if you know what your percent Yeah, that's whatever whatever spreadsheet that's in I I don't know the number. We don't know the actual number I used I think I used the lowest number that was publicly available to us.\n00:25:27 - Dan’s iPhone (danddcompany.com)\nIt's like eating out So I need to look at And is that 80,000 every year It's yeah, it's like an average like a rolling average So that would mean So you're getting a percentage of that 80,000 and you're saying you thought you were at 6 percent Eleven Eleven Okay, was it alone? Okay. And so how many new customers did you have in 2023? And how many have you had in 2024 so far? New?\n00:26:18 - Tina Marie (profitdriversinc.com)\nI don't know.\n00:26:19 - Dan’s iPhone (danddcompany.com)\nhave to go around the report. Okay. currently paying at some point during 2023. I'm not sure where you're at. are you asking how many individual customers paid us or how many active subscribers? Well, me ask you this way. How would you identify your portion of that 80,000? How would you identify and define your marketer? So that's what I'm asking.\n00:26:51 - Tina Marie (profitdriversinc.com)\nHow many did you have in 2023? how many do you have so far?\n00:26:56 - Dan’s iPhone (danddcompany.com)\nWell, the things that we track. So that. We have new customers and new subscriptions, so that 31 is actually new subscriptions, right? That's not new customers.\n00:27:08 - Tina Marie (profitdriversinc.com)\nNew customers is lower.\n00:27:12 - Dan’s iPhone (danddcompany.com)\nSo new customers is the factor that you use for market share, right?\n00:27:18 - Tina Marie (profitdriversinc.com)\nSo the market's 80, I'm saying we get 10,000 customers a year would up first. So yeah, I mean, offhand, I couldn't tell you how many customers we've got this year, but I could go run it. I can run that on the torque of the drop pad. Can we do it now? No, because my laptop's in the house. I'm up on Perch 2.0 looking at the ocean team, huh? Listen to your voice, listening to your voice, looking out over the horizon. All about hurt and the relaxation button band. I got to earn my phone. I was just on the support chest like an hour with GoDaddy. Only to find out I can't do what I want like oh my god. Did I really spend an hour?\n00:28:06 - Dan’s iPhone (danddcompany.com)\nDoing this yes, that is the worst that will literally ruin my mood for hours. Oh my god. I'm ruined. I'm a headache Seriously anytime with customer support All by itself is always like seriously wreck Emotionally I hate it. I don't I wish that I was like Full dreaming, but then to not get it resolved and to have spent that time I Don't know why it affects me so badly, but it Literally like imagine a battery icon and it you can watch it drain The life force is doing like that's what I feel like so I feel you Okay, well next week You either have that or be where we can go look at it together.\n00:28:59 - Tina Marie (profitdriversinc.com)\nIs that fair?\n00:29:04 - Dan’s iPhone (danddcompany.com)\nI can send you an email reminder. Sure, I have a spreadsheet with it all and they're already, I've definitely done this. But what I probably don't have the last time I did it was November, but I probably don't have like the true 2023 total, but I can get it, yeah. Okay, what I'm asking you is by next week, will you either have that done or be where we can go get it during, okay, I'll either be done or I'll have a computer, yeah.\n00:29:37 - Tina Marie (profitdriversinc.com)\nAnd do you need a reminder for that? No.\n00:29:41 - Dan’s iPhone (danddcompany.com)\nOkay. Promise?\n00:29:44 - Tina Marie (profitdriversinc.com)\nYeah. Yeah.\n00:29:46 - Dan’s iPhone (danddcompany.com)\nI need this stuff for those broker dudes too, because they, they had asked some stuff for them. And they, they got into our books and they were like, your books are a mess. I'm like, have I mentioned my partner to CPA, we're shocked.\n00:30:00 - Tina Marie (profitdriversinc.com)\nthe mechanics car never drives like yeah yeah they're like what is this entry I was like I don't know I got to Jeff Jeff what is this entry what oh my god really so then I get him so then I send him Stacy right Stacy other Stacy that works with me was working with Sean I don't know if she's still helping probably not and then I send her impotor Jeff and Jeff's like I know Stacy and then it dawns on me oh that's right I found her to get our books done what happened oh I stopped yeah five or three years ago I'm like and here we are again he's like I just didn't want to pay her five hundred bucks bro you didn't there and her updates are hilarious she's like you haven't entered anything in over a year\n00:31:00 - Dan’s iPhone (danddcompany.com)\nSo I'm like, oh, God.\n00:31:02 - Tina Marie (profitdriversinc.com)\nWow. Now we're paying her like $5,000 to fix it all.\n00:31:06 - Dan’s iPhone (danddcompany.com)\nI'm like, how did that work out, Joe?\n00:31:09 - Tina Marie (profitdriversinc.com)\nSo 10 months worth of $500, and he could have just paid it. Yeah, and it would all have been up to date, and then I wouldn't be broke. you would be sitting around twiddling their thumbs. Oh, that's a good time. Oh, my gosh. OK. Oh, so, Mark, I might, um, kind of all of it out, Tina. Spit it out. You know, like, I always have like five stops that want to come out at the same time. It's the heat stroke. It's not. I'm freezing because or once everything is like, icebox and I like heat. But no, I hate it. I'm always blown up. like, is there? air-conditioning on? No, yes it is. Yeah, I don't mess with it, though, okay? Gaslighting.\n00:32:06 - Dan’s iPhone (danddcompany.com)\nlike, there's your lighting. No, it's not on.\n00:32:10 - Tina Marie (profitdriversinc.com)\nAnyway, so Lorenz, because we were talking about, um, how, huh? Po-changer, whatever, yeah. Yeah, yeah, well, I mean, because Lorenz went from, I don't remember what it was, like, around, uh, a million dollars a month for attorney fees, and then we had that meeting. By the time I talked to him again three months later, he had almost doubled what he was doing before. So I'm like, dude, my coaching is already paid for. You should just let me work with him, because he's still complaining about Lorenz's pace and ability to manage the team. And he's finally come around. think he talked about it on our meeting that, you know, we can't. hire the best people, which we had that conversation from day one, because he's not going to pay top prices for those people. And it would exist. Well, yeah, but yes, there's that. But also, there's no guarantee that they'll stay. That doesn't mean any kind of loyalty or whatever. I think you get more loyalty by growing people and giving them a place and they know that they're you know, CRB players, and then you raise them up, you know what I mean? And I think Lorenz falls right in that. He's not sure how to open to it.\n00:33:31 - Dan’s iPhone (danddcompany.com)\nBut I'm like, basically.\n00:33:33 - Tina Marie (profitdriversinc.com)\nSorry, there's so much noise.\n00:33:34 - Dan’s iPhone (danddcompany.com)\nI'm not sure if I hear you loud and clear. If you're talking. good.\n00:33:40 - Tina Marie (profitdriversinc.com)\nSo I'm like, basically the coaching was already paid for by just what Lorenz has done and improved.\n00:33:47 - Dan’s iPhone (danddcompany.com)\nSo let's just get in there and make that team better.\n00:33:51 - Tina Marie (profitdriversinc.com)\nSo Samantha, Samantha does good enough financially, and he's figured out what people to put on her team that we don't really, the fact that she doesn't want to be open to it doesn't matter. But we can work with the people who do. So then the the invoicing I'm like well we should just pause whatever you want to do with the splitting and like the end of your stuff because his 10 million dollar settlement came in and he's got to think about taxes. like just wait and maybe we'll bundle all of that together or something but uh and then there's Dolce you know the dog situation and he's working super late at night and yeah then I was a day born to Selco. What's that?\n00:34:38 - Dan’s iPhone (danddcompany.com)\nI said 14 hours a day according to Selco. He's like a market legitimately uh as Selco said finally learning his business. All right I mean I don't know I don't know if you really realize that before the king never went to work. He was never there. He never went in. I heard you. So what I'm gonna try to do then is just tap\n00:35:00 - Tina Marie (profitdriversinc.com)\ninto what's already happening, if he's going to be there a lot, then I'm just going to be more, was going to use the word aggressive, but it's not really aggressive, but just more frequent in the questions and then the, like if he's here, if he's in the season of getting work done, I want to tap into it and help him, I don't know, do whatever he can do, but then also he was like kind of quiet this week. So I was like, is everything going on? Like apparently I didn't tell you I'm a human bear, not barometer or something like that, but basically when the weather changes, it's a headache and can't work, so. Oh, it's way more than that. The divorce is next. I mean, like he's going to, he's going to go, the only question is, and I don't think he will, Salka thinks he's going to go off the rails. I'm like, I don't think he's going to go off the rails. Salka's like, he's going to go off the rails. So I don't think so, man. He's. He's directing his energy in the right place. Yeah, he is doing that. But I do see him going, what am I doing? Like, and just finally cutting the cord. So I said, oh, yeah, I so the one thing I asked and he didn't respond to. And because I'm not really the one that asked this is like, did you go talk to the guy, you know, that you were asking about the counselor, whatever? And, and then I just kind of like glossed over that. Went to a big question. Yeah, but it's really not for me. So what I, what I did do is send them a good message of like, good, like, you know, kind of about what these are the things that when, when these things are shaky in my life, everything falls apart. So if they start to shake at all, I go fix them. Like in the past, it's been money. When they're when it's not there and I'm not sure about things like I'm stressed. I can't even think straight. I can't talk. my mood is crap, like everything's terrible, and then the next thing would be my relationship with the girls. So anytime I have problems with the girls, like it's bad.\n00:37:09 - Dan’s iPhone (danddcompany.com)\nSo I make sure I don't ever have money problems, and I give my girls like priority, so and make sure like be proactively, you know? Anyways, and oh, the other thing is I have to get sunshine every day, like the things to protect my mood, because I'm the steward of the ship, like I'm the cat, and I gotta make all these things happen. So I have to get sunshine every day, I gotta move, and I have to eat food to protect my mood, because I'm prone to depression, and he has to, which is why I was talking about it, like avocados and salmon and things like that. But he's taking grown into the office, and oh, we knew that was yeah, he's been taking it like since Monday, at least, I don't know if he did it before that, but I think that's super good for him.\n00:38:00 - Tina Marie (profitdriversinc.com)\nand I really do. That's a good idea of channeling. But, um, the other thing, I'm like, go hug your mama a lot because to lose his dad and his dog, like, was it this, his dad passed this year?\n00:38:13 - Dan’s iPhone (danddcompany.com)\nIt's been recent. And so I'll give you the quote he gave to Selco. And I was like, ouch. And he said, I lost my dad. So I lost, I lost the person that helped me with my head. I lost my dog and I lost my heart. was like, that's just slightly sad. Like, Oh, Lord. Yeah. So yeah, it was. And I think that weirdly or not, maybe not, the dog dying just reinvigorated the dead dying 100%. Yeah. And so now Selco loves. Yeah, he's like, I don't know where he's gonna go. And he, those two talk constantly, constant. weird to me because in the beginning, like, I know that that's how you got involved. But Mark made it sound like he's damn psycho. He doesn't want him. He didn't want him to be in the business, right? But even that even he even relented on that. I was floored on Monday when he was like, basically, and I called this two months ago, month and a half ago. I was like, we're eventually going to get to the people. Well, we're there. Except I didn't think he'd go intake then lawyers. But that's exactly what he did. I actually talked to Salco yesterday and I said, he started with Lorenz and Patrick. But I'm like, we all know that Sam and Tyler are next. Like, nobody's safe. And they shouldn't be because that like, I'm not going to tell you what to do, Tina, but here I'm going to tell you what to do. All you got to get from Patrick and Lorenz is what do you need help with? That like Like this is I mean, it's not a nice way to say this, but like Mark's not a good lawyer and Therefore they're not good lawyers, right? So it's like they can't become better lawyers if the lawyer that they're working for is not good at the thing, right? He's not because he he if his background was he ran the intake For Jacobia Myers. He wasn't a lawyer there. Yes. He was a lawyer, but he wasn't a lawyer there He was a lawyer that ran the intake team and that's why he was good at that, right? That's why That became a strike for him here But as like an actual practicing lawyer Salka's a better lawyer by miles, right? But Salka doesn't want that's why Salka's in their training What's his name? Let's see the kids name Nick Salkos got Nick doing the LIT department, and then he wants to start looking at the pre LIT stuff, and now you're going to go look at the pre LIT stuff, and the problem with pre LIT is system. Salkos convinced, I said it to you, it's these nine steps. That's it, it's like nine steps. These guys aren't lawyers, right? Like they just have law degrees because it's a pre LIT firm, which means they're never stepping foot in the courtroom. Therefore, they're never really being a lawyer in the true sense of getting in front of a jury, making argument, blah, blah, blah. They're mostly pushing paper, and if they followed literally a checklist, then they could be better at their jobs. The problem is that checklist doesn't exist. It can exist, but presently it does not exist. Not because of his version of the checklist, Mark sort of got his version of the checklist.\n00:42:05 - Tina Marie (profitdriversinc.com)\nThere's some, you know, disagreement about how some things work, but ultimately the data will say which one's right or wrong or whatever. So my guess is the problem with Lorenz is not managing people. It's managing the system.\n00:42:24 - Dan’s iPhone (danddcompany.com)\nWell, you can't manage the system that doesn't exist.\n00:42:26 - Tina Marie (profitdriversinc.com)\nAnd that's the problem. There is no system. There's a sort of system. We know that we know that A and B, right?\n00:42:36 - Dan’s iPhone (danddcompany.com)\nSo there's a black box in the middle and it's like, okay, what's happening in there exactly? Everyone doing it the same? there a way to make this better to get a higher percentage of cases settling at the policy rate? The answer is yes.\n00:42:55 - Tina Marie (profitdriversinc.com)\nThe thing is that no one's extracting it, right, which you're great at. it. it, and then, and then, you know, once it's out, once the pieces are on the table, preferably, right?\n00:43:07 - Dan’s iPhone (danddcompany.com)\nstart putting it together. Well, that was insightful and good. I'm trying to figure out, because he's not sure Patrick's open to it, but I think there's only one we only need one. Yeah, I agree with that. That's a good thing. Patrick isn't in Arizona, though. He's in so I don't know. I only need one. Let me hear the rest of your logic behind that. It's because they're all doing the same thing. So it's like the system is the system. It exists outside of people, right? I get that. Okay, so for creating system, I only need one. That was what you're saying. Yeah. Okay. Yes. Okay. Got that. I need all the attorneys to be their best. Oh, I was confused, but not good. I mean, the way that they get better is by working a system, right? It's like, it's like, like, and I think that the system Salco knows the system and the question is, can you take what they're saying they need, what Salco is saying, and then like Josh and go, okay, let's make let if I do this so that it's just, it's like, follow the yellow brick road. Just, just follow the yellow brick road and things we've talked about. I mean, it's super cool that like, it's all now happening and it's, it is happening faster than I thought it was, but this is like the final frontier. It's like, okay, let's figure this out. Now, whether Mark moves in this direction of, hey, yeah, I'm downsizing. And like, I'm just going to run this super tight firm at like super high margins. or not remains to be seen, or I talked to Salka yesterday. So like, Salka was like, hey, you know, like they're still trying to figure out a way to work together. And I don't know if they'll get there, but I was saying how this KSHQ to me, potentially, had solved the one thing that was like, dude, if we were signing these cases, signing retainers, instead of sending leads to someone else to sign them, like, we'd be so much better off. But we didn't have a method to do that. Like, he didn't want to hire an intake team. for a while, he was like, well, he was marks. And I was like, I don't know if that's gonna work, right? He's gonna, right? seemed weird. But now you have this KSHQ guys, and I go, so literally yesterday I go, holy , I didn't actually think about that. Like, they saw, we've never had a lead gen problem. We always had to leave, follow a problem. Right. only problem with those guys is I hate the software that they use. It literally creates work for me. So I pitched to Robert for me and him to get on the phone. And I was like, I've got a solution that will make your life easier. And it's like a living thing, right? I can get him on lead blowing and he just opens up the hood, I'll be like, yeah, dude, I can make your so much better. But then that in term, it marks the better. And then that becomes a resource for shall go. And then it can better align sweet love myself. And so I'll go with these ad surgery dudes, which is, I think. Those guys are super interesting in that they just want to generate leads. They don't want to go around with any of this other stuff. I'll be back in overall. I'll do the systems. Okay, there's something here.\n00:47:02 - Tina Marie (profitdriversinc.com)\nThat's why I would mark that that Arizona firm thing today. was like, and that might be the way to go. I thought that before, except, you know, that dude did it totally wrong, goes against private equity money.\n00:47:15 - Dan’s iPhone (danddcompany.com)\nBut, you know, it's like, just like I said, me, know, you have all the money in the world.\n00:47:21 - Tina Marie (profitdriversinc.com)\nYou can't execute. It doesn't matter. he had 3.3 million in revenue, and we know as pre-lit insiders, he should have been paying about 200 bucks a lead and about four grand a retainer. And if he wasn't, which I'm willing to bet he wasn't, then he was screwed from the start. And if he had never been inside a pre-lit law firm, how could he possibly know those numbers? Even better, even if he had, that firm didn't know it, marks the only one that knows the numbers, and that's because we made it the same. Right. reality. Yeah. What to think about but the I always have to think about the person like I don't I have to in in the sense that like, oh, yeah, totally. Do it. Yeah. And think about like where he's at in life, what the you know, the probability there's possibilities and probabilities, right, about where he's going to go, what kind of pace he can work at. of course, there are, we're thinking about this yesterday, I was talking to my friend, Samantha, and I'm like, there's pace pockets, like inside of this pocket, this is the pace and the pace can be different all around us. But also, we can have so like inside a sweet law, there are different pace pockets, Samantha has her pace. Lorenz has his pace. Mark has his pace and they all are under the same roof, but operating kind of at different speeds and almost kind of self-contained units. I know he's got pods, but there's that and there's the autonomy of those pods and what he's doing and whoever is the one in charge that has the power that drives that. What's going on in their personal lives always will affect it no matter how good the system is, no matter how good the tools are, but if the system is such that it's engineered to be max leverage, meaning it requires the least amount of mental effort and energy so that when that person is operating on a lower level, because divorce, Samantha pretends\n00:50:00 - Dan’s iPhone (danddcompany.com)\nactually mark, I mean, death, sickness, babies, all these different things. If the system is maximally leveraged, then even at their lowest, the company is still okay, everything's okay. But when it's max leverage and everybody's operating at their highest, then we have the seasons of like just sprinting and mass and growth. But because it was based on the system using the system, it should still be sustainable and maintainable. Even when things when the person slows down a little bit. So everything that I'm doing is trying to figure that out. But but again, I'm not in person. I'm not watching things we talk one hour a week. But yet, look at all the growth that's happened in that amount of time. So that's that's kind of amazing. Anyway, I mean, I think he's in the spot right now. Oh, it's like this. It's, I mean, it's potentially highly pivoting point in his life, right? like, it's like, I mean, he just has to cut bait. His marriage is a show. So it's like way worse. It's way worse than you know, let's put it that way. I don't know anything about it. Do you want to or do you not want to your call? My I do, but I should not. So that's why I never mentioned it to you. So it's like it's I have no I know why he's not doing it because I because we know him because he is emotional or whatever. But the fact of the matter is he should have never got married to her. He was warned to not get married to her. Explicitly, he was questioned. Why are you even doing this? And he did it and I think part of it is is he purposefully picks someone that's broken, right? Because he's broken. And it's like, but now I think he's getting to this place where he's like, I don't want to be broken anymore. And it's like, well, then you have to, you have to separate yourself from what the broken version of yourself is created, right? And the broken version of himself created romper room, which he, so he's going to clean up a romper room first. And he's just doing it faster than I thought. And it's like, okay, man. But, you know, he is in this spot right now where it's like, you got that $10 million settlement, which by the way, he didn't work on zero work.\n00:52:51 - Tina Marie (profitdriversinc.com)\nHe just gets the benefit, right?\n00:52:53 - Dan’s iPhone (danddcompany.com)\nThe work that he did was he got that lead. So it's like, okay, you're going to get this $10 million settlement. And now you're putting this. focus on work, and it's like, if he taps into you, in a way, it is go time, right? It's like, okay, if he's going to put his attention towards work, and he's going to bring you into work on some other stuff, and he's got this ginormous influx of cash, it's like, you know what, this is the time to take the next step. But, and I pointed this out to Salka yesterday, and it ties into just what we were talking about being a second ago, it hit me yesterday, after our call on Monday, you were like, oh, just go get another vendor. That's really not a thing, right? But the fact of the matter is, that's not a thing, practically, right? Because new people can come into the market, that's all. Yeah, but it's like, but it's not likely that we're going to find somebody new and or that they're good, and that they're going to move the needle very much, right? it hit me yesterday, I was like, oh, He's he's gonna the growth is gonna start to slow down and It's not necessarily a bad thing right like he looks outside at Steve or whatever But what Steve is doing. They're not doing the same thing So you can't look at Steve's results and expect those because what Steve is doing in my opinion is Steve is buying brands So Steve is buying these branded firms and it's not this firm. That's Kicking on Facebook ads or Google ads or whatever. It's a firm that's been around for 10 years And they did and they they're getting a lot of referral business Like if we could go into the hood, that's what you'd see you'd see like I know they don't have 300 leads from monkey and blah blah blah whatever Right they have the same people coming through the doors that have been coming through the doors for 10 years And maybe they're doing buss ads and maybe they're doing like more of the traditional stuff But the the core of that business is built around referrals in a brand And well, if you buy 10 of those, get 10x that, right? Or to whatever degree. So when Mark looks at that, I'm like, no, you're never going to be that. I mean, you will be in 10 years once you build up your brand.\n00:55:17 - Tina Marie (profitdriversinc.com)\nSo it's like he's now going to be at this thing where his model is going to cap out. Unless and until he can figure out a way to generate leads on demand, which I'm not sure is a thing, to be honest.\n00:55:35 - Dan’s iPhone (danddcompany.com)\nAnd then God forbid, like a monkey or something goes up, because that's still a huge problem.\n00:55:43 - Tina Marie (profitdriversinc.com)\nwhen a bunch of your business, I mean, granted, he's spread out that risk now across multiple vendors. But still, it's like they go sideways. You're instantly damaged. So it's like he needs to keep that in mind. So it should be like building the doctrine that built building the internal assets that you do control the doctrine at work the referral portion the bump of a and yeah, you can keep looking for vendors, but And stop looking outside stop looking at Steve stop looking at models that are not akin to what you're doing right Right and the other thing is okay, so he this week Tuesday referred me to One of his friends who's a doctor for coaching Fuji Naka Well nice, but nice yeah, he's like he was looking for a coach and He said he thought it would be a good fit so I've been talking back and forth and then he's in love with Mark like that the dude in Arizona No, he's in You know to the way that he's talking about Mark as a mentor and the way that he feels about him. It's really obvious that Mark is special to him, and I've seen enough just in how Mark takes care of his mom and how he talks about, know, the romper room isn't, like, business is his social, like, he needs a family and Dr.\n00:57:26 - Dan’s iPhone (danddcompany.com)\nHe needs, yeah. Well, it's a service.\n00:57:30 - Tina Marie (profitdriversinc.com)\nIt's a surrogate. It is. He does need a family but I'm afraid he's boxing himself out there. Yeah, but my point is that I'm taking this back to pace and also to who he's modeling after. So like, and that was part of the message that I sent to him today, you know, he's modeling and targeting these businesses that are doing things he doesn't want to do. They're using ethics or a lack thereof that he would not. I want to do and so that he really needs to take into account the things like he's living this life where people Fall in love with him because he loves them and supports them and encouraging and the way that he talked about his friend was like Like it like a brother, you know, love it. It wasn't that he used but but the language was very obvious Like there is like they love each other And that that was the dude down here Zach loves Mark My point is that Mark is not these guys that he's been trying to chase after and to your point of You know, what what path he'll choose and what he's gonna do and where he's gonna go You know People do what they do and I don't know, but what I have seen Mark do Is repeatedly check himself like I've seen him go off the rails a little bit And I've seen him Do things that aren't really prudent But I've seen him respond to\n00:59:00 - Dan’s iPhone (danddcompany.com)\nour council and other people's council and check himself and go, you know what, I gotta just do this and I just gotta do that. Which is probably also why he's at this point where he's at where he wants to be respected and cared for at home also. But that whole thing is a long journey and most people take a lot of dips in it, but I, over the three years, what I have seen being more consistent is that he purposely puts himself in a path to talking to people who will call him out, who will tell him what he needs to hear, even if doesn't want to hear it. He will go quiet and process it rather than sound like he's hearing it and then he'll work on improving. So, I mean, three years is, that's a pretty steady... I don't think he'll go off the rail. No, I don't think so. Salco's not sure. Well, I don't think he will. Yeah. But I do think that he's going to.\n01:00:15 - Tina Marie (profitdriversinc.com)\nHe's going to have, he's, he's approaching as, as sort of, you know, the scales fall away, whatever metaphor you want to use, right?\n01:00:24 - Dan’s iPhone (danddcompany.com)\nThat's happening. And it's like, it's unavoidable.\n01:00:27 - Tina Marie (profitdriversinc.com)\nAnd he's going to have to face things that, I don't know that he's necessarily been avoiding them, but they've just been comfortable. And it's like, he's going to start to have some clarity around the things that he really does want, right?\n01:00:46 - Dan’s iPhone (danddcompany.com)\nand he, he is good about like moving past things, right? It's like, he's moving past the idea like, oh, I can just hire someone in.\n01:00:54 - Tina Marie (profitdriversinc.com)\nI can, I can just increase the size of the team and I'm going to get there. like, no, a. No, my argument was always, you don't even need to do that. The math doesn't support it.\n01:01:04 - Dan’s iPhone (danddcompany.com)\nAnd then the market wasn't supporting it either. So it's like, OK, internal, which it was him. Like when he asked you to do that on Monday, I was like, no, I didn't see this. Got me. But OK, it was a good move. Um, I just saw a lizard outside. had to take a picture of it.\n01:01:22 - Tina Marie (profitdriversinc.com)\nOK, I had just my chair.\n01:01:25 - Dan’s iPhone (danddcompany.com)\nwas like, where did that puppy go?\n01:01:26 - Tina Marie (profitdriversinc.com)\nOh, there it is. Yeah. Yeah, I don't appreciate non-getting puppy pictures. Gee, Dan. You get none? So rude. You sent me one picture. That's it. I'm like, come on. Newsflash.\n01:01:38 - Dan’s iPhone (danddcompany.com)\ndon't take pictures. All right.\n01:01:41 - Tina Marie (profitdriversinc.com)\nsuppose I can expect that. You and you and Stacy.\n01:01:46 - Dan’s iPhone (danddcompany.com)\nOh, up. is it 104 already? Because I was on support to go down for an hour. Isn't that related to this?\n01:01:57 - Tina Marie (profitdriversinc.com)\nAll right, well, I got to go run. and errand but um hold on let me just close my I gotta go take I gotta go take some Advil or something. What were you saying? Uh it was funny as I was convinced it was from work. I was like yesterday or Tuesday or whatever I was like I think I get headaches when I come to work. No.\n01:02:18 - Dan’s iPhone (danddcompany.com)\nWhat is it? in the back. I got them in the back here too.\n01:02:21 - Tina Marie (profitdriversinc.com)\nI think it's just . I'll be with . Uh oh. It might be a little bit of that too. Yeah mine or not.\n01:02:28 - Dan’s iPhone (danddcompany.com)\nI'm a little stuffed up right now. Okay so next week we are doing market share kind of numbers and figuring out all of that. I don't know. should probably even go do it right now. Yay.\n01:02:43 - Tina Marie (profitdriversinc.com)\nI'm like I do want to I do want to know. Feel free to send me a prequel. And so look at that.\n01:02:49 - Dan’s iPhone (danddcompany.com)\nI'm going to go adjust my class ceiling formula. Yes.\n01:02:54 - Tina Marie (profitdriversinc.com)\n100% PC that. Before I send a nasty Graham to that guy. You're wrong. and here's the proof. Hi, my name is Dan. You're wrong. All right, Diana. I will. What's the Thursday? I will talk to you Monday and I will be back in the not-popped place that I hate. I'm sorry. Whatever. Have a great weekend. I'll talk. should go to the beach. You should actually get in the water. I can't. I'm duty. I'm puppy duty. I can't leave. While we're on the... She can't go anywhere because she's not fully vaccinated. don't bring her up with other dogs. That's what these shoes are for, okay. Oh, right. Be responsible. Whatever. know. Have a great weekend. All right.\n","contentPreview":"00:00:03 - Tina Marie (profitdriversinc.com)\nI'm just looking at my bathroom no highlights and they are so weird because they're a I yeah but like one of them is NHH semi colon period KKKG you know yo...","processedAt":"2025-05-04T03:40:52.601Z"}