{"fileName":"Done Transcript for Tina Maria CAll(1).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Tina Maria CAll(1).txt","type":"transcript","priority":"medium","content":"00:00:00 - Maria Gudelis (Maria Gudelis)\nOh, nice.\n00:00:01 - Tina Marie (profitdriversinc.com)\nYes, I'm very excited about it. But I have this people that build my deck did not build it right. And so it's very creaky. It's not always been creaky. And that's where I work. And it's driving me bonkers. So now I have to deal with people coming in and out and probably doggies and the doggies like to play tag with the deer around here. They will chase each other up and down the fence. Because if we had some baby deer that were born and they used to sleep under my porch and they've grown up around my dogs.\n00:00:37 - Maria Gudelis (Maria Gudelis)\nAnd they will so cool.\n00:00:39 - Tina Marie (profitdriversinc.com)\nChase my dogs and my dogs will chase them. But my dogs will be barking their heads up while it's happening. So it's cute. But also my brain.\n00:00:48 - Maria Gudelis (Maria Gudelis)\nYeah, I love it though.\n00:00:50 - Tina Marie (profitdriversinc.com)\nThat's like deer.\n00:00:52 - Maria Gudelis (Maria Gudelis)\nAre you kidding me? I remember when I lived in Florida, the golf course community we had deer in our backyard some mornings and beautiful to watch.\n00:00:58 - Tina Marie (profitdriversinc.com)\nBut they're actually living there. That's That's so cool. I will show you, I'm going to text you a picture of these so you can just kind of see the area.\n00:01:06 - Maria Gudelis (Maria Gudelis)\nThese are my kiddos and my daughter.\n00:01:11 - Tina Marie (profitdriversinc.com)\nI'm going grab my Turn it on. Well, that is my two youngest daughters and my, the one in the back, that's her boyfriend helping them build it. And there's also a tree house that I had built for them up there, which is huge. It's got astroturf and lights inside and papisane chairs and we can see the whole city and It doesn't take a while to get to me because I just turn you on So but so where do you live exactly? Southern Oregon Okay, and so you call it if I'm a falls. It's a dinky little Redneck town is what it is a hillbilly place, and I can't wait to leave but I had babies here, so Years and and so do you have like a big backyard so that though? It's not very big actually so we were resting for a long time after I got divorced I basically found the safest place I could as fast as I could and then they sold it and I didn't get much notice So I had two months to find Finance and close our house Which is that almost snow time. And the criteria primarily was be in our church ward and in our same school district.\n00:03:07 - Maria Gudelis (Maria Gudelis)\nSo that limited it tremendously.\n00:03:11 - Tina Marie (profitdriversinc.com)\nBut it was a beautiful house and it was brand new. So nobody's lived in it. And it's on a hill, which is crazy in the winter because we get a lot of snow. But my kids went from playing outside and playing basketball all the time to day stops playing outside immediately. only moved the block away. But because of the steepness of the hill, these lazy kiddos would not walk up it. So they stopped playing. There's no neighbors that talk and visit. And it's beautiful, but it's just I need them to be where they're engaging with people more and okay, pros and cons to everything.\n00:03:53 - Maria Gudelis (Maria Gudelis)\nYeah, yeah. So this one they're building.\n00:03:55 - Tina Marie (profitdriversinc.com)\nWhat are they building in this picture? That's a gazebo.\n00:03:58 - Maria Gudelis (Maria Gudelis)\nSo it's going to be it's\n00:04:00 - Tina Marie (profitdriversinc.com)\ngoing to be, see if I can find a picture to show you what it's going to be, because I also have a really nice couch that goes outside, but the pine tree just keeps dripping sap on it. Well, it would if I didn't keep it covered all the time, but because I keep it covered all the time, nobody wants to deal with the cover and take it off. so this has netting on it. We also have a smoker grill out there, but this is what they're building.\n00:04:29 - Maria Gudelis (Maria Gudelis)\nOh, it's going to be gorgeous idea.\n00:04:32 - Tina Marie (profitdriversinc.com)\nI already have the lights and everything.\n00:04:34 - Maria Gudelis (Maria Gudelis)\nCool.\n00:04:35 - Tina Marie (profitdriversinc.com)\nThe fairy lights. Yes.\n00:04:37 - Maria Gudelis (Maria Gudelis)\nAnd I bought this big like wicker egg chair that is. seen those.\n00:04:42 - Tina Marie (profitdriversinc.com)\nYeah. Yeah. So making our, I'm a, I'm a homemaker. That's my money goes to home and family and traveling.\n00:04:51 - Maria Gudelis (Maria Gudelis)\nThat's it. I love it. Yeah. We redid our whole backyard last year to want to make it look like an English magical garden. So we have that we we might still. We'll do the gazebo. We said no at first when the designer suggested it. But just because it's mostly evening when I want to be out there.\n00:05:08 - Tina Marie (profitdriversinc.com)\nRight. Come here. Come here. Come here.\n00:05:15 - Maria Gudelis (Maria Gudelis)\nthat dear.\n00:05:17 - Tina Marie (profitdriversinc.com)\nDon't say hi.\n00:05:20 - Maria Gudelis (Maria Gudelis)\nOh, cute.\n00:05:26 - Tina Marie (profitdriversinc.com)\nThat's my that's my Baha'nies boy. Okay.\n00:05:30 - Maria Gudelis (Maria Gudelis)\nEnglish, English garden.\n00:05:32 - Tina Marie (profitdriversinc.com)\nYeah. I saw picture with your mom or a video. She was smelling her roses and it looked so peaceful and nice back there.\n00:05:42 - Maria Gudelis (Maria Gudelis)\nIt is. Yeah. We're in a really small town here too in Canada. yeah, it's nice. And my mom's backyard. Actually, I worked from her house yesterday afternoon and she was just cute thing because like she goes to take a nap in the afternoon and then and it was really bad rain. Like we've had flooding here and everything. But it. So you're not at about three o'clock yesterday, all of a sudden five o'clock, she comes down and her bathing suit like, what are you doing? It's five o'clock and she goes, I'm going for a swim. I'm tired of being inside the house all day. know, I'm like, Mom, you have more energy than me.\n00:06:13 - Tina Marie (profitdriversinc.com)\nyou're amazing. It's the naps, Maria.\n00:06:16 - Maria Gudelis (Maria Gudelis)\npowerful. It must be because I was just amazed. was just like, here she comes. she's 88 years old and she just, yeah, come down down and get her bathing suit and just goes and swims, jumps in the pool. I'm like, Oh my God. And then she's like, how come you don't have bathing suit here? So I know, you know what? I'm going to go buy second one and just keep it there. Cause I probably would have joined her, right?\n00:06:37 - Tina Marie (profitdriversinc.com)\nThat's what I told my friend to do. Cause I have a friend and she comes in Queens for me on Friday because she's amazing and an organizer and so smart. Anyway, I talked her into it and pay her good, but I'm like, I'm swimming with me. yeah, yeah, like that water sunshine. I don't need a lot else.\n00:06:54 - Maria Gudelis (Maria Gudelis)\nYeah. know, that's right.\n00:06:58 - Tina Marie (profitdriversinc.com)\nYeah. I've been excited about this. I tried to be productive. I'm telling you, the beginning of my existence is not having people to work with. It didn't used to be a problem for me, but the older I get, the more it gets like that. I think part of it also is after getting into this transitionary phase, I really feel my emotions coming on, I'm annoyed by it. But since my older girls have moved out and I haven't had the chaos at home. And the energy of all these people, because I left the workplace, that was difficult. Then the kids got bigger, know, I had four of them. And so that filled me up. But now they're gone most of time. The two are the two oldest are gone all the time and the two youngest are gone most of the time. And so I wasn't aware of how much I was feeding off of their energy, even when they weren't in the room.\n00:08:00 - Maria Gudelis (Maria Gudelis)\nGot it. Got it.\n00:08:04 - Tina Marie (profitdriversinc.com)\nIt's annoying. I'm not really a cry baby, but like my emotions are I worked so hard to not suppress them anymore.\n00:08:16 - Maria Gudelis (Maria Gudelis)\nYeah, I purposely let them be free, but it's really annoying when it's this one.\n00:08:21 - Tina Marie (profitdriversinc.com)\nAnd I'll cry when I'm mad. I'll cry when I'm happy.\n00:08:24 - Maria Gudelis (Maria Gudelis)\nI'll cry when away.\n00:08:31 - Tina Marie (profitdriversinc.com)\nSo like, I've got to figure out. I don't have enough work to hire somebody regularly. And I'm like, if I just get one more client, I'll just pay somebody just to sit there with me.\n00:08:43 - Maria Gudelis (Maria Gudelis)\nBut I need riffing.\n00:08:45 - Tina Marie (profitdriversinc.com)\nI need somebody to sit there and hammer things out. And I've never needed that before, because I had energy around me. I didn't know that I was literally drawing energy from their presence, even just being in the house. But I'm very conscious of but now because I noticed when I'm productive, it's when they're here and they're busy doing stuff, even if we're not together, I'm like, I can do stuff. They'll be gone all week long. And I'm like, I'm gonna get so much stuff done, get nothing done. The second they get home, like, boop, boop, boop, boop.\n00:09:15 - Maria Gudelis (Maria Gudelis)\nI'm like, interesting. Yeah, so that's where I've been, like I'm not really not getting a lot done, but I did work with chat GBT last night.\n00:09:25 - Tina Marie (profitdriversinc.com)\nI get these little spurts where something pops to my brain and I will capture it. But that's basically as productive as it gets. I won't sit down and do things. But because you asked me, let me go to my notes here. to be crying, whatever. me look somewhere from my face, stop the leap. What are you, what's that? There's a child. Anyway, so talking about a welcome video, you said to think about video training and structure. so what I was thinking, Let me close this, is that, sorry, I'm not on my normal computer, I'm on my laptop, so I have to kind of like organize everything better for this to crank drive minutes. So, think about video training and structure, and so, I was thinking about this, and I think that no matter what entry point, somebody comes in with me, there are, there are going to be some key principles that I want them to understand before we go forward, because I want them to complete whatever they came here for, because it's always their time otherwise. And so, the thing that I know, wow, that was, sorry, okay, the thing that I know is that, in order for us to do things, we have to be committed to it, so we have to buy into it. Otherwise, it's just a momentary fluke, you know, they're in the moment, like how many times Time is your brain committed to something and your 10 minutes later is like, I'm not the same person.\n00:11:05 - Maria Gudelis (Maria Gudelis)\nWe're not doing that. Yeah.\n00:11:08 - Tina Marie (profitdriversinc.com)\nSo, but if I get buy-in, I kind of get buy-in to the spirit, not just the energy of that moment. So, I think in the beginning, I want to tell them when they get there, okay, so and so you sign up for this, whether it's paid or free, whatever it is that we're doing. And the reason that you did it is because there's a result that you want. And there's a result that you want because there's something missing that you don't have or there's something present that you don't want or both. Okay. So, here's how we're going to get it, but let me explain to you why working with me and going through what I'm teaching you is a little bit different. I'm going to explain to you leverage. And I'm going to explain it very quickly, explain what a lever is, and explain how it's doing working you. that's almost impossible making it very simple by applying pressure to a device, a device being a system, a structure, a process, whatever. But I'm actually going to have like a little picture or maybe a jiff that shows a very simple lever, a stick, a rock, a heavy thing, and they're like, you can't move the rock and then you push pressure on the lever, boom, the rock goes up. That's leverage. Most people are not ever thinking about leverage. And if they are thinking about it, it's not constantly, it's not persistently, it's not intentionally. Because everything that I do is leveraged, always looking to increase my leverage. I'm always, people talk about working smarter, not harder, but how do you do it? It's levers. It is what devices can you use that gets more from less. So I want to teach that to them very quickly. Like we just cover that maybe two minutes, but they should be engaged in it. Most of their brain. are going to be like, you were listening, they're probably going to be listening, like, I can get more from less. And you're telling me how people always tell me I should, but they don't tell me how.\n00:13:09 - Maria Gudelis (Maria Gudelis)\nYeah, yeah.\n00:13:11 - Tina Marie (profitdriversinc.com)\nOr why it's simple or why it can happen. So they just learn something new. first few seconds that they're there with me.\n00:13:20 - Maria Gudelis (Maria Gudelis)\nOkay.\n00:13:22 - Tina Marie (profitdriversinc.com)\nThe next thing is I'm going to tell them I need you to consider energy. This is a resource that we all have. But as you know, it fluctuates. It's sometimes unreliable. It's sometimes not there when you need it to be. But most people think about energy retroactively. I want them to think of it proactively. I am always thinking about energy. I am thinking about tomorrow's energy today. And I'm doing everything I can to maximize today's energy and tomorrow's energy and making my choices consciously so that I have sufficient, if not, plenty of energy to be able to do all the things that are most important to me. And then the next thing I'll tell them about priorities because how do I have energy for the things that are most important to me if I have it consciously and intentionally chosen what is most important to me. So, so-and-so name, we're going to go through an exercise, a series of exercises that are very quick, that are very succinct like the things that I just explained to you that are going to help you sort and filter the current activities that you have so that you can learn how to prioritize them and so that you can learn how to leverage your time to get the most out of it in the least amount of effort as well as maximize your energy. And this might seem like a big ask and that it's a lot to do but what I can tell you is and I promise you that if you will spend whatever time it takes to get to this. Some people can get through it in 10 minutes. Some people take, you know, two hours. But if you take the time to go through and organize these, to complete this task because I don't want to overwhelm them with describing it yet, then I guarantee you, you're going to have a shift in the way that you spend your time and the way that you spend your energy and you will think about it differently forever from this point on. But when you think about it differently, it's going to be so clear in your mind about how you can do differently. when you, here's the thing, if you want to be different, you have to do something different. But if you want that different to be good and strategic, then the difference that you do has to be good and strategic. And I'm going to tell you, without knowing your business, without being over your shoulder, I'm going to show you how you can custom tailor, not according to what I I think is important, but what is important to you, your activities so that you get more from less of your time and so that you have more energy and more peace while you're doing your activities, your work activities, business, whatever. I'll improve that script a little bit, but basically that's it and then send them through the exercise and then have a closing one. Like, okay, this is not, so first of all, I want you to pause for a minute and I want you to ponder and reflect on what did you experience? What was your aha moment? I would like you to write down your ahas. What were your epiphanies? did you notice that maybe you didn't notice before? What did you notice about how you should not be spending your time or how you should be spending your time? What did you notice about energy and what could be altered and improved? Now what we're gonna do is go through and apply this. I want you to do, sort your activities according to, you know, what we just did, and then I want you to spend the next 30 days operating with this new awareness. But what I want you to do again in 30 days, and maybe you're not an overachiever and maybe you want to do it in 90 days, but you want to come back to this activity soon, and what you want to do is the same activity. You want to take stock again of where your time is going, how it's impacting your energy, how it's impacting your profits, because now they've had it all explained to them that it's energy profits, time, all this stuff that they're looking at. And ask yourself, because now you're a new person, you're a new person tomorrow, you're a new person 30 days from now, you're a new person 90 days from now, and I want you to go back through this activity and go, is there something else I'm not paying attention to that I'm not aware of? And what I can promise you is that you will have changed, you will have a new epiphany So if you continue to do this, this is called an iteration, we make a new change, we make a new improvement, and if you continually do that, and maybe it's not every 30 days, maybe sometimes it's every three months, and maybe one day it's six months later, and maybe life got crazy and it's a year later. But thing about this is that I'm going to teach you timeless principles. You can go back and apply anything I'll ever teach you, and every time you apply it, you will have an improvement, because you will have changed in your awareness and understanding will have increased, and so your ability to apply the timeless principle will improve the results. So it doesn't matter, if you're really consistent about doing it, if you're more consistent, you get better results, but every time you do it, you will get good results.\n00:18:56 - Maria Gudelis (Maria Gudelis)\nOkay, so, so Breaking that out. I I started taking notes here. So so video ones about leverage video to energy and priorities to shift To shift you away like how you spend time how you think about your time And you're gonna kind of have them do exercises in that video too during video too By the way, like it everything you just said first of all Overall summary, but I went into like okay.\n00:19:23 - Tina Marie (profitdriversinc.com)\nLet's let's create this mode. Okay mechanical mode.\n00:19:25 - Maria Gudelis (Maria Gudelis)\nget it. I'm good Yeah, yeah. so so yeah, like just real quick Rather than just drawing. I just want to start this little document. So Energy and and here you'll you'll do also talk about yourself and success stories, right? Okay our results So energy and priorities shift away, okay, so and then come back in three days since activity repeat Take stock where time is going how it's impacting your problems. It's all this in video too and the exercises.\n00:20:00 - Tina Marie (profitdriversinc.com)\nSo I didn't break these up. What we could do is I could just make whatever comes out and then we cut it if cutting is needed. But what I was imagining is the leverage energy and priorities is all in the welcome video because all of that is a preface to what we're about to do.\n00:20:20 - Maria Gudelis (Maria Gudelis)\nAnd it's very short. I cover it in less than five minutes.\n00:20:24 - Tina Marie (profitdriversinc.com)\nAnd it could be broken into chapters or it could be broken into short of videos. But I really do think it needs to be a contained thing because this is the before you start you need to have this. It's a micro lesson.\n00:20:42 - Maria Gudelis (Maria Gudelis)\nFive minutes is still very short.\n00:20:44 - Tina Marie (profitdriversinc.com)\nBut it is a timeless lesson in and of itself. Leverage, energy priorities, and learning how to maximize those and also the concept of persistence and consistency. which are not the same thing. Persistence is how energetically you're at it, right? drive for it. Consistence is frequency. they're both separate elements, but if they're both present, those are productivity amplifiers and magnifiers and multipliers. So that's what makes it leveraged also when there's persistence behind it.\n00:21:32 - Maria Gudelis (Maria Gudelis)\nPersistence is a leverage.\n00:21:34 - Tina Marie (profitdriversinc.com)\nConsistency is a lever. So, but these are not, this is not how people are thinking. Most people don't think this way, which is why when I get the new clients I've been getting are attorneys and doctors and they're paying me a thousand dollars an hour and their minds are blown. And so like I, in my point, is not anything. It's just that these are some of them are Ivy League and They're still not thinking like this. My point is that this is not, people aren't trained this way, but once they have the understanding, these are not difficult concepts and these people are not too stupid to understand this. It is, it's just not taught and given. And so anyway, anybody could apply it to any type of business, any type of activity, any type of stewardship and they will be better, they could be a soccer coach and this would help them. This would help them. You know what I mean? Like any stewardship that you have, leaders said, this is how I think I'm going to be arrogant, but I'm probably arrogant.\n00:22:40 - Maria Gudelis (Maria Gudelis)\nNo, I'm sure it would help a lot. I guess the thing I'm thinking in my mind is just, yeah, let's get the training done and out there and start having people go through it to get the more testimonials and stuff for it.\n00:22:56 - Tina Marie (profitdriversinc.com)\nYou know, it's just sitting down and getting it done, but I need to just sit down and get it done. Today. It'd be a good day. I just I need to do day. You like just give me do they say Tina? need you to have X done by X and be aggressive about it because I could do it. I need I need accountability. need help. Please.\n00:23:12 - Maria Gudelis (Maria Gudelis)\nYeah.\n00:23:13 - Tina Marie (profitdriversinc.com)\nOkay.\n00:23:14 - Maria Gudelis (Maria Gudelis)\nYeah. So so two questions. Yeah, we can give you deadline is and the first question is is in one week good enough like by Tuesday next week.\n00:23:24 - Tina Marie (profitdriversinc.com)\nOkay. Yeah.\n00:23:26 - Maria Gudelis (Maria Gudelis)\nBecause it should take a total of like four hours or less. Like it could be one hour. But I know myself sometimes it condense 60 minutes of concepts into a five minute video more valuable than just blabbing away for 60 minutes.\n00:23:39 - Tina Marie (profitdriversinc.com)\nNo, I don't mean think it'll be an hour.\n00:23:41 - Maria Gudelis (Maria Gudelis)\nI already have a video for this. Actually, I just want to make it for it's way better now. So it's all years ago and it was like 20 minutes. So let's have a deadline of a week from Tuesday. Yep. Oh, Friday. Okay.\n00:23:53 - Tina Marie (profitdriversinc.com)\nSo Friday. Awesome.\n00:23:55 - Maria Gudelis (Maria Gudelis)\nI could have it done by tomorrow.\n00:23:56 - Tina Marie (profitdriversinc.com)\nOkay. But I won't push myself.\n00:24:00 - Maria Gudelis (Maria Gudelis)\nLike I have What's today Tuesday? Yeah, yeah, and the second question is for you to get this done will be better, would it be better for us to just do a working session where I go. Okay, go create video one right now and let's come back in half an hour. Okay, let's do that. So, so, yeah, go create video one right now and then let's reconvene right now.\n00:24:26 - Tina Marie (profitdriversinc.com)\nIt's Well, normally that would be good today because of the work situation.\n00:24:33 - Maria Gudelis (Maria Gudelis)\nGotcha.\n00:24:34 - Tina Marie (profitdriversinc.com)\nOkay. But but we could say, you know, create first draft today. Let's have a working session tomorrow. Like we can even wrap it up if you want to because I don't want to monopolize your time. I paid for a certain amount and I don't want to use that. Yeah.\n00:24:53 - Maria Gudelis (Maria Gudelis)\nWhat? Go ahead. Tomorrow's wide open after 12 noon my time.\n00:25:00 - Tina Marie (profitdriversinc.com)\nI mean, I didn't get around, yeah, my brain, Maria, oh, so I'm taking my daughter to girls camp tomorrow. That's early in the morning. And, um, the heck is that? Oh, so I found a co-working thing yesterday, actually. Oh, cool. And, um, it's called flow dock club, I think.\n00:25:28 - Maria Gudelis (Maria Gudelis)\nOkay.\n00:25:29 - Tina Marie (profitdriversinc.com)\nI'm going to try doing something like that.\n00:25:32 - Maria Gudelis (Maria Gudelis)\ntotally forgot about it already.\n00:25:34 - Tina Marie (profitdriversinc.com)\nBut, um, flow dot club, I'll go to the website. Yeah, go look at that.\n00:25:47 - Maria Gudelis (Maria Gudelis)\nRight. We're going to get your work done. Go get focused free. Oh, that's cool.\n00:25:53 - Tina Marie (profitdriversinc.com)\nIt seems like different people create their own sessions and their types of sessions. that they want. So this one that I chose, it's called 120 minutes, finished strong flow club with Lex, and she's like a law student or something. And so they have five minutes of briefly sharing goals with the group, 50 minutes of doing solo focus work on mute, five minutes celebrating at the end. And I was like, that's perfect.\n00:26:25 - Maria Gudelis (Maria Gudelis)\nThat's amazing. This is amazing.\n00:26:27 - Tina Marie (profitdriversinc.com)\nYeah.\n00:26:29 - Maria Gudelis (Maria Gudelis)\nI'm like, I really need that.\n00:26:31 - Tina Marie (profitdriversinc.com)\nSo.\n00:26:34 - Maria Gudelis (Maria Gudelis)\nWow.\n00:26:34 - Tina Marie (profitdriversinc.com)\nOkay.\n00:26:35 - Maria Gudelis (Maria Gudelis)\nRight. Yeah, I like it.\n00:26:38 - Tina Marie (profitdriversinc.com)\nSo, but then I meant if it was today, that'd be even better. I don't know how they're, how long they're gonna be working on this because even though, but I imagine it's gonna be a while and that's just a major brain disruptor.\n00:26:53 - Maria Gudelis (Maria Gudelis)\nOh, no, I get it. I get it.\n00:26:55 - Tina Marie (profitdriversinc.com)\nLike if I have my cleaner here and sometimes just ask me questions. Oh, I know. Yeah. Oh, you're going to hair appointment is white going with you. Are they still working? I'll pay you all. I love you. Bye. Have fun. I love her hair done. Okay, so hasn't told me what time she wants to be for girls camp tomorrow and it's 45 minutes away. So I really Don't know what my availability is until I know at least she'll be there by 10.\n00:27:42 - Maria Gudelis (Maria Gudelis)\nSo I at least we'll be back by 11 My time so noon my time is to wake up. Wait, what time did you say you're available? Yeah, like after 12 noon Um, nine a.m. So If you're available after 12 noon, your time that's three o'clock, my time that works. I go up till about five o'clock. And then Thursday, Thursday after 2.30 PM, after 11.30 AM your time.\n00:28:18 - Tina Marie (profitdriversinc.com)\nAnd I have a call with Dan from 12 to 1 on Thursdays, but then I'm done after that. So if you have that time block tomorrow at noon, and I hate to ask for a tentative time, but I'm okay if you can't do it. But if we're just reviewing what there is and then, because honestly, if I finished it, I'll just send it to you and say, here's what we thought. And so it doesn't necessarily have to be a fixed time. We can just do kind of a back and forth for the most part. And then if... I can experiment with that flow session and see if that's helpful, but basically what I need for me. Okay, so your offer super , by the way, was, you know, it takes you 18 or whatever, 180 hours. I don't remember to come up. was a structure and a format of things that need to get and things that you would extract and then this is what we've got out. So the bullet point of even that mental focus of, okay, these are the things that we need to have. So you go, you know, Tina, you go create this and then you're telling me if you tell me what you're doing, that will help me just go, okay, these are my containers.\n00:29:50 - Maria Gudelis (Maria Gudelis)\nI need to go fill them up.\n00:29:54 - Tina Marie (profitdriversinc.com)\nAnd is there, I don't even like, if I could look at the sales page, I'd go back and look at that. Epic, could you help me figure out what the structure is and what, what all I want to need to do and like, how do we get to the finished product? So I know if I create it, the, I create the training, um, then there's, there's copy and there's all these other things. What parts do you do? What parts are we doing together?\n00:30:22 - Maria Gudelis (Maria Gudelis)\nYeah.\n00:30:23 - Tina Marie (profitdriversinc.com)\nbeen a thing.\n00:30:24 - Maria Gudelis (Maria Gudelis)\nSo basically, um, I'll, and you're kind of a rare breach that you're going to So like, I kind of do the copy and, but you know, you, like, you might have something that's like stellar to write instead or add to it, et cetera. Um, less is more in these little $3 things. keep in mind it's really just a headline bullet points stuff. And then, um, I will like, uh, help put together basically, like once you have the training done, like I can kind of just take a look at it and. Just, it's more just review what you've done, like, like, again, you're kind of every that you're very experienced all this. So it's more like, is there a worksheet or success action that needs to be better or added to it to make sure there's consumption, right? my biggest thing about this is like, how many people are really going to use it? So there's that. And as far as getting it done, yeah, like I'll do the sales page and even the technical set up of it and the reality is, again, then what's the order bump going to be? So I help strategize like what the offer portfolio is. So what the order bump should be and then what is the what's after they buy the $3 thing, whether or not they buy the order bump or not, they land on either a thanks page or like upsell one page. So typically what's not in scope, obviously, is crafting up to the one upsell too for you. But typically what a lot of people do, and I even suggest that even for the, like, product boss who've made a million dollars with their $37 offer, right, is they first started with just the front end thing, and then it wasn't up. So one was just a thank you page for the first month. And then after that, they added. So what you could do on the thinking page, like we just need to figure out what what you want to send them into. So it could be, you know, book a call and into, you know, your private coaching, it could be, you know, just for now, love how creating hybrid coaching, like, I don't know what it looks like, and how much of your time I can buy, and how much of your help I could have that being able to stay focused and basically getting through the offer creation.\n00:32:46 - Tina Marie (profitdriversinc.com)\nIf I can implement this co-working so I've got, you know, something to help me do my stuff where I don't need your high level brain. But I tend to overthink offers, and copy. I do know less is more, but I also know that long copy does a really good job when somebody needs more time to be convinced so I go through a gamut of logic and I just go like that. But I also know that done is better than perfect and perfect isn't real. But because I get stuck in my head having somebody just go, well, this works. Let's try this. You know, this is what I do with my people.\n00:33:34 - Maria Gudelis (Maria Gudelis)\nWell, let's just try it. Like, you don't know. Yeah, that's kind of what that is. Just try it. That's kind of what this is because like, what I, to be honest, what I kind of foresee for you for just a cadence, I really feel this is that it'd be cool because you're also your energy so amazing live and zoom and stuff. It'd be cool if like, end result, six months from now, what's the cadence look like? That, And also from the customer journey point of view is that they come in and two ways to get access to you from cold, right? Is either buying the $3 thing and remember you're still building your list because the way the $3 thing is they opt in, right? For it before they buy so they're gonna have lot of abandoned carts Which is still on your list and that person might buy something else for me And and then you have once a month like a mid ticket like a hundred dollar maybe live workshop once a month. That's it So you're starting to build an offer portfolio from that because if the workshop is slightly different every month not the same one Those things can become you're up. So one you're up cell to see how we're kind of the case But also I'm riding on something else here. That's interesting We're in a weird and year into this also because your your love of psychology and everything and trends Um 2024 and 2025 26 we're in a weird movement moving forward because with AI and everything. Yeah, content online is a commodity like anybody like you know a 16 year old kid could pretend to be a 45 year old and say I made a million dollars and put up a bunch of content and you know whatever do okay so I think we're shifting to A that's why I like the $3 thing people want some immediate thing for cheap right to get to know you yeah low-risk yeah and they get a taste of your stuff but be also some live access to you because authenticity sells right so so in that live access you know is engineered like I'll get to the group coaching session for second but but if it's once a month like this workshop you don't have to do this for the rest of your life you actually building up all these other little products that can be sold and then also the workshops can be recorded and chair won't go up sorry and so that becomes part of the concert That library anyway, my brain will exactly exactly. And then if you're going to this, this is actually, I'm actually re visualizing my own micro offer kind of business to is is and I like this concept is that then you go to the hybrid coaching that's way more high ticket, like maybe it's a hundred bucks a week or 250 a week with you and you're only doing in your game for this to, you know, live coaching a month. But they get access to you. We can figure out what the pricing is and stuff, but because I know you're really good at that, like, because that really resonated with me last week about the value, right? so discounting. But you know, you could have some more high end kind of group container coaching that is not like open, close, open, close.\n00:36:50 - Tina Marie (profitdriversinc.com)\nIt's more like it's there.\n00:36:51 - Maria Gudelis (Maria Gudelis)\nYeah, I don't like that game and also can't talk about consistency.\n00:36:57 - Tina Marie (profitdriversinc.com)\nYeah, do that. So it's out of alignment. with my other principles to do.\n00:37:01 - Maria Gudelis (Maria Gudelis)\nYeah. Yeah. so the monthly workshops can also be built based on kind of the feedback you're getting from people. Like you could have a beta, beta founders join my, you know, XYZ program, you know, Go ahead.\n00:37:18 - Tina Marie (profitdriversinc.com)\nI was just going to say what I like about it being so low ticket filling it up is that what what is really difficult for me is low energy. So, so like when I show up to alive and I've done group training and there's hardly anybody there and everyone's quiet, it drives me nuts. I can talk to myself. I want to. I don't enjoy just hearing the sound of my voice that you wouldn't know because I don't shut up. But this energy, it's because of you. Like, because you're here and not just because a person is here, but a person with an amazing mind and personality and values, I'm feeding off of that. So if there's nobody in there or there's a couple of people or their weak energy, like I really want to be able to fill up a room.\n00:38:07 - Maria Gudelis (Maria Gudelis)\nYeah.\n00:38:08 - Tina Marie (profitdriversinc.com)\nAgain, back to I draw energy from kids that are here, and I'm not even with them. Like I'm very sensitive to energy. But also, as you've experienced, I can project it, which is why I'm never afraid of AI because no type of AI has spiritual soulful energy. And I do know that my translates through text even.\n00:38:30 - Maria Gudelis (Maria Gudelis)\nI don't know how.\n00:38:31 - Tina Marie (profitdriversinc.com)\nI don't know why, but I know that when people read my words, even just the words change them. Pure text, no images. So, you know, like I'm excited for that, but I also have to keep it in the energy container of, I can't build a framework that requires too much of my time. I need to leverage my time so that yeah, whatever access people get to me. Um, what I wanted to be is an environment where the energy is there for them to top into because even if they are aware that they're feeling the energy and being benefited by the energy, they're still being benefited by it. They don't have to. They just need to feel it and that they're getting so, so one of the things that I've learned is that where most people just kind of throw a grenade at a business or they just make you want to overhaul everything, I'm taking surgical cuts, that's what the leverage is. So anyway, but I really want to be able to find a way to work with you long term. I don't think I need a lot of your time and maybe because we were talking about the CEO of the Spicy Brain CEO being separate, but and I would love to serve you if there would be a way that you would like to use my brain, I would be happy to just share it. Find like I'm not opposed to paying obviously. Yeah. Yeah, not what I mean, but whatever it is Maria I really I want to spend more time doing this together. I would love to support you So to separate I have a habit of converging things and this needs to have its container But anyway, I get excited when you talk about it and those offers that makes logical sense to me And I'm excited because this is what I need Cool. Yeah, so so no, it's cool So yeah, and I definitely think that too because I think you could help me a lot on focusing and in your time management stuff and just You know, yeah, so so now so really what we're talking about is sort of like you're just selling Different levels of access to yourself right like is the three-dollar thing You know is like there's just your training right in the worksheets, you know, but I do have more training So just just because my work on Yeah semantics of it and logistics of it like there is definitely more training to be had that doesn't need to have access. Yeah, because I think that I can train it in video very well. And I think that my energy and my experience have been that even in video and it doesn't have to be live, the energy is still contagious. Yeah, infectious, you know, and so I do think that they're on the spectrum are more levels of it's not access to me per se, but just to the training and that there's always an upsell of access with whatever level of training they're getting. yeah. But there's definitely more modular type stuff that we can sell and package and put together. And if I do these co-working sessions, I can hammer them out because I can do the stuff in my sleep. Yeah, have the energy, just the energy. Yeah, anyway, so that help kind of Yes, we're selling access to me. Yes, there's a spectrum of it and the price point, but we also can sell just the information and the training. That's a lot of words to insert that. Sorry.\n00:42:15 - Maria Gudelis (Maria Gudelis)\nNo, no, no, I got it. That's good. good. um, yeah. So I think, I think, yeah, first up, let's just get the training part done, the $3 thing done. um, you said, your clients just get out there.\n00:42:31 - Tina Marie (profitdriversinc.com)\nYes, I'll get it out there. Okay.\n00:42:34 - Maria Gudelis (Maria Gudelis)\nAnd just, so, and just close things off. um, when are we, it's kind of potentially tomorrow, right? And you're just going to text me.\n00:42:44 - Tina Marie (profitdriversinc.com)\nSo what, how about we do this because I, I don't, um, can we schedule it for Thursday or even, um, Friday? And do just email communication back and forth, because I think if I create something, we don't need to be on a call for you to say, you know, you need to go create this, like, I just need you to be able to review it. And then to me calls are for brainstorming, clarity, you know, things that can't be done through email or vox or even I love the audio messages, because I don't like I love talking to you. I love that. If I if I can just get the stuff done, I'd rather have your time for riffing, you know, that type of thing that can't be accomplished the other way.\n00:43:39 - Maria Gudelis (Maria Gudelis)\nSo I agree.\n00:43:41 - Tina Marie (profitdriversinc.com)\nI agree. Okay. how about we don't even schedule anything yet. I'll get my work done. And then the only way to get access to your time is to get my work done.\n00:43:53 - Maria Gudelis (Maria Gudelis)\nYep. And Friday's your deadline. Okay. All right.\n00:43:58 - Tina Marie (profitdriversinc.com)\nCool. Love it.\n00:43:59 - Maria Gudelis (Maria Gudelis)\nThanks. All right.\n","contentPreview":"00:00:00 - Maria Gudelis (Maria Gudelis)\nOh, nice.\n00:00:01 - Tina Marie (profitdriversinc.com)\nYes, I'm very excited about it. But I have this people that build my deck did not build it right. And so...","processedAt":"2025-05-04T03:40:52.559Z"}