{"fileName":"Done Transcript for D&D Co & Profit Drivers - Weekly Review(10).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for D&D Co & Profit Drivers - Weekly Review(10).txt","type":"transcript","priority":"medium","content":"00:00:03 - Tina Marie (profitdriversinc.com)\nHello. You're muted.\n00:00:11 - Dan’s iPhone (danddcompany.com)\nHello.\n00:00:13 - Tina Marie (profitdriversinc.com)\nHi. I had a horrible asthma attack today, this morning. You're just on the Great Week. Oh, dude.\n00:00:26 - Dan’s iPhone (danddcompany.com)\nYou didn't know.\n00:00:29 - Tina Marie (profitdriversinc.com)\nThe crazy thing is, like, I started, like, copying and gasping. My throat was closing up, but, like, the rest of my body, my skin was, like, on fire. I've never experienced that before. So, yeah, that is fun.\n00:00:47 - Dan’s iPhone (danddcompany.com)\nYeah, it sounds like good.\n00:00:49 - Tina Marie (profitdriversinc.com)\nYep. I might call from time to time. I'm sorry. It's exhausting, but, like, my brain is fine. Um, my health is fine. Yeah, it's just like, yeah, anyway, it's wild. So, um, but I, um, my brain is fine. Not mostly. I, I have struggling a little bit still to get everything. Um, notes. Hold on. I have them.\n00:01:21 - Dan’s iPhone (danddcompany.com)\nHow are you? Um, we covered, we covered you.\n00:01:27 - Tina Marie (profitdriversinc.com)\nWe covered them. But I am really happy with my mission and getting to do that. And that's been pretty amazing.\n00:01:38 - Dan’s iPhone (danddcompany.com)\nNice.\n00:01:39 - Tina Marie (profitdriversinc.com)\nDoing this genealogy work and getting to have all these like spiritual stuff. have won't hear a quick three minute story. Maybe three. Less than. So, the work that I'm doing. So, we do, we believe that, um, have always existed, like, the Solomon, the temple of Solomon, things like that. And that we believe in proxy work for the dead, because not everybody gets to hear the gospel and be able to accept it and be able to be baptized. in temples, work is done for the dead by proxy. So somebody else does it on behalf of that person, and then they get to choose whether they accept it or not. So, and then we also do ceilings of families together. in the Bible, there's a reference to Peter having keys, and that whatsoever he seals shall on earth shall be sealed in heaven.\n00:02:41 - Dan’s iPhone (danddcompany.com)\nAnd whatsoever he loses on earth shall be loose in heaven.\n00:02:44 - Tina Marie (profitdriversinc.com)\nSo ceilings can be divorced and families can be put together forever exist in the family unit forever. So, we do genealogy work to be able to do that, that temple work for families. So that they can be sealed together so they can be found and and have that work done for them. So our church has got crazy huge genealogy like Before ancestry was there we had family tree and family church and everything Anyway, this weekend last weekend. I was doing work for family. So my assignment is really short I'm just supposed to append records of parents to children that are they were already identified, right? So it's like a this spreadsheet and Because people have most of the missionaries are really really really old and really really slow And they don't have anything else to do so they kind of me and or and they do all kinds of things and they get off task So it was given a time limit of five minutes, which I follow so I'm really doing this anyway I was trying to figure out for this dad because he had a Polish name and an American name Which name I should use because all of his records like his census records and things like that were attached to his American name, but I felt like I should use his natural born name that was on his naturalization records. Anyway, so I went off to pray for it for a minute and figure out what I should do, but when I did that, I kept seeing this flash of all these other records that I had looked at like super quickly because I fly through stuff. And I was like, I had seen what I think was potentially duplicate records, which is really common of the mom and dad. And then I went back and looked at them and they had 11 children, but only five of them were on one set of records and six of them were on another set of records. And so I was only supposed to attach one child. And I just started bawling, like bawling, sobbing, could not control it. it was like, I didn't see things. I didn't hear things, but I had this feeling of like there's all these people and they just really really wanted to be together. But in order for that to happen, everybody's records had to be fixed. The duplicates had to be fixed. They had to merge together. Names had to be correct. They had to be correct, whatever. And so I'm like, okay, I'm just going to do this. And like, it's almost like they're all hovering over my shoulder. And I'm sobbing the whole time. And then I did it and I did the last lady and I got to the last lady and she had nothing. Like she hadn't, she didn't even have enough dates to be able to go to the temple, even if she wasn't attached to her family. And so I looked her up and I'm like, well, I'm just going to go see if you have a husband. I'm going to see, make sure you have everybody once I get finished with you. And I found out that she died being the head of household. So she died living with two of her sisters. They all lived together. So it was definitely a really close family. And I had no way of knowing that. And anyway, but as soon As I got done, I felt really happy and it was just a really, I'd never had an experience like that before, and that was just kind of amazing, and with some of the things that you experienced, I thought, maybe that was...\n00:06:13 - Dan’s iPhone (danddcompany.com)\nAll right, so what you're doing is sort of like creating a record that connects the records. were like, oh, belong with each other, but you would never know that. Oh, that's interesting.\n00:06:25 - Tina Marie (profitdriversinc.com)\nbecause we have census records, social security records, new You can't go change those, so you're like, oh, I'm gonna connect, I'm connecting these thoughts. Right, so like FamilySearch and Ancestry.com, they have their person records that are created based off of the existence of those like federal records, birth records, voter registration cards, military things. Yeah, so like there's all kinds of teams of people who like read those, oh my gosh, census records, I don't know you've ever seen them, but some of them... Yes. Yes, they're terrible and the voter registration things versus like all of that stuff is hard. So there's a bunch of missionaries that just go around and they spend all their time trying to read those records and so they digitize them. And in two weeks, we got 95 years worth of the work done. Yeah, I don't even know what it was. It sounded like a motor.\n00:07:28 - Dan’s iPhone (danddcompany.com)\nI did not hear anything. I went away from my phone. Oh, don't do that, damn. I know. was like, what am I doing? So Denise's Italian citizenship project that I've been working on forever. They recently contacted me and they're like, we cannot find Margaret's birth certificate. Like, we can't find it. We don't think that's her name. I didn't know this until I didn't know this when the project started. So, Everyone in the family knew her as Margaret, but that was not her name at all. It wasn't her middle name It was none of her names her real name is immaculata Yeah, we we think her name is immaculata. I go it is I Just learned that they go. Okay, Then we can go get this record because we found that and everything else lined up But then what didn't line up was the name and And yeah, you're talking 1910 yeah, not only no, you know what I mean, and this is all in cursive.\n00:08:31 - Tina Marie (profitdriversinc.com)\nYou're like, yes Person and a lot of times they spell things phonetically, so it's wrong because they don't spell it all over the place Yeah, all over the place, right We I kept running into Joseph spelled different ways. I'm like really or the names are flip-flopped It's like a middle name Or they give the nickname and that's not actually their name.\n00:08:57 - Dan’s iPhone (danddcompany.com)\nYeah, so I'm spending with their zippy even though\n00:09:00 - Tina Marie (profitdriversinc.com)\nI got his name.\n00:09:01 - Dan’s iPhone (danddcompany.com)\nHe changed his name to Joseph. His name was never Giuseppe. But he called himself. Yeah. So in America, he became Joseph. And then someone just assumed, Oh, they probably mean Giuseppe. And it's like, nope.\n00:09:16 - Tina Marie (profitdriversinc.com)\nHis real name is like a Jessup name, which is in between them. It's not Giuseppe. It's not Joseph. It's Jessup J E S E P.\n00:09:27 - Dan’s iPhone (danddcompany.com)\nWell, that's like Denise's dad. It's like, Oh, I'm Nicholas Leduca the second. And then the son is Nicholas Leduca the third. No, you're not. Did you your dad's name was not Nicholas Leduca? Like, was it wasn't Nicholas, Joseph Leduca? That wasn't his actual name. And then I said that to me, goes, Oh, yeah, I know. I got the why are you why are you calling yourself a second? Because he wanted to look like, Okay, no one's no one's gonna stop you obviously.\n00:09:57 - Tina Marie (profitdriversinc.com)\nThat's crazy. So I'm don't\n00:10:00 - Dan’s iPhone (danddcompany.com)\nGetting 12 hours a week doing that and it has been like making me really happy Which is great because also because all these old people are so slow and are they are people Are is it like people submitted? Hey, I I need this done for me and then No, so it's a it's a genealogy Database like are you familiar with ancestry calm?\n00:10:25 - Tina Marie (profitdriversinc.com)\nYeah, you're just saying hey this person's in the church Therefore we're going to do this for them No, no, no, no, it's everybody so think of ancestry. We have a site that's just like it basically It's called family search and we have a partnership with ancestry. So Because honestly our church has probably got the most genealogists the most genealogical records like But the closest one would be ancestry, but it started with Family tree maker which was called my art church.\n00:11:03 - Dan’s iPhone (danddcompany.com)\nWell, how do we know someone? How do you know which records to work?\n00:11:07 - Tina Marie (profitdriversinc.com)\nHow do we know which records?\n00:11:09 - Dan’s iPhone (danddcompany.com)\nWhat? The work on like you're you're serving like, hey, this one needs to be done.\n00:11:14 - Tina Marie (profitdriversinc.com)\nLike, what is that? Thanks for all. Yeah. So it's first of all, it has no bearing on whether people are members of the church or not. Because the whole point is that we believe everybody in order to be in the kingdom of baptized in God's houses, immaculate in records. Eventually, everybody's stuff will be done. But anyway, so sometimes they're found just because it was attached to a whole bunch of records we got, like social security records or an even at records or military records or census records. So basically every type of document and record naturalization records, like those, like that's probably how they found out about her name. Alice Island type documents. any time we get a document, every single person just gets put in them. So then they go through and methodically attach and try to find, well, do we already have some of your family in the database? And so they go through and AI goes through. Yes. Did you know one of the biggest revenue sources in my church is patents. The church owns a ton of patents like technology. It is so fast. When we ask for a change, it can get done within hours. No corporation in the world works as fast as those.\n00:12:36 - Dan’s iPhone (danddcompany.com)\nthat's been a whole nother kind of lesson. I'm like, holy crap, this is so cool. didn't know this.\n00:12:42 - Tina Marie (profitdriversinc.com)\nI didn't know it. I did not know it. Go ahead.\n00:12:47 - Dan’s iPhone (danddcompany.com)\nWhat? How would you like, you know, the things that we don't know?\n00:12:51 - Tina Marie (profitdriversinc.com)\nWe don't know. don't know. Right. Yeah. But it's one of the things I'm fascinated with. Anyway, it was just a whole between the like, you know, I was special side because we have those conversations and then I did not know that Denise was going through all that with her family. So anyway, oh, yeah, um, close to those docs, see them. It's just funny but interesting. It is. It's just the world is cool. Family is cool. The work to figure out family, especially when so many people are being pulled apart by technology simultaneously, they're being brought together. And like that's the whole polarization. Like people are either focusing on the bad or the good, but 100% the bad and the good are happening side by side all the time.\n00:13:39 - Dan’s iPhone (danddcompany.com)\nRight. Dark and shadow. I mean, shadow left all the time.\n00:13:43 - Tina Marie (profitdriversinc.com)\nRight. Like Tina's having an asthma attack and almost nine, but also angels are visiting.\n00:13:48 - Dan’s iPhone (danddcompany.com)\nSo yeah. Yeah, I heard a quote the other day and I was like, I'll never heard of that. But they were like, it was something like the the brightest light cat. That's the largest shadow. I was like, oh, wow, that is true. Yeah, I've heard that before. true. The thought about that. So it's like, there's the dichotomy.\n00:14:08 - Tina Marie (profitdriversinc.com)\nYes, I've heard that. But I've never thought about it with the yin yang type thinking.\n00:14:14 - Dan’s iPhone (danddcompany.com)\nTotally. Right. Exactly. Which is also literally white and black. Right.\n00:14:20 - Tina Marie (profitdriversinc.com)\nthere is light inside of the dark always and always dark inside of the light. Yep.\n00:14:28 - Dan’s iPhone (danddcompany.com)\nTotally.\n00:14:29 - Tina Marie (profitdriversinc.com)\nBoop boop. and tittishy.\n00:14:33 - Dan’s iPhone (danddcompany.com)\nRight.\n00:14:34 - Tina Marie (profitdriversinc.com)\nOkay. now that we have had our whole spirituality portion of the conversation out of the way, let's go. All right. But it is the spirits that do the work. So let's do this work. Okay, let's start with another 71. So I can get an update. I'll rock it along.\n00:14:53 - Dan’s iPhone (danddcompany.com)\nI just got, I got Lucy working on my special project. Literally, I just scoped it out for him and we ended our chat. He's I've got it, but he's now doing my thing where I mentioned this months ago, right? going to create a user upon form, submit, make sure that they can. There used to be an issue years ago that I think is resolved, but I don't know where if you already had a preexisting user, like checking out with Wu was an issue. But I think that was like a early days, Wu, like, Oh, yeah. Yeah, we probably should make something for that. And they pretty sure they fixed it, I was like, just make sure that if we create a user on form, submit that user can check out without issue. Hey, we'll do the next step. I sort of sketched out the next step, which was it would be return the PGT tracking data into user meta and attach it to that user. these are on creation. If they're PGD, PGT day, which would be basically our UTMs, right?\n00:16:09 - Tina Marie (profitdriversinc.com)\nwe, oh, okay, translate them.\n00:16:11 - Dan’s iPhone (danddcompany.com)\nSo you have PGT campaign with new team campaign. But then we have some extra one for us that we lose to a different way.\n00:16:18 - Tina Marie (profitdriversinc.com)\nAnd you've explained that before, but I forgot that that's what that was. Okay.\n00:16:22 - Dan’s iPhone (danddcompany.com)\nuse user. If they become a customer, we'll get pulled into Metarick. And then when they're in Metarick, I'd be able to say, hey, what was their PGT basically lead data? what was their PGT data, which would be lead? I might haven't actually do that. I think I need to create a separation between lead UTMs, the PGT and then customer. Yeah, I'm pretty sure I'm going to do that, but first I just want to get, like, sort of the gears in place and start spinning them and go, okay, yeah, they're worth it, they'll together.\n00:17:12 - Tina Marie (profitdriversinc.com)\nWhat does PT stand for?\n00:17:14 - Dan’s iPhone (danddcompany.com)\nSo it'll stick in my head better. Performance gravity tracker.\n00:17:21 - Tina Marie (profitdriversinc.com)\nOkay.\n00:17:21 - Dan’s iPhone (danddcompany.com)\nOkay, get back here. Get back here. Wandering dogs.\n00:17:32 - Tina Marie (profitdriversinc.com)\nBellers in the .\n00:17:34 - Dan’s iPhone (danddcompany.com)\nOh, it's Bell. He's a wanderer.\n00:17:37 - Tina Marie (profitdriversinc.com)\nThat's my youngest baby's name, so. It's actually Isabelle, Isabelleona, but I call her Bell.\n00:17:46 - Dan’s iPhone (danddcompany.com)\nUm, okay, so I start calling her Bell, like it's easy, or B, with B.\n00:17:52 - Tina Marie (profitdriversinc.com)\nThat sounds like a damn thing. So then, okay, so they get pulled into my I reckon they become a customer and then you can go look at their lead data.\n00:18:03 - Dan’s iPhone (danddcompany.com)\nYeah, then I can run these custom meta reports. So what I want to get at is I think ultimately what will happen is I can attach meta lead, meta cohort, meta. Metric has purchased meta. So I can be like, okay, fill me purchases from Google, which would be, let's call last. I haven't really, I got to talk to GPT because it's not touch. They've actually done, they've done more than touch purchased, right? So it'd be like purchase attribution and lead attribution. I could be the way I go better. So I'd say, Hey, show me the purchase attribution that you have that says they purchase from Google organic. Okay, great. And then in that same view, I have their. need meta-exposed and be like, oh look, all these Google organic air quote customers really originated from Reddit or really originated from Facebook and specifically the quiz type, whatever, forms. Now that might not happen, but then I'll know. I think there will be a pattern in there somewhere. And then similarly, I'll be able to apply their cohort, right? So I've been collecting their cohort, post-purchase. So once their cohort is applied, I can then say, hey, go into the, have the meta cohort to that record too. And then I could go into meta, I can say, show me all the cohort zeros. And then look at that, look at the, all right, what was the purchase source of cohort zero? What was the lead source of a cohort zero? And start to figure out where these people are really coming from or where I think.\n00:20:00 - Tina Marie (profitdriversinc.com)\nI love that. I'm going to see it.\n00:20:05 - Dan’s iPhone (danddcompany.com)\nYeah, it's pretty dope.\n00:20:07 - Tina Marie (profitdriversinc.com)\nHow long is it going to take most you do you think or to get you that set up? And then you have to collect data.\n00:20:14 - Dan’s iPhone (danddcompany.com)\nSo, and then so once he's done. think I can go, I think I can go backwards. Oh, yeah. So I think I could. So anyone that has a user record. I'd be like anyone that's a lead and it's like you have a user right now.\n00:20:30 - Tina Marie (profitdriversinc.com)\nI mean your customer. Right.\n00:20:32 - Dan’s iPhone (danddcompany.com)\nSo in Ninja, I would say. Hey, here are all the leads here are all the customers. Okay, now with the now let's get all these leads. And then apply post like back apply their meta. And then I'd be and it'll be thousands of leads.\n00:20:55 - Tina Marie (profitdriversinc.com)\nThat would be really cool.\n00:20:57 - Dan’s iPhone (danddcompany.com)\nOkay, wait. And then that'll be it. That'll appear. better within 24 hours.\n00:21:03 - Tina Marie (profitdriversinc.com)\nWhen do you think Moshi will be done?\n00:21:06 - Dan’s iPhone (danddcompany.com)\nI don't know, because the first go around, he's like, you can't do that. I'm pretty sure I can, but I looked at that six months ago. just now, I'm just chunking it out. I'm like chunk one. Create a user from a gravity form submit. Do not change the form. If you have to change the form, you have to tell me how it needs to be changed. And I'll tell you whether not I want to do that. So like, assuming, know, and he was like, okay, so if I take the notes, form a creative user, that's what you're talking about. Do that. And then as that user try to check out and make sure nothing happens. So I assume he'll, he'll probably be done with that within a day. And then I got to think through, then I'll look at the meta, the PGT. Like I was just doing this too. I'm like, what? is the meta? I don't know what the meta nomenclature is. Like it's, I think it's under school war. might start with underscore meta, then you can put whatever you want. So then I would just figure out my naming convention and say, okay, make this PGT that maybe run that by Norio, be like, hey, we integrate this into PGT somehow? Or just kind of go dirty at first, and then loop back around, Norio, which I'll probably do actually. So then once he gets the PGT applied, has a meta on an actual lead cement. I'll make sure that she's, well, that won't show up in Metarick until they buy. Well, so once he does that, then I'll go, okay, how do we go backwards? That'll be a bit of a, that's going to be a bit of a lift because there's no way to export all the gravity forms in one go. demanding they dump them all and merge them, it's going to be a bit of a pain in this. But it's doable.\n00:23:09 - Tina Marie (profitdriversinc.com)\nWell, and what we've learned is the data is worth the effort.\n00:23:13 - Dan’s iPhone (danddcompany.com)\nOh, yeah, totally.\n00:23:17 - Tina Marie (profitdriversinc.com)\nGetting the good clear data is the way that you spank everybody else's .\n00:23:23 - Dan’s iPhone (danddcompany.com)\nYeah, I mean, I don't know the answer to this, but I do know if I answer this, then I think I can do it.\n00:23:32 - Tina Marie (profitdriversinc.com)\ncan skill with it. I want to show you something that we figured out, and you may not think that this is very cool, but I think that it's very cool. have to go. Are you, are you on a mobile device? I am now, outside with the dogs. They are very interested in this dude on the roof next door. Well, it doesn't look good on mobile, and I think even if I screen share, it's not, it's going to look the same way, but I'm going to show you. Anyway, turn it sideways. Please. Oh, that was weird. Oh, she must be playing with it because it does not look good on desktop now.\n00:24:10 - Dan’s iPhone (danddcompany.com)\nDang it.\n00:24:13 - Tina Marie (profitdriversinc.com)\nI'll never mind.\n00:24:14 - Dan’s iPhone (danddcompany.com)\nI'll show you later.\n00:24:15 - Tina Marie (profitdriversinc.com)\nSo I figured out, though, actually, I'll show you on James Wedmore because that's where I found it. Um, to do work with me. Okay, so where's my zoom to screen share? No, that's a bit. I did not know with this. There is sure. Let me know when you see this wavy movie line.\n00:24:52 - Dan’s iPhone (danddcompany.com)\nWhat? I see the song.\n00:24:56 - Tina Marie (profitdriversinc.com)\nYou don't see the wavy movie line?\n00:24:58 - Dan’s iPhone (danddcompany.com)\nOh, I do.\n00:24:59 - Tina Marie (profitdriversinc.com)\nOkay. So, um, well, first of all, I was looking at different sites and I was trying to find something, um, I wanted to model for, because it's easier for me to get somebody to build what I want if I can give them a visual example of this.\n00:25:15 - Dan’s iPhone (danddcompany.com)\nSo, what I mean by inspiration, Tina, very familiar with my level. Yes.\n00:25:19 - Tina Marie (profitdriversinc.com)\nSo, but what I like, first of all, is that I know that James attracts a lot of the people that, that I resonate with me, I should say in that way, that resonate with me. Um, I also think that he's very good at getting his message across and he's very just non-dushy, I think he attracts a lot of females, his vibe is just not not the whole, like, in your breaking up content so that it flows and you get, you know, like these big, big words, they're bright colors. It definitely seems to be attracting female colors. Ryan Lee does the same thing. And so, but there's, if I go to his home page though, watch because there's movement everywhere, which with 80D people really, which especially the women, it really captures it. So anyway, I was doing that, but this was really cool to me. I love that.\n00:26:32 - Dan’s iPhone (danddcompany.com)\nThis would be updated. Hey, buddy, this is such an own page.\n00:26:38 - Tina Marie (profitdriversinc.com)\nWait, what was it?\n00:26:40 - Dan’s iPhone (danddcompany.com)\nOn his home page is the chunk missing.\n00:26:42 - Tina Marie (profitdriversinc.com)\nIt says this, which it needs to be updated. Oh, I didn't even see it. That's hilarious. So, I was like, I've never seen this before. How does somebody do that as an image? And so, if I gave it to chat TPT, I'm like, what is that? Can you give me the code for it? Because we were looking at it. I was like, it said SBC. Yeah, but what's the image? It's not an image. This SVG is created through code. This weight is just code. And I had never seen that before. anyway, so I have not all browser support them yet, but they're pretty close. Yeah, and the way that we'll just do something else or nothing. Right. So she had replicated it here on my site for me. But then I said, I needed I wanted it to look. Oh, I told her to change play around with the shapes to see what other shapes that we could do. And and that looks terrible. But she did have it replicated completely. And like, this is the element or theme. Oh, yeah, I can tell. Yeah.\n00:27:46 - Dan’s iPhone (danddcompany.com)\nSo those his. Oh, is that what that is? We were in the bet money.\n00:27:52 - Tina Marie (profitdriversinc.com)\nThat's what I was guessing.\n00:27:54 - Dan’s iPhone (danddcompany.com)\nAnd so anyway, that's what I was looking for is trying to kind of do something like that. Oh, there's like a browser extension that will it's like a WordPress browser extension that will tell you all the deets of a WordPress site when you're on it.\n00:28:09 - Tina Marie (profitdriversinc.com)\nSo they'll be like theme.\n00:28:11 - Dan’s iPhone (danddcompany.com)\nWhat's it called?\n00:28:12 - Tina Marie (profitdriversinc.com)\nYou know, I forget.\n00:28:14 - Dan’s iPhone (danddcompany.com)\nI used to use it years ago.\n00:28:17 - Tina Marie (profitdriversinc.com)\nIs it built with?\n00:28:19 - Dan’s iPhone (danddcompany.com)\nNo, you can use that. I don't think they you the theme.\n00:28:22 - Tina Marie (profitdriversinc.com)\nuse that for just like, Hey, what's I just use that like yesterday for somebody His book like it was built on kajabi. That's why I was like, I don't Yeah, cuz it is from and it's probably WordPress and as courses are probably kajabi. Oh So the kajabi code is only on there because it's tracking or isn't using it to log in or wherever. Yeah. Oh Well, anyway, I just thought I don't think kajabi does all the fly in stuff with that blueberry element or Yeah, I that's what was really surprising to me. Oh, so then I went to see think if it because I was, you know, you know, I've been looking around for the thing to use and buddy boss was just too complicated for me to figure out on my own, which I don't need to do on my now own now because I got to go. But I went to, so I was just playing with all of these things, got all these accounts, I was like, what happens with this. So think if I gave it a paragraph that had all of my chapters and what they were about and, but it wasn't, it wasn't very long. And it's a I created all of the chapters in a module for me with a sales page, landing page, and an opt-in page within minutes.\n00:29:43 - Dan’s iPhone (danddcompany.com)\nI got catchy PT. This is the first time I've ever been successful with it. So I started, I lost the song. So I've written this song, I had like, so I just sort of, I just sort of finished the song. Now I'm going to take it into full production. And then but while I was writing this one I had this other one in my head I was like I gotta go find that one. I'm trying to figure out which one to do next and I lost it. It wasn't in my phone. It wasn't in my G-Drive. I'm like, oh my god I cannot believe I lost this and what it was was just me mumble singing over a guitar riff but I Separately what I do is like I'll do the mumble singing I'll come up with the melody or whatever and then I'll write all the lyrics in notes and in my notes I'm not doing whatever and Then I'll go back and figure out the riff and you know when I go start record it So this I had done all that I had like this version of me play like what I'll do is I'll take a Clip like it's a clip of me playing with someone or whatever. I'll go. Oh, that's it. That's that's the guitar part I'm gonna write over that and then I'll mumble sing over that and now So I'll have like the original just us playing guitar then I'll maybe I'll edit that down and then I'll Mumble saying over that into my phone and then I'll go set. I'll be in notes. I'll listen to it All right lyrics and then I'll be driving around like singing it in my head and I'll go. I'm gonna go right that lyric But I never go back to or I rarely go back to that mumble singing thing, right? So that one I was like Oh, I'm gonna go find that and I could not find I literally spent six hours looking And I couldn't find it. I was like son of a So I was convinced it was in Slack I'm like, I must have shared it because I know that I liked it. So if I liked it, I would have shared it. So I'm going through six years of slack Trying not to Trying not to waste time by making and you can't search so whenever I'm literally scrolling through So I'm scrolling through And I'm about to give up and then yesterday. So I'm going through I did over three different days so like two hours at a time and yesterday I I'm going through and I'm listening to these various things that are in there. There's tons of that I've put into slack and I find this one guitar part. I was like, oh, yeah, I remember that. I never did anything with that. I'm listening to it. And out of nowhere, this is what's so interesting about this stuff. Out of nowhere, I start mumble singing over it. Never did it before. And then I just, for no reason, sing Ophelia. And like this sort of like, it's almost, it's basically the chorus and I go, oh, that, I'm going to record that really quick. Right? then I do the thing. I play the guitar part and then I mumble singing over it and I record it onto another device and then I'm like, oh, that's pretty good. I think I did that yesterday. then I went back and I listened to it or I did that two days ago and then I went back and I think I came up with it and I just remembered it. And I like, I really got to record that. So then I recorded it. Yesterday and I was listening to it. It's like oh, that's kind of interesting and I'm like What the hell is Ophelia right like Ophelia's from something right so I go to the church and I'm like I'm like who's Ophelia? Thanks. yeah, she's like from Hamlet. I got all here. Right and I asked you I go what if I wanted to oh no it said Ophelia was this character In her the Ark of her story was told through songs her songs and Hamlet and I'm like, I don't really remember that I go what are Ophelia's songs and it lists these four songs and like chunks of the Text and I go that's interesting and in my mind Right, but in my mind I was singing To her not about her So because the first lines I was mumble singing was like I was singing to her So I'm reading the synopsis and I was like oh, this is really interesting. Oh It's like, hey, what if I wanted to write a song about Ophelia where I'm singing to her about, you know, her arc or her stories, and it goes, oh, well, you could do it like this, and I you not. What it spit out, I was like, oh my god, that's a great idea. And then I started pulling its words, and I literally wrote pretty much the whole song in like 10 minutes. And I was like, finally chanting, but again, right, it's the person prompting it. It's like, it's not just, it's not going to just write a song. If you ask it to write a song about Ophelia, it would suck. time I've asked it to help with lyrics before, it's been horrible.\n00:34:40 - Tina Marie (profitdriversinc.com)\nBut it's also the fact that there's a huge database around. So it didn't just get to tap into that story. It got to tap into Shakespeare, like a much bigger library. So, like, if you had asked about Sarah, like, what is there a depth about Sarah, there may be something, but my point is, is that the sort of course of the information was deep.\n00:35:02 - Dan’s iPhone (danddcompany.com)\nYeah, exactly. There's a lot of people writing about that. Right. Good point.\n00:35:08 - Tina Marie (profitdriversinc.com)\nYeah, but even more than that, Shakespeare stuff himself.\n00:35:13 - Dan’s iPhone (danddcompany.com)\nYeah, totally.\n00:35:14 - Tina Marie (profitdriversinc.com)\nYeah, he wrote over 100 plays. Yeah, and his all his information has been broken down. Yeah, that's that. So I had today based off of something I saw from someone. And I was like, Oh, a reference point that that that uses a lot of because like I use a lot of analogies and people like, wow, you should write that down. I've never heard that before. then like, Deepak Chopra and a couple other people. The right so minor different. I don't talk about the universe to talk about God. But every now and then, like, I use these analogies. And I'm like, if I could find a way to blend what it already knows about that. with my own philosophies plus because there's there's way more of his words written than I have written to train with. But actually what I really want to do is go get somebody to go through like all of my fathom recordings and find just my stuff, copy and paste my stuff like not client stuff, but because because fathom will say this is Tina. And then use that because then that's a huge library that that I don't have created. So that would be awesome. But yeah, that's amazing. Hold on second. She may be to go. And my daughter's texting. Who is that? She's got to go like over a mountain. That's what we call it over the mountain to this place called Metford and pick up a car door from a junkyard because she's going to replace her own car door.\n00:36:57 - Dan’s iPhone (danddcompany.com)\nThat's my kid.\n00:36:58 - Tina Marie (profitdriversinc.com)\nShe's also going to beauty school. She does tattoo. She does like wild makeup and my kids. I think they're awesome You try me, but they're awesome Okay, um, all of the stuff is gonna be so cool. Oh How did we even get to the music stuff from Mushi FBT Oh, yeah, so just the pace of this evolution like here's what I think is going to happen is these Small solopreneur type people which you're not that anymore, but but the people like you and I that have super creative brains and Have a difficult time sometimes it's financially But sometimes it's just because you can't get somebody to get your vision which has been your biggest issue from the beginning We can train because you can train AI faster, right when it's good But but we're learning how fast it's going to get good like it's going to pull away, like your ability to get the bigger. Did I lose you? Hello. Oh, you're muted. You're not muted anymore. Can you hear me? I don't hear you, but I do hear like something.\n00:38:35 - Dan’s iPhone (danddcompany.com)\nI don't don't hear you. What is happening? Uh, yeah, missed all that. Sorry.\n00:38:43 - Tina Marie (profitdriversinc.com)\nOh, what happened?\n00:38:46 - Dan’s iPhone (danddcompany.com)\nLet me see. Couldn't get my vision.\n00:38:48 - Tina Marie (profitdriversinc.com)\nI agree. So, but the way that AI is evolving, your ability to be able to train it and train it quickly and be able to get some of the things done that you couldn't, just because you go. to it and it will give the instructions to the lay people, right, the other people that you need it to. But what I'm thinking is that this is going to be, so we've watched these different stages of technology and how it's helped small people, small businesses pull hard and fast up through, you know, to compete with bigger, like your goal of getting market share, increased market share, those types of things for somebody that thinks so differently, like you do, like I do. I think that there's, this is going to be like a catapult for people that are using it and I think that that's going to be fascinating because I think that this, I don't think it's the disruptor people think it's going to be en masse, like on a big scale, because most people last week was.\n00:39:54 - Dan’s iPhone (danddcompany.com)\nOh yeah? Yeah, so that a big part of that was tied to the reporting on and how the AI companies are not profitable, none of them are profitable, and they're not gonna be. So reality, right? we're so steep, and we're not even steeped in it, but we are, like, compared to the lay person. We're like, it's like, we're in the deep end. But yeah, all these, they're not making any money. No one's paying for it. I am. You are, but we're, we're unique. Right. You know, who's, you know, who's not paying for it? My neighbor on that side, my neighbor on that side, my neighbor over there, my neighbor over there, none of them. No one I work with is paying for it, right? No one I work with directly here is paying for it. Not one person. They asked me to pay for it.\n00:40:43 - Tina Marie (profitdriversinc.com)\nI was like, yeah, and we're sharing an account. Hey, that's $20.\n00:40:46 - Dan’s iPhone (danddcompany.com)\nOh my gosh.\n00:40:49 - Tina Marie (profitdriversinc.com)\nThat's crazy. All my clients have it, but I have almost no clients now because I fired people and yeah, that's a whole nother conversation actually. Um, yeah. So actually, I was thinking about asking a question, but the question is just on, could I tell you things that you never repeat to anybody? They're not inappropriate or anything like that. Or like, pretty much, I don't ever talk to anybody about what we talk about. Well, one of them is related to somebody I never ever speak about.\n00:41:25 - Dan’s iPhone (danddcompany.com)\nOkay. I don't really matter who it is.\n00:41:30 - Tina Marie (profitdriversinc.com)\nYeah. Well, I'm like, I'm like a bald tina, like a bald. Except in case we like you just get, you just get annoyed and like you say things and I still think that you're a bald. just like, I would need you to be a mindful vault about that. Because the only reason I would hold on. Uh, uh, you, it's been a long time since he's posted, but have you seen any of the posts related to any government entities?\n00:42:11 - Dan’s iPhone (danddcompany.com)\nOh, we're talking about Facebook.\n00:42:14 - Tina Marie (profitdriversinc.com)\nYes.\n00:42:14 - Dan’s iPhone (danddcompany.com)\nOh, yeah. No.\n00:42:16 - Tina Marie (profitdriversinc.com)\nWell, he's made a couple of, um, references to it. Uh, SCC, FTC.\n00:42:27 - Dan’s iPhone (danddcompany.com)\nOh, yeah.\n00:42:28 - Tina Marie (profitdriversinc.com)\nbut, uh, I, I've literally barely done those. So, well, it's been a long time since he said it. And most people, I don't think pay attention to it.\n00:42:37 - Dan’s iPhone (danddcompany.com)\nUnless they've had to deal with those entities before.\n00:42:41 - Tina Marie (profitdriversinc.com)\nSure. But he's been talking about it for years. You know what they can do to people when they're investigating, right? Uh, Yes. So that situation has been going on for like a decade. And, um, geez. But indeed, I get emotional. Sorry. It's really annoying.\n00:43:05 - Dan’s iPhone (danddcompany.com)\nOh, please. Okay. That works.\n00:43:22 - Tina Marie (profitdriversinc.com)\nThey have locked everything up that long.\n00:43:26 - Dan’s iPhone (danddcompany.com)\nWhich way?\n00:43:28 - Tina Marie (profitdriversinc.com)\nHuh?\n00:43:29 - Dan’s iPhone (danddcompany.com)\nFor who?\n00:43:30 - Tina Marie (profitdriversinc.com)\nMy guy.\n00:43:32 - Dan’s iPhone (danddcompany.com)\nFor Dexter?\n00:43:34 - Tina Marie (profitdriversinc.com)\nYes.\n00:43:35 - Dan’s iPhone (danddcompany.com)\nOh, he's a good person about this?\n00:43:38 - Tina Marie (profitdriversinc.com)\nHe hasn't for a long time, but he has.\n00:43:41 - Dan’s iPhone (danddcompany.com)\nI've never seen, I've never seen his stuff. But I've never seen him talk about this. Oh, I've never seen him to harass Dan.\n00:43:49 - Tina Marie (profitdriversinc.com)\nWell, they are thieves. what those entities do is criminal.\n00:43:57 - Dan’s iPhone (danddcompany.com)\nOh, yeah.\n00:43:58 - Tina Marie (profitdriversinc.com)\nYou are, you lose. Yes, okay, the only reason he stopped fighting them was because of me and he knew that it would just Like you can't you can't win.\n00:44:11 - Dan’s iPhone (danddcompany.com)\nYou're right.\n00:44:11 - Tina Marie (profitdriversinc.com)\nYou lose But but because of me he's trying to play their game and just not die Right Not because the money. I don't I don't care if he has any of it And he's willing to lose it all this had cannot go anywhere else.\n00:44:32 - Dan’s iPhone (danddcompany.com)\nI've not told his business to anybody Yeah No, no one I know knows who he is.\n00:44:47 - Tina Marie (profitdriversinc.com)\nYeah Yeah, the only vision that we're not married is because of this because and they can get into my stuff Yep, totally. So we've not been able to have the lives that we've wanted to because of this and yeah and it's it's it's the government like drag it out okay but on top of that um we have relatives who have dealt with cancer and being homeless and I've been financing everything um I really hate emotions I would just I'm fine sometimes it just like comes out and physically like it pisses me off because I'm like I I'm fine it doesn't feel like this but anyway um I have just been getting I don't want this on text or email so I had to do it on a call I've talked to Mark about it too because I'm not I can't keep up and I have to do something but I don't have an engine like I don't mark it I've always had enough for me. I have plenty for me, but I have been taking care of three other families for years.\n00:46:08 - Dan’s iPhone (danddcompany.com)\nOkay.\n00:46:09 - Tina Marie (profitdriversinc.com)\nAnd I'm I can't anymore. I mean, I'm going to I can't but I can't afford it. I've got to generate more money. And so I've been working on the course. But the problem is I have to hire people and I can't afford to hire people. I don't need a lot. Just to extract it from me. The whole course issue that we've discovered, that's the biggest thing.\n00:46:36 - Dan’s iPhone (danddcompany.com)\nSomebody needs an extraction.\n00:46:40 - Tina Marie (profitdriversinc.com)\nAnd so I have that. I have, I'm going to text you my little whiteboard thing. You can see this. You have an extractor come in. do.\n00:46:51 - Dan’s iPhone (danddcompany.com)\nI do.\n00:46:51 - Tina Marie (profitdriversinc.com)\nShe comes into my house. She also cleaned. I have to be able to afford her. And she lost her job. So I really have. have to be able to afford her because she needs it. And it's just another family that like, I'm going to take care of everybody until I can't. And I will do all that because I can make money. I can make all the money. That's the thing. have no scarcity mindset whatsoever. That's why I'm willing to volunteer 12 hours. It's in your text. I have so much energy.\n00:47:26 - Dan’s iPhone (danddcompany.com)\nI've done so much healing.\n00:47:27 - Tina Marie (profitdriversinc.com)\nMy mood is good. Like if you pick on it and like zoom in.\n00:47:33 - Dan’s iPhone (danddcompany.com)\nI am. I love you.\n00:47:37 - Tina Marie (profitdriversinc.com)\nSo the orange things are concepts. green ones or they switch colors because those sticky notes are action items. So everything is a concept with a tactical practice. And then of course I teach it's a constant iteration. So these are the fundamentals. These are everything that we do. all the time, but I teach people that it's, you know, everything builds upon itself. So anyway, there are two things that I need. First of all, Mark sending me Fuji, the doctor, and he paid, I told him, so this wasn't my new pricing structure, and it's not for IM people because they can't do it, but doctors, doctors, lawyers, expensive professionals who have spent a lot of money on education who immediately understand the benefit of it. I said it was $5,000 a month with, you pay by the quarter with at least a 90-day commitment because I've got to have at least 90 days for you to know if there's anything.\n00:48:44 - Dan’s iPhone (danddcompany.com)\nWell, yeah, we figured that out, yeah.\n00:48:46 - Tina Marie (profitdriversinc.com)\nRight. then, or $4,000 a month, but you pay six months at a time, and so he did that. So, was $4,000 a month for him, and he's immediately happy. His wife is so excited. His wife comes to talk to me on the— videos. It's amazing. I'm so happy with it. But anyway, what I'm trying to figure out, and I gave Mark a pitch, I've got to stop worrying about money. don't, it's sucking the energy out of me. I need to be able to just have the team. And you know how everybody else is like, oh, go to have this person full time. Well, I don't need full time. I need like 10 hours from my developer. I need 20 or 30 hours from Stephanie, which is my, she cleans for me, but also she does this. She has run businesses. She's a business. ran a retirement center. she flipped that thing around, man. She is a workhorse. So she, she understands things professionally, but she also is like my best friend. She claims she's like one of those amazing rare people that can do a few different types of things. And she is and I'm learning from her too that I could teach my stuff to people that manage who maybe they're corporate managers or whatever like there's so many different entry points like I would market it as though it's a completely different product but it'd be the same thing just with a different entry point so like same product but I like Fletcher yeah his theory is that you bring them in on any of the nine column headers here but actually they could all come in on the same thing it would just be the story is different as to why they need it yeah they're saying I need time management or I need how to build the team but in reality we know actually you need yes you do need that that's just the pain that's right the face that you have right yeah punch in the face you have right now but we all know you don't know your numbers so the pitch that I gave to Mark out of I can only call it does it what it's It's not just desperation. was, it was inspired by that, but I'm trying to figure out what is the thing that makes sense for somebody else. Like, I don't want charity. I don't want somebody just give money, but this is going to take a little while to build out. But I'm like, I can't even tell you, you know when you know that you've got all the things, I've got all the things. Every single time I teach anybody anything, anytime I have a conversation, at some point, somebody goes, holy , I've never thought of that before. And then there's something that they can go wrong with because the people I'm talking to have brains at their homes and they do really cool and exciting things. Anyway, and I know that I can market this. The reason I started, you know, showing up on video is just to get over any shyness being on video.\n00:51:51 - Dan’s iPhone (danddcompany.com)\nThat's why I was like, jump on Zoom sometimes with video. Just there was a reason.\n00:51:57 - Tina Marie (profitdriversinc.com)\nYeah, just conditioning myself. And, and And the point that nobody says anything. So I'm like, that's that's the whole thing. I need to tell myself, nobody cares. Nobody cares. So anyway, the pitch that I gave Mark was that I'm like, you're gonna be like, yeah, you got some brass balls. Anyway, I want to get $100,000 and not think about anything and hire everybody, build my marketing campaign, go nuts on it. I don't even care if I I've got people who cannot, they're going to be homeless. They would be wasn't for me every single month. Anyway, but but the deal is that I would give 10% of any money coming in and up to $200,000 or for the next 10 years, but it's going to be faster than that. So that they double their income period. In addition to that, I would give any time they want anywhere, but I want to be able to know that I don't have to go chase money. I'm gonna and a building engine. But the other thing is like, so Dexter and I have had a rule. I don't have male partners. I'm like, you don't get to dictate that anymore. I have to do what I have to do. You can be afraid. You can be afraid and break up with me if you want to. He would never. But it really makes him afraid. And this is terrible against his ego. If he knew I did this, he might. I think it would crush him. Which is why he can't know because he can't handle it. But the up you see will kill you.\n00:53:32 - Dan’s iPhone (danddcompany.com)\nSo I don't have any other options not to take care of my family.\n00:53:39 - Tina Marie (profitdriversinc.com)\nBut this is not coming from a place of weakness. I'm on fire damn. Like I just I have so much energy for working and building this out and this AI stuff with the Dev girl that I got, which you have your own team. But with Stephanie's help, Maria just It was something kind of to rip off of. She, that girl takes too much stuff on her.\n00:54:04 - Dan’s iPhone (danddcompany.com)\nBut, but there are. Yeah, she, uh, she's ping pong's around.\n00:54:09 - Tina Marie (profitdriversinc.com)\nShe does. And I don't want to ping pong, which is why I want to be able to hire people direct them very specifically, no favors. Like I, the other thing is the girls, like I'm down to one, basically. The other one is going to start school. She may be staying here, but also I need to pay for her school. And, um, I just, I don't want, when you worry about money, it's Maslov's hierarchy, but it's also his paradigm. You can't think about higher level things when you're in pain. So I need to get rid of the pain so I can be high performance, but I feel high performance all over the place. I just am not working with anybody and I don't have the financial resources. And I need to figure out how to get to that. And if I can figure out a way to, but I, I can't tell anybody. That's the other thing.\n00:55:01 - Dan’s iPhone (danddcompany.com)\nI can't help it.\n00:55:02 - Tina Marie (profitdriversinc.com)\ntwo. So I told Mark, I'm like, can I give you a dollar? And then anything I tell you, you can't say because it's privileged. He said, yeah. Yeah. That's true. then mowed him. This was like two months ago. And that's when he got Fuji and he's like, I'm texting two people. It was like 11.30 at night on a Saturday because that's losing my mind per minute. So now you're in the loop. But I don't know if there's anything that you'd be interested in that we could do. I will partnership. I don't care. I will work like crazy. You could have ownership. This would be, I'm not even being clear about anything right now, really specific. I could build that. But it's mostly a download of information and your brain does things. So that's where I'm starting. And you have your own puzzle. I don't know if there'd be something you'd be willing to invest in with an income guarantee contract like you'll get your money back however long it takes kind of thing and obviously there's risk involved but I don't think it's much of a risk because I'm pretty sure you know I can do these things so that's something to think about and just whatever part of it would just be benevolence like a huge part of it that would be the initial thing I know that but the other part of it would be I'd make sure you get your money back I have no I made a million dollars in coaching 10 hours a week or less in six years but it's not enough not while I'm taking care of other families and I fired the pain and he asked people that were draining me So that's the other thing.\n00:57:01 - Dan’s iPhone (danddcompany.com)\nI'm not making nearly what I used to make. Right. I have that as well.\n00:57:05 - Tina Marie (profitdriversinc.com)\nYeah. So, and I can't bring on just anybody. And I really want my time needs to be leveraged like everybody else's. I've got to build the course, but it's happening.\n00:57:20 - Dan’s iPhone (danddcompany.com)\nI'm doing it. all you need to do. That's literally like if you don't, you shouldn't even be building a website. You shouldn't. There's no reason to have a website if you don't have a course.\n00:57:33 - Tina Marie (profitdriversinc.com)\nI'm not building it.\n00:57:34 - Dan’s iPhone (danddcompany.com)\nI'm making sure I have something to do it. It's always the time. Right. They're all, it's all sort of, you know, which isn't exactly accurate, but it's all like proactive. It's like, oh, I'll just go work of the website. Well, you know that the teeth pulling or whatever you want to, however we want to not authorize it. It's doing that bit now. You got a lot done though. So props, but it really comes down to that like if there's It's like you're building a house for something that doesn't exist. And it's like, you know what? Build the shelter for it after it exists But nobody makes the damn course like I just went through this with DK DK is gone. you not two Years he's been working on it And I said it's not with it. I'm like, dude, and he's getting hung up on like the names of the steps It starts really cool gives a So there's a 82 pages like this has to be this is not enough I have to fix it and then I know but I mean I can see it. I know you right. I'm looking I get I read the nine things I go yeah, there's really good like I don't I My feedback would be like, yeah, okay This seems like a good framework, but like then here are the bones right here's the skeletons Now you got to go throw the meat on it and then it's like, it's got to be, you know, so that when you do sell it, because the ease, you know, the quote unquote, easy part, right? easy part is building the funnel or whatever, right? It's like that's the easy part. Yes. The hard part is all the work that you put in over the years to get the know how and whatever, right? mean, that's ultimately what they're buying. Um, do you go, I'm just going through it. Yeah. And I mean, just go hard at this. Go hard at this and just get it done, whether it's video, I don't know what, however you want to deliver it, like, but like build the thing and then go build the parts around it, right? And then, then you get into the funnel metrics and then split everything in the blah, blah, blah. But it, and it might be, if you have this and then a website, then you can do a damn thing again, right? Go go to Meredith and like do that pitch. Like look back at things that worked, except this time you're like, I'm not, I'm not putting them in a one-on-one opportunity tonight. You go make a similar pitch, but it's gonna be for this. Yeah, and maybe some people do, as you know, they will, right? people are gonna go the Fuji path, but it's like I was on the horn with a hannock the other day. So like he had to fire the number one, the number one salesperson, and then that turned into a total show where she came, she came back and started poisoning the well and all this stuff. So he went on vacation, air quotes, and while on vacation, he worked four of the seven days, and he just keeps coming back to, I'm like, dude, are you just not seeing the part where like you hate the business model that you have? are you, when are you gonna get that message? You you built the wrong business and now you're you're like you got at this life preserver Oh, and then his his ops guy Went totally sideways. So the integrator dude all of a sudden start talking about how he doesn't understand Some of the metrics and I'm like he's just bringing this up now What are you talking about? But it's like he should he should have he's like I should ever recurring revenue business. I go yeah You should right so like you're saying yours is gonna be hybrid and it's like So you could end up with like I think wedmore. I do not like him by the way There's he just rose me the wrong way.\n01:01:44 - Tina Marie (profitdriversinc.com)\nThere's something off about him.\n01:01:45 - Dan’s iPhone (danddcompany.com)\nHey, I don't either but there no I know but I think his Yeah, his presentation is good and I don't think his content's great. Your versus better You have more probable probable probably have more actual legitimate success that he does, right? mean, he's slinging courses to people that are never gonna finish them.\n01:02:07 - Tina Marie (profitdriversinc.com)\nYeah.\n01:02:09 - Dan’s iPhone (danddcompany.com)\nWhich you'll get that too, but that's not your intent. That is his intent. His intent is full well-knowing, like, and that he's gonna upsell.\n01:02:16 - Tina Marie (profitdriversinc.com)\nBut I will get what I know I will get is whatever time they're willing to spend with me, they're gonna think a new thought and they're gonna change something. I guarantee you know what he's gonna go through any module and not think that even just slightly differently and operate just slightly differently. that's iterative change. And that's all I'm promising. And if you want more, you just keep coming back.\n01:02:46 - Dan’s iPhone (danddcompany.com)\nSo. And then once you have this feedback loop, it'll get better.\n01:02:56 - Tina Marie (profitdriversinc.com)\n100%. That's the thing about being on the mission and everything else. Now that the girls are grown, I don't have kids to take care of anymore. I do. I have these, but I, the capacity that I have for wanting to teach and lead, but also I'm constantly learning. So very few of the teachers are constant and intentional students. I always am a student. Like I'm always, you know, how humble can you be if you say that you're humble? But like I'm very aware that I don't know what I don't know.\n01:03:26 - Dan’s iPhone (danddcompany.com)\nSo I'm always learning.\n01:03:28 - Tina Marie (profitdriversinc.com)\nSo that's the thing too. 100%. I know it's unique. So I can create this stuff, but here's where I get caught up and you know this is I overthink things. You don't be the only one that I know who doesn't sugarcoat things, who has the experience, who knows the benefits. So what I need to do is keep this minimal, sufficient enough that somebody can comprehend it. like MVP, right? Smallest actionable stuff. Can I get you to and I can pay for it? I don't care how it happens But as I create a chapter get your feedback on it and say I think you're missing this I think you're this is too much I think whatever because I will overthink it if I don't have some sort of feedback loop.\n01:04:18 - Dan’s iPhone (danddcompany.com)\nhave to have it Yeah, totally. Okay, that would be really helpful to me I think that should be the short-term thing like Right like forget about the other Energy the thing that I need you to understand about other people. It's not just proactive avoidance. It's it's I know I said it wasn't the exact right word.\n01:04:43 - Tina Marie (profitdriversinc.com)\nYes. Yes. No, right. So I don't spend any time on it I talked to her an hour a week and it literally is mostly it's just like a battery pack for me So it gives me a little boost of energy it 100% is a placebo effect But it still has an impact of like, okay, it feels like there's something happening, but where my real time does go is this, is actually writing this stuff.\n01:05:08 - Dan’s iPhone (danddcompany.com)\nSo that's the difference that separates me from other people is I'm aware.\n01:05:12 - Tina Marie (profitdriversinc.com)\nI mean, you've done a lot too. That's pacifier. I better be looking at it go, I'm sucking my thumb. Okay, let's go right. Anyway, but um, so if you do think about it, and if you can think of anything where there would be terms and maybe you talked around that, don't know of something where I would I'm not going to stop working. That's the whole point of this where you can get your money back. It's not a charity investment, but maybe it's a just it is a an investment that takes a little while to get back. If you'll think about it, if you're like Tina, that's just not, no, that's fine, whatever, I'm at the point where I can't be proud.\n01:06:03 - Dan’s iPhone (danddcompany.com)\nYeah, I've been there.\n01:06:04 - Tina Marie (profitdriversinc.com)\nDon't enjoy that, by the way.\n01:06:06 - Dan’s iPhone (danddcompany.com)\nNo, I've been there. Well, I've also been on the other side where I've been too proud, both both are not great.\n01:06:13 - Tina Marie (profitdriversinc.com)\nDespite the fact that I like get emotional cry, I don't feel weak. I don't feel trapped. don't feel helpless, but I do feel like the biggest thing that I need to do is trust who I can trust, ask what I can ask and get by us to work and stay at work. So, I'm doing all the things, I'm not letting pride get in my way, I'm not being lazy. If I suck my thumb for an hour, we're talking to a developer, which it's just more about there's somebody that I'm training her how I think when the time... I mean, I get it.\n01:06:45 - Dan’s iPhone (danddcompany.com)\nI get it. Yeah. Right. So, that was also before you showed me 82 pages, so I'm like, all right, you're doing the thing. Right. Because it's all about the thing, right? It's all about the product, right? You can... You have to have the product. I think you do have the product. Within you, right? It's like so and now you're making the product and then it's like okay now go market product Now I'll get the product out there, but where people People get hung up on never building you did too, but now all of a sudden right Or not the best reasons you're like . I gotta I gotta jam my nose against this grindstone. Here we go And you're doing the thing. So it's like, okay, great. And then I'm more than happy to help you Review it or whatever And then I'm I certainly will consider it, but I'm obviously going to be like All right, is this progressing?\n01:07:40 - Tina Marie (profitdriversinc.com)\nLike what's going on? But that would be perfect because I Responded really well to that Right I don't and I don't give excuses I'll like stay up all night and be like, okay, here's something here says like whatever I don't have a Tina in my life. I don't have anybody that does that and I do needed. So that's part of what's so funny.\n01:08:04 - Dan’s iPhone (danddcompany.com)\nHere's the comedy is that literally two months ago maybe three I told my sister you should call up Tina and you guys should For lack of a better word harass each other to getting your courses done like that was that would be the best thing you guys could do for each other and she didn't do it because in the reason she didn't do it is because She doesn't really want I think she does want to start a business But I don't think she really thinks she can do it and I'm not gonna say that to her But that's exactly what I believe and now all of a sudden she finds herself That was up The years up like she wasted a year like you should have spent I tried to tell her she should have spent a year Doing once she just got a coaching client for 25 grand. I'm like there are more but you're I, of course, you and I, you know, universe, religion, we want to call her. I'm like, she's closing herself off from it at like a subconscious level. See, it's telling herself it's not really real yet.\n01:09:12 - Tina Marie (profitdriversinc.com)\nhere you go, you just made 25 grand.\n01:09:14 - Dan’s iPhone (danddcompany.com)\nRight. How many more of those do you need? And I was trying to get her with something like, you've done it, but she's never done it. like, what's the math? What is the math we're working with you? I can't help you if I don't understand the math. And like, she can't tell me, hey, I need to make this much a month of money. then I'd be like, okay, great. What I want to know from her is, how much money do you need to make a month? And how much money does Robin need?\n01:09:43 - Tina Marie (profitdriversinc.com)\nLike, what is your not? There's two elements that go into that.\n01:09:45 - Dan’s iPhone (danddcompany.com)\nYou got to live and you got a fund, let's call it. What is that number? Yeah. you can work backwards. You have the number and now you're trying to work backwards.\n01:09:57 - Tina Marie (profitdriversinc.com)\nThat's how you have to do it.\n01:09:58 - Dan’s iPhone (danddcompany.com)\nSo you can tell her, oh, I need to. make a million to our month, it's like, good luck.\n01:10:02 - Tina Marie (profitdriversinc.com)\nYou can tell her, because I think that she thinks whatever that I'm, I won't say better, but at something that she's not at, and it has my experience doing it myself has no bearing on it because she just, she just did it in a different world. So the valuation is what's different, that's all, skill and ability is not what's different. And her knowing that she can exist in this world is what's different because I know I can because I have. And I know that I do it really better than anybody else I know because for what I do make and how little I work and how little I worked for it, because it's all been word of mouth. I don't know anybody else who has done it to that level. So I have confidence from that.\n01:10:51 - Dan’s iPhone (danddcompany.com)\nAnd dumbfounded by the amount of money you made up on, it's like dumbfounded. Yeah.\n01:10:57 - Tina Marie (profitdriversinc.com)\nYeah. I missed that.\n01:10:58 - Dan’s iPhone (danddcompany.com)\nDid she really make it all by?\n01:11:00 - Tina Marie (profitdriversinc.com)\nheard about it.\n01:11:00 - Dan’s iPhone (danddcompany.com)\nYeah, totally. She doesn't have a court. She should. She should have a court that she doesn't. But a big part of that was parenting and motherhood. I was just gonna say you didn't need to do it before. Right. At some point, it's like, Oh, needs to happen. And then the need or at right, it's pacing all the things to you.\n01:11:21 - Tina Marie (profitdriversinc.com)\nExactly. All and it's all the things that I teach. So if you want to tell her, because that, like I said, I draw energy from the the riffing kind of thing. But it's very difficult to find a running mate from my brain. Lisa. I mean, she she and also she does like you that she's like, like the very first conversation we had. She's like, wait a minute. And like, like, yeah. she's very frank, which is amazing and awesome. And yeah, so if you could, I would give her we could give each other an hour a week and it would just be give feedback, give suggestions, whatever.\n01:12:05 - Dan’s iPhone (danddcompany.com)\nI of bill a buddies.\n01:12:08 - Tina Marie (profitdriversinc.com)\nYep.\n01:12:08 - Dan’s iPhone (danddcompany.com)\nI still think she should do it. She did two interviews. talked to me and it was like, one, was like, if they offer you the job, you got to take it. And neither one of them hired her. And I was like, you are now your client. Like in my head, I was like, you are your client. Like, so what would you tell your client, right? What would they do? So she's interviewing for another place, but I'm like, maybe they're not going to hire you. But you know, she did the coaching thing or whatever. She never watched like her stuff. And again, I don't think it's the greatest, but I do think they're I still think like you can use it to come up with to sort of structure something.\n01:12:51 - Tina Marie (profitdriversinc.com)\nI think honestly, if she looked at my carbs and what I think that she would go wait, these are the things that I do. So like, I just have to sit there, and that, by the way, that has come out over the last year and a half, maybe, of going, okay, what are the things? Well, and it did start with Fletcher stuff, but in terms of, like, I saw a road map, and then I was like, I hate all of this, let me do my own thing, but all I needed was to see a road map and to know, oh, I need a road map.\n01:13:24 - Dan’s iPhone (danddcompany.com)\nSo, and that's the thing about so does your client. Yeah. Yeah. think that he's so right about that. Like, people want to see a solution.\n01:13:33 - Tina Marie (profitdriversinc.com)\nlike, oh, I can, can absorb that.\n01:13:36 - Dan’s iPhone (danddcompany.com)\nThat makes sense.\n01:13:38 - Tina Marie (profitdriversinc.com)\nYes. They want to know that there's not just a point A and a point D, but they want to see that there are steps in between, which was something I did innately, but I didn't map it out. So what I would say is, hey, tell me where you want to go and let's work backwards. It was the same concept in my mind, but I never showed that. to anybody and seeing it, I was like, holy , they need to see it.\n01:14:05 - Dan’s iPhone (danddcompany.com)\nYeah, your B, your proverbial B is, hey, I'm not working this much. I'm not working this hard. I'm making more money. All the, all the things I don't like are gone and the things that I do like are still here. And you're like, yeah, your A is where you are right now. I can get you to B, and you know how you do that? It's these steps. And they go, oh, and it's true, right? If you, you know that those nine steps, and they don't necessarily go in order, right? Because they could come in on whatever, but that pathway or the learning those nine things, whatever the hell it's, you know, displayed to them will get them to be. Like, your people are all looking for the same B. I want, like, Mark. Mark's a good example. I'm sure Fuji's a good example. So, yeah, totally. And Mark's, I love how Mark on the phone the other day is like, what are we doing? I was like, I'm not, Sure, what we're doing, but we're going to do this math here, buddy. Can do that.\n01:15:07 - Tina Marie (profitdriversinc.com)\nYeah, well, yeah, and we had an extra column. going to that's the one that I accidentally sent the notes. The whoopsie, which all got smoothed out because really the AI.\n01:15:19 - Dan’s iPhone (danddcompany.com)\nI'm like, how, how is that what your summary is? That was not. Oh, sometimes they're horrible.\n01:15:25 - Tina Marie (profitdriversinc.com)\nYeah. So anyway, but all right. Well, we, I just totally used up your time.\n01:15:33 - Dan’s iPhone (danddcompany.com)\nSo sorry about that.\n01:15:37 - Tina Marie (profitdriversinc.com)\nactually knowing you that if it came out that Lisa finally got something and she gets talked into getting help from somebody that can, you know, actually run with her extract things from her. Um, I, I adored her. I think she's amazing. She is incredible. And this process would be, I think the biggest issue for her would be figuring out the market.\n01:17:00 - Dan’s iPhone (danddcompany.com)\nThink about your day. If you think of one, write it down. then when you get home, take that post and know that you thought of and put it wherever the hell it belongs.\n01:17:08 - Tina Marie (profitdriversinc.com)\nI'm sure you can start with nine.\n01:17:10 - Dan’s iPhone (danddcompany.com)\nIt just ends up being late.\n01:17:12 - Tina Marie (profitdriversinc.com)\nSo no, I had like four or five. That was the original. And then I realized that there's, um, there's the next level stuff. So like the sharpen your saw and like mind your heart, those two last ones. They are like, how do you feed the visionary? How do you keep that person, um, up with everything, sharpening your shawl, whatever you're the best at, you have to keep doing it. You do it normally and naturally, but basically it's the shield against apathy and complacency. And then the mind's your heart or yeah, mind's your heart. So that's about heart and mind. It's that we're human beings. Um, and if you don't constantly feed yourself with positive information that strengthens you, that encourages you. urges you that uplifts you when it's a fan because it will, when you lose a spouse, when you lose a child, when you lose some function in your body, when you lose a parent, whatever, whatever happens when we go through a recession, something's going to happen to you. If you haven't intentionally been fortifying yourself on a daily basis, on a steady basis, when that comes, it's going to crush you. So that's something that is a part of my process, right? We do it in our coaching sessions and things like that. But it's not, you know, technically the business stuff, but it 100% is a strategy. It's an intentional strategy. It's a regular part of my practice. And so it got added into it. And yeah, anyway, so that's how it came about. So with Visa, I would just say, what are the things you always teach people? And I would show her how to use chat TBT and a Google Doc, and just go like, what are the things like, tell me some of the stories? Well, in those stories, we're going to extract a concept and she could start by telling chat GPT stories and then go okay what is the premise what is the concept that I taught and I could teach her how to do those things and then now she's got something that she can be working with if it's three o'clock in the morning and she can't sleep and she's like these things are on her mind but you don't want to go call somebody because everybody else is sleeping because they're saying they're not really um you know what I mean so that could be I could teach her those things because that's what I've been doing with this is using chat GPT telling it stories and then having it give me some like extraction like what did you notice I'm like oh yeah that's what I do and then I go write something what yeah yeah so anyway okay so sorry that was just there no even clear ending point I've got lots of questions for you and I've already taken a letter of time so I'll wait till next week but also thank you for being\n01:20:00 - Dan’s iPhone (danddcompany.com)\nthe exceptional Dan that you are because um well I can pay you a dollar to put you under oath like where you can't see me but I can trust that so anyway you for being that awesome I appreciate you before I go though is there anything that's like I don't know something crazy that happened this week or something problematic so I can we can either talk about it or putting notes down so I can ask about it next week no I am just waiting for the supervised guys though they came back with like they can do the code when they came back they quoted doing the authorized dot man so they're up to like 20 grams it's like 20 grams to do all the customizations whatever and now and they're like do you want to make an offer for the copy the software do you want us to I'm like you can which they wouldn't do before so I'm like okay another willing to do it. And so I'm waiting for them to come back with that. So it'll be like 20 grand plus that. And then weirdly, the universe, I got Noria working on his or the employee or whatever, or high level. So I'm him and I'm sort of teaching him that like he asked questions like, Oh no, do do this. Look at this. This is how this works. And then in I look, I found something yesterday by accident is high level just randomly releases . Like there's no way you can keep up with it. And they're releasing something next week called third party integrations that I read today. And I was like, this is exactly what we need, I think. But I never thought about it. I had, I just thought they're never gonna do that. They're doing it. So I had this function that I wanted to put into follower flow. And Like, oh my god, we're going to be able to do that in a week. So I said it tomorrow, I go, hey, look at this. And I think this is where we need to go. I'm pretty sure he's going to come back and say yes. So yeah, that's like, wait. I'm waiting on you. I want to see what those guys come back with.\n01:22:17 - Tina Marie (profitdriversinc.com)\nThat's awesome. Oh, I'm Marsha stuff. Just quick update.\n01:22:22 - Dan’s iPhone (danddcompany.com)\nI'm now delving into the custom JavaScript. So I haven't heard back from Melissa. I'm to hit up Melissa. She's going to it. I want to see where she's at. I've decided that I'm just going to rather than take a Tilla's container, I'm going to build a brand new one because Marsha, I didn't realize that they had all these pre-made templates for GTM, and he uses a bunch of them that we would use, like, Clarify or Clarity. He's like, oh, we use the Clarity template. We use this template, and then they have a template. So I think I'm. better off just and and the one that Attila built for ninja is custom. It has like a domain look up table. So we have like a master container that works for four sites. And it's cool. But I'm like, yeah, I don't think we'd ever do that again. So I need to build like one that's single domains ready. So yeah, I'm like, I'm gonna go I'm gonna finish this thing and then build my first container, which actually uses his starting container. then I append that with some other stuff. And then I'll push it onto woofer. Oh, and those guys met with Frank yesterday. I'm going out to lunch with Derek to get the Frank update. I decided when Eric was like, oh, we're just talking about getting stuff, the meetings at 6 a.m. You can be there or not. was like, or not, sounds good. I'll be in the or not column. That's funny.\n01:23:55 - Tina Marie (profitdriversinc.com)\nYeah. So wait, Frank was meeting with woofer?\n01:23:58 - Dan’s iPhone (danddcompany.com)\nNo, no, no, with Abhishek,\n01:24:01 - Tina Marie (profitdriversinc.com)\nOh, you switched here so fast. I did. Why had you?\n01:24:05 - Dan’s iPhone (danddcompany.com)\nYeah. Well, that was the third thing.\n01:24:06 - Tina Marie (profitdriversinc.com)\nwas like, that's the only other thing to, that I'm working on the things that are lurking earlier.\n01:24:14 - Dan’s iPhone (danddcompany.com)\nRight.\n01:24:16 - Tina Marie (profitdriversinc.com)\nSo when do, when does Frank think Wolf be done? Wait, Wolf was already.\n01:24:21 - Dan’s iPhone (danddcompany.com)\nI don't know. Yeah. So they updated him on that. So he was back on his vacation and then they did all the get stuff and then recovering that with him and then I decided not to go up, show up to the meeting and sleep for another hour. So I'm going to take Eric out to lunch and just text it on, have you eaten and I'll get the update from Eric today.\n01:24:44 - Tina Marie (profitdriversinc.com)\nAwesome. Okay. So here's what I'll say. If you, I don't have to have the number that I said, that was the one that will give me like six months. Don't worry about it. So, because I've got Mark and I've got Guji, and I've got you, and I've got one other client, and that's it right now. There's a couple of me, but I really don't want them, and I really want to be able to stay focused on this. So if there's anything that you end up thinking of, okay, I'd be willing to invest this for that kind of thing, and it'd be a long-term turnaround, pretty much everything helps me not stress out about it right now. And then the whole Lisa thing would just be, it's just whatever, whether I get something out of it or not, I told her, would just do it for her if I got nothing out of it, because I want to see her do it.\n01:25:39 - Dan’s iPhone (danddcompany.com)\nI think the problem is she doesn't, not that she doesn't want to do it, it's that she doesn't think it's possible, I guess. I haven't talked or I'll hit her up. She's supposed to call me an item, call her back, oops.\n01:25:55 - Tina Marie (profitdriversinc.com)\nSo I'll text her, be like, well, yeah, I'll probably talk to her So the other thing is, ask her what she's What is the it? So when people are not specific, that's that's what makes it harder to believe it's possible. What does it look like? And exercise in the nevetsal. So for me, it was x amount of money, x amount of time. I'm happy not working with . That was it. That was it. So now that I knew what it wasn't, I'm not working with . I'm not working more than 20 hours a week. I'm not making less than x. Those put the parameters in place. So then it's like, what do I have to offer? Who will say yes to it? What's the math, right? How many people? And like, so what's the math of the number? How many people? What's the minimum amount of people I can have to get to that number? If I offer x, can I deliver x at a no-brainer price? Well, they'll be happy that they for sure see enough value in it that they'll pay that price. it's really simple math, but you have to answer some questions first and specifics, and I always start with, what do you not want? I don't want to make less than X. I don't want to work more than X. I don't want to work more than this time, and I don't want to deal with these kind of people. That creates the first container. That creates the first part of the mass. anyway, if you have enough of that conversation with her that she thinks that there's some positive, because the thing that I don't do is wrestle with people. You don't either. It's your sister, so it's different. You should wrestle with her a little bit and help her have some confidence in it, because we get to a point where jobs just don't make any sense. Age-wise, life-wise, it's just not worth it. But I don't know if you know anybody else who can figure out how to get everything I want within those parameters, and I did it. The only exception was the pandemic. Being with somebody who's dealing with this with the FTC and wanting to take care of three additional families. is at all costs, which is not normal.\n01:28:02 - Dan’s iPhone (danddcompany.com)\nMost people don't have those things going on. Yeah, the only other person that knows me. Right. And how many people did you know? It was, I don't want to work for anyone else, initially. And then it became, oh, I need to make five grand a month. And then it became, oh, I want to do this. But it was always about, I don't want to work for anybody. So yeah, I don't know what her is. I don't think she knows. So it's a very good point. So it's like her it slash you're not like somewhere. If you define these two things, then you can and she, you know, sort of the perfect day concept, which is, I think the problem is just that her paradigm, she has this, she has this NPC, right? Sort of a paradigm of like, oh, you go, you get a job, you have a career. it's like, yes. Yeah. That is up.\n01:28:56 - Tina Marie (profitdriversinc.com)\nThat's the institutional thinking. Yep. And that's what I told I her when I talked to her is that and that's why school is so difficult because your program to be an institutional person to go get a job in an institution where you continue to be programmed as an institutional person, which is you are there to serve, not to be served.\n01:29:17 - Dan’s iPhone (danddcompany.com)\nYeah.\n01:29:18 - Tina Marie (profitdriversinc.com)\nAnyway, so if she was be willing to talk to me one week, once a week or a month, just come spend time with me, I will extract things out of her. I guarantee you that she will have a paradigm shift unless she refuses to do it.\n01:29:38 - Dan’s iPhone (danddcompany.com)\nRight, which is the current methodology.\n01:29:43 - Tina Marie (profitdriversinc.com)\nRight. Yeah. But if after that much, she still refuses to do it, then you know what you know, and that is that until the pain of staying the same is worse than the pain of change, wait, pain of change is yeah, that's what I\n01:30:00 - Dan’s iPhone (danddcompany.com)\nin it.\n01:30:01 - Tina Marie (profitdriversinc.com)\nThen she won't change, but at least we'll have resources when she is ready. Okay. Anyway, okay, I'll be quiet.\n01:30:09 - Dan’s iPhone (danddcompany.com)\nThank you. Have a good day.\n","contentPreview":"00:00:03 - Tina Marie (profitdriversinc.com)\nHello. You're muted.\n00:00:11 - Dan’s iPhone (danddcompany.com)\nHello.\n00:00:13 - Tina Marie (profitdriversinc.com)\nHi. I had a horrible asthma attack toda...","processedAt":"2025-05-04T03:40:52.612Z"}