{"fileName":"Done Transcript for Fuji_Tina Coaching(4).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Fuji_Tina Coaching(4).txt","type":"transcript","priority":"medium","content":"00:00:04 - Tina Marie (profitdriversinc.com)\nHi. Sorry. It's having weird issues with Zoom today.\n00:00:09 - Fujinaka, M.D.\nOh, I'll get it.\n00:00:16 - Tina Marie (profitdriversinc.com)\nThe worst time calls for me to like 11, because it takes me so much longer on Mondays off the weekend to like get my brain going. I'm not in work mode. I take all of Sunday off, but you've got this schedule and only Monday warnings work for you.\n00:00:36 - Fujinaka, M.D.\nYou know, we could do a because I because I've shifted my schedule to free this. could. We could do afternoon. So let me let me text. Maybe I'll text you later after this and take a And then early it's that I like being at optimal.\n00:01:00 - Tina Marie (profitdriversinc.com)\non mental level for that because I feel like I provide the best service that way and in the so like there's an acceleration to my morning but also to the week and so first thing Monday morning I'm not giving the best but also you have a habit of sending me stuff at the last minute like Sundays and I am not I won't see it until right before our meeting which isn't enough time what did you send me you sent me oh I just put in the chat box but um we're gonna go over the nighting you you emailed me something and I was trying to find same thing it's the same thing I love doing it too I created a share folder so now we can we can all look actually I should put all this in the same folder but um but yeah I'm excited to look honestly I've had my bookkeeper doing this so the last like since I started the business I was like okay I'm gonna get a bookkeeper so I keep track and uh\n00:02:00 - Fujinaka, M.D.\nI really don't look at this stuff other than to look at like the total profit for the month, which is basically you know right now, but Yeah, it's time to go through it You say it's no old right now? Very little, no Or for which business for July? Yeah, it's very low.\n00:02:20 - Tina Marie (profitdriversinc.com)\nWhy?\n00:02:22 - Fujinaka, M.D.\nNow it's just a lot of it's getting rolled back. Well, it's not, you know, it's like 40,000 But a lot of it was getting rolled back into the world back into the company Okay, well, there's a big difference between nothing and 40,000 just you know But rolling it back into the company is something and you'll see So where do you want to start? Oh, let's start just January. Oh, we'll just go through it.\n00:02:50 - Tina Marie (profitdriversinc.com)\nwant to just do January Yeah, and do you want to screen share or me square screen share or just both?\n00:02:56 - Fujinaka, M.D.\nYeah, why don't you do it because I guess I want to look at how you're looking at it and\n00:03:00 - Tina Marie (profitdriversinc.com)\nOkay. Let me change my name. Now. Why is this open with.\n00:03:16 - Fujinaka, M.D.\nOh my God, wait. I'm sorry. They say it's empty. Wait, my, my bytes say zero. There's, there's. So the file is not right. I'm sorry. Hold on. Oh my God. Only one of them work just August. Can you see if you can open the one that says August?\n00:03:38 - Tina Marie (profitdriversinc.com)\nLet me try. I think I have to click the link again because it's like, um, very frustrating and confused. what it is. Okay.\n00:04:00 - Fujinaka, M.D.\nthere's. Okay, that's what happened. Okay, let me get the rest. about this. And check that.\n00:04:12 - Tina Marie (profitdriversinc.com)\nOkay, cool. So you also have your to date there. So service income.\n00:04:21 - Fujinaka, M.D.\nOkay, we're ready. can look at January. No, sorry.\n00:04:27 - Tina Marie (profitdriversinc.com)\nNo worries, no worries. Can't do this kind of work and be impatient like stuff has to happen. It's all across us. That's interesting. No, looks very different from August.\n00:04:40 - Fujinaka, M.D.\nI didn't have the year to date yet.\n00:04:44 - Tina Marie (profitdriversinc.com)\nOkay. That makes sense. Okay, service income, cross-profit expenses, advertising and marketing and contractors.\n00:04:55 - Fujinaka, M.D.\nOh, by the way, I come up with all of these headings. all the headings that you see on the list. the left are my categorizations for expenses. So I can categorize things even more finally, or like more detailed, but as you'll see, these are the ones I chose to group them.\n00:05:13 - Tina Marie (profitdriversinc.com)\nThis is good. So what I would do, generally speaking, I would look at this in correlation with the one that had the calls on it.\n00:05:29 - Fujinaka, M.D.\nOh, interesting.\n00:05:32 - Tina Marie (profitdriversinc.com)\nThis is it, right?\n00:05:34 - Fujinaka, M.D.\nYes.\n00:05:41 - Tina Marie (profitdriversinc.com)\nSo, and then I would probably put nets like gross and net, even though the payment comes like a year and a half on average later, however long that is. to go over the data and look at the trends, and then those particular things do have a correlation to what's happening in real time in terms of like your staff, marketing, you go in accounting services, advertising and marketing, that's the same.\n00:07:39 - Fujinaka, M.D.\nOkay, so before this point I was using another company, I had funds left over from a different business, so I was paying those advertising expenses for February and March through a different company, just to create expenses on it, but that's This is actually that this was the true advertising market and expense I was paying. Okay, or closer to it, I should say.\n00:08:10 - Tina Marie (profitdriversinc.com)\nOkay, and Elizabeth is going up a lot. So what was Yeah, so around this point, Elizabeth, she's my only clinician that's being Spanish and she's licensed in all the states that we operate.\n00:08:28 - Fujinaka, M.D.\nSo I increased her salary to like 30, I think it was like 35 a visit up from 30.\n00:08:34 - Tina Marie (profitdriversinc.com)\nOkay, so she's paid for visit.\n00:08:36 - Fujinaka, M.D.\nBut she also does the most volume in our clinic, like she almost she works full time basically with us. The others only do like a day a week. Is she happy with you? Loves it like she was in Africa for three months and working from Africa and, you know, doing this from Africa.\n00:08:53 - Tina Marie (profitdriversinc.com)\nGood. if you have somebody that you're that reliant upon, you definitely want them to be happy and well taken care of. So it's April, Elizabeth, not so much as March and was not down in April. How come she worked? Like, did she work less in April and why?\n00:09:20 - Fujinaka, M.D.\nIt's possible. Again, I don't actually get to choose their working schedule.\n00:09:25 - Tina Marie (profitdriversinc.com)\nget to pick their own. It's not about choosing. It's about understanding what the rhythm is, like why it's happening and what impact it makes. And these are the questions I'm looking at is because that's an anomaly. That's an inconsistency and I'm wondering why.\n00:09:46 - Fujinaka, M.D.\nThat's a really good point. Well, I'll read you the much data when you pull it up. So for April, there was 349 visits completed. Yeah, that's interesting. That dollar value actually should correlate like this total visits completed should correlate with the amount I spend on clinician.\n00:10:08 - Tina Marie (profitdriversinc.com)\nRight.\n00:10:09 - Fujinaka, M.D.\nAnd just saying that it kind of doesn't.\n00:10:11 - Tina Marie (profitdriversinc.com)\nOkay, well, so thousand for this month, but the month before which had less calls significantly or less appointments.\n00:10:25 - Fujinaka, M.D.\nOh, you know what, though, also they bill me at the end of each month. Wait, would that make sense? So they bill me bi-monthly so every two weeks. I don't know, should still show up. I don't know. Maybe their last payment is coming on May 1st.\n00:10:42 - Tina Marie (profitdriversinc.com)\nThat's possible.\n00:10:43 - Fujinaka, M.D.\nSomething like that.\n00:10:45 - Tina Marie (profitdriversinc.com)\nI just don't know what just February.\n00:10:51 - Fujinaka, M.D.\nMay 1st.\n00:10:53 - Tina Marie (profitdriversinc.com)\n16th. Yeah, that's just but those are very two very different types of things um yeah office expenses software okay and june is big but we're a number to come up that was a lot more this year that's just a definitely not a super consistent um in terms of and maybe it is the day that you get build and pay people out uh that would make sense if the payment for me went out in june because me was heavier yeah and also this invoice i paid my contract my not not contract i paid my staff\n00:13:00 - Fujinaka, M.D.\nlate so I paid them into in July so like there's zero for the staffing fee on this month right on July I think I've yeah I paid them in July yeah see the staffing fee went up here and the staffing is double there and there was zero in this month for staffing okay so what's the difference between staffing and clinicians clinicians are the doctor like the nurse practitioners and the staffing is my admin okay yeah I wasn't even noticing Guatemala they're all Guatemalans got it I'm stopping January February almost nothing and then March was really big That's why I don't know, like in March, I think I paid a couple of them late. I was there like their second month or first month starting, so it pushed over to the next month.\n00:14:08 - Tina Marie (profitdriversinc.com)\nThat was our first month. Okay, so there's still just a lot of getting going in this.\n00:14:15 - Fujinaka, M.D.\nYeah, very manual. Now I've given the payroll over to my manager, like the one guy that I'm paying a lot more, so it should be really consistent. think it should be more consistent. So August, this is pretty representative because I cut off all marketing, as I mentioned. The staffing was paid on time, the clinicians were paid on time. This should be pretty close.\n00:14:41 - Tina Marie (profitdriversinc.com)\nAnd the accounting, I assume most of this is accounting as well.\n00:14:46 - Fujinaka, M.D.\nI don't know, that's a huge number. Now that I've pointed out, I want to take a look. So I have this, a detailed statement here.\n00:14:55 - Tina Marie (profitdriversinc.com)\nSo the month before it was 9500. So And that does not correlate to any other month. I don't know, except for February, maybe they're catching up and doing stuff. okay. yeah, my bookkeeping costs $300 a month. So yeah, that stuff is actually because your today, your $19,880.\n00:15:35 - Fujinaka, M.D.\nOkay, I just uploaded something else into my Google drive that I shared with you. It's called the detailed profit and loss. This has like every check that I received, every deposit I've made. Okay. Where is that category? Oh, there it is. Yeah, so I included, I included my bookkeeping. I'm sorry, I included my accountant into that one.\n00:16:07 - Tina Marie (profitdriversinc.com)\nOkay, so one is but keeping the one as accountants.\n00:16:11 - Fujinaka, M.D.\nYeah, I just looked it all together.\n00:16:14 - Tina Marie (profitdriversinc.com)\nOkay, I mean for the P&L that is right.\n00:16:19 - Fujinaka, M.D.\nThere's no, yeah, there's no legal, legal fees. Okay, and so that looks correct to you for the cost of your account. Yeah, unfortunately.\n00:16:33 - Tina Marie (profitdriversinc.com)\nI mean, would you want to do that? Although it still seems pretty high for what you do. What's your accountant's hourly rate?\n00:16:49 - Fujinaka, M.D.\nHow are you billed? have no idea. He just they just invoiced me at the end of every year.\n00:16:59 - Tina Marie (profitdriversinc.com)\nYeah, you know. How do you get stolen from very easily have no idea?\n00:17:04 - Fujinaka, M.D.\nThat's a good point.\n00:17:06 - Tina Marie (profitdriversinc.com)\nSo I think you should get a detailed invoice for everything and go or with the find to call. I'm happy to do it with you. want to call if you just don't want to do it, but I'm pretty sure you can get a really good accountant for less than that. I mean, potentially you've got a lot of records and it takes a lot of time, but I think a good person would be able to do better than that. But at the very least, we want to take a look at it. And anytime you're spending thousands of dollars on anybody, the answer to what are you paying for should never be.\n00:17:44 - Fujinaka, M.D.\nI have no idea. That's a really good point. I will start asking. I'm actually looking at the invoice that they sent me right now and it doesn't really, it doesn't really say much.\n00:17:55 - Tina Marie (profitdriversinc.com)\nWhen you take your eyes off your money, somebody else will have their eyes on it and their hands on.\n00:18:01 - Fujinaka, M.D.\nThat's a good colloquialism. Sorry, yeah, I will, it's a really good point. I will ask them why is this money, this money?\n00:18:16 - Tina Marie (profitdriversinc.com)\nSo let's go back to the calls.\n00:18:19 - Fujinaka, M.D.\nAstronaut, so just Tina on that note too, before I had these accountants called Markum, I had another really quote unquote aggressive accountant. And we feel that the aggressive accountant saved us money, but it was driving us bonkers that he would get it to us like on the day of, or he would text us on the day of and be like, oh, hey, send in your taxes right now, send in your payment right now, to days today. And we did that for two years with them, we're like, we can't keep doing this. So we turned it over to a kind of a more of a corporate accountant called Markum. They're like a big box accountant. And, you know, they give us like reminders, they tell us how much we're going to owe. It's all very like clean, minus the invoicing, which I'll ask.\n00:19:09 - Tina Marie (profitdriversinc.com)\nlong as you're making a conscious tradeoff and that money is worth the convenience, that's okay. I pay convenience fees. had two storage units. Nothing I have in there is worth paying a storage fee. I don't have to deal with processing, memories, things that belong to my girls and my house. And so it's a convenience fee, you know, but I'm consciously choosing to spend my money on the convenience fee of delaying having to deal with it because it's not my priority. And I have the money to do it.\n00:19:49 - Fujinaka, M.D.\nAnd I, you know what I mean?\n00:19:51 - Tina Marie (profitdriversinc.com)\nIt's, if you are happy with your investment for whatever reason, but you consciously wasn't the reason. And I'm saying this again, because I want it, you apply it to everything. Some things, some people, some emotions, some experiences are worth the resource. In case I'm going back to paying the access fee for, for, yes. So, but you just do need to know, never, especially when somebody's job is money, say I have no idea. Account is a classic for embezzlement.\n00:20:33 - Fujinaka, M.D.\nI see it. No, it's, uh, thank you. That's what, you know, it's just one of the unexpected things I got out of this coaching with you is there's things that I sort of feel are I sort of felt bad about? Like one of the things is counting. I'm like, God, you know, I really should find a better accountant that's more aggressive. But yeah, thank you. I appreciate you saying that because you're right, it has been a conscious effort when everything else was kind of like going to, going crazy in our life.\n00:21:00 - Tina Marie (profitdriversinc.com)\nThis accountant was just very consistent and you know and Esther and I have always sucked like hey we are going to find a more aggressive one in the future but we need to stabilize our right now and that's why we're okay so I'm not thank you for saying that I do appreciate that but yeah on the flip side I do need to have I do need itemized invoices from this dude absolutely okay and always be aware of the trade-offs so like I don't do anything really aggressively anymore and I am type a Virgo perfectionist like all these things but the trade-off for my peace of mind it is that well it's priceless and one of the things that I realized a long time ago and it started with learning about the parade of principal so the 80-20 role but do you know the history of him as an economist and how he discovered it So he was an Italian economist and what he discovered was that 80% of the property in Italy was owned by 20% of the population.\n00:22:10 - Fujinaka, M.D.\nHow interesting.\n00:22:11 - Tina Marie (profitdriversinc.com)\nYeah. And so then he did some further studies but the correlation has been that roughly 80% of our results comes from 20% of our efforts. Obviously there's outliers and all these different types of things but when it comes to delegation. So I really like things done my way. I get really annoyed and frustrated when they're not my way but I have taught myself to let that go and just be glad that that thing is done because I didn't have to deal with it. And so sometimes the degradation of quality could be 5 to even 10% let's say if somebody else does it. It's less if I train them and qualify them. But the opportunities that are available to. me to experience of any type personally or professionally are increased and much more in alignment with my joy and my area of expertise when I'm not bogged down by the other things. So whatever it costs me, I'm more than make up because I'm putting my time in my most leverage which also tend to be my most profitable activities which also tend to be my most enjoyable activities. And so quality suffers in some areas but overall life quality and business quality increased. So I don't know what you mean by saying you need to have a more aggressive accountant. But this piece of mine or at least the systemization of the reminders and all these other types of things, that is something I would highly recommend for any of my visionary type clients because you're never going to want to deal with it.\n00:24:00 - Fujinaka, M.D.\nAnd they do that really well. Yeah, no, and I meant, I meant I think there are other ways we can cut taxes a little bit like legally. Oh, okay. That they're just not pushing hard on.\n00:24:11 - Tina Marie (profitdriversinc.com)\nSo you want a wealth manager in addition to an accountant, an accountant's job, some of them are going to look for tax breaks and to a certain extent. But a wealth manager, somebody who understands trust laws and tax countries and all these other types of things, accountants aren't taught that lawyers aren't taught that because those are institutions. Those and institutions are meant to serve the institution being the government. So they're not going to be taught the loopholes. They're not going to be taught all of that. And they don't want to get in trouble. They don't want to have it in their business. So you want somebody whose primary focus is on maintaining and preserving wealth. that is not an accountant.\n00:25:02 - Fujinaka, M.D.\nYeah. Yeah. That sounds right.\n00:25:06 - Tina Marie (profitdriversinc.com)\nSo have those conversations with Mark. Maybe he has some referrals for you. I bet he would. But it is definitely separate. keeping as much keeping more of the money that you make. Separate then totally come different conversation than accounting.\n00:25:22 - Fujinaka, M.D.\nYes. I appreciate you saying that. I need to be reminded. I know that. I do. I really do know that. But I just have to be reminded about that sometimes.\n00:25:31 - Tina Marie (profitdriversinc.com)\nWell, remember all of these things when you when you think about when the bill comes in November and be like, oh, yeah, that's why I'm paying Tina.\n00:25:39 - Fujinaka, M.D.\nOh, we're good. We're doing this for a year.\n00:25:43 - Tina Marie (profitdriversinc.com)\nI'm gonna we're gonna make this work. You're gonna I if we get to stick with it for a year, you would you'll be like everybody else and not want to quit. Because it helps to have somebody else doing the thinking with you. You can't think all the things.\n00:25:59 - Fujinaka, M.D.\nNone of us can.\n00:26:00 - Tina Marie (profitdriversinc.com)\nNone of us can. I've got I've got people in my corner too, and I'm like, oh, I don't know what I would never have thought that thing Thank you.\n00:26:08 - Fujinaka, M.D.\nWe are we are doing this for a year.\n00:26:10 - Tina Marie (profitdriversinc.com)\nI want I want to I want to do it for a year at least Good. That's a good commitment. Okay, so Um, let's look at this So I'm looking at the calls and we're looking Nothing really stands out other than the fact that you don't know about Some things so I want you to know those things and I'm going to Make that an assignment for you to get back to me next week Just either that you have sent out the request like to your accountants You so you want to atomize Invoice from him For month over month, right? Yep.\n00:26:52 - Fujinaka, M.D.\nUm, I'm just gonna call her Two people, but yeah, I'll just say hey, know, I'm trying to be more diligent send me And it's always good to talk to them so they know there's a real person.\n00:27:04 - Tina Marie (profitdriversinc.com)\nYes, and that person is paying attention and not asleep. Always good to know that the people watching your money know you're watching your money too. And so I would really like to see stopping hours so we can correlate this and just take a look at it. So if you have a staffing report that tells you hours worked over these months, do you?\n00:27:33 - Fujinaka, M.D.\nOh, no, I mean, they're all, you know, just full time from Guatemala. I have, I mean, I could just tell you the number of full time staffers. It's five. think.\n00:27:45 - Tina Marie (profitdriversinc.com)\nNo, so how when they invoice you, what do you just get a dollar amount?\n00:27:51 - Fujinaka, M.D.\nYeah, because everyone's working essentially 40 hours a week. I have a couple that are offset like one goes from nine to five. another one goes from like 10 to 6.\n00:28:02 - Tina Marie (profitdriversinc.com)\nAre they salary?\n00:28:04 - Fujinaka, M.D.\nYeah, I want me it's it's whatever I decide.\n00:28:07 - Tina Marie (profitdriversinc.com)\nOkay, so I'm trying to figure out okay um are we talking about clinicians or other staff?\n00:28:15 - Fujinaka, M.D.\nOh it's a staffing I consider my administrators is what I'm And they're their salary?\n00:28:22 - Tina Marie (profitdriversinc.com)\nYeah just the okay that's fine um but for your clinicians I would really like to see some sort of reports okay because their numbers vary quite bit okay and not necessarily in correlation with the volume and it may just be like you said that you pay on a different date but I would like you to inspect that okay so we go back to clinic volume the ml data um I can put a column well I could put one for like Elizabeth patient scene you know like right here I could put one\n00:29:00 - Fujinaka, M.D.\nthat says like Elizabeth, patient seeing, that would be great. They just something simple. And I could just literally put in how many she built me for it because she builds me by how many patients she saw. And then that's it. That's how I'm ambitious.\n00:29:16 - Tina Marie (profitdriversinc.com)\nThat would be great because, I mean, again, the more data we look at, the more you'll notice particular patterns, whether they're good or bad. But also, you just want to make sure you're not being taken advantage of like you, that's a base level of information you need to have, if somebody is sending you an invoice. Kids, sometimes even good people can be tempted when they think nobody's looking.\n00:29:45 - Fujinaka, M.D.\nOkay, I'll do that, thanks.\n00:29:48 - Tina Marie (profitdriversinc.com)\nOkay.\n00:29:49 - Fujinaka, M.D.\nI'll just do it for the other ones too.\n00:29:51 - Tina Marie (profitdriversinc.com)\nYes, yes, yes, you should do it for everyone for sure.\n00:29:55 - Fujinaka, M.D.\nOkay.\n00:29:58 - Tina Marie (profitdriversinc.com)\nThank you. But here's the other thing is, so I like tracking time as much as possible because these are your resources that your people's hours are your inventory, basically, right? It's you can only fulfill what your staff can fulfill or you and your staff can fulfill. So if you did decide that you know what, you're going to go just out out for a couple of years to acquire, like, grow your revenue so that you have more money to invest in other things and not worry about whether not you become a target or, let's say, just two or three year window, you're just going to go and tell something happens, grow and grow and grow. You need to know what your scalability is, what the capacity is of your clinicians and your staff to handle things and these numbers will give you the best indicator. But they'll also help you know, okay, so everyone Everybody fulfills a different amount of calls, patients, and what is the quality difference? So it helps to inform your hiring in the future as well. Pattern more after this person, pattern more after this person that we are actually a good blend if we have these, that type of thing. Again, the more data that you have, the better you are at scaling. So you want it for everything so that so can I show you my schedule?\n00:31:31 - Fujinaka, M.D.\nYes.\n00:31:32 - Tina Marie (profitdriversinc.com)\nwant to see all the things. It's all helpful. Oh, stop sharing.\n00:31:37 - Fujinaka, M.D.\nThere you go. I think you'll be, I don't know, you might be very amused at this. I'll just show it to you. So this is our Google calendar that schedule. So each clinician has the ability to add their own time slots. for Tuesday September 24 tomorrow, you'll see Elizabeth wants to work from seven to 10. It doesn't mean we're going to fill them with patients because obviously you don't have enough, but you can see she already has one. And then today we're going be trying to fill up her schedule today. But the limiting factor isn't necessarily you know, I guess how much they're working. It's how many patients we can get a hold of and schedule. And it's always a challenge on telehealth. People don't answer their phones. Do like tomorrow, everyone wants to work. Like three of the clinicians, Elizabeth wants to work at seven. She wants to work again at 12. Then Sherby wants to work a short shift in the afternoon from three to five. And then Angelina wants to work a short shift in the evening from five to seven. So, you know, we all want to.\n00:32:56 - Tina Marie (profitdriversinc.com)\nThat is very useful because it makes me want to say If you're willing to play the game and take a risk, and I'm not advising you to do that. I cannot. I don't know the extent of the cost of having somebody breathing down your neck, inspecting you and auditing you. So that's a real stress, and I tend to put a moat around my family for potential stress. Depending on what it is, some things I'll literally die for, but you have to decide what it is and also how you feel about it. I believe a lot in intuition and in addition to the logic and the analytics. what I would do out of just a curious exercise would be look at the average amount of time slots that your team wants to fill each week and look at how much you can see. like could you open another location and get another 400 people with your existing staff who wants to be working more and I might run those numbers and go you know what let's do that.\n00:34:13 - Fujinaka, M.D.\nI did my homework that you wanted me to talk to Mark about this question because before I had asked him what if I just expand you know he said you know don't I so I kind of dug into him more about like what's the reason and he said ultimately my name is on every note because I'm supervising all these so he said you unknowingly are already on every insurance's radar probably because they're looking at which doctors doing volume and so what he said is what he's seen is the sweet spot is about 400 a month and why is it 400 he said because if you take 20 working days a month where there's usually 19 or 20 working days a month and each doctor can see 20 patients a day insurance companies figure that each doctor can see roughly 400 hundred patients a month. And he said, if you start to show your name more than that, that's when you're going to get flagged. And they're going to say that is impossible for you to see that many, you must be cutting corners and they're going to investigate you. So he said, you could probably go up to 500 and say you're just a badass and you work on weekends. But he said, the more you stick out past that 400, the more chance you're going to get. And that was his answer. So I was like, okay, yeah, that makes sense.\n00:35:27 - Tina Marie (profitdriversinc.com)\nSo I said, the other way is you can go ahead.\n00:35:31 - Fujinaka, M.D.\nThe other way is you can look at expanding is you partner with a doctor, wipe your name off of it. Like you have to start his a clinic for him or her. You'd have to, you know, run his practice. They would have to pay you secretly, not secretly, but like pay you as a different company. You could do it that way. he said, know, in that way you would avoid your name getting on all these insurances, as long as you were just literally their manager or something.\n00:36:00 - Tina Marie (profitdriversinc.com)\nconsultant.\n00:36:01 - Fujinaka, M.D.\nYeah, like a consultant. So I mean, I've thought about doing that. We actually tried, Mark and I actually tried to do this for Arizona for a nurse practitioner. But when we were going through it, there was a lot of issues with how I was going to get paid as her manager that I just didn't feel safe about. And Mark was like, yeah, this is, this is no point out.\n00:36:25 - Tina Marie (profitdriversinc.com)\nWell, what if you did it as a consultant or like an equity partner in a business that I don't know how you could do that as a, you know, is if the doctor can be a business and like a corporation, I have no idea how that would work. But I would ask and I would probably be somebody around tax law, a tax attorney that you might, sorry, oh wait, I got to change that time because I A tax attorney to corporate tax attorney, actually, because structure would be important. And then probably a contract law attorney to figure out what is the best way to protect your money and make sure you get paid.\n00:37:26 - Fujinaka, M.D.\nIt was actually, I actually have a malpractice attorney and it was actually a kickback issue with the payment. Not so much corporate because Mark and I could figure that part out, but it was the, it was getting around the kickback law for physician providers. We couldn't transfer that money to me.\n00:37:46 - Tina Marie (profitdriversinc.com)\nThat's why I'm talking about talking to a corporate attorney because the structure will make all the difference. Now, being in medicine, I don't know what structures are available to you, but if you're not, the doctor, if you're just a structural advisor, right, you're saying this is how to set up your business, this is how to run it, this is how to market, this is how to all these things, right? If you're just advising, but you're basically like, I've got the cookie cutter plan, I can't go expand this, why don't you do this and I'll guide you through it. But for a fee, and that way, you avoid learning all the things that I had to learn and whatever.\n00:38:33 - Fujinaka, M.D.\nso it's kind of like, oh, it was that fee, what you just said, that was it. But yeah, I mean, I could take a look again, it was that it was that exactly that fee, because to make it worth it, I was trying to get a certain dollar amount. And to my malpractice attorney, that was like, if anyone looks like this, this is an absolute kickback. And I was like, yeah, I don't know.\n00:38:58 - Tina Marie (profitdriversinc.com)\nYeah, because you're a doctor, they're maybe no way around that.\n00:39:06 - Fujinaka, M.D.\nYeah, so anyway, that was that simple. The simplest way, Mark, and I thought we could expand this. just it became not simple with the fee structure we had to set up. But yeah, I mean, maybe looking at asking like a different question about like if it's about the corporate structure. But at the day, it came back to how am I getting paid. How is the how is that company getting paid as a fee? And the line was really blurred about.\n00:39:38 - Tina Marie (profitdriversinc.com)\nIf you are a marketer, if you had a company and it was a medical marketing agency per site, and your role is marketing technically on paper, but it's a little bit more advising than that. I mean, they can play they can pay a marketing agency. You can And, you know, your agreement could be, here's our invoice, whatever. I don't know, you'd have, but I would, I would talk to somebody creative about structure, who knows the law, especially for you as a doctor, because you have different rules you have to play by.\n00:40:21 - Fujinaka, M.D.\nWell, you know, next meeting, I'll bring back what my malpractice attorney said, and I guess we could take look at what that would look like, because it's not about, to me, it's not about the structure. It's about what's safe for my license and getting paid the fee. So I could show you what the malpractice attorney said, like we're safe structures. And from there, we could see if it's worth exploring the structure, maybe.\n00:40:47 - Tina Marie (profitdriversinc.com)\nYeah, because I didn't even know he gave you ideas about what were safe structures.\n00:40:52 - Fujinaka, M.D.\nYeah. Well, it wasn't structures. was about how we can arrange the fees. Like, how am I going to get money from the. the doctor. Yeah, back to me because I'm not doing this for free and I'm not going to.\n00:41:09 - Tina Marie (profitdriversinc.com)\nSo we did the effective hourly rate calculations, right? And your time for QME was between 25 and 36. No, it was one on the second. Where were those numbers? I feel like there's like, what is that document? What was it? I did it, right? Did we put it in your time sheet homework?\n00:41:48 - Fujinaka, M.D.\nDo you have cough?\n00:41:56 - Tina Marie (profitdriversinc.com)\nI'll find it. Because I remember that July ended up being more than you thought it was and more than five hundred and I think that was Q&E and I think July ended up being like three thousand sixty six or something like that.\n00:42:37 - Fujinaka, M.D.\nYeah that's probably based on my our estimates though on the real numbers right now I don't think it's making any more close to that.\n00:42:44 - Tina Marie (profitdriversinc.com)\nYeah I would agree the more that I've seen. Gosh dang it where is that? Let see if it's in my notes here. Just scroll down. It is not in those notes. Where the heck did we... Put it, I wonder if it was in one of your docs, like that you own, not in these.\n00:43:16 - Fujinaka, M.D.\nWe just did an app calculation. don't know if we actually wrote it.\n00:43:21 - Tina Marie (profitdriversinc.com)\nmight be an units, the phantom notes, though. Adam, yeah. Um, I'll go find that. So, but let's say your effective hourly rate, we'll just call it 2000 for right now. If you got a $2,000 an hour, roughly. Um, on a second, let's just do more paper napkin math, 2000 times 20 times four. I was saying, like, if you were 20 hours a week in $20,000 to be $160,000. Which. It's not going to get us where we want to go. So that's the kind of reverse engineering that we want to do, too. I don't want to.\n00:44:07 - Fujinaka, M.D.\nSomeday, July. hope July Medical will be that, right? I mean, I don't even work 20 hours, but someday I hope that that's what July makes.\n00:44:16 - Tina Marie (profitdriversinc.com)\nIt's about 160 a month. But how, well, okay, never mind, because we just haven't gotten to the payouts yet. So that's a big part of it while you do that. So what I would like to see, I do want to have gross and net revenue in this clinic's volume for the month, even though it's not corollary to that particular month, we're just watching everything grow over time, if that makes sense. So because you only started in April and we're looking at roughly 12 to 18 months for payouts. So, just seeing how that number stacks up over time while we're looking at this, knowing you've almost hit the ceiling for how many referrals, right?\n00:45:16 - Fujinaka, M.D.\nIt's 400 referrals a month, right? Probably more the visit, the visit count.\n00:45:22 - Tina Marie (profitdriversinc.com)\nThat makes sense. Okay, so total visits. High for visits.\n00:45:29 - Fujinaka, M.D.\nYeah, Mark said I could probably push to 500, but he said I'd be careful any higher than that. Why is it 400? careful and higher than 400.\n00:45:39 - Tina Marie (profitdriversinc.com)\nSo, again, we're right around the threshold.\n00:45:41 - Fujinaka, M.D.\nYeah, we're right there.\n00:45:44 - Tina Marie (profitdriversinc.com)\nSo, let's just do it now. Let's do this. I'm going to.\n00:45:52 - Fujinaka, M.D.\nThis was part of the reason Mark was like, you know, you can pick and cherry pick the cases that pay you more, right? I stopped taking dog bites. I stopped taking dog I slipped in fall cases where people fell in Walmart, know, and now I'm just taking car collisions because I can, which is...\n00:46:12 - Tina Marie (profitdriversinc.com)\nWhy? Oh, comments only. I can't edit this.\n00:46:16 - Fujinaka, M.D.\nOh, I can take that off. Okay. Oh, the reason I didn't want to put the money on here was because this is shared with my manager at all. And I don't want him to see how much we're making. But what I could do is I could just mirror this chart onto a separate one for just you and I, and then we can consolidate all the data.\n00:46:36 - Tina Marie (profitdriversinc.com)\nLet's do that.\n00:46:37 - Fujinaka, M.D.\nLet's just duplicate it. Okay, I'll do that. Can you send me a reminder email about my homework?\n00:46:43 - Tina Marie (profitdriversinc.com)\nI didn't get one last week, so I was talking about what I needed to do. Yep, I will.\n00:46:51 - Fujinaka, M.D.\nYeah, because I remember last week I asked you what you remember and I didn't send it to you, but I will do that because it...\n00:47:02 - Tina Marie (profitdriversinc.com)\nOkay, so let's just go ahead and do this. you mind if I make it? No, you make the copy because then you're the owner and then share it with me.\n00:47:12 - Fujinaka, M.D.\nLet's go ahead and put this number in real quick.\n00:47:15 - Tina Marie (profitdriversinc.com)\nBecause we've only got 10 minutes left yet anyway. And really, like I said, the next few weeks, it's going to be all about the numbers.\n00:47:37 - Fujinaka, M.D.\nAll right. Oh, and then while I'm making this, if you want to look at that. The homework sheet on the tab. I put in my recruitment fees. It's the Google sheet where you had me make a tab for each of my business streams of income.\n00:47:59 - Tina Marie (profitdriversinc.com)\nOkay.\n00:48:05 - Fujinaka, M.D.\nSo I put in all the amounts of money that comes in.\n00:48:12 - Tina Marie (profitdriversinc.com)\nRight. So what I had asked for that also is a description. And I know that this is what you're talking about wanting to email a description of how that money comes in. Like where does it come from? What do you have to do for it?\n00:48:33 - Fujinaka, M.D.\nI put it. I put a little bit on the top.\n00:48:35 - Tina Marie (profitdriversinc.com)\nI know how to do that? Oh, it's down at the bottom. Hold on. Let me scroll. This company. You said what you need to do and what you can do, but not really how it came to you.\n00:48:56 - Fujinaka, M.D.\nOkay. Yeah. Okay.\n00:48:59 - Tina Marie (profitdriversinc.com)\nYeah. So this is what I'm going to do here.\n00:49:03 - Fujinaka, M.D.\nThat I literally don't do anything for. It just pops into my bank account.\n00:49:08 - Tina Marie (profitdriversinc.com)\nHow? I put a little box in there for you. To populate. Okay. Did you. Duplicate that and share it.\n00:50:04 - Fujinaka, M.D.\nYeah, I'm right now.\n00:50:10 - Tina Marie (profitdriversinc.com)\nI won't talk to me to rule them all.\n00:50:24 - Fujinaka, M.D.\nOh, import range. That's what it is. OK.\n00:50:31 - Tina Marie (profitdriversinc.com)\nYou know you could have just made a copy.\n00:50:34 - Fujinaka, M.D.\nNo, I want it to when I want my manager to update this clinic volume ML data and then have it real time update.\n00:50:42 - Tina Marie (profitdriversinc.com)\nOK, you mean Mark's farm.\n00:50:46 - Fujinaka, M.D.\nGood job.\n00:51:16 - Tina Marie (profitdriversinc.com)\nBecause what we're going to be doing, and I know I've explained it, but is figuring out, so I'm going to create a tab that's going to have a calculation from all of these, from QME, July, test prep, medical company, physical recruitment, then a little formula that's like, so here was last year's gross revenue, and that revenue, because we want to at least not decrease the profit margins, right? But what we're going to do is figure out, Throughout what percentage of increase across each of these will get us to 2x without significantly impacting time. And so it'll be a bunch of like playing with different numbers for a while and seeing which one gets us there the fastest and which one gets us there the easiest and then kind of finding a blend between the two. My path is always whatever the fastest path the cache is where it intersects with the fastest path of freedom which means less work, right? That's where you have the most leveraged and optimized opportunity. So all of these numbers is what helps us pinpoint that spot that like it map out our navigational system. This is where we're going and why because it's the safest like easiest. Most leverage route.\n00:53:12 - Fujinaka, M.D.\nOh, that's about anyone with like this. Oh . Well, play around with it. I don't remember how I did it last time. goes. Okay. All right. So on this, I will consolidate all the financials so we can see it prettily.\n00:53:49 - Tina Marie (profitdriversinc.com)\nNice.\n00:53:51 - Fujinaka, M.D.\nAll right.\n00:53:53 - Tina Marie (profitdriversinc.com)\nOkay. I will take a few minutes to just go back over the notes from. Last week and this week and summarize that and put that in an email for you to make sure that we're on track, but, but this is it really organizing the data across the boards so that we can analyze the data across the board very quickly and simply. So that we can go look for the most leveraged opportunities and then take action.\n00:54:24 - Fujinaka, M.D.\nThat was a good.\n00:54:26 - Tina Marie (profitdriversinc.com)\nAll right, do you have any other questions, thoughts, things? Nope. Okay.\n00:54:33 - Fujinaka, M.D.\nReady to do it.\n00:54:34 - Tina Marie (profitdriversinc.com)\nLet's do it. All right. Do you have a great week is great talking to you always. Thanks. you Bye. Bye.\n","contentPreview":"00:00:04 - Tina Marie (profitdriversinc.com)\nHi. Sorry. It's having weird issues with Zoom today.\n00:00:09 - Fujinaka, M.D.\nOh, I'll get it.\n00:00:16 - Tina Marie (profitdriversinc.com)\nThe worst time...","processedAt":"2025-05-04T03:40:52.590Z"}