{"fileName":"Done Transcript for Maria & Tina🪄(5).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Maria & Tina🪄(5).txt","type":"transcript","priority":"medium","content":"00:00:06 - Tina Marie (profitdriversinc.com)\nAre we there?\n00:00:07 - Maria Gudelis (Maria Gudelis)\nI am. Oh, sorry.\n00:00:09 - Tina Marie (profitdriversinc.com)\nI did have my video on. How are you?\n00:00:12 - Maria Gudelis (Maria Gudelis)\nI'm like on fire.\n00:00:14 - Tina Marie (profitdriversinc.com)\nYeah.\n00:00:15 - Maria Gudelis (Maria Gudelis)\nYeah. don't know what it is. I just feel amazing today. I hate popcorn yesterday too, but it was good popcorn from this store that doesn't have butter in it. It's not like the crowd popcorn. So I'm thinking like I even had carbs. Why am I feeling so good today? But yeah, you know, I didn't go. This is all about you, this call, by the way. So five minutes of me and then all about you because you said you had lot of questions and stuff. So I want to help you. But what happened, which is a big deal, is I've been thinking over the last two weeks to four weeks whether to stop working with Krita, like who I love. And she's still a friend. But I had a big realization a few weeks ago that by me becoming her full on 50-50 business partner, like about eight months ago, she lost her coat. and I became within her partner and well you'll be proud of me. I've been asking her for the financials because I haven't had a good breakdown of financials because we're 50-50 split and I just had a feeling. I keep asking for it and to make a long story short yesterday I get the box of her saying maybe it's best you know I'm really burnt out right now if we just split ways. I still haven't got the financials. So you know I'm not super pissed because even if numbers were making great money with her because the last two months things of slump but also I was sick she was sick like there's a lot of reasons why. But I also felt it's not in my heart to teach people how to start a Shopify boutique store even though I can teach it like you know blindfolded. It just isn't and so so you know going back to what's my anchor right and all that stuff and in my heart is the compass and bada. My heart is my and it was serendipity getting that text from her. So I called her right away because I always thought, what the ? We embarrassed right once and it's a text, you know? So I called her right. said, look, I get it. You're burnt out too and stuff. So yeah, I get it. Why don't we just call this a 30 day break as well? And yeah, full on, but there might still be something in 30 days to at least see where we're at and really what I was building that in is like, I still want to see you know, at least have her admit that there's money owed to me.\n00:02:34 - Tina Marie (profitdriversinc.com)\nYeah.\n00:02:36 - Maria Gudelis (Maria Gudelis)\nSo that's kind of where that goes. So I'm just kind of pulling back. But I'm happy about it because I knew it wasn't really where I needed to go and I knew I needed to start standing up on my own because I was hiding behind her all the success. Right? So yeah, yeah.\n00:02:51 - Tina Marie (profitdriversinc.com)\nYeah, it is. First, I have to tell you, I made a mistake with a meeting schedule. with my missionary calendar. I have the missionary training in half an hour that I thought was in an hour and a half and it's done. Okay. So we'll need to figure out where to fit the hour. Well, it's only every other week. So every other week we can do this. yeah. But the actual, the questions I have are all around you anyway.\n00:03:23 - Maria Gudelis (Maria Gudelis)\nNot my stuff. it was no, it was all for you. Oh, okay.\n00:03:28 - Tina Marie (profitdriversinc.com)\nWe'll see you later. Bye. done. Oh, we're digging. We're digging. But this is amazing. This is perfect. And that's the thing about the deep work is it's liberating and it's energizing. When you don't realize, you know, when you feel kind of trapped by something.\n00:03:48 - Maria Gudelis (Maria Gudelis)\nAnd a lot of times it's multiple things.\n00:03:51 - Tina Marie (profitdriversinc.com)\nAnd usually the thing is actually how we feel, not a person, the thing or whatever. We get into situations with people and business and things as a result of not knowing how we really feel or What is really driving us? so but You and I'm gonna bring Heavenly Father into this because you Without fail I'm always thinking about where to start back. So I'm gonna go back to laws of mercy and justice So why did Jesus Christ have to do what he did? because the law of justice requires a Penalty and a price to be paid for transgression of the law The laws exist in order for us to be able to have peace For us to be able to have light to be protected from darkness is good and evil is evil and when one offends the other the price has to be paid Jesus was the only one strong enough and able enough to live in this world and never transgress the law. He was perfect, no matter what happened to him. Because of that, he enabled the law of mercy to be fulfilled. because he paid the price, he can reclaim anything, anyone, as long as it doesn't go up to taking over the law of justice. So he can't reclaim more than the price that he paid. so we have a certain level of requirements to meet in order to help him meet the law of justice with his law of mercy. So prayer and faith and efforts help fulfill the law of justice. The law of justice, says, he can't just give it to you for free. He paid a certain price, but there's a bigger price that has to be paid.\n00:06:07 - Maria Gudelis (Maria Gudelis)\nSo in order for God to give us all the blessings he wants to do, he can give it up to a threshold, right? But then after that, he says faith precedes the miracle.\n00:06:16 - Tina Marie (profitdriversinc.com)\nThere's reason he tells us that over and over again. I love that. Faith precedes the miracle. But the reason faith has to precede the miracle is because of the law of justice. So he doesn't hold blessings back from us because we're bad, because we're naughty, because whatever. He's a perfect father. He wants to give us everything. But the law of justice, even he has to obey. If he fails to obey that law, he ceases to become God and he ceases to be able to protect us. The law has to be obeyed by all can't be circumvented, but it can be satisfied. Jesus satisfied so much of it. The rest of it, we have to satisfy with our faith.\n00:07:04 - Maria Gudelis (Maria Gudelis)\nSo every time we take an action to draw nearer to the Lord.\n00:07:00 - Tina Marie (profitdriversinc.com)\nto pray, to act in his name, to read the scriptures like somebody who's been doing, and to share that she's reading about the scriptures, she is fulfilling and satisfying a measure of the law of justice, therefore bringing you blessings that the Lord has been waiting to give to you, but needing you to activate, and you just activated it.\n00:07:24 - Maria Gudelis (Maria Gudelis)\nThat, I never connected the dots. That's like, it's like a tickling sensation now, everywhere, because it's like, that's called the Holy Ghost. Yeah, it's amazing. It's amazing. You're right, because like, it occurred to share my journal history, and then if you saw my videos this morning at the sunrise, I did. Yeah, I had a story about Psalm 23, and then the birds come in on the tree.\n00:07:52 - Tina Marie (profitdriversinc.com)\nI didn't hear that part, because I dropped my daughter off at seminary, because it's only 830 here, and I've been up for three hours.\n00:07:59 - Maria Gudelis (Maria Gudelis)\nOkay, it's just on the stories. It's not a video I posted on Facebook page post but under my Facebook page stories. There's one video and it's really short but it just says I'm reading Psalm 23 here and as I'm reading all these little birds come into the branches on the train and it's not picture of me. It's just a picture of me the video showing the branches and the birds swooping in.\n00:08:25 - Tina Marie (profitdriversinc.com)\nSo it's amazing. So my experience is that the closer I, the more effort I put into communicating with the Lord every single day, the more clarity I have, more confidence I have, the more of those experiences like that, that feeling of the Holy Ghost, his job is to testify of the truth of all things. It's the bare witness of Jesus Christ and it's the bare witness of God but it is also to be able to tell you, Maria, that's an AI video. Literally anything that is true, he will and can tell you. So your effort part and to know God and to be able to be worthy and in tune with his spirit will bring you so much clarity that comes out of nowhere. And you're like, how do I know this? But I know this.\n00:09:11 - Maria Gudelis (Maria Gudelis)\nI don't just think I know. Yeah, yeah, yeah.\n00:09:15 - Tina Marie (profitdriversinc.com)\nSo things about like, I think something's wrong, but then like a piece about it, like something's wrong. And I need to deal with that. But it's going to be okay. Like, you know what? This was not right. But probably what I did wrong to put myself in a situation or here's what I did that was maybe less than my best.\n00:09:35 - Maria Gudelis (Maria Gudelis)\nMaybe not wrong. Maybe not right or wrong.\n00:09:37 - Tina Marie (profitdriversinc.com)\njust I wasn't showing up as strongly as I know that I can. I was hiding or I was playing smaller. And I don't need to do that anymore. So I can be a piece for my part in being in a situation that wasn't forthright. She's not sharing the books with you. That's not worth right. That's not honest and it's out of integrity. And way more out of integrity than hiding behind somebody else, you know. But now you get to the other thing that the Holy Ghost does and Jesus said that when he left that God would send a comforter and that is the Holy Ghost. And that's what he does. He comforts us. can be literally in the middle of a storm and have everything burning around us and still have peace, know who we are, know who we are, know where we're going and just be okay. So you are activating all of that with your efforts and it's going to be, it's going to keep getting amazing if you keep with it.\n00:10:40 - Maria Gudelis (Maria Gudelis)\nThank you. Yeah, I know it feels me because it's like, I just feel so good. I was like, why? like I had popcorn last night. But you know, I did go for a workout yesterday afternoon. So that was good. But I'm like still going. like, had bread. I normally try to not have any reduced carbs, but I usually don't. don't have gluten in it. I had a, you know, a half a little half a big get, you know, it was like, I should be like feeling like lethargic and bloated. I slept so so, you know, and I'm like, what's going on? True is powerful.\n00:11:16 - Tina Marie (profitdriversinc.com)\nWhen you when you get that spirit, the spirit is what's powerful.\n00:11:20 - Maria Gudelis (Maria Gudelis)\nThat's what you're feeling.\n00:11:21 - Tina Marie (profitdriversinc.com)\nYeah. Okay, so I've learned some new things about you. And that's great is that you actually have a really strong connection to God for it to be that activated that quickly.\n00:11:31 - Maria Gudelis (Maria Gudelis)\nso it wasn't not there. It was just dormant.\n00:11:34 - Tina Marie (profitdriversinc.com)\nYeah, yeah. What question I do have for you? And my questions just go straight into things. If you don't want to talk about something, you don't have to. But I was wondering two things, how you got started. Okay, I actually multiple things. I'm just going to pick a bunch of things, tell them to you. And then I'll let you pick which one you want to answer and what's about. How did you get involved in business and what do you love about it? Two separate things. What do you love most about it? And how long have you not been with your husband and how much was your business relationship, your relationship with business attached to him? How much do you think your validation, your skills, your networking, your connection, your whatever, and success is tied to that in your mind or what you think might be in other people's minds. So these are the things that I'm just kind of thinking about. Is there some kind of separation that still needs to happen between the past and the present to be able to stand even more on your own two feet? Are you also maybe in a shadow of the past, not not just the\n00:13:00 - Maria Gudelis (Maria Gudelis)\nOh, I'm sure of it. Yeah. Like, again, I think by asking God for help, I think it's now helping me, you know, put more light on me and no shadows, but yeah, definitely there's a shadow in the past. So, so to answer your questions. I've always left this as a kid, my, you know, being one of four siblings. The other three were more because my dad was a chemist, and he worked as an executive, though, from Corona.\n00:13:28 - Tina Marie (profitdriversinc.com)\nSo, but he had a lot of patents under his belt for chemistry and oil and stuff.\n00:13:32 - Maria Gudelis (Maria Gudelis)\nSo, yeah, so he kind of had the mix of both business and chemistry. My mom was a nurse, and then she became, and she did yoga. So I was all into that too, because it was fun with her to do that. And then she then started painting. So, but as a kid when my brother's sister was more into chemistry becoming a chemical engineer, or my two brothers are chemical engineers. My sister got a pharmacology, toxicology, and we can't got a doctorate in it and all that. And then she went and worked at Charles Sick Kids Festival quite a while before, you know, stay home with the kids and all that stuff. So for me, I was a love business, like I loved, like, reading the stock. I loved having my dad teach me how to read the stock market, but, you know, the papers, you know. so, and I invested when I was a kid, I had the paper out. So I was, yeah, you should, yeah, do you do, yeah.\n00:14:26 - Tina Marie (profitdriversinc.com)\nI bought my first dirt bike.\n00:14:29 - Maria Gudelis (Maria Gudelis)\nI didn't buy a girl bike. I bought a dirt bike when I had a paper out at 11. Okay. This is scary. Mine was a Yamaha YZ 80 dirt bike.\n00:14:40 - Tina Marie (profitdriversinc.com)\nThis is weird. One is one of those. Actually, what I thought was a huffy and it was royal blue with bright yellow bags and it had trick, trick pegs on it for freestyle.\n00:14:52 - Maria Gudelis (Maria Gudelis)\nOh my God. Yeah. Mine was black and yellow and I hid it for my parents. Cause it was money from the newspaper route as well. And they didn't want me to get one. So I bought it used. But I hit it at my friend's house for the longest time, like months before they found out and then they let me because we had a big backyard and then let me ride around there. But yeah, was like grade seven, it was around that, grade six.\n00:15:11 - Tina Marie (profitdriversinc.com)\nYeah. Actually, I might have been 12, I probably was 12, some are right a while.\n00:15:21 - Maria Gudelis (Maria Gudelis)\nSo yeah, and then I enjoyed reading the stock markets and all that time for both of us, no internet existed. So it was always the paper. And, you know, probably in other world, you know, I may have become an investment banker, right? Because I did walk out of the investment banking interviews when they interviewed me at the MBA after my MBA school, but I just thought they're too arrogant, so I'm like, okay, I didn't know you had an MBA, so, oh, yeah, yeah, yeah, so, yeah, so, so, so with, so now grade 12 with, again, the money from the, like, shoveling people's snow in the winter too, but that's right. Yeah, I used to cut grass. Yeah. Yeah. uh, yeah. And then from the newspaper route, I remember bringing in 1000 cash. Like I didn't have a check at that time. I think I had a little bank account for my little dimes and stuff. And then I took 1000 cash to my dad's stockbroker. And I said, I want to buy shares of Nova Corp, which was a gas company could be in Sardir. Most things are a gap. And he's like, well, most people bring a check. But yeah, so I guess I was always interested in business.\n00:16:30 - Tina Marie (profitdriversinc.com)\nSo amazing.\n00:16:32 - Maria Gudelis (Maria Gudelis)\nYeah. And then, you know, maybe you did this too, because I assume it's in the States too.\n00:16:36 - Tina Marie (profitdriversinc.com)\nThen I did junior achievement.\n00:16:38 - Maria Gudelis (Maria Gudelis)\nOh, yeah. One summer. So that was really good. And we made these little handmade clocks, and I love sales. I won the sales award that summer of the most clocks. So I'm just knocking it in the door. Um, and then when I went to school, um, you know, was pure science, mathematics, and then business school. So, uh, yeah, so I, and then I think I then, I wanted to be not fair, but believe me, MBA school probably different nowadays, but then smashes out the entrepreneurs. It makes you become a CEO. want you to go to corporations because the school I went to in Canada is called University Western Ontario. It's the Richard Ivey school business. It's like the Harvard of the North, like it's kind of it's an Ivy League business school and all that jazz. So people usually go and work from a Kinsey or Goldman Sachs after or bigger because I like firms. And so that's why every year. So so that shows that it wasn't all about money, even though I am money driven, because I just thought these guys are too arrogant, even though you're going to make a million dollar salary. But I decided I wanted to create something rather than just shuffle paper. So I ended up working actually by first offer Shell Canada and Calgary in the financial department, because I wanted also a life. So Calgary is fun because of the Rocky Mountains, you go skiing on the weekends, all that stuff. So that was good. And then while I was there, I still had that in entrepreneurs. because I perform really well, I've got to know a lot of people. And I remember when I went to Boston, I was like, you're probably going to end up being the Prime Minister of Canada. Like, you know, he's on it, especially you. Yeah, he's like, don't think you don't belong. You even though you'll do well here. But I kind of think you're going to either form your own company or do something. So yeah, so then after that, I then I worked for PricewaterhouseCoopers as an SAP business process ranger and consultant. And then I was in Switch because at that time, SAP consultants were really in the man. So I had a doctor call me from the States and said, how would you like to work for computer science corporations and states? And so I moved and worked for them because then that's what I'm making, like say 100,000 Canadian make 100. 10,000 US, which is like 150,000 K. I was like, ah, you know, you know, when you're in your late 20s, you're like, this is exciting. So, yeah, and every six months, you're in a different city for different client. Like, I was, like, they put me up at a penthouse with Retina Square, Philadelphia. I was on Millionaire or Miracle Mile in Chicago, working for Amaco for six months. But I was getting tired. I'm not meant to be in a box and I kind of wanted to be partnered. But, um, and I don't know if this was your thing when you were in the corporation. I just really had our time being having a boss too at the same time. So I always thought about starting my own company. So I think it's by having the crutch of Rudy, because that I met him when I was like 28. And that's when I was working for a computer science court and he proposed me in 1999 because we got married to 2000. And both of us kind of always thought, ah, maybe we should start something on our own. And so what happened is I was the one to quit first and I wrote a bit This was planned on his kitchen table because then I was living with him California because we were getting married soon and we wrote like I covered with this plan but he put it on and then we got a million dollars financing from Silicon Valley because it was the year 2000 when the internet was just starting and people were just needing websites. So we're like cable charm which is competitor to Cisco funded us a million else provided all their servers so we created a server farm like so basically started hosting company websites back then right. Yeah, and now Rudy because these Dutch just and I'm saying this because it really is cultural cultural cultural he can come across any is arrogant I'm not going lie like he's what do you Basically married into that too by the way gosh okay yeah but he treats other people like I'm just gonna say it right so so I started realizing that because you know that's what you and I were attracted to you read the part about me. The mama bear people call me the mama bear I can build communities, you know, and I love building communities and uh But I kind of put up because like people sauces the power couple right cuz he he's like he his IQ was hard Mine I had a high IQ, you know Because I even skipped grades when I was a kid because they didn't put me half and uh probably needed to I graduated with honors. didn't sit school because they tried to put me in the talented program They tested me and they're like oh, not as smart as we thought you were all my teachers like you've got to be in the gifted program but my kind of smart can't tested so Not that way anyway anyway, so so um But yeah, like like he would like call in all the programmers because we're doing a lot Java programming and stuff and creating some pretty cool stuff online for companies and He would call 90 a meeting and our software programmers their culture. They they like to work till 2-3 in the morning, right? And and so he called morning morning at 9 and mean really on a good health regimen like we would go We play tennis you know, because of the California, why would he play tennis, right? Belong to the tennis club and we didn't belong to the gym, we'd go in the mornings to the gym. So he'd soldier in at 9.30 because he had a workout with a private trainer and we're all waiting for him at 9. all the programmers woke their, you know, sleeping in until 2 programming. And like, that's the kind of, like, shenanigans he would be pulling, like, and he didn't care because like, well, they worked for me. I paid their salary. I don't care if they're waiting. Like, he's really hard to have a slow lineup. I remember getting in fights with him back then, you know. So anyways, so that's the dot com crash hit. And so everyone got hit. So all of our clients, we actually had a good business model, right? know, server, but we targeted small to me. So as companies, I got funded in Silicon Valley as our customers. So the bubble hit, all of a sudden, they could pay us. So we basically had to dissolve the company. And then that's when we went back to consulting, but kind of independent consulting, like I I worked for some friends that had a small SAP company, they would fly me off to whatever the client site would be, like the Department of in North Carolina. So I'd be put up in Raleigh, North Carolina, worked there. So we were separated for a while, because you'd fly home some weekends or whatever. But we basically did what we could to get work. He worked for a smaller company. And then we went to one of those real estate weekend courses that Robert G.\n00:23:26 - Tina Marie (profitdriversinc.com)\nAllen had.\n00:23:27 - Maria Gudelis (Maria Gudelis)\nAnd that's how he became my first career. OK. Yeah, I ended up being on one of Robert G. Allen's, well, me and Rudy, on an infomercial. Because we went to his three-day thing that's free, and then we got sold into his $5,000 thing. And that's where we learned how to do no money down real estate investing. So we just took massive action, loads of pliers everywhere, started buying those properties, flipping them and stuff. So that's where we were featured on infomercial, we didn't really well. Yeah, the real estate crash happened, so we lost everything. So I knew I needed to leave them in 2005, we got married in the year 2000, and so basically we lost everything, and long story short, divorced them, so yeah.\n00:24:20 - Tina Marie (profitdriversinc.com)\nWhat year did you divorce?\n00:24:23 - Maria Gudelis (Maria Gudelis)\nWe were separated in 2000, towards end of 2011, summer, and it was 2000, so we're separated, I was living in Canada, 2015, I think the official divorce went through 2015, because it was easy.\n00:24:42 - Tina Marie (profitdriversinc.com)\nThat's true, took you a while, huh, I know the feeling.\n00:24:45 - Maria Gudelis (Maria Gudelis)\nYeah, because we didn't really have that in the assets, don't mind you, I still am convinced that you had a lot of money in Dora, I think you opened up a private account in Dora, because after the divorce, my dad was getting so mad at my sister. as well, like on Facebook, they'd see him traveling everywhere in Europe, like at all these amazing places. I'm like, I'm pretty sure yet he was stashing money away. Are you sure he didn't make money from your businesses, Maria? I'm like, oh, no, we didn't.\n00:25:14 - Tina Marie (profitdriversinc.com)\nBut now I wonder, you know, I asked to go get ready for this meeting because it's a mandatory meeting and we're learning new things for our Jenny, I'll do what I'm so excited about. But what I would really love for you to do, so here's the thing about the way I did I work. I go deep and fast, but the relief comes quickly and you may already even be experiencing it. It's just from the questions. I don't do the work. You do everything, but what I'll do is ask you questions.\n00:25:44 - Maria Gudelis (Maria Gudelis)\nNobody's asking them.\n00:25:46 - Tina Marie (profitdriversinc.com)\nPeople don't ask number one because they don't think about it too because they don't care or three because they're afraid and they don't want to bring up painful things. But I think that that fire that you're looking for is just right there and the path. So there's a combination of defining the thing and then all it is is you've already got so many assets, there will be a particular offer. My experience is that there's always a hybrid of offers, a hybrid of work that you do, one that is the most leveraged financially and time-wise and one that is passion and your kind of give back thing and there's a meat in the middle and a spectrum especially with that mama bear energy you've got to serve. So your competitor wants to serve high level and needs to be with your competitors with the high level performers but the mama bear needs to be with the babies and the babies in business and things like that. So that's why we can feel this this satisfaction or lack of fulfillment because we're not balancing out. all the parts of our personality. So finding the way that we can stay in business, balance all the parts of our personality, not balance feed, balance, know, and do it in a way where we're not overburdening ourselves. Now that doesn't mean that we're never working excessively, it just means that there are like sprints, you know, like we do go hard and fast and then we pull back a little bit and so we build things that do that. So what I would love for you to do is think about the experiences that you've had throughout your career that lit you up the most and what was it about it that lit you up? Was it traveling? Was it being recognized for your skill and your talent and your intelligence? Was it how much money you made? Was it how much money you made quickly? Was it the type of people you worked with? And if so, what was it about them that you loved? But... I want you to explore that across the decades, because you've evolved and changed. what let you up in the past might not still let you up, or at least in the same way. But if you if you go through it that way, kind of with a fine tooth comb, then you might be able to find where the parallels are between the different types of things that let you up, that might not seem related and create kind of a world for yourself that combines those elements those types of people, that type of activity, that type of freedom, that type of income, whatever it is. So that you're just, you just fill on fire again. But then you also have to take into account time with mom, time with friends. know, if you haven't been skiing in a while, like what are tennis?\n00:28:52 - Maria Gudelis (Maria Gudelis)\nI need to find somebody that will play tennis with me.\n00:28:55 - Tina Marie (profitdriversinc.com)\n48, I really haven't played since I was 14, but I My I was playing just with friends and the tennis coach came by she goes Are you signing up for tennis? need you to sign up for tennis. was like what like I'm not amazing now I haven't played I've got all the elbows, but I also go to the gym and I left heavy and I can do stuff And I'm like I need to play it anymore. Yeah, definitely need to get more playback. don't want to go I wanted the full hour. got to go, but um Can we catch up with boxer? don't want to wait till Monday to touch bases again. I'm really enjoying Maria time.\n00:29:30 - Maria Gudelis (Maria Gudelis)\nOkay Get to a boxer. All right. Cheers. You're amazing. Bye\n","contentPreview":"00:00:06 - Tina Marie (profitdriversinc.com)\nAre we there?\n00:00:07 - Maria Gudelis (Maria Gudelis)\nI am. Oh, sorry.\n00:00:09 - Tina Marie (profitdriversinc.com)\nI did have my video on. How are you?\n0...","processedAt":"2025-05-04T03:40:52.569Z"}