{"fileName":"Done Transcript for D&D Co & Profit Drivers - Weekly Review(8).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for D&D Co & Profit Drivers - Weekly Review(8).txt","type":"transcript","priority":"medium","content":"00:00:00 - Tina Marie (profitdriversinc.com)\nOh, that's not good sound. Hello. Can you hear me?\n00:00:11 - Dan’s iPhone (danddcompany.com)\nI heard that.\n00:00:19 - Tina Marie (profitdriversinc.com)\nwas really garbled.\n00:00:21 - Dan’s iPhone (danddcompany.com)\nDon't give me that crap.\n00:00:26 - Tina Marie (profitdriversinc.com)\nIt's what it is, Dan. I can't help it. Are you there?\n00:00:37 - Dan’s iPhone (danddcompany.com)\nAbout now. I think it's because I was on Wi-Fi and data.\n00:00:47 - Tina Marie (profitdriversinc.com)\nI can hear you. It's still a way. Not great sound quality, but anyway. I had to do this real quick. How, what happens, I mean, unless it's personal and stuffs Monday, that you couldn't come to our meeting?\n00:01:14 - Dan’s iPhone (danddcompany.com)\nSo, I hired this dog trainer that Glenn recommended, because it's like completely transformed Glenn's dog, blah, blah, blah, long story short, the guy basically kidnapped the dog. So, I had to go to Phoenix to get the dog back, because his life fell apart. He had no car, he was homeless, he had no car, he's got some crazy girlfriend, she kicked him out. The girlfriend started sending me all these weird messages, and I'm like, is going on? He was supposed to bring back the dog on Tuesday, and he's like, I can't do it. like, oh, got to be kidding me. Nice. So, I had to fly to Phoenix and drive back to get Zinnia, and she's now trying. Right.\n00:02:01 - Tina Marie (profitdriversinc.com)\nAs far as I can tell, I just that's terrible.\n00:02:12 - Dan’s iPhone (danddcompany.com)\nAnd so you and Glenn are talking again, friends or like, no, he, well, I mean, I do talk to him here and there, but you not me, Tina, I don't do emotional . So he had recommended the guy back in the fall and I talked to the dude briefly and then I just sort of blew it off. But then I was like, right, we get this other dog, like she really needs to like, I just need her to like, get a catch up. Right. So I'm like, can't train two dogs at once, but I'm gonna have to know. And the dude has like great reviews. I guess Glenn never told me this. Glenn told me this recently. the reason when I had like two trainers and neither one of them could really train Malu, which is his German Shepherd. And then Malu was like really fear aggressive. And he was also just sort of not, he was like, unwieldy. And then Malu bit Glenn's mother, she had to go to the hospital get an operation, like, and then that really freaked Glenn out. He's like, wouldn't they wouldn't let anyone come to their house. The dog got worse. So then he found this dude. And now the dog is like, it's a different dog. It's like the dog's like, everyone comes over, we go on walks, no, no more fear aggression. You got to go to the other. And I was like, Oh, yeah, there you go. And then Glenn sound like, other people to the guy. They all raving reviews. They're like, Oh, this guy's great. And then his online reviews are like five stars. So it's like, All right, don't mistake it.\n00:04:06 - Tina Marie (profitdriversinc.com)\nUh, that's wild.\n00:04:09 - Dan’s iPhone (danddcompany.com)\nwild. It was unfolding. I'm like, what?\n00:04:18 - Tina Marie (profitdriversinc.com)\nNow I'm wondering, did your psychic tell you any of this was going to happen? Like not specifically, right?\n00:04:24 - Dan’s iPhone (danddcompany.com)\nBut it was this wild. I don't know.\n00:04:30 - Tina Marie (profitdriversinc.com)\nWhat a story.\n00:04:33 - Dan’s iPhone (danddcompany.com)\nNo.\n00:04:34 - Tina Marie (profitdriversinc.com)\nAnd how much, how has been getting her and.\n00:04:39 - Dan’s iPhone (danddcompany.com)\nYeah, it was like four grand to, like, I, when it's all said no, I'm like, but I, he had videos of her and she'd be doing all the things. So I'm like, all right, she is sort of and then he's like, the dude is very apologetic. I mean, I think he just didn't see it, but I'm like, best intentions, bro. it's like they don't mean a whole lot so I'm supposed that he's supposed to like do video call on Friday I'm like this is all for Denise this is not for me it's for her but but yeah so I saw videos of her like healing like a pro right next to him to do that with me so there's still a chance I did some stuff I was doing but the whole rigmarole of flying dude there and driving back yeah but that she doesn't bother me alright whatever that's what I gotta do I'll go do that I mean yeah that's you you choose how you handle things yeah yeah Eric was like I would be so pissed I'm like what's the point what it\n00:06:00 - Tina Marie (profitdriversinc.com)\npoint of being mad really about anything?\n00:06:02 - Dan’s iPhone (danddcompany.com)\nthat's like, and then I wrote some really great lyrics on the ride home. So there you go. I was looking at them this this morning and then someone sent Dan Burks and a new song and I was like, oh, I think those are going to work. Here we go. So there you go.\n00:06:17 - Tina Marie (profitdriversinc.com)\nSo we're lining. Yes, that there always is one. I really always this one. So during COVID, I got my daughter access to masterclass and they had some dog training stuff in there and she did that with my havinies. It was a little punk and he so healing, sitting, staying, and there's something called door dashing like when the door opens, they run off the door and he doesn't do that anymore. So I don't know if Mario would be interested in training Zinnia and you're getting like an online thing.\n00:07:00 - Dan’s iPhone (danddcompany.com)\nBecause I got a different trainer for the puppy and Denise and Mario lasted approximately one lesson. And then they're like, I don't want to do it again. like, well, then I'm doing it because this is not happening. Yeah. I had an hour lesson with her yesterday and Belle did great.\n00:07:19 - Tina Marie (profitdriversinc.com)\nAw.\n00:07:20 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:07:22 - Tina Marie (profitdriversinc.com)\nYay. Yeah. okay, good. We talked about last week, I need to, I probably should go back and remember that it, but talking about, I think I probably just need to do that because my brain is like not dialing into the details of it. And my AR notes aren't good enough about this section, but basically scope of support and creating an SOP for like you were saying, I don't remember who did it. I guess it. was Glenn, I think it was Glenn, where Vijay and Abhishek did things that they shouldn't have done and it was a lot. so how even did it get to them in the first place?\n00:08:20 - Dan’s iPhone (danddcompany.com)\nOh, okay.\n00:08:24 - Tina Marie (profitdriversinc.com)\nSo in reality, Bobby's the one that stopped because he kind of okayed it.\n00:08:37 - Dan’s iPhone (danddcompany.com)\nSo that's what I was asking is what's the routing process?\n00:08:41 - Tina Marie (profitdriversinc.com)\nhow did the ticket come in?\n00:08:42 - Dan’s iPhone (danddcompany.com)\nWho saw it? How did he get to Abhishek and Vijay? Exactly. That comes into the desk. Typically, Bobby is the first person to get on any tickets. I never do. Sometimes, sometimes they'll tag me in for whatever reason. Eric, Sometimes it's tagged in, but usually Bobby's the first person to touch it. Maybe they're trying to get him or not entirely shown.\n00:09:13 - Tina Marie (profitdriversinc.com)\nOkay. Typically. So is that not even a standardized process? Yeah, I guess so because I asked you a question, you said typically Bobby's the one that sees the tickets first. so you said typically that makes me ask, is that even a standardized process who's checking and who's assigning and who's accountable?\n00:09:49 - Dan’s iPhone (danddcompany.com)\nNo, I think they all are assigned to him. So buy him.\n00:09:59 - Tina Marie (profitdriversinc.com)\nWhat is the volume of tickets?\n00:10:00 - Dan’s iPhone (danddcompany.com)\nOh, like, one a week, maybe.\n00:10:09 - Tina Marie (profitdriversinc.com)\nSo Glenn asked for something and Bobby said, okay, and sent it to Avishak and Vijay, basically.\n00:10:16 - Dan’s iPhone (danddcompany.com)\nNot realizing what he was asking for was more than what it seemed. Because the framing of it was, oh, yeah, just take this funnel and make it that funnel. Bobby didn't realize, like, yeah, that's part of it. But then you also need a new calendar. You also need a new automation. also need to tell you also, right? So it was like, it was the behind this. It was like the underlying functionality that was time absorbent, not the, like, duplicate this funnel.\n00:10:58 - Tina Marie (profitdriversinc.com)\nSo is part of the. the process be then if there's a technical request that comes in that whoever assigned it, like, let's just say it's Bobby for right now, which long term probably is not the best thing. But if it goes to a dev team saying, what is the scope of this, like, what is involved and if they say, okay, we think it's this, this is how long it would take, then whoever comes back and says, okay, this falls within your scope of support, anything beyond. Like, if you have additional requests or we find out that it needs more, how, I'm just trying to figure out how would we word the contingencies, the, the qualifier.\n00:11:44 - Dan’s iPhone (danddcompany.com)\nSo yeah, so Bobby's working on that.\n00:11:47 - Tina Marie (profitdriversinc.com)\nSo he's like, and we had started this many moons ago, right?\n00:11:52 - Dan’s iPhone (danddcompany.com)\nAnd it was like, this is included, this isn't. So if it comes in and you're like, oh, yeah, that's, you know, we could. categorize it at that point or tag it and go content update, you know, site update, content update, new page, right? All the stuff that's included is that. And then we do these other included things like monthly plug in and we're pressed like that's all non-request based. So if you look at the tickets that come in are three kinds. Update content, which is all we ever get from Mark or Isaac really. Customer support, like I just bought strong marriage now and I can't log in. So we handle that, we'll forget those but Rebecca actually does that so we have her in there because they have their own help desk person but she uses the centralized help desk. And then the third one would be, I mean an example would be length. thing, which to me would be new components. But you could also, what would also fall in that not covered category would be new landing page, new form, stuff like that.\n00:13:16 - Tina Marie (profitdriversinc.com)\nWhich I'm new name.\n00:13:19 - Dan’s iPhone (danddcompany.com)\nWell, no, just very specific, right? a new content page? Sure, yeah, that's going to be an opt-in page and a new form, the most negative. What they were requesting was a new funnel, like straight up. And it was like a book, a call funnel, you could call it, right? was. Yeah, it was like, yeah, was a book, I would call it a call funnel, which we, they had one. So they were right and like, oh yeah. We just want to make another version of this, but there's no, it's not cut and paste at all. Well, I mean, parts of it on, they don't know that. So their interpretation of this cut and paste, whole thing done. And I think Bobby's interpretation was also cut and paste. Oh, yeah. And he just set to damage it to BJ. And then they came back, they don't question anything, right? They just do, which is very developer-y.\n00:14:29 - Tina Marie (profitdriversinc.com)\nOkay, done. We're gonna get it done.\n00:14:32 - Dan’s iPhone (danddcompany.com)\nAnd they got it done. And then it was like, oh, PS that took 10 hours. And Bobby was like, wait, what? Which in the grants do you know things? It's not that big a deal, right? Because most of the time we get zero requests from Glen and Ross. So we're just making 700 bucks a month, doing nothing.\n00:15:00 - Tina Marie (profitdriversinc.com)\nexcept there an allotment of developer time that a person can have. So let's say all of the requests.\n00:15:09 - Dan’s iPhone (danddcompany.com)\nNo, they get none.\n00:15:10 - Tina Marie (profitdriversinc.com)\nOkay.\n00:15:11 - Dan’s iPhone (danddcompany.com)\nThey only get what they get and there's no custom anything. There's no whatever. It's like, hey, you get these things. So, and there's no limit. Like, you could add plenty of new content pages, but no one's ever going to do that. So it could be later on, we change that button right now. It's like all framing and do like set it and forget it. Like, you don't need to be adding blog posts or if you do, you can do it or we can do it. So, those guys were, they'll also add like a product here or there and that's like super simple. So that's included. It's like, oh, they want to add. They always do some weird . Oh, you know, need a 3K 150 month. All right. Well, no, I mean, fine.\n00:16:10 - Tina Marie (profitdriversinc.com)\nThat's a good perspective. Is there a due date for Bobby having this documented?\n00:16:20 - Dan’s iPhone (danddcompany.com)\nI've missed the meeting on Monday, so I don't know where it's at. I I think his first line was just going to dig up what we already did. I feel like it's already done. We just didn't really. We got to figure out, like, I guess, in a way to help us do this. Hey, a call bundle takes 10 hours. So therefore, the price of a call bundle is 10 times the hourly rate that we already have, which I don't know at the top of my hand. I want to say it's like $90.\n00:16:58 - Tina Marie (profitdriversinc.com)\nYeah, I feel like I remember. like two years ago maybe that you had a price chart for hourly rates.\n00:17:07 - Dan’s iPhone (danddcompany.com)\nYep we have it if you're looking somewhere and probably it's based on Abhishek and DJ's black quilts like Greg's.\n00:17:17 - Tina Marie (profitdriversinc.com)\nRight. Anyways, of time right?\n00:17:20 - Dan’s iPhone (danddcompany.com)\nYeah or they buy the thing. So we say okay it's gonna cost this. So some stuff you would just need little pre-priced. Hey a new landing page of form is this. Hey a new funnel book a call funnel is this. A new sales funnel, three steps sales funnel thing. And then we could have these things pre-built as important templates from the basis cloud library. just don't because we can't build them yet. Because that part doesn't work. Because the theme isn't done right?\n00:17:57 - Tina Marie (profitdriversinc.com)\nguys are fixing another dragon.\n00:17:59 - Dan’s iPhone (danddcompany.com)\nOh yeah. My version of it, it's like, hey, we would have the Cloud Library template of, hey, this is a automatic customer funnel. But they're going to charge them what we're going to charge them, and the fact that we have a Cloud template, not their concern. We built it, we use it, you still pay 900 bucks or whatever it is.\n00:18:32 - Tina Marie (profitdriversinc.com)\nThis is named Frank back from vacation.\n00:18:37 - Dan’s iPhone (danddcompany.com)\nI think he got back.\n00:18:50 - Tina Marie (profitdriversinc.com)\nSo he gave some deadlines of when he thinks the first thing will be done, but you think it'll be done soon. I'm trying to remember what the first thing was.\n00:18:59 - Dan’s iPhone (danddcompany.com)\nI had it written down. He wants the wolf or site.\n00:19:01 - Tina Marie (profitdriversinc.com)\nOh, no, the first thing was to build the wolf or side on 2.0 Oh, you just like got really far away or muffled or something He wanted the wolf or site built on basis 2.0 But he didn't know it was already done.\n00:19:20 - Dan’s iPhone (danddcompany.com)\nOh, I didn't either. I was like, I think that's done But I don't I'm not I'm not gonna say that on this call And then I think I have to check me to let him know, but he was on vacation. So they were like, hey, we already did that So we're gonna go work on this stuff What's next? They just start working on the theme And they sent the code For review, I think they tagged in Nario Then they sent it to Frank. So ultimately Frank is like, hey, I want a code review before I get it and then when I get it we're gonna come in I get it and review it and it's good It'll get committed for there literally are waiting for Frank And does he have it Huh, huh yes, yes, okay, yes Or like it's in the get waiting Oh What's what's the status of brain tree and moving and all of that There Eric was all pumped So he thought he had it solved and then this morning reset you got hit again It's like oh well not solved But no one else is getting hit. It's just reset you now so that makes me think that Ross or Glenn's admin is compromised. So I was like they don't need to be admin. So we removed that like an hour ago and then I was going to look at one thing, but I didn't have a chance to look at it yet. We installed this, we installed two plugins, but one looks for attacks and the other, like, logs a bunch of activity. So they're, like, getting in through an admin, it should show up in there. But there's also the idea that they were already logged in. And they just, so then we just unlocked, we logged everyone out. It moves WP log in. So if they were going straight in, or were already logged in, now they should be logged out. And then if Glenn and Ross were compromised, they no longer have.\n00:21:45 - Tina Marie (profitdriversinc.com)\nYeah, that was one of the main things that I learned a long time is a long time ago is not have WP admin as the login, like, we would use secret link or something like that.\n00:22:00 - Dan’s iPhone (danddcompany.com)\ninstead of it.\n00:22:01 - Tina Marie (profitdriversinc.com)\nAnd that there are zero admin accounts like the admin default is changed to something else. So that anything that's default basically got changed to something else.\n00:22:15 - Dan’s iPhone (danddcompany.com)\nYeah, and then prank was like you need to rotate your admin password like every 60 days. And we should use this thing called one pass. We don't log in. We log in through WP Manage or I do. So then I was like, everyone just needs to use that. We just change WP Manage. Okay, breaking up so bad and trying to figure out what you're saying.\n00:22:49 - Tina Marie (profitdriversinc.com)\nI think I got the gist of it. He said change your passwords every couple of months or six months? 60 days. 60 days. Okay, that I was like, it sounded like two. I remember a six, okay, that was every 60 days and he said use one pass and you said you log in through Managed WPAs, WPAs. So you don't have to get rid of rain tree?\n00:23:30 - Dan’s iPhone (danddcompany.com)\nKnown at this point. Okay. Maybe it seems like a maybe we can if no one else has gotten hit, which makes me think that there's and the Presidium guys did find malicious code on reset. You and they didn't find any on other sites. So it could be that they're only able to get into that site through whatever backdoor they created.\n00:24:00 - Tina Marie (profitdriversinc.com)\nYou Well, hopefully that gets fixed. Oh yeah, where are we at with more surf stuff?\n00:24:22 - Dan’s iPhone (danddcompany.com)\nI just finished. We are advanced. No, it's not done. And halfway through is a Google analytics board. And beyond. But finished the first two sort of. The steps of. Yeah, like their. Valley and now I'm moving into. The next level. I'm doing the GA for one. Right now. and then he has like a GTM advanced that I'm doing after today probably and then uh there's like uh oh there's uh oh and then I hit up Melissa and was like hey are you out there she's like yes but i'm on vacation of course you are in european that's what you people do uh so she got back from vacation today maybe they all go away at the same time uh and I sent her all of his stuff so he has like two forces whatever right so he has like two it's really two videos he has two videos on looker from their kind of point of view and then he has um those reports his eye on the journey Report thing and they have all these graphics that are like pre-built for you that you can use start like hey Log in here. Watch these Then I want to build these reports. I set up a bunch of the events for it. I think correctly and then let me know when you're done and We'll take the next step. So shoot price started looking at that yesterday Okay Okay, so oh no, I'm sorry today today. She's back today Sent it to her yesterday What would she be doing is like creating your version of the report for you? Yeah, yeah, she's she does all of our GDS stuff So she built like that that screen cap I sent you the other day of that report.\n00:26:49 - Tina Marie (profitdriversinc.com)\nThat's all her You built that What screen cap of a report did you send the new subs and new cancellations? I don't remember seeing a report.\n00:27:02 - Dan’s iPhone (danddcompany.com)\nWell, you didn't look then. And what's the report was like, there's like, there's a graph.\n00:27:09 - Tina Marie (profitdriversinc.com)\nYes. Yes, chart chart chart. Okay.\n00:27:13 - Dan’s iPhone (danddcompany.com)\nSo we have a bunch of different charts in Google data studio that are based off of blue data and gravity data. We don't have anything that's, you know, extending Google analytics or not Google on the floor. But she's our, she's our go to for that. And I think like, you know, it's going through this course. I set up the variables to do or to mail or get the variables and the parameters or whatever. I said all those up to be able to do it for two journeys. it's sort of the path. the journey path to purchase so which path will they go down and then just like the straight product journey which would be a product checkout purchase so those should all exist as data in Googling will explore now for like you know only like a week or whatever but and then they'll just continue to accrue.\n00:28:24 - Tina Marie (profitdriversinc.com)\nCan you describe those journeys again path to purchasing straight product journey.\n00:28:31 - Dan’s iPhone (danddcompany.com)\nSo path would be the go to the two paths page then they go down one of the paths of winner ninja only then they go to the product page and then they check out the other journey is that they start on the product page and then they check out or everyone that goes to the product page so even if they came from a path I just want to see hey what happens or project project page on and then I can connect to build three journeys so it would be path one path to and then like home page button to product page which is the probably the most popular way people get there.\n00:29:12 - Tina Marie (profitdriversinc.com)\nSo is it like a I don't know like a goal setting kind of like with behavioral so I'm not referencing GA for because I haven't used it but previous google analytics you could map out goals and they had customer behavior where you could look at their journeys from where they entered this page this page. So no, what does this look like? Like in a layman's professor?\n00:29:50 - Dan’s iPhone (danddcompany.com)\nYeah yeah so what you are talking about doesn't exist anymore at all. So everything in GA4 is event based. So, like of those reports, I'm firing events for those steps, but then in order to visualize it and see it as like a funnel or see a breakdown of people going through each individual step, right? let's say, hey, how many people hit the product page? Well, that event is product page, page view event. So, it would take that level and be like, okay, you had 100 people, this is the product page. So, instead of it being URL base, like it was in J4, you're using events and the reason you're using events is because they can only fire once, right? So, you don't have to worry about, oh, did this person come to get, right? The page views are not really page views, whatever, it's really like this many, it was 100 people, 100 events fired on this thing, conceivably. And then you'd say, then you have multiple events on the page. So, then the next event is add to cart, or the next event is, you know, you can have multiple events. so, you're doing, you're doing, we have a report based on the events. And then you can put it together by like, OK, event one is page view of path page. Event two is page view event of path one. And then event three is page view, obviously, this person above the priority, right? This page view of product page. then the next one is page view of checkout. And the next one is page view of purchase page. So then you could say, OK, show me that. Show me the breakdown of that in percentages. So he has like, one side is just like the numbers. OK, 10% of the people saw the page one. And 20% went to path one. And 80% went to path two. And then you can start. And you start basically right now, we're just establishing a baseline. Like, I need to know what's actually happening. And then. And then he's got some like, he says, oh, what's his number? He's, I'm going say his, he says that everyone's card should be 10% add to card. It's not like that. He's like, we've done so many sites and you'd average as 10% if you're not getting 10%. That's where you start. You should start figuring out why you're not getting 10%. So we get the number. And then we see, are we 10, are 20, are we 2? Then that's the right side of the screen. And then the right side of the screen is more of like an actual funnel visualization. And it's showing you going through the steps of the funnel, but his funnel is that those eyes, impression, interest, interaction, whatever the five eyes are. And then those events are separate events. could, you can have some of them might be like impressions is the same impressions, but then interest is hey, they scrolled and saw the variations or they, whatever you decide. So I don't have those ones set up yet, because I have to figure out what they are.\n00:33:06 - Tina Marie (profitdriversinc.com)\nI, I love this. mean, because how many times have you talked about how much the data matters and that's. Um, so does it have a built in heat map where you can see the activity or the equivalent through the events, like can an event be mouse over the cart button or, um, to a certain page or click or hover or things like that?\n00:33:38 - Dan’s iPhone (danddcompany.com)\nYeah. So like one of his events for like interest would be, um, scrolled to make this up, right? And was at that location for four seconds or more. So then that event would fire. He's like that shows that there's interest and you can sort of Find these events right find those more specific events by Watching like clarity videos or whatever, right? You might go watch a bunch of clarity videos and go Oh, there are people doing this like I should I should track that. I should see You know, whatever whatever it is. I'm good example But your example is correct, right? You would define The add to cart button is like, okay, they or the for us it would be like the Drop-down menu of sections, right? like oh, went to this they stayed in that sections area for this long So they were thinking about it or and then or maybe you can find an event like they interacted with that menu That's gonna get more into this advanced GTM. That's part of a gun to that's where you start writing your own JavaScript and you're and you're firing events using JavaScript based on Thumbs up so but other stuff like scrolls already built in so you can Take the scroll data that's already there and then you're going to marry that with Hover and whatever that's not built in There's a bunch of basic stuff that's built in you just have to turn it on That sounds so awesome Yeah, he's definitely it's definitely been demystified. I'm like, I'm almost there. I'm like, okay.\n00:35:31 - Tina Marie (profitdriversinc.com)\nI'm starting to pick it up now That's good And I love that you had Melissa because with Google Data Studio like it should provided the the new framework right the user interface um is being understood she should be able to be useful in So you being able to say which is to me the main goal of you having enough of a technical understanding of what needs to be done in the business to hire and choose the experts to actually do the thing, work in the business, and also to be informed enough to direct them specifically to the most leveraged activity, which I think is, you know, like Melissa, you have Norio the code overlord and Frank and Melissa for analytics and Bobby for meeting management and conversation, so that is to me the way that, so I was, I started EMeth again because I have Mark and the guy who referred me to reading that, and so I was just, I'm like, well, it's been like 12 years, I should read it again, and I was looking at that going, I was listening, thing just in the very beginning and thinking about the 30,000 foot view that they start describing about what needs to happen in the business and then I'm thinking like why am I not out of business yet and other people doing this stuff and then I heard the thing and it was like this is always the issue with EOS, EMITH, with any of these things is that the work that I do and the way that it's work with are different is that we want the good business practices and the good business systems and it lines up with a lot of that but we want and prioritize freedom over time and who we work with above profits like for Mark his priority is I don't want to go to the office if I don't want to go to the even if I don't want to go in for a month. He wants to work, he wants to have his business, he wants to have it profitable, but come hell or high water, he's going to figure out how to do that without having to be in the office for a month if he doesn't want to go in for a month.\n00:38:14 - Dan’s iPhone (danddcompany.com)\nThat's new.\n00:38:16 - Tina Marie (profitdriversinc.com)\nWell, and that's why I'm having conversations, because I'm like, he's definitely not there.\n00:38:25 - Dan’s iPhone (danddcompany.com)\nBut I don't remember hearing that before. No, I definitely did not exist before.\n00:38:34 - Tina Marie (profitdriversinc.com)\nYeah, so it does. And the thing is that there are always trade-offs, but these trainings don't talk about human trade-offs and making anything that's other than prioritizing the absolute best health of the business rather than the absolute highest value of the visionary being that which is what I'm always going for. And because a lot of the times we do think like for you, it's pace. Like that is more important to you, I think, than well, then then profit, but so is no drama. So not feeling like things are stressing you out either because of the people that you're dealing with or making yourself go, you know, this is the deadline. It's the deadline. It's got to be the deadline. Realizing that deadlines are arbitrary anyway, really. It's this because we said it's this and it should be this, which is what happens most of time, the same with financial goals. That's what most businesses live and die by. And even an email, and he's like, and it's hard work, but it's worth it. And I'm like, it depends on who you ask. And how hard it is. Like, so none of us are opposed to work. We all work. We work consistently. something we show up all the time. But I think it's kind of almost the obsession level and the required discipline. Like even, oh, what's his face? see it. It's the profit profit first. Yeah. Yeah. What? So none.\n00:40:33 - Dan’s iPhone (danddcompany.com)\nThat's creating a job.\n00:40:35 - Tina Marie (profitdriversinc.com)\nLike, oh, I'm never doing that. None of these, to me, are the simplest forms of success. Right. There is always extra and and they talk about the 80-20 rule, but I don't think that they really understand it or they they just overcomplicate it because We really don't have to have that much organization and structure. The bottom line is what are your most profitable activities, effective hourly rate, that kind of math, right? And what are the things that have to be done in the business or it fails to exist or it diminishes that is tedious and takes the visionary away from the most profitable activities. Those are two massive leverage points. Number one, you spending more time doing the most profitable thing, which almost always is also the thing that people love most. That's why it became the most profitable thing because you loved it first and we're good at it, almost always. In fact, I have not seen an exception yet. And the other one is as quickly as possible and creating a path to this if it doesn't exist. all the other things that pull you off of that off of your plate on someone else's. Specifically, someone who can work autonomously and not need to be micromanaged or anything like that. To me, those are the first two levers to go after. And then systematizing inside of that. But mostly, it's just a huge awareness of the greatest value in the business, starting with human resources, starting with the visionary, depending on how small it is. And then a single person of support in the highest level. So like Seth Ellsworth, his biggest person would be a salesperson, or a lead generator. The next biggest person would be an automations person, because what he does is largely automations. For Mark, Mary, um looking in the documents or looking at some of the reports and managing managing the people being available frequently and then having attorneys over their pods just being better leaders has you know those are his leverage points for you a developer because so much of it is technical and then a person to track tasks and move them forward and not necessarily a single person in any of these things but those are leverages and so you know there are things to glean from email from bill to sell from EOS but yeah anyway just contemplating all of that and but but things like that so you understanding going for a full circle how staying on top of technology has been a massive lever for me is for you, too, because the technology itself is the lever. So GA for being able to provide so much data, but the first thing is you have to wrap your head around GA4 and how it works in order to unlock the gift that it has in its data. And knowing most people will never do that, most people are just kind of going in the dark because they don't have good data, they don't know where to get it, or they won't put the effort in if they do know where to get it. anyway, you just leveled our leopard game, that was a long way to say that's what you just did.\n00:44:50 - Dan’s iPhone (danddcompany.com)\nWell, yeah, I mean, I think that, you know, I just come back, it's like, it's the age old thing. It's like, there is no system, there's no system. Not working a system and there's no system if you're not building a system. So I'm like, you gotta build the system first and then work it So I'm no problem and usually where people fall down is they never build the system So it's like, you know, you didn't set the weather. It's like he hasn't built the the way to get an automations person in there, right? and it's like oh, yeah, you're gonna build that mark but it's funny about mark is like The other day was like, hey, I think you need to start recognizing that and your right hand not Mary Here we go Salka's getting deeper and deeper in there.\n00:45:39 - Tina Marie (profitdriversinc.com)\nI would like to hear more of that.\n00:45:41 - Dan’s iPhone (danddcompany.com)\nWhat how He's deeper and deeper in there like he's interacting with Sam and Are you saying Salka is the right hand? Salka was saying that he said that to mark. He's like you need to Start recognizing that like I'm your right hand not Mary And that his right hand needs to be someone like Salko, not Mary, because Salko can go into an arbitration. Salko can go in and tell Sam, hey, no, you're doing that wrong. And like level up the things that matter. Mary's more like a ops person. It's like, no, should just be the, like, I think you just nailed it. Like, she's the one that should be looking at dashboards. That's not Salko's gig. You should be the one that's like, hey, your leads are down. Hey, retainers are off pace. Hey, but you know, calls going out is low, right there. But you know, our job, you know, is getting those metrics in place to be established and be then set that baseline and say this equals that. Therefore, if this is not happening, then that is not going to happen. And I think I actually had Josh did something with phone calls that he sent me. I haven't looked at it yet. Because I started, look, I started wondering about that. like, okay, if we can't track an intake person, which we can't, which I understand, because they don't don't get assigned the lead. That totally makes sense. It's like, well, they all do the same thing. They all make calls. So there's got to be a relationship between all volume and whatever, right? what was the differentiator about July? What made July different than every other July before it, right? Part of it was lead sources. But like, what even the best lead source hit the bend. So it's like, well, it wasn't just that, right? Like, and what's really great about it was like, in the mark three years ago, monkey did that to him three years ago in July. Totally different stories being told at that point. You're like five alarm fire, we're at, because we got zero retainers this month, right? like, he would have been like, so underwater. And I was like, no, that's not you can now have your best lead source totally crap out on you.\n00:48:05 - Tina Marie (profitdriversinc.com)\nYes, and you set a and you set a record. And that is the leverage.\n00:48:10 - Dan’s iPhone (danddcompany.com)\nThat's a risk. Yep.\n00:48:14 - Tina Marie (profitdriversinc.com)\nYou're welcome. Mark. Right. Thank you. Because he's like, well, because he didn't even have a system for it. He didn't have a schedule for it. He didn't, whatever. I'm like, who goes and buys new vendors? do. do you do that? How often? Well, um, like, okay. Yeah. Yep. All these things. Um, hold on. Let me. Oh, you were so lead. Let's talk about mom for a little bit. I have to cut off right at one. Um, unless there's something else you'd rather talk about.\n00:49:01 - Dan’s iPhone (danddcompany.com)\nAnother Sunday one's just chugging along it's high season and we're just I'm it's all It's me just figuring out this the analytics piece is gonna unlock it all I'm about to ask ask Mercer my first question yesterday, which is something missing in their training some of their trainings old I'm like, hey, this doesn't exist anymore. I Don't even really need the thing, I'm wondering if they have an answer and then I'll get to this other bit And then I'm gonna hit them with my KPI. Hey Let's say I want to try new customers. I still got to get that answer But that's gonna be my big question for them. The rest all make sense And I'm just gonna go on the Legos in place. We just had an hour and a half long call about mom.\n00:49:41 - Tina Marie (profitdriversinc.com)\nSo go. Oh Yeah, huh. Yeah.\n00:49:45 - Dan’s iPhone (danddcompany.com)\nWell, got moved to today.\n00:49:46 - Tina Marie (profitdriversinc.com)\nYeah. Oh Yeah, cuz well our last call was an hour and a half also Cuz time flies I'm like I was this call almost was over already. Um, what was I? Oh, yeah. Okay. So another 71, that was kind of why I wasn't pausing on that because because of the analytics. And I already asked you about record stuff and just seeing what's going on there. But I haven't asked about mom in a couple of weeks, other than you know, was Mark working on the book. And I don't remember your answer, but basically they're doing other things.\n00:50:29 - Dan’s iPhone (danddcompany.com)\nNo, the book is done. It needs to be edited. And then Katie comes back on Monday, so I'm going to yank around the side and be like, I need you to help me edit this book. So her and her husband will probably help me edit the book and then the book will be done done. So that'll probably be done hopefully, you know, next seven to ten days from Monday.\n00:50:57 - Tina Marie (profitdriversinc.com)\nYeah, what's next?\n00:50:59 - Dan’s iPhone (danddcompany.com)\nThen I'm going to revisit like all the all the checklists. So we had like a release checklist, that checklist, I gotta make sure all those are up to snuff, you know, as far as Greg goes, because I think he made one, but I don't think he made them all. Make sure those are done and then sort of revisit the mom's site and be like, okay, now let's make it really show what we do. So I was on a call with them today, and Sean's label wants to sell land, so they acquired Lansdown's catalog as part of being signed to the label. And now the heads of the label got ousted, he literally just texted me that because I'm like, what's going on? So they got, they were like, hey, you can buy your catalog back. And they want to charge them 250 grand, which I just went on Chats UPT for like a while, and I was messing around. The value of the catalog. like is way higher than that based on what Chechi PT was saying, right? Me going, Hey, how do you do this? How do you do that? What's a multiple, right? So I got to verify some of that stuff, but it, you know, as Chechi PT does, I'm like, Oh, that's not real. Like, I don't know if this is real, but. And then I was querying it, whatever. So there, there's definitely like a formula that you could use. So of course, Mark home, you know, home run, Grand Slam. Grand Slam is like, Hey, we could go around and start buying other outer catalogs will go get investments money and blah, blah, blah, blah. I'm like, no, bro, no, no, no, no, no, no. Like, why don't we go back to AFM, which is Sean's label and we make them an owner finance offer. So we buy lands down catalog back. It'll be money down into paying interest rate, firms with a payout by whatever, they'll get a monthly, a guaranteed monthly payment. And then we have some sort of bio clause that we can buy out whatever because my Arc was showing me and Spotify what happened with his band, so he's been playing around with Cross-McTill using some of the fan flowy stuff. And their streams are just like going up and up and up and up. But they are nowhere near as big as Lansdowne. And then this other band that we work with, they signed with a company called Amuse, which is sort of like what we're doing. And those guys went and started promoting non-point, and their streams started going up. And Amuse is getting a chunk of that revenue. So they're like, Lansdowne has better bass numbers than both of those bands. And what a shock Tina, Lansdowne has never used any of the fan flowy stuff. Because why would you when it's right there in front of you for free? So, of course, today they're like, do you want to buy Lansdowne's catalog of like no? But after I did the whole thing, I was like, wait a minute. Like, what if, Angela, what if mom bought Lansdowne's catalog, owner financed, right? Don't, none of this go out and raise capital because you're just inviting people in that you don't want around in 10 years. Like, so you go in and your owner financed it. And I, with GPT, I was like, hey, how long has Spotify been around? So I sort of came up with this custom formula that says, well, Spotify might not be around in 20 years. So don't give me evaluation on 20 years. But the calculation that I did give me, it was saying, which I do feel it could be pretty valid. just got to go, you know, find something. And it had like, oh, this source, this source, this source. So it might mean some tweaks, but, you know, over a 10-year period, it was saying that the stream revenue is worth, which is based on actual Spotify data, that it's worth 1.5 million. I was like, okay, so if we can come up with that formula and then we can actually figure out like what it's worth, then you could go do this with other bands. You go to the whoever owns the catalog and you just keep doing these owner fine hand steals. Like, hey, we want to buy this one for that and then you bring them in and then you put your promotion engine behind it and then whatever those numbers were, they're wrong because you're now going to increase all that revenue, but you're going to do it to an asset that you already own. So I like, all right, that's kind of interesting. That's like building this asset, like this recurring revenue asset that can go out 10, 15, 20 years and then God forbid, one of these bands breaks, like, all right, yep, we need to look into that. So we got our first there, Sean and Eric are setting up the staff stuff tomorrow. We're bringing on a DIY client, it's going to be the first person to like, just, he's going to pay, I think, $97 a month and he's just doing it himself. So what he wanted, he was like, when can we get access to this? he's going to be our little beta tester. Norio, I got to send him a video today. I don't do right after this. So he has, he needs some help with his. He's building this song lookup app for us that uses this service called song link. That's part of the onboarding that we have. It's part of the promotion engine that we need the artist to be able to quickly get all the links for all the streaming services by searching their song. He's building that, those search their song. They go, yeah, that's it. And then it will update like 10 custom fields inside their account. So they could do that for like up to three. So we promote retell them to pick three songs. So hopefully when I send him today, we're. Yeah. Hopefully when I send table, get him over the hub and then he's going to look at this DNS app that we might build is the biggest sort of hurdle for use or so far has been getting their DNS setup. They're like, OK, not going to go, daddy. Hey, person, there's no idea what we're talking about. Go in and add this MX record, that MX record. Oh, yeah. Yeah, good luck. So people are just borking on that. And Mark found this software that looks like it's exactly what it does. And they have an API and all that good . I'm going to kick that to my own next.\n00:57:26 - Tina Marie (profitdriversinc.com)\nI'll your MX records for what they need to be.\n00:57:28 - Dan’s iPhone (danddcompany.com)\nIt does it all. Yeah, it's just it's wizard or fives setting up all your DNS.\n00:57:35 - Tina Marie (profitdriversinc.com)\nSo you just give it like a registrar or something or how does it.\n00:57:40 - Dan’s iPhone (danddcompany.com)\nYeah. No, you give it your domain name and then using their app, you're already approved with like Wix. And like so many of these people are using Wix or bought their domain through Wix and then never built the site. And high level only works with like GoDaddy and CloudFlare, which some we had. Some people use GoDaddy, but, you know, if they have Dane, whatever, this, this middleware works with anybody. So then you, when you're authorized through them as fan flowy, then you're authorized to go in there at the DNS records on all those other providers. the person is just, you know, essentially. So like MailChimp uses them as an example, one of the big clients is MailChimp. So anyone that goes on MailChimp and needs to update their domain, they're going through MailChimp's app that's using this third party.\n00:58:32 - Tina Marie (profitdriversinc.com)\nAnd then the third party goes. You don't have to log into your register.\n00:58:35 - Dan’s iPhone (danddcompany.com)\nLike, I get the access.\n00:58:38 - Tina Marie (profitdriversinc.com)\nHow do you validate that somebody actually owns that domain?\n00:58:41 - Dan’s iPhone (danddcompany.com)\nLike, what is the verification process? Yeah, I don't know. I mean, I haven't, I just looked at to go play with it, play with the API, and then he'll come back and go, all right, this is how it's going to work.\n00:59:00 - Tina Marie (profitdriversinc.com)\nYeah, I will check because if they have that kind of permission, I mean, our is your domain safe. If anybody can get into it without.\n00:59:11 - Dan’s iPhone (danddcompany.com)\nIf it might be that they do just log into our login and it passes it all through. That would make sense. That's probably how it works. So you're like not oh, I think, but it's sort of like that.\n00:59:24 - Tina Marie (profitdriversinc.com)\nRight. Like plaid or something like that.\n00:59:26 - Dan’s iPhone (danddcompany.com)\nYeah, yeah, yeah. Yeah, that's a good example. It's probably like that. They probably pull from a drop down. It's probably very much like plaid. And they just have every frickin provider. And then they can go in. Yeah, it's good. I was like, oh, that's interesting. But it would totally solve the problem.\n00:59:49 - Tina Marie (profitdriversinc.com)\nI'm not paying attention to the time.\n00:59:50 - Dan’s iPhone (danddcompany.com)\ngot to pay attention to the time. right.\n00:59:52 - Tina Marie (profitdriversinc.com)\nSo then that app.\n00:59:53 - Dan’s iPhone (danddcompany.com)\nYeah. And then I just reached out to the follower flow. guys for an update and haven't gotten an update. And the Spotify app no update waiting for that I think that's gonna take like two more weeks Until we get an answer if yes or no or nothing.\n01:00:09 - Tina Marie (profitdriversinc.com)\nThat's what you said last week.\n01:00:11 - Dan’s iPhone (danddcompany.com)\nWell, it's five weeks total So, okay, I think I still do the date. I say in the date. So five weeks or whatever the date I said you is most likely when we're gonna hear back.\n01:00:22 - Tina Marie (profitdriversinc.com)\nOh, yeah, I kind of recall that Yeah, um, oh what I was gonna ask Was next steps, but oh no, okay, so let me just say this because I do have to go but What you were talking about with chat DPT and its calculations And I know your brain already goes here, but the thing that I was thinking is how do you validate its formula and you would have to know what its formula is but if you understood its formula and you could validate it by Whatever it's playing data from and however it's making its calculations but basically replicate that formula, those calculations, that outcome so that you understood it and could verify that it works, then you've got a solid valuation process that you can be using for potentially purchasing other catalogs or helping people to sell their catalogs as a service or just another way for mom to generate revenue, but it just really stood out to me that having a formula like that would be really powerful.\n01:01:36 - Dan’s iPhone (danddcompany.com)\nThat's what I said to it. I was like, I want to build a formula for this and then it added some stuff. go, well, I don't think Spotify has only been around, you know, Spotify has been around whenever I go, yeah, but how long is it number one? And it's like, oh, it's only the number one since the late 2010, like, oh, great. So now we're going to use that. So let's say, you can't say, you can't give me a calculation based on 2020. years is when I'd be around 20 years.\n01:02:01 - Tina Marie (profitdriversinc.com)\nIt's like, you make a good point. We have to consider that they won't be the market leader. like, right?\n01:02:06 - Dan’s iPhone (danddcompany.com)\nAnd it can't it literally created like a point system, like based on the age of the band, the age of the band's catalog, the number, whatever. So I need to get it to like integrate some other things. But then the math of Spotify or a stream is 100 percent correct, like 0.004, like it's some ridiculous number. So yeah. Now the question is, will the label go for our finance? don't see why they wouldn't. It's positive cash flow. Right.\n01:02:41 - Tina Marie (profitdriversinc.com)\nI'm going to pause the questions that are popping up my brain so I can keep to my schedule. But it just goes so fast. So many things to ask and then anyway. Have a good day. Take care of yourself.\n","contentPreview":"00:00:00 - Tina Marie (profitdriversinc.com)\nOh, that's not good sound. Hello. Can you hear me?\n00:00:11 - Dan’s iPhone (danddcompany.com)\nI heard that.\n00:00:19 - Tina Marie (profitdriversinc.com)\nwa...","processedAt":"2025-05-04T03:40:52.599Z"}