{"fileName":"Done Transcript for Patrick(2).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Patrick(2).txt","type":"transcript","priority":"medium","content":"00:00:04 - Tina Marie (profitdriversinc.com)\nHey, Patrick.\n00:00:05 - Patrick Shahverdian (sweetlaw.com)\nHow are you doing? Good. How are you?\n00:00:08 - Tina Marie (profitdriversinc.com)\nGood. I'm trying to get on my windows up in real quick. saw you sent your assignment. I haven't got it yet. Microsoft. I'm gonna move this over to Google Docs for myself. I won't even let me copy it. Oh, dude. I don't want to go through all those steps. Um, yeah. I'll just look at it here, I guess. Um, how long did it take you to do this?\n00:01:08 - Patrick Shahverdian (sweetlaw.com)\nI had a new guy that came, I basically did this with him for, believe, the other week. Yeah, because I was just explaining what we do, so I kind of already did it with him, so I just had to put it on in writing.\n00:01:28 - Tina Marie (profitdriversinc.com)\nOkay, do you feel that there was anything useful about it when you did the exercise? Did you think anything? where's it just recording?\n00:01:40 - Patrick Shahverdian (sweetlaw.com)\nThis is what it is. I mean, it's always good to know. Like, just get some cases to make sure that you know exactly what steps need to be done on each case. It's easy to like skip one and then.\n00:02:00 - Tina Marie (profitdriversinc.com)\nlike the health insurance stuff for the distributions are out like it'll come up because accounting needs those to process the distributions but I mean we did we do so many cases like you pretty much already know what needs to be done yeah and I only have two other people on my team so it's not like the tasks are broken up to like four different people yeah my gosh I hate I have a Microsoft account but I just never use it I have a PDF I might ask you to send it some other way because I actually have like three accounts I've got my school account because I'm a student I've got one for my mission and I've got my personal fun and they don't make logging in easy like you can't just anyway yeah Uh, yeah, if you would mind just copying pasting it, even into an email is fine. Oh, that should do it actually, let's see. I'm gonna try to get it signed in. Oh my gosh, always it makes me like reset my password. Chirping, oh gosh. That an allergy is my eyeball sting, sting, allergies suck. don't know you have allergies, but they suck. My little sister doesn't have a little. that's you so lucky. Everything makes my body just go bleh. right you emailing that to me yeah thank you let me open up see what i'm going to do i will make a new spreadsheet is what i think i'll we need a lot of like copy and paste in light bro calm down thank you what the heck Oh, good. Okay. I was like, it wasn't letting me crowd it. Okay, so I want to do this until I want to do it. I'm going to share my screen. So I want, that's everyone. And then I'm going to Actually, so introduction call. I'm just going to kind of do this stuff together. Um, because it'll make it easier to kind of sort and track this time. Did I do that right? I'll see does this and does them the best. Okay. So nobody is assigned to that. Oh, so he never mind. It's just in a different row. Um, sending defendant insurance.\n00:06:28 - Patrick Shahverdian (sweetlaw.com)\nCynthia does that. Okay.\n00:06:33 - Tina Marie (profitdriversinc.com)\nSometimes the formatting like breaks in between things. Like this. Okay. Cynthia, he does it best. The job doing us by the way and thank you for that. That'd be helpful. Well, she and Cynthia are able to do the same. Okay. I'll see limits, other policy limits level is that or same level. Never mind. Okay. I'm trying to like fry in my brain. I got like four hours of sleep and not for good reason. I mean, kind of it's tucked in my sister and we're ridiculous cackling into like one o'clock in the morning, like 12-year-old, but making red jokes like 10-year-old.\n00:07:35 - Patrick Shahverdian (sweetlaw.com)\nIt's plenty of to wake up in the morning.\n00:07:38 - Tina Marie (profitdriversinc.com)\nOh, 540. So that's who worked out so well for me. I'm a little punch drunk, Patrick. But it's okay. She had to get up at four o'clock.\n00:07:54 - Patrick Shahverdian (sweetlaw.com)\nShe works at a methadone clinic.\n00:07:56 - Tina Marie (profitdriversinc.com)\nShe's a nurse and she has a 45-minute drive. I have to, when she comes home, she's going to be dead driving on these windy roads. I kind of, I know kind of like, I do feel bad about that, depending on what the call is regarded. Right. See. Soon. And now this is tedious. I'm just doing this and that seems always full of the time, but it's not because formatting it will just do some things I want to get into kind of creating a structure for time. Okay. And this will be better for kind of visualizing it and making a correlation to case-in-case volume. My daughters' birds are going nuts, it's got parakeets, okay, let's see, so introduction call. now bear with me because systems optimization, all of this is a case-by-case kind of process, right? So there are fundamental things that I look for and ways at approaching it, but it gets customized is for multiple reasons, team, time, and also the person who's running the system or the people who are running the system. So, for example, I know you don't want to read books. There are, you're not the only one. I use this example because it's the first thing that comes to my mind of, like, Mark, I wanted to have him do a gratitude practice just to help him be in a more positive mindset because it works really well. He's like, Tina, he tried for a few weeks. didn't really push back. He just really didn't do it. He's like, it's not really my thing. I said, that's you got to tell me that because, you know, just because I suggested doesn't mean I think I know all the things and it has to be one way. It has to be the way that you will do it, the way that you can buy into it. If you don't buy into it, you're not going to do it. You're not going here. Continuing client. Elsie does this and does it best. Okay, we'll go back here. I can tie. Does it best? Okay, and client doctor. gonna guess that's also Elsie. Patrick and Elsie depending on what the calls regarding. Oh wait, I put that in there. I'm gonna just didn't get it actually there. Now this is why putting things in a good format to begin with, which I did not specify as far as she might have actually, but it's okay. Just because later. So Um, preparing demand letters, why I know you just have to do that. That's Mark wants you to do that. Right.\n00:12:13 - Patrick Shahverdian (sweetlaw.com)\nUh, all the attorneys right there demands.\n00:12:16 - Tina Marie (profitdriversinc.com)\nYeah. We just had the conversation screw looking at AI demand writing services, negotiating and finalizing new settlements, doctor reductions and distributions. Now, I know that at least the distributions can be done by someone else. What about not necessarily on your team that you have somebody on your team that can do this, but these things could be done theoretically by someone else, right? Doesn't have a turning. Okay. At knowing who's on your team and definitely don't think anybody else would be. That's what is that? So one, two, four, what did I do? Yes, property damage. Copy and pasting would not be that difficult. Patrick, right, I'm just not. OK, all right, um, let me go into little bit a real question. Do not update the password. That's how I get locked out a bit of I could use. There's some stupid things. See. Is that this one? If I mess this up, I'm taking that out to you and I think it might be just one refresh. I the last 60 days or not. Actually, I think I want to know I want reset the parts. How would you be by attorney? All of the cases like attorney are matters by team. And then team Patrick. So you have 114. Oh. Then, let's set up 22 negotiations. What's it?\n00:15:10 - Patrick Shahverdian (sweetlaw.com)\nIt's one we like to disperse the money, but we keep a little bit, as we're still waiting on something. Like a health insurance link to pay, but we can distribute the client funds and take our portion without having to like wait for it.\n00:15:32 - Tina Marie (profitdriversinc.com)\nI'm to do one more thing. So, Mark just took some of your cases right and put them somewhere else.\n00:15:53 - Patrick Shahverdian (sweetlaw.com)\nYeah, we saw some things too.\n00:15:56 - Tina Marie (profitdriversinc.com)\nHank, right, okay. How many? I have a number of that skewed, so let me text Marco because I need him to give you guys a report and I keep forgetting to ask Mark. Hey, when are you going to get me a report that the attorneys can look at with all the stats I asked about? Like weeks ago. I need a saucy face. Whoops. Come on, man. I'm dictating. Okay, so I need that because this should have a correlation to the closed date. But it'll be interesting to, let's see how we made that correlation. Again, I know that it seems like a very scattered frame, but this is the time that we spend creating the process and kind of putting structure on where the time goes is worth it. And it is kind of, I don't know, not just like it's disjointed, like there's trying to wrap around everything. So I'll see, I'll see. Cynthia, Cynthia ordering final medical records, initial documents, sending different insurance inquiries, um, and or policy limits. I also need people's time reports. okay. So Cynthia works in the office or at home or, okay. They're both in the office. And she's there every day.\n00:18:48 - Patrick Shahverdian (sweetlaw.com)\nCynthia, I'll see why it's a week is home.\n00:18:54 - Tina Marie (profitdriversinc.com)\nOkay. I'm just going to put nuts for myself. I'm just getting like overall operational structure so that I wrap my head around it. So do you think that you have a ballpark average estimation of how long these particular tasks take average, right? Obviously, there will be outliers, some that go very quick, some go very long. If I put a column here, do you think that you could give that?\n00:19:42 - Patrick Shahverdian (sweetlaw.com)\nIs that just like property damage, like let's say just for one client, it could be like over the period of like two, three weeks to get it done?\n00:19:56 - Tina Marie (profitdriversinc.com)\nOkay, so here's what we'll do because time has to be We'll go to complete, like so, or phase, because I kind of like these different phases, and then um, estimated time, um, like, minutes, hours spent, like this task type, right? So, like, how, ordering the policy limits, I mean, like anything where you've got to call insurance, sometimes those calls, like, take a while, right? chasing clients down, and so I know that that's not going to have a real number two, but it'll give me some kind of ballpark, and it'll help, it'll just help in the mental process of kind of creating this, and then trying to figure out basically what is the best type of flow throughout world. the day in terms of like blocking types of tasks. And then also looking at it and going, how often do we need to go through this cycle for all the cases that you have so that we're not waiting two or three weeks before we check on the next thing? Does that make sense? Because I don't think right now that you have anything where you do that, like where you look at a checklist, basically, and everybody just mentally goes through a checklist. The problem with that is we are statistically human beings are terrible self reporters. So if you mentally are saying you went through the thing, right, you don't check on it, you don't look at something, we're going to forget or assume the other thing is, it's like the bystander effect that that we assume that somebody else has done the thing. As as Especially if there's a thing where there's, there's two people who do it. So I'll see in Cynthia. I'm like, oh, well, I'll see mine is done then or whatever. So if we have a list and we just kind of go through it and and you've got a list of your cases, checking off whatever things are done. And then whatever stage that we're in now. Do you have something like that in Lidified that has all of these statuses. Yeah, I didn't think so. Okay. And you don't have anything that that you could just go through and say it's in this section. It's in this status. It's in this status. Right. And can some of these be happening simultaneously? Yeah. Okay. So that's another thing that I want to know. So, um, um, can happen. currently it so we'll do that and I'm going to let's see yeah okay so let's see the concurrent first introduction calls obviously it's first thing one of the things can be happening whoa at the same time let's go down that row confirming coverages and liability I feel like that's kind of its own thing that has to happen first and then true it has to happen so none of these like these are all standalone right and then yeah assessing property damage you can probably be working on that while you're setting up for treatment yep okay so this is not for let's see let's say that can happen I'm going do number three for sending defendant insurance inquiry request or D&D. That can also happen, right? Same time-ish. You don't have to wait for setting up treatment and property damage to do sending defendant insurance inquiry or do you?\n00:24:19 - Patrick Shahverdian (sweetlaw.com)\nSo typically you wouldn't be doing the treatment if you're sending those insurance and because basically we're trying to see if there's any insurance.\n00:24:29 - Tina Marie (profitdriversinc.com)\nOkay, so this goes before treatment?\n00:24:34 - Patrick Shahverdian (sweetlaw.com)\nYeah.\n00:24:36 - Tina Marie (profitdriversinc.com)\nOkay, so I'm going to cut these, bring them down here, drag everything up, change this. Okay, let's go through the order then first in case there's anything else that can't be done before the thing above it. Can you hear these first? Yeah, I got to make sure the doors are closed next time.\n00:25:33 - Patrick Shahverdian (sweetlaw.com)\nOkay. It looks like no, it's in order.\n00:25:37 - Tina Marie (profitdriversinc.com)\nOkay, now it's an order. Okay, so one, two, the defendant. Insurance inquire request or DMV insurance chart request. So that will disregard the numbers. Actually, I'm going to go like this. One. Hey, that's not what was supposed to work, dude. Appreciate that. Okay. So any defendant insurance, um, is there anything else that happens with this or is that like preliminary that has to be done before we get to the next steps.\n00:26:29 - Patrick Shahverdian (sweetlaw.com)\nUm, I guess you can do the intro call and stuff or it would already be done.\n00:26:37 - Tina Marie (profitdriversinc.com)\nUm, so do we need to change this order again?\n00:26:43 - Patrick Shahverdian (sweetlaw.com)\nNo, I mean, typically the intro call would be done at that point. The intro call is like the first thing. So.\n00:26:57 - Tina Marie (profitdriversinc.com)\nSo do we send the this before confirming or are they.\n00:27:00 - Patrick Shahverdian (sweetlaw.com)\nIt kind of does in techno can't be so like you do the intro call and you know, you they don't have the defense insurance information Actually number four order initial documents as police reports you would put that before setting defendant insurance thing Okay Could Since it's both Cynthia, okay, what else So ordering policy limits medical referrals You can do those simultaneously Okay\n00:28:00 - Tina Marie (profitdriversinc.com)\nfive, six. I'm just going to do this together, five, six. Okay. Um, what else?\n00:28:24 - Patrick Shahverdian (sweetlaw.com)\nseven, eight, nine and six can all be done together.\n00:28:35 - Tina Marie (profitdriversinc.com)\nsix, seven, eight, two, one, two, five, ten. Wait, now that's right. Oh, I'm thrown off because the rest of that. Oh, that's why I'm sorry. Never mind. This is definitely its own thing, own thing, own thing, own own thing, right? property damage weight.\n00:29:12 - Patrick Shahverdian (sweetlaw.com)\nProperty damage you can do with five, six, three.\n00:29:40 - Tina Marie (profitdriversinc.com)\nOkay. Then can three be done with five and six also.\n00:29:55 - Patrick Shahverdian (sweetlaw.com)\nYeah.\n00:29:58 - Tina Marie (profitdriversinc.com)\nSo, because what I mean when I. say done with it is like basically it's not contingent, like you can't, you don't have to wait for anything. Okay, just want to make sure we're on the same page. Okay. So, do you feel like most of the work is done linearly, like people thinking that it's this step, then this step, rather than here's all the things that we could be doing for this case right now, what do you think is more likely that is happening?\n00:30:38 - Patrick Shahverdian (sweetlaw.com)\nProbably like step by step.\n00:30:41 - Tina Marie (profitdriversinc.com)\nOkay. So, just this right here would probably could probably really help the flow of the cases. Knowing how many cases you have now, here's what I don't know is how long it takes and how much waiting there is and how good it is, but. What I would guess is that there's a lot of time people are just not really working super hard and at stuff and sitting there just thinking about the cases maybe and just glancing at the records and not really pushing it forward. What do you think? Do you think that because obviously I'm not, I don't want anybody. I'm making a wild assessment.\n00:31:30 - Patrick Shahverdian (sweetlaw.com)\nI'm sure there's like times in the day where it's just like things slow down. Obviously, happens with me too. But I do think like some of these things like policy limits, like that takes like five minutes. You know, so it's like, let's say you're, or you just got off a long call and you don't want like take a call right now or something. You don't want to make a call. could like do the policy limit real quick. It takes five minutes. You just didn't put the info.\n00:32:04 - Tina Marie (profitdriversinc.com)\nSo here's where I'm getting out with this. And this is my hard- slide that people don't really like, but you'll have no problem with your team. don't know. And and also you're kind of laid back. So if you're not looking at it this way, but my guess would be, especially based off of the conversations I've had with Mark about how things go, is that there are probably several gaps throughout the day, every day of the week, where not much is getting done and could be getting done. Because if you have 116 cases, and most of them are in a status of needing to get something, there are probably 116 calls that could be made somewhere in the team throughout the day. they're hourly, right? You're not, right? Or are you hourly? No, but they are, right? Um, I would bet that all the billable time is not used very effectively or, um, I would just bet that there was a lot of just about 10% level effort. Being put, and this isn't talking about your team statistically. I'm talking about people in general. And I think part of the nature of it is not necessarily laziness or unwillingness to work. I think it is the volume of things to do and the mental effort. And I think it's a lot. I would not do this job. This would be tedious. I would hate it. But, you know, that's me, I didn't go into this. but what I think could happen is if we work through this for a little while, go through it with Lorenz and get an idea, I would love to see you do is kind of create some structure and say, look, here's the list of cases that we have, even if you put it in a spreadsheet and if you're using Microsoft Office, you probably have a sweet lot account, right, with Microsoft. So, it's secure. Everything stays on your own drive, stays, you know, where only sweet lot people could get to it. You could check it with Lidify. You could have some other kind of identifier. don't know if Lidify doesn't have, like, case IDs. does matter IDs. Okay. that would get really confusing. I feel like I'll ask Mark if we could do this. And based off of other work that we've done together, I feel like he would be okay with that. And I'll show him this and see what he thinks. But honestly, I think that this could be really useful across all of Sweet Law. Because just the mental taxing effort of trying to track all the different, like you only have 160, but 116 is a lot. And some of the other teams have 300, you're going to have more. And whatever state that they're in, somebody needs to be checking to see, is it waiting on us? Is it waiting on them? If it's waiting on them, one was the last contact point. If it's more than 24 hours or two business days or whatever, you deem appropriate that we do follow up. So just going through a checklist of here's the things that have to get done. Here's the list of cases. Here was the last touch. So then there were be another column that's okay so like we would have this as a checklist while people just kind of get used to it like oh yeah I could be doing this here's all the things that have to be done and there's a spreadsheet with all the matters on it and then so I really want to see what you guys look at letify what do you do and letify what do you guys record and letify what do you use it for everything like the whole case is on there yeah so all the notes um so like you could go in here like click the matter yeah so this is what I see when I open the case so there's highlight activity can I click on activity I mean I can but so it'll show the last time somebody We touched it, but not necessary. I tried to call and nothing happened, right?\n00:37:07 - Patrick Shahverdian (sweetlaw.com)\nUm, you could pull like left a voicemail still pending, whatever.\n00:37:13 - Tina Marie (profitdriversinc.com)\nOkay. timeline. No. How would you, um, like, no, what's the, what's going on? Yeah. What's the last thing that happened?\n00:37:32 - Patrick Shahverdian (sweetlaw.com)\nWho, who touched it last? So, on the left side, this big, like, paragraph, how you do it there first. Okay.\n00:37:45 - Tina Marie (profitdriversinc.com)\nSo, yeah. So these are all the notes.\n00:37:49 - Patrick Shahverdian (sweetlaw.com)\nThese are, they use this side for like, made, like bigger points. Like she's got an injection. So I want to know like that. And then on the right side, the, um, the activity. But if you scroll down, these are more like calls, email the sent out, things like that.\n00:38:07 - Tina Marie (profitdriversinc.com)\nOK, so let's you look at both. OK, let's just let's just run through these real quick and look at something. So this was last touch yesterday. We're going to go like boom, boom through a lot, really quickly. Last touch three months ago. OK, tell me what we are going look at to go. Why was this only the last note three months ago?\n00:38:37 - Patrick Shahverdian (sweetlaw.com)\nCan you go to the conversations? I know he's still treating, so we could sound like a follow-up text just to keep it on the I loop on what's going on with the case, but he's still in treatment.\n00:39:06 - Tina Marie (profitdriversinc.com)\nOkay. So, um, do you know when treatment is supposed to be over?\n00:39:14 - Patrick Shahverdian (sweetlaw.com)\nUm, can you scroll up to the damages?\n00:39:19 - Tina Marie (profitdriversinc.com)\nAnd tell me like, scroll over here and then the far left. Oh, here. Click on it.\n00:39:31 - Patrick Shahverdian (sweetlaw.com)\nYeah.\n00:39:41 - Tina Marie (profitdriversinc.com)\nThis doesn't total it for you, huh? But it should, because you are trying to hit policy limits, right?\n00:39:47 - Patrick Shahverdian (sweetlaw.com)\nIt does on the other page. But this. Yeah. Okay. Right.\n00:39:57 - Tina Marie (profitdriversinc.com)\nThere are total damages. And. And where does it say what the policy limits are here?\n00:40:04 - Patrick Shahverdian (sweetlaw.com)\nYeah, if you go to insurance on it right there. So it's 150.\n00:40:14 - Tina Marie (profitdriversinc.com)\nSo I'm 50,000.\n00:40:16 - Patrick Shahverdian (sweetlaw.com)\nYeah.\n00:40:17 - Tina Marie (profitdriversinc.com)\nOK, so that's not likely. would think to hit a policy limit. So then, um, um, I'm not sure how much more I'm to do under this. Yeah, so it again, I know this much, right? So I'm just asking questions. How would you know? I mean, OK, you know that he is in treatment, but if there's no contact for three months, how do you know that they're still going?\n00:41:00 - Patrick Shahverdian (sweetlaw.com)\nyou know that they haven't so is there a time period that a person can stop going for treatment that affects the case yeah more so in the beginning like if they don't go to treatment like a month and it's like the big red flag but not later it kind of depends but like if they're waiting for a surgery or something it's obviously going to take some time to schedule it and stuff like that but so as long as the initial doctor's assessment is there that has said these are all the things that they need they kind of have a window a significant window to accomplish it like basically they should be going consistently up until like the pain management visit after that it's like take some time to schedule injections or surgeries or things like that so there's some like I guess there, but like initial appointment, there shouldn't be any gaps really.\n00:42:09 - Tina Marie (profitdriversinc.com)\nSo is there a reason why it wouldn't make sense to have at least a monthly follow up with somebody or every couple of months at a particular stage help me figure out like, if you were to look at this and just make sure you're on top of it and not assuming that things are going a particular way, what could you do that's not really bugging the client but is being proactive and making sure that things are going along a schedule?\n00:42:43 - Patrick Shahverdian (sweetlaw.com)\nLike a quick text? Yeah. Every 30 days or something?\n00:42:49 - Tina Marie (profitdriversinc.com)\nDo you think that that's reasonable to at least have your team attend every 30 days? Okay. So we're just going to put this down here, attend. Well, so let's say we don't hear back for every 30 days. So let's say, okay, it's in 30 days, we send a text message. If we don't hear back, then do we check a week later and just keep doing it every week until we do hear back, just to make sure that we're still connecting?\n00:43:18 - Patrick Shahverdian (sweetlaw.com)\nYeah.\n00:43:20 - Tina Marie (profitdriversinc.com)\nUm, let's see the text. Um, in the case with no contact. Um, well, I'll say example, in treatment. Really, that's probably the only thing, because everything else you'd be talking to a doctor or insurance, or you need to be talking to them about distributions, right? So this would probably be the only time that there's just an okay period to not be talking for a while and not managing the time.\n00:44:00 - Patrick Shahverdian (sweetlaw.com)\nIs that correct during treatment? Yeah, I mean, you want to make sure they're going and stuff, but like, there's a certain point where It's less required because like, let's say, they can appointment for like October 28 for an injection, right? Right. It's kind of like It's a month away.\n00:44:20 - Tina Marie (profitdriversinc.com)\nThere's no point. Yeah. Okay. Yeah. What I'm saying is, is there any other status here that the case could be in where It's acceptable to not hear or not have any communication efforts for even more than a few days.\n00:44:40 - Patrick Shahverdian (sweetlaw.com)\nNegotiations like I got a 30 days for the insurance to respond. So There's not really not going to be much update until I hear back type of thing.\n00:44:52 - Tina Marie (profitdriversinc.com)\nOkay. So that makes sense. Um, but if the insurance has responded, then you're in a new state.\n00:45:00 - Patrick Shahverdian (sweetlaw.com)\nAnyway, right or you're still dealing with it. No, it's still negotiations, but I have to update the client on what the offer was things like that.\n00:45:38 - Tina Marie (profitdriversinc.com)\nOkay. I better. Yeah. Okay. Um, all right. So we were going back in here. Let's just go ahead and. don't want that. Look at a few more cases real quick. Last one September 13, just a few days ago. So, um, mailing insurance, companion matter, oh, um, like, incidences in the same, like, multiple people. Okay, like Yeah. Okay. Yesterday, Saturday, four months ago.\n00:46:31 - Patrick Shahverdian (sweetlaw.com)\nAnd this one, I texted her recently.\n00:46:37 - Tina Marie (profitdriversinc.com)\nOkay. I'm stations.\n00:46:40 - Patrick Shahverdian (sweetlaw.com)\nRight. Go back.\n00:46:48 - Tina Marie (profitdriversinc.com)\nOkay. And you would think that that would be more useful on the home page, just immediately there, but okay, so that's been touched. Good job. This is what we want to see though is that, that says July 24th, don't go to conversations. 18th year to go. Okay, well actually, let me ask you a question.\n00:47:28 - Patrick Shahverdian (sweetlaw.com)\nSo he's just still in treatment.\n00:47:31 - Tina Marie (profitdriversinc.com)\nYeah. I'm going to keep getting them until three months out, because it's all up, okay, three months out. I didn't pay attention to which one I was on, I'm just going to look down here. July 24th. Two months ago. So. Um, what should we look at to see, like, uh, still have back pain and decided to get that after all? Uh, that was three months ago, which I'm gonna call, yeah, I mean, that seems like that should be followed up with what do you think?\n00:48:34 - Patrick Shahverdian (sweetlaw.com)\nYeah, was there a note on the website at all?\n00:48:37 - Tina Marie (profitdriversinc.com)\nUm, details right here, July 24th was the last thing.\n00:48:45 - Patrick Shahverdian (sweetlaw.com)\nYeah, so this one has to be touched.\n00:48:48 - Tina Marie (profitdriversinc.com)\nSo here's what I would recommend for you just to, again, so we're just trying to figure out what helps you get things done the quickest without being tedious. Now, the amount of volume that you have, maybe you spread it out across a couple of days, but this wouldn't take very long, especially if you did this every week and just literally went in, clicked on all of them real quick, because what would happen is if you started doing that and you started following up with your team, they should be doing this. They should be checking on their stuff and you go look at it and go, yeah, they're on it. And then you just start to do it as just kind of randomly going through the cases as a audit and just be like, hey, is there anything that has gone too long without being touched? And if so, who did it? Why are we unclear about what the expectations are? just think that we shouldn't, but is there a disagreement internally about whether we should or we shouldn't? is there not enough clarity about what requires a response? Is it that some people just feel like they're bothering clients? And, and, and does that need to be trained because like, who's bothered by getting the job done for them that we're supposed to do, getting it wrapped up posted up that type of thing.\n00:50:11 - Patrick Shahverdian (sweetlaw.com)\nYeah.\n00:50:12 - Tina Marie (profitdriversinc.com)\nbe something that you'd be willing to do is just just go like once a week, just once a week. And you can split it across two days if it just is annoying, but honestly, that should go really quick. I think, I think you could be done with all your cases in an hour. Just click, get out. Because most of them, you're going to see, yep, they touched it. Yep, they touched it. Yep, they touched it. There should only be a few where you're like, that's a long period, or you know that you looked at that last week. And you know that they're not at a time period that, because you already looked at it, right, that we should be messaging out. It's going to be a few more weeks. So after the first couple of times, it shouldn't take you very long. Yeah. But the insight into the gaps should be really quick and really clear. Would you do that?\n00:51:01 - Patrick Shahverdian (sweetlaw.com)\nYeah, I mean, my file reviews are basically that.\n00:51:04 - Tina Marie (profitdriversinc.com)\nOkay.\n00:51:06 - Patrick Shahverdian (sweetlaw.com)\nSo, once you've clicked our older cases, I should focus on those. But typically, on the new ones, I'll just check like the intro call was done. We've found insurance to take set liability. Basically, get the case, like the green light to start treating it. Middle ones are more, you know, where are they at? Are they going? going? Do they fall off? Are they missing? And then the really old ones is typically settled or we're just like waiting on health insurance, lean type of things. yeah, mean, I pretty much do what you just asked. But yeah, this case needs to be touched for sure.\n00:51:55 - Tina Marie (profitdriversinc.com)\nSo, what is your schedule for doing that and making sure you've covered that?\n00:52:00 - Patrick Shahverdian (sweetlaw.com)\nall the cases, like what's the frequency? I try to do it at least every other day.\n00:52:09 - Tina Marie (profitdriversinc.com)\nAll the cases?\n00:52:10 - Patrick Shahverdian (sweetlaw.com)\nNot all of them, but like we'll go through a portion of my case list. The other week we've got like a bunch of new files. like, you know, I went ahead and went through all those, make sure like what first of all see what the case is. Is it like a big case, small case? What potential issues we might have with it? Where to send a client for treatment?\n00:52:37 - Tina Marie (profitdriversinc.com)\nSo would you just be willing then, let's say this is a starter, top to bottom, I'm looking at the way that we just looked at it. then also, and because we're running out of time, I don't know there's enough for you to tell me all of this, but like I'd like to understand all the things that you look at when you do file review. Now, we did talk about, would you be willing to do file review with your team yesterday? You did. And how many files did you go through?\n00:53:13 - Patrick Shahverdian (sweetlaw.com)\nWe just felt like we did like 40 minutes. I think we went through like 10 cases.\n00:53:19 - Tina Marie (profitdriversinc.com)\nOkay, so that's a long process. So my version of this audit is definitely not as thorough as what I think that you were doing. But there were two cases that probably should have been touched that we found in the first few. And like you said, they were older. So what I would like is just once just go through everything top to bottom. And then next week when we're all meeting, of give me some insight as to what you discovered and realize, okay, we should be doing it this way. And maybe it's by the age of the case. Maybe it's by a status or something like that, but. How can we just make sure that we're not going too long without touching the case and making contact with the client? And yeah, it's just about making sure because there are so many moving pieces, so many cases, so many different things to do, so many different reasons, it's not a fluid process, right? Because there's so much waiting on insurance, on doctors, on the patient, the client. So it could be really easy to have for things to fall through the gaps. So having a very specific process that makes sure that the only way to not have things fall through the cracks is top to bottom. could do that broken up as long as you're sorting the cases by date, right, by the day that they open, not because until they're closed. And so let's say you starting with the most recent cases up to like the most recent 50 cases, and then the next one, the next day, the next review, whatever, within that week, two weeks max, you're getting to the next 50. But then, so what I also think is two types of fire review. is just the quick glance, did it get touched, which you could go through all those 116 cases, probably in an hour. And you wouldn't have to go through all of them every week because they're, you know, they'd be really quick. So there's that version of it, and then there's the thorough, are there opportunities for us to like, do we need to do something different? But what I think will happen preemptively, is that as you go through in your skin, you'll go, you know what, we don't need to review that as a team, I saw enough of it, it's good. So then you can mark the cases that you probably should review as a team, have some questions about or somebody else you saw, there was a question that somebody on your team had, and then save those for the team power reviews because there's potentially something to discuss, whereas if everything looks good, you can just be like, you know what, nothing to discuss there, so you don't need to waste the team's time with basically managerial kind of oversight effort, which would be better with you for the most part anyway. So how do you think, how do you feel about that?\n00:56:42 - Patrick Shahverdian (sweetlaw.com)\nYeah, I think that's the best way to do it because naturally we all go through our cases just to see what's, you know, available to be settled or, you know, these cases are my responsibility at the end of the days, so I need to know, you know, where they're at. and make sure that they get maximized. no, I think you'd write, it's the best way just to go through each one.\n00:57:10 - Tina Marie (profitdriversinc.com)\nOkay, so let's give that a try. I would love by the time that we meet next Tuesday that you had a chance to just go through everything and look at that and just kind of note anything. One thing I would love to note is how many cases had not been touched in more than 30 days. Do you remember that? Yeah. Okay. And just anything else that might have stood out and let's do the longest. Like, so whatever you notice, like, so there's one that hasn't been touched for three months. If you see anything longer than that, like, I want to know what's the longest that they had reached out just to check and make sure. and then here's our next step, just kind of restating the expectations of how the case will proceed. Does that make sense? Just people are people, know, and especially if they're going through hard things, there's a huge difference for really it's just a little amount of effort. It could just be the text message, right? And you could even have fairly canned text messages that are but let me fix this before putting in the number and or I guess if you're using the automations, it's already there so just be careful. But just it's that feeling of we are aware of you and we're at and we're checking in on you. It's a human nature nurture.\n00:59:50 - Patrick Shahverdian (sweetlaw.com)\nno, I get it. I mean, we don't really think about it because, you know, we see the cases every day but it's a business perspective for you, but nearby.\n01:00:00 - Tina Marie (profitdriversinc.com)\nlike something traumatic and bad happened to me and all of this sucks and somebody called to check on me and it made my day, you know?\n01:00:08 - Patrick Shahverdian (sweetlaw.com)\nYeah.\n01:00:09 - Tina Marie (profitdriversinc.com)\nIt could do a lot for us and it can also increase referrals possibly if we just really made somebody feel good. It's a little thing. It could have a big impact over time and a compounding effect too as we gained that reputation for just really kind of holding, it's not hand holding, it's 30 days, but compared to just waiting through things, you know, make them not feel like it's a number and a transaction, that type of thing. Okay. Well, we were able to have that whole conversation because you did all of this, so great job.\n01:00:48 - Patrick Shahverdian (sweetlaw.com)\nI'm here to see Lorenz have stuff that I didn't know on there.\n01:00:52 - Tina Marie (profitdriversinc.com)\nYeah, so we're all meeting next week and we will take a look at it and I think that that is going to be useful too. I'm really glad that you guys want to do that. the the working together thing because I think it's going to be insightful and even if it's just like a five percent difference um but if you give him five percent of your good stuff and he gives you five percent of his good stuff you know none you're both you're both just getting better and and then we're all getting better insight into the whole thing it's good you know that's not good you got to fix that i know that's what navies are for i can't take it out though because i have conversations every day or no no i can't because i just lift super heavy until i can't and then i can't walk for a few days but my strength increases i lose weight i still have more energy my like i did some studying and it's crazy like it's like kind of a new hack. I don't have to exhaust myself. So yes, I I could do better. My last lake press was 390 though, and it was smooth like butter. So I was pretty happy with that, okay?\n01:02:13 - Patrick Shahverdian (sweetlaw.com)\nOkay. I'll be able to work out every day. You won't stay up late because you'll hate yourself afterwards.\n01:02:19 - Tina Marie (profitdriversinc.com)\nI know, but I'll be so tired all the time. I ain't trying to be like that. And I just no. Naps are cool. Did you know I'm gonna leave you with this? It's like 80 reduction in cardiovascular events for people, especially men who take naps three or more times a week of at least 20 minutes. Massive benefit.\n01:02:45 - Patrick Shahverdian (sweetlaw.com)\nI don't know I'm a weekend for sure.\n01:02:47 - Tina Marie (profitdriversinc.com)\nOkay, you gotta get, you gotta get one in the middle of the week, just a little 20 minute. Maybe not. You're still young, but you're not up there like grandma here. All right, it was great talking to you.\n01:03:02 - Patrick Shahverdian (sweetlaw.com)\nWhat time is it?\n01:03:02 - Tina Marie (profitdriversinc.com)\ntwo. Yeah, oh, we're over. I will nag mark for the report again. He did this emoji.\n01:03:11 - Patrick Shahverdian (sweetlaw.com)\nGood luck. Have a great day. I'll talk to you next week. Good to see you. You too. Bye-bye. Bye.\n","contentPreview":"00:00:04 - Tina Marie (profitdriversinc.com)\nHey, Patrick.\n00:00:05 - Patrick Shahverdian (sweetlaw.com)\nHow are you doing? Good. How are you?\n00:00:08 - Tina Marie (profitdriversinc.com)\nGood. I'm tr...","processedAt":"2025-05-04T03:40:52.565Z"}