{"fileName":"Done Transcript for Lorenz.txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Lorenz.txt","type":"transcript","priority":"medium","content":"00:00:09 - Tina Marie (profitdriversinc.com)\nCan you hear me?\n00:00:11 - Lorenz Schuerch (3)\nYeah, I can hear you.\n00:00:13 - Tina Marie (profitdriversinc.com)\nHow are you?\n00:00:14 - Lorenz Schuerch (3)\nHow are you, Tina?\n00:00:16 - Tina Marie (profitdriversinc.com)\nI'm hurting today.\n00:00:18 - Lorenz Schuerch (3)\nYou're tired.\n00:00:20 - Tina Marie (profitdriversinc.com)\nNo, I'm hurting.\n00:00:21 - Lorenz Schuerch (3)\nI'm in pain, but.\n00:00:23 - Tina Marie (profitdriversinc.com)\nIt's a girl thing. Do you daughters?\n00:00:30 - Lorenz Schuerch (3)\nI have one, and I'm married.\n00:00:33 - Tina Marie (profitdriversinc.com)\nYeah, well, I got the woman thing, having daughters is, I've got four daughters, so it's been fun. It's been fun. But my brain is kind of struggling today with the paint. Okay. And I'm dehydrated. fun times. get my notes open. Let's see. So, let's start with how, so we talked about some things last time, and I always like to start with, have you had any thoughts, just kind of that happened as a result of it, things that you might have been thinking about since the last time we spoke?\n00:01:23 - Lorenz Schuerch (3)\nYeah, I think one of the things that you brought up earlier in the meeting was, you know, I think you were talking to Patrick, but I kind of took it on as well as start the day proactively.\n00:01:36 - Tina Marie (profitdriversinc.com)\nYes.\n00:01:37 - Lorenz Schuerch (3)\nDo important things first, and address fires after, and so I, you know, it, so I've been out since Thursday and came back yesterday, so I've only had really like one day issue. Yeah, to do it. But I've kind of been instructing my team. Every time we meet, I kind of digest what we talk about. And then I try to, like, any, any good ideas. try to pass them on to my team as well as I've been trying to help them prioritize the, uh, the fires, because some clients, you know, every time they call it's a fire, every time they call they're about to fire us. And, um, it's like, well, we spoke yesterday and nothing has changed since yesterday. So, I've been thinking about that. And then, uh, we, uh, we also spoke about being loud in your mistakes and being able to be. confidently wrong. You have to create a safe space for the people around you. think it's implicit, but I don't know that it's explicitly like something that is fostered in the culture, the firm. I think it's implicit in that, you know, Mark doesn't fire people just for no reason, people go just because he doesn't like it or something like that. But I think like sometimes for people like very who come from pretty traumatizing firms, it's hard to trust. So maybe I need to kind of sit down to make that more sense. that it's okay to make mistakes. I want you to take risks. I want you to, you know, give us ideas that I want you to just be there to get along.\n00:04:14 - Tina Marie (profitdriversinc.com)\nYes. Yes. So that brings up another conversation that could be had, which is, and this is a conversation that I've been working on with Mark, which is, and in a matter of fact, sorry, my brain just jumps around and it comes back full circle, but you should have seen a survey that happened around March, I feel like it happened maybe February, which was in the survey, it would have been, what do you feel represents the culture of sweet law? How do you feel about the culture of sweet law? And what do you think? How do you identify it? So would you remember anything about that?\n00:04:59 - Lorenz Schuerch (3)\nYeah, yeah. I think Mark went through it with the attorneys. went through all the instances. And he was pretty happy about it, because it was overall pretty positive. I think there was one remark about how they needed more snacks in the kitchen.\n00:05:20 - Tina Marie (profitdriversinc.com)\nYeah.\n00:05:22 - Lorenz Schuerch (3)\nBut it made me wonder, like, how candid people really are, how much they trust that their answers are not being, like, analyzed to see who they're from. Yeah.\n00:05:37 - Tina Marie (profitdriversinc.com)\nYeah. And that's why it's something that I want him to do more often. for example, last year we did a survey. And so it's a practice that we're just kind of working on iteratively.\n00:05:50 - Lorenz Schuerch (3)\nWe talked about that last week.\n00:05:53 - Tina Marie (profitdriversinc.com)\nAnd not super consistently, not on a schedule, because it is still a small. all firm and there's a lot of moving pieces and everybody has a lot of work to do. So kind of prioritizing how we serve and how we work and it's a work in progress and building the framework for creating an optimized business, which means that we have a consistent feedback loop. But to your point, people have to feel safe to give truthful and useful feedback. Snacks in the break room, you know, anybody could ask for that and how much happier, how much, you know, is it going to improve the quality? Not to some degree, we are human beings and we're pretty simple in certain ways.\n00:06:40 - Lorenz Schuerch (3)\nSo feed us like, you can be good, I'm going be happy for a while.\n00:06:45 - Tina Marie (profitdriversinc.com)\nI'll be thankful and I'm going to remember who fed me. So you know, it's not that that's not useful, but we really wanted to dig for some of the deeper stuff and looking at the values. So, um, uh, Let me go see if I can find it. I'm sweet. Let's see. Share with me. So, it will be 27. Yeah, survey 2024 responses. that the right one? That's another one. There you go. I was working with AI to try to kind of, there's a lot of information to analyze it, not to analyze like who did it come from, but what was the overall feeling. The overall feeling was really great, though, that they feel like there's effective communication, that there's patience, that there's interesting though. is there were some conflicting responses from the same person. So while we don't know who the person is, we do have all of the answers of one person in one survey. So somebody would say something about, you know, we've got great unity and great team and cohesion. And also, but, you know, I feel like, I don't know, a complaint that contradicts what they just said, which kind of, and of course you could be thinking about different scenarios and different things, the wording of the question, and that's why having conversations at a leader level and creating an environment where your pod and your team will talk to you is actually the most useful thing that we can do. Creating a space where people will really tell us what's going on so that we know what they need, because sweet love will be the best place for everybody if we actually know what everybody needs. and everybody wants. And we can't know that if they don't tell us and they won't tell us if they don't feel safe to tell us. So, you know, it's just this whole kind of circle of things to So what could have the best way to create that?\n00:09:13 - Lorenz Schuerch (3)\nDo I approach them one on one or do I have like a group conversation?\n00:09:19 - Tina Marie (profitdriversinc.com)\nSo generally, the approach is going to be group wise. The support and the so there's also the coach in private praise and public type of thing. So, for example, let's say you have team meeting and somebody says something that is too critical, right? It's not constructive feedback. First of all, you also want to, you don't just want to tell people hey, you're safe and you can say whatever you want to and nobody's going to say anything because that's safe without a purpose. goal is that we also want to make ourselves those people who can accept constructive feedback. So part of the culture and the values need to be, I'm a person who wants to grow and I want to be the best version of myself. So that's actually where you start is asking and trying to figure out like, how do you feel about personal development? How do you feel about, you know, do you have goals to improve yourself professionally, personally, as the communicator, as a team member, as a person, as a parent, as whatever. Because if that value doesn't exist, all of these efforts are moved. They will placate and patronize, but it will be ineffective. This has to be an intrinsic motivation to want to be better. For the most part, I think that sweet law does a good job of attracting those types of people. There are exceptions, and you can tell that those are the people that basically show up for a paycheck. And there's not a lot that you can do with that except for just create strong guardrails basically. So that they know, you know, if you're here for the paycheck, this is what you got to do to get the paycheck. But just so you know, our culture is we're here to be the best that we can be as teams, but also as individuals. And so if you want to enjoy being here, if you want to stay here a long time, then, you know, consider getting on board with these goals and these values. And here's why you might want to do it. Here's here's the reward for it. at the end of the day, there are people who are intrinsically motivated and driven and there are people who are not there only externally driven. Those really aren't very common, honestly. people have intrinsic drive, but they don't necessarily, first of all, even have a consciousness of it. They don't know what their own motivators are. They've never contemplated it. They don't have anybody mentoring them and guiding them. So, it starts with the conversations and just awareness. And from that sparks questions, which return answers, which generally spark additional questions deeper. And it's a series of just probing, gathering information, analyzing the information, adjusting the trajectory and where you're going based on that information. And then probing again, and it's an iterative process ongoing. but those are the types of conversations that will lead to most of it and it starts with kind of assessing who do you have on the team and what drives them. Let me this creating a safe space for VRE. So you have me go back to, let me switch my create one for just you and yep that'll be sweet. So I have a tab manager and I have different sets of tabs for each of my clients. So they automatically opens up all the things that I'm working in.\n00:14:05 - Lorenz Schuerch (3)\nOh, that's nice. Like 42 tabs open right now.\n00:14:10 - Tina Marie (profitdriversinc.com)\nI mean, that's half of what I generally have open on each of them. It's called, it's, uh, why did it just go away? I know what it's called, and it's actually just hit itself for me. Let's work Ana. So W-O-R-K-O-N-A for Chrome, and you create these workspaces, and you can save all kinds of tabs. That way, you don't have to use up all your browser memory for it. So anyway, if you don't want to have things slow down. No, not doing that. I just want to open. Okay, here we go. And now what was I looking up? I forgot what I was looking at while I was going to. My notes, very, Oh, I just wanted to get to my house. That was a patch, but I think it's Oh, the team, sweetheart attorneys. It's the name of my spreadsheet that has everybody. So, I know you have Cynthia. Unless I have to look at it. No, I have a very in John. Right. I took Cynthia.\n00:15:55 - Lorenz Schuerch (3)\nI used to have some gestures with Patrick now, and then I have. Jessica and Mike.\n00:16:01 - Tina Marie (profitdriversinc.com)\nJessica and Mike. All right. Oh, here we go. Finally. Okay. Oh, wait. Varian Johnson?\n00:16:12 - Lorenz Schuerch (3)\nYeah.\n00:16:13 - Tina Marie (profitdriversinc.com)\nOkay, okay. Because you said that and then my brain went anyway. So, and then Jonathan and Jessica are the primarily Spanish team?\n00:16:24 - Lorenz Schuerch (3)\nUh, Mike and Jessica are our Spanish speaker.\n00:16:30 - Tina Marie (profitdriversinc.com)\nI gotta put these together. So, I just have it as case managers and then assistance.\n00:16:37 - Lorenz Schuerch (3)\nYeah, and Mike is also a case manager, I guess. And so, but Jessica is a primary case manager.\n00:16:45 - Tina Marie (profitdriversinc.com)\nOkay.\n00:16:50 - Lorenz Schuerch (3)\nIt's complicated.\n00:16:52 - Tina Marie (profitdriversinc.com)\nI see that. All right. Let me put this here also. Sometimes Google Docs add new features and I don't know that I've added it until I see it and it just did that. Okay, so, okay, now, let's talk about this. long has, I mean, so you've been with Sweet Wild like two years now, has it been two years?\n00:17:27 - Lorenz Schuerch (3)\nAt the end of the month.\n00:17:30 - Tina Marie (profitdriversinc.com)\nOkay. Let's just kind of go down the path of how your team grew when you got each person.\n00:17:43 - Lorenz Schuerch (3)\nYes, so I started with Mike and Jess and then Mary asked me to see if I could find someone that could work in addition to them in Arizona. Yeah, and so. I got John who was working with me at Zane's last law firm and so we had a you know three men, four men team for a little while.\n00:18:14 - Tina Marie (profitdriversinc.com)\nHow long has Jonathan been there?\n00:18:17 - Lorenz Schuerch (3)\nIt's been a little while now, right? Yeah, he started like a month after me. That's September. And then eventually we got, see, we had it sold for a little bit and then she transitioned Tyler's team and then we are our cases just exploded and so we needed a fourth person and so we got Cynthia. Did we have someone before Cynthia? No, we had Cynthia. And then last Christmas since I just wasn't working well within the team, she just she just had a really hard time with John. So she transitioned to Patrick's team and then we got someone else I think is Mary Selah. Now we have someone else before that she like had to have a surgery and then she never came back never heard back from her and then we have Mary Selah her husband had surgery and she couldn't take enough time off at the time and so she decided to go take care of her husband and then we got very two or three months ago.\n00:20:06 - Tina Marie (profitdriversinc.com)\nUm, so let's talk about your team a little bit. So let me, let me kind of plan this out a little bit. I know structure and prioritization is what I wanted to talk about, but I also need to talk about the team. Just dig into them a little bit more and who they are and how they do. So Jonathan and Jessica, wait no, Micah Jessica is who you had from the beginning, right? So can you give me a brief rundown of each of them?\n00:20:55 - Lorenz Schuerch (3)\nSure. So they're, they're kind of like my most experienced. case managers they're they're separately sure yeah yeah let's start with Jessica she's been here the longest she generally you know generally speaking she is she's very like self-motivated she she transferred to working from home because she moved from California to last year and it's been going pretty well you know there's she's very good her strengths are on she communicates she's very good with clients she has a very good soft touch with clients she's able to communicate things very clearly to them she's very experienced so she knows how to answer most of their questions and she has a good touch with providers as well link me with providers in the clients so So that's been her primary job duties. Lately, it seems like a lot of clients are almost set with her because she's not getting back to them. And so I've been trying to find ways to talk to her about, because she says, well, e-mail them. was like, well, the e-mail's not unlitified. So I can, I know what you've e-mailed them. And so she's like, oh, well, it didn't make it through to litify. And I'm like, OK, one time, that's fine. But this is the fifth one that somehow doesn't upload to litify. So I think there's a little bit of, she's getting married in three months, I think. So she might be a little bit distracted. And she's worked, might not be the most important thing in her life right now. So, but generally speaking clients really like her, she's getting a lot of five-star reviews and her cases usually, you know, they move through pretty quickly. The one thing I would say with a Jessica and Mike team is I'd like to see more policy limits in their cases. Sometimes I feel like, okay, this case is ready for demand and I look at the case and you know, they have Cairo and MRI's and then there's no PM recommended and I say, well, why was there an OPM recommended and they say, oh, well, it looks like the Cairo wasn't interested. So like, well, can we just kind of do a console to the PM and be like, oh, yeah, hadn't thought of that. You're my most experienced CNC, like, if you don't think of it, who knows. So, but that's, that's just, Mike, I think when I got initially, I was warned a lot about him that he would need, he would require a lot of supervision, a lot of following up. He turned out to be kind of a superstar, honestly. He was, you know, when I got him, you know, he was pretty, just kind of floating and just happy to just be there. And not too ambitious. And then I realized pretty quickly that, you know, he likes money, he likes making money. And so he likes numbers, he likes money, you know, not just money going to him, but he likes money going to the firm. And so I was like, well, do you want to help me out of distributions? And so he started, you know, some distributions, like I showed him how to do it. And then, you know, he wanted to do all the distributions for the. Jessica and Mike team and ever since he started doing them, I haven't had to reduce my fee partly ever. Whereas before, clients would have an opportunity to speak to me at distribution time and they'd be like, you can reduce the fee, it's not fair that you're taking it home more than us and try to explain that, well, you have a part of the values of treatment and all that because they're speaking to the attorney, they know I can lower the fee, but now by adding a layer, by having him speak to Mike first, it's a lot harder for them to negotiate the fee where they know Mike doesn't have that kind of authority to lower the fee for them. And Mike is very straight forward, he just tells them, look, this is basically what it is, this is a really good result and, you know, he's like, a magician, he just gets them to sign and then they'll they'll write him a five-star review, know, within the next three minutes, even though they're taking home, you know, couple of grand.\n00:26:12 - Tina Marie (profitdriversinc.com)\nSo that is awesome.\n00:26:15 - Lorenz Schuerch (3)\nYeah.\n00:26:17 - Tina Marie (profitdriversinc.com)\nDoes Mark know that he's got that kind of skill?\n00:26:20 - Lorenz Schuerch (3)\nOh, yeah. Oh, yeah. Yeah. In fact, I'm really worried because I'm worried that he's going to Mark and Mary are going to be like, well, let's put him in charge of like this team or, you know, this team's not doing well with distribution. So let's, let's put Mike in a, in a different team.\n00:26:39 - Tina Marie (profitdriversinc.com)\nwant to keep Mike, he's like Mike. Yeah. Well, especially because you're the one that got, you found his spark.\n00:26:49 - Lorenz Schuerch (3)\nYeah. But what you really like, I talked to him and it's not like most people really dread those distributions. and phone calls, even attorneys that I've talked to, he enjoys it. He like, this is really enjoyable for him. He the challenge, he likes the ability to calm people down and the ability to get them to really see the value that they're getting. I've been building this customer who sounds incentive structure to where, you know, when they get a distribution, I'll bonus them for that.\n00:27:49 - Tina Marie (profitdriversinc.com)\nI love that. I love knowing that you were able to take him and find, instead of him being the problem child.\n00:28:00 - Lorenz Schuerch (3)\nhe's the winner.\n00:28:01 - Tina Marie (profitdriversinc.com)\nI mean, that's, that's pretty amazing. And you, you did something for that. You paid attention and you noticed something and then you put him in the spot to, to bring that out. So good job.\n00:28:16 - Lorenz Schuerch (3)\nYeah, no, I, that's like, one of the things I'm very proud of is, you know, being able to spot him because he was, you know, he kind of shows up at 10 o'clock and takes an hour and a half lunch and you know, it's easy to see him as this, you know, guy who doesn't really care, just young kid who's just there for the paycheck. But actually when you talk to him, he worked, when he's there, when he's at the audience, he works harder than anyone else. He's on the phone all the time.\n00:28:48 - Tina Marie (profitdriversinc.com)\nSo do you feel like he, um, because something I've been wanting to dig into more is how many hours do people actually work and put in, um, especially within take because it's really, nobody micromanages and I'm not a fan of micromanaging, I don't agree with it. But I do believe in knowing the stats. And so how much do you think that he is he hourly? He's hourly, right?\n00:29:16 - Lorenz Schuerch (3)\nHe's hourly, yeah.\n00:29:18 - Tina Marie (profitdriversinc.com)\nSo how much does he work each week?\n00:29:21 - Lorenz Schuerch (3)\nWell, usually I see, you know, there's not really a way for me to check on that. Michelle would know better, but you I look on the slack when they're active, you know, when their little circle is green and I would say, so he probably shows up around 9.30 between 9.30 and 10 in morning and then he leaves at five, but it takes probably an hour, sometimes little more for lunch. So, at seven hours a day, but in the seven hours that he's there, he probably outworks everyone else on the team who's working eight hours, eight and a half sometimes.\n00:30:25 - Tina Marie (profitdriversinc.com)\nWorking or outperforming or both?\n00:30:29 - Lorenz Schuerch (3)\nI think I know what you mean by that. You mean like there's people that are working but they're they're not producing as much.\n00:30:41 - Tina Marie (profitdriversinc.com)\nYeah, so it would be level of engagement, right? So I might sit at the screen and my brain wanders off or I check my Facebook on, you know, like that that's working. But now if I'm here fully engaged in task at all times, then I'm out like I'm I'm really more engaged. I'm out working somebody who's saying, know, same amount of time, we're technically logged in, we're technically at work. But you're, I'm getting, I'm actually engaged at a higher level. And, but, let's say I've got, you know, happy intelligence of this person, and in their 20 minutes, they can outperform, meaning accomplish more tasks than meet hour for hour. So outworking is efforts, outperforming as results.\n00:31:30 - Lorenz Schuerch (3)\nOh, yeah, he outperforms, I think.\n00:31:39 - Tina Marie (profitdriversinc.com)\nOkay. Okay, that's some good information. Does he seem to be happy, enjoy working there, want to stay there, do you know anything about his goals and ambitions?\n00:32:00 - Lorenz Schuerch (3)\nYeah, I mean, I think we have a pretty good relationship and as good a relationship as you can have with someone you know, mostly meet with on Zoom and he's every time I've spoken to him, I try to have a one-on-one every month. I haven't had one last month, last month was kind of crazy, usually his feedback is pretty positive, he enjoys being there, enjoys the works he does, he likes being on the team he's in, likes working with Jessica, generally speaking and enjoys himself, I know that sometime back this was two years ago, almost when I started working there, I had spoken with him about his future ambitions and at the time he was looking to you know, going back to school for marketing or something like that, but honestly I can't I think he's settled again. enjoys what he's doing. of course, I don't have a crystal ball. can't read people's mind. Maybe he's putting on a show so that he still has that freedom to do whatever he wants.\n00:33:21 - Tina Marie (profitdriversinc.com)\nguess if he does want to go back to his marketing, but he looks pretty There's usually some signs and running on the wall that a person is checking out, like what Jessica seems to be doing, but it could be situational, like preparing for writing or whatever. There will be some sort of indicator that there's a problem, not necessarily what the problem is, but that there is a problem. And so if somebody, you know, if he's showing up and he seems to be happy and his performance continues to at least maintain pain itself, if not improved. That's a pretty good indicator that what he's telling you is true. So, you have one-on-ones with everyone once a month?\n00:34:14 - Lorenz Schuerch (3)\nI try to. Yeah, again, June didn't happen.\n00:34:18 - Tina Marie (profitdriversinc.com)\nAnd how important is that to you? And do you know how it's just your people?\n00:34:24 - Lorenz Schuerch (3)\nYeah, it's kind of my way to keep a near on the ground because I have a team that's one of John here in Arizona, Jessica and Utah. have Varian Mike in California. So, it helps me kind of know where they're at, know how they're feeling, if they're feeling overwhelmed. ask them pretty, I don't just ask them how you do it. ask them, you know, as your caseload, you feel like you have too many cases right now. Do you feel like you're overwhelmed? Do you need me to shift some cases to the other team? Do you think? think, you know, what do you think of the way the team is going? you think we're headed in the right direction or do you think if you were in charge, would you make changes? Things like that. So I feel like that gives me a pretty good temperature of how they're doing, but again, you know, if they're lying, there's no way for me to be able to tell.\n00:35:28 - Tina Marie (profitdriversinc.com)\nRight.\n00:35:32 - Lorenz Schuerch (3)\nBut I enjoyed it a lot. gets me to, you know, that's how I'm able to kind of steer them in a direction. I think they'll be more successful.\n00:35:43 - Tina Marie (profitdriversinc.com)\nHow often do you feel like you missed those meanings?\n00:35:48 - Lorenz Schuerch (3)\nI did January, February, March. I don't remember if I did April, I did May, and then do June.\n00:36:12 - Tina Marie (profitdriversinc.com)\nOkay, and why did they not happen?\n00:36:17 - Lorenz Schuerch (3)\nIn June, we had, we did a lot more, I think we did a lot more case reviews and so I felt like I didn't want to overload the team with meetings, but at the same time honestly I just got swept away in the end of the month, subtle medicine, didn't plan well enough, didn't schedule far enough in advance.\n00:37:02 - Tina Marie (profitdriversinc.com)\nHow often do you feel like you come back from those meetings with, um, value that it was valuable that you had that conversation.\n00:37:17 - Lorenz Schuerch (3)\nWhich meetings the one on once.\n00:37:19 - Tina Marie (profitdriversinc.com)\nYeah. Yeah.\n00:37:27 - Lorenz Schuerch (3)\nI feel like there's value every time.\n00:37:31 - Tina Marie (profitdriversinc.com)\nDo you feel like they feel like it's valuable.\n00:37:42 - Lorenz Schuerch (3)\nI don't know if I would venture into knowing what they're thinking I think. You know, I try to make it to help them feel heard I try to help them feel like this is their time to kind of like address on the issues. Um, but.\n00:38:00 - Tina Marie (profitdriversinc.com)\nHow often does somebody bring up an issue? Or even just tell you, hey, I like this or I'm having a problem with this or this is frustrating, whatever, do you feel like something like that comes up every meeting? We're trying to get a temperature of, you know, the value of the call to them.\n00:38:25 - Lorenz Schuerch (3)\nRight, I see what you're saying. Yeah, not everyone always has issues, but some issues came up like at one point, we were doing full team meetings. Mark had asked me to do full team meetings every day. And at one point, you know, they voiced that it was just felt very superfluous. Like there's no, not a lot of value in those. And so we restructured that. There is also point time where Jess and Mike felt like their caseload was a little high so I shifted some cases over to the other team. That was back in March, I believe. And there was a, well, this was some time ago now, but back with Cynthia in December, you know, she talked to me about the fact that she had her just a really hard time with John wasn't able to connect very well within, wasn't able to understand his style and that she would rather just have her own cases than have to work with John.\n00:39:47 - Tina Marie (profitdriversinc.com)\nThat came about from my one-on-one meetings? Yeah, it was a one-on-one So What I'm trying to get to is, do we need to build a system for you to have these scheduled in as non-negotiable and, you know, fail-safe if it doesn't happen, because the message that you send is that that is not a priority thing, if it's not scheduled regularly, and it's reactive rather than proactive. And if there is a tool or a process or system that you use that generates good results, then it needs to be done consistently. Now maybe it's every other month, maybe it's quarterly, but I think once a month, especially with our remote team, is not too much. you can do in order to have it not be overwhelming, and what is the most amount that a person\n00:41:00 - Lorenz Schuerch (3)\nconsistently. They're all hourly, right?\n00:41:02 - Tina Marie (profitdriversinc.com)\nSo what's the average? What's the what's the high low over under on how much they work per day? Weekly.\n00:41:14 - Lorenz Schuerch (3)\nWeekly high is let's say 40 low would be 34, 35.\n00:41:23 - Tina Marie (profitdriversinc.com)\nOkay, so being in your one on one calls last how long?\n00:41:30 - Lorenz Schuerch (3)\nWell, they usually schedule for 30 minutes, but they usually go over.\n00:41:35 - Tina Marie (profitdriversinc.com)\nWell, and that's an indicator that it needs to happen. If there's enough conversation to be happening that it's going over, there's got to be some mutual need and wants there. So that's a sign for you to be able to read. I will tell you, having worked 100% remotely for 22 years, that's. monthly is not overdoing it by any means. It doesn't matter how educated, how corporate, how higher level it is. That one-on-one time is, especially if it's consistent and they know it's there for them, is going to have higher value. They will know that there's going to be a time to bring up an issue. They will also know that there's a time where they're going to be asked and held accountable for how things are going, if that's what it gets used for. But we know that humans perform better with consistency and with structure. So your job as a leader is to make sure that you provide that. Anything that you have deemed as something worth doing with any kind of frequency needs to be done intentionally. thematically consistently be scheduled, not let's see if I can squeeze it in, or we're overwhelmed and so we're not going to do it all. Now, there generally is a pace to to the cases throughout the year. It's much more consistent now because we're working really hard on the lead generation so that we try to be giving a consistent amount of cases. But, you know, you can look at what people are working on and do your best to move things around and balance out the workload, but at the end of the day, whatever wiggle room you have should be, maybe we can move it from this state to this state on this week. And maybe we can cap it at 30 minutes, but what's not negotiable is we're not not doing it. And you can give. the timeframe of this week, hey, pick a day this week, but but really, it should be a study on the first Tuesday of every month, or second or third of whatever, a specific day of the month, a specific time of the month that is committed to. Now, if somebody is going on vacation, gonna have a baby do it, like all those different types of things that you reschedule for, you don't just not have it unless we're talking about like maternity leave or bereavement, and they're gone for a long time, bereavement is not that long. But anyway, but maybe that's a time where, you know, you do give a little extra time. Other than that, so vacations you know about ahead of time, and you can look at that and go, Oh, you want vacation during this time, that happens to be when we're having our review call. So let's have our review call ahead of time, or have it after, and maybe we'll make it a little. shorter because it's going to be closer to both the either either the first review before it or the one after Depending on where we're moving it right if we're moving it up or we're moving it back Um, but we don't want to not have it what you also can do Is and you can you can try this out, but what you can do is create that framework and kind of replicate it through email only Under extreme circumstances where somebody's going to be gone for a large chunk of time Where it doesn't make sense to just not cancel that one? So what you do is an email version in lieu of and these are the questions that I would ask you um I like to give people an option of sending me an audio message if they don't want to type it up um, so and and With your team attorneys typing writing is probably not an issue, but basically the thing is you you want to create a format where they're going to still be open and share as much with you as possible. So, like if you have a Slack channel, you can say, hey, we're going to go ahead and have this week's, this month's meeting because of extenuating circumstances, right? other time. Otherwise, it's prioritized. We're having it. It's the normal way. I'm going to ask you one question at a time. You shoot me back your response. Then I'm going to send you the follow up. Then what we're going to do is have an equivalent of about 30 minutes of back and forth chats so that we've connected so that I know where you're at, so that you know I care about where you're at and that I'm we're checking in. But basically, you always want to keep that connection and you want them to know it's really important to you, that they're really important to you. But also, you need that finger on the pulse. You need to be able to gauge them consistently. You know, because you can tell people change how they're talking a little bit, plus when you add that how they're showing up. If you ask them, how are you feeling about this, and then you get a pause, you know, there's probably an issue. There's a lot of different things that you can read, and if you're not having those one on one conversations, then you're missing out on that. So I love that you're doing it. I think that you should absolutely prioritize it and make sure it does happen every month. And I would like you to ask them, and you can send it in email and say, you know, this is the reason I have these calls. This is what I would like to get out of it. I would love to know if you find any value in it, and if so, you know, do you appreciate about it, appreciate about it, and is there something you think that we could do better? we Is there there something something do do you would like to see we discussed, like maybe there's a question I don't ask you, you wish I would ask you and give you an opportunity to discuss something that maybe I'm not creating a space for, especially with Viri. So let's talk about her for a minute. Leading the conversation. So now you do, do you have everybody on a group team meeting anymore at all?\n00:48:37 - Lorenz Schuerch (3)\nNo. I just meet with John and Viri and I'll be with Mike and Jess.\n00:48:43 - Tina Marie (profitdriversinc.com)\nAnd the other, they don't interact with anybody else, right? It's just John and Viri and just Mike and Jessica with you, right? No? Okay. All right, that makes sense. So, John and Viri, tell me a little bit about running out of time. That's okay. Quickly a little bit about John and Barry. Let's just do John because I have enough to work with Barry for right now.\n00:49:13 - Lorenz Schuerch (3)\nOkay. Yeah. you know, John, I knew him at Zane's. Um, we're, you know, we're, we're good friends. Um, he, uh, he's very, very good with clients, very, very good in crisis crises, out fires. Um, generally really, really appreciate him. Um, and he's getting better at doing, getting distributions, not quite as good as Mike. Uh, and so I, I counted like, this is more of an ad hoc thing where I still do a lot of the distributions, but he'll, he'll do a few, And that's fine that you know, I don't mind doing it He Sometimes He he hyper focuses on things sometimes And things that should take like five minutes taken 45 minutes And so Can feel a lot of times like you're stretching through mode Do you have perfectionists? Does he have any kind of OCD? He has he has ADHD And I have a kid with ADHD so I can't get it and My wife has it too It's it's pretty common for them to hyper focus and just kind of get lost in the in the details and so So we've found some ways to manage that. I think I'd like him to test the consistent, know, being able to, like, I'm very much a guy that, like, I have 42 tabs open. I know exactly what's on all the tabs. As soon as I get an email, I respond right away. You know, and I kind of like, that's how I work. I bounce from thing to thing, and then by the end of the day, all those things have been resolved. And John works differently where, like, he can only have one tab open at the time. know, before he gets a phone call, there's a client that calls, he needs to use the file for, like, five or six minutes before he takes the call. And that's sometimes little bit too slow for me. my liking, but I also understand we have different styles, we have different ways of organizing ourselves. And yeah, same thing, he gets lot of five-star reviews, clients love them. In fact, a lot of times I'll be talking to a client and they ask if they can talk to John instead. So that's always a good sign as far as I'm concerned. Wow.\n00:52:28 - Tina Marie (profitdriversinc.com)\nActually, it depends on what the values are. It's a good sign that clients like him, but for example, 28 years ago, somewhere around there, was working in a call center and we had Apple Computer and Intel and lots of high-tech companies. The people that customers loved the most, made us the least amount of money and generally ended up getting fired. They had poor call control skills. They couldn't focus on what mattered most. People, it's not social. power. We have a goal to accomplish and the thing is the client's goal is to get their money. That's really what it is. But people also, Maslow's hierarchy of needs, right? They need communication. And if they found somebody who will talk to them and make them feel good, they may call just a chit chat and just the update. If you were to go listen to his calls, you may find that they go up the rails and talk about things that don't actually matter. And that's a coaching issue. It sucks because that's a part of human needs is to have that social connection. Um, but there's a time and a place for all things. So, you know, getting those needs met has to happen. And maybe, but like everything else, sort of, it starts with awareness. And, and then it starts, and then, and then you add in values. So if he becomes more aware that really the best way to serve them isn't to be their buddy and their friend and make them feel happy, but it's to get their case closed and get them the biggest settlement possible, that that's actually the best way that he can serve them and that by taking too much time with each person, he's actually neglecting other people that he also likes and wants to take care of. So just having the awareness and doing kind of that mathematical equation of if there's not like, there's only so much time I have, there's so many cases that I have. If I'm spending so much time on things that are really irrelevant, enjoyable, pleasant, but irrelevant, I don't have enough time to actually get to the things that matter. And maybe he's He's never really assessed that, and maybe he hasn't assessed it in a way that makes him feel better about saying, about redirecting a call. You know, when somebody wants to tell them about their cat that died, or, you know, whatever problem they had that day because it happens. People get on the phone with a compassionate person, and maybe they get a text message that reminds them, I got to go do this, and then they talk about it. And then somebody goes, oh, I'm so sorry to hear that. And then they might ask a follow up question like, are you okay or whatever, and you open a door that needs to not be opened.\n00:55:38 - Lorenz Schuerch (3)\nYeah. Yeah, I think when I was at the public defender's office years ago. They said there's like four types of attorney, there's like the, the warrior, the, you know, The advocate, and then they forgot what what all they are, but one of them is a social worker. Yeah. You know, go knock on your door to make sure you're okay and, you know, find a babysitter for your cat while you're in jail and stuff like that and that's, yeah, it's not as helpful as might think.\n00:56:12 - Tina Marie (profitdriversinc.com)\nYeah, and then that goes back to what is the end goal and what is the priority. So, we have the word priorities as a plural now, but when the word was first created, there was no plural. It was just one, there's a priority, a single primary goal. So, having conversations like that might be helpful. And I think you have the soft skills to be able to kind of massage that conversation. And because, first of all, it takes time to make change. That's a personality that, you know, are habits that are ingrained in his personality. And so to go against that would be to violate his internal values. us. He's taught that he actually has conflicting values, which most of us do and aren't aware of it. The conflicting value would be I want to take care of this person. I want them to feel good, but to take care of them, I need to get my job done and ask these questions and get them to answer them because I also want to take care of these people. And when I talk to them about things that aren't related to the case, I'm actually failing to serve them in the way that I want to. So is it being their friend of the higher priority and being friendly, or is it serving them to the best of my ability, meaning getting the case resolved at the highest level possible, and is it timely amount or is possible?\n00:57:53 - Lorenz Schuerch (3)\nSo I'm thinking about maybe asking my how many cases he touches each day. And kind of seeing and asking John the same question and seeing if we can move them out so that. Because another thing is he's been requesting a lot of over time to catch up.\n00:58:17 - Tina Marie (profitdriversinc.com)\nAnd I'm wondering if that's the reason why he needs to catch up because. Oh, John is asking you for time to catch up so above like 40 hours like what do you mean.\n00:58:38 - Lorenz Schuerch (3)\nI don't approve anything Mary does but usually asked for like six or seven hours on Saturday.\n00:58:52 - Tina Marie (profitdriversinc.com)\nAnd do you think it's been trying to milk things so he can get over time.\n00:58:57 - Lorenz Schuerch (3)\nNo, I don't think so. I generally think he needs it to catch up. will just jump. 41.\n00:59:23 - Tina Marie (profitdriversinc.com)\nRight. Let's keep working. I as we go.\n00:59:30 - Lorenz Schuerch (3)\nI know we need to wrap up, but. Right.\n00:59:34 - Tina Marie (profitdriversinc.com)\nTime flies. That's a good thing though. That means we're getting some good work done. So, Viri, I don't want to jump the gun, so I don't want you to go have a conversation that you're not ready to have, but I think you can. And basically just kind of feel it out. I think you have enough awareness in you to direct the conversation. and it doesn't have to be a big long one. Basically, the change will come as a result of you consistently sending the same message, both with what you say and with what you do. So if you say, this is a safe place for you to talk and I'd really like to know what you think about things, how you feel like there's ways that we can improve. I want to know what you like. I want to know what doesn't work well. I think you've got a lot of experience and but I notice you don't really talk about it much and I feel like that we're under utilizing you or under serving you or both because of that and I'm wondering if maybe you just don't feel like this is a place where you can talk and I want you to know that it not only is it safe for you to do it, but it's wanted and just see what happens, just be quiet and let her kind of go from there. You don't want to just keep beating it down. And then if she ever says anything, that is like, I can't believe you just said that. It's so negative. It's so bad. It's so whatever. have to just be able, and I think that you're, I think you have this ability. I've never seen it, but I would assume you have this very well where you can just go, okay, let me think about that for a little bit and get back to you because that was a lot. And I want to give you the respect and honor to give you an appropriate response. And since I don't, I don't have it the moment, but thank you for sharing and encourage it. Because the first time you say you're safe and she's not, that's done. So one of the things that you have to do, and this is something I do with anybody that matters to me, but my star started my practice with my kids, and they're the most volatile. So it's the hardest, and it's the best way to practice, which is kind of that poker face of they're about to say something, and I know I don't want to hear it, and this is hard, and just like, and they're like, okay, I am not going to react to this. matter of fact, I'm going to drop my voice a little bit, I'm going to get softer, I'm just gonna, okay, okay, okay, I need to talk about this a little bit later, maybe tomorrow, you know, process it, although I can't imagine there's going to be something that's that difficult, but just in a leadership role where you want to have people tell you everything, you have to practice how you respond to it receive it so that if they happen to tell you when you're having a bad day, when you're at a time, When you're hungry, when you're tired, because these are the things that make Tina a bear. Do not want to tell me bad things when I'm hungry and tired. It's not going to be good. So just make it a reflexive response to take a bee and just take it in. And then, okay, I'm going to come back to this and do that. But, you know, for people, scattered, working remotely, different personalities, different paces, different skillsets, all of these different things. But you're still trying to work within a single organization with a common goal. That's no small thing. But, certain things, certain types of systems, certain functions done consistently can help you be able to get the best results. it's knowing your people, it's communicating with them. frequently, having a set of company values. And the company can have pods, you know, within it, right? you and your four people are one, but also you and each are one also, separate ones within, so organizations within organizations. And making sure that the internal values of the pods, the smaller the pod is, the more refined those values can be, the more detailed they can be, because there's less people, right? All of those need to be compatible with the larger company goals of, you know, great communication, being honest, being reliable, caring about the customers, the clients. That is definitely, I think, a value in sweet lies. Most people really care about the clients, and they want to take care of them. I don't think... think everybody does. But I know that Mark cares about that. He wants to be one of the good guys, you know, and he works, and he wants people that work for him that are the good guys. That's unique. That is a unique part of your culture. I think that stands out, especially in the industry, that you specifically are in in personal injury. So, you know, lots to talk about, lots to do, and it's the consistent effort. It's the proactive. We didn't get to really talk about the morning and how you started. But I'm really looking forward to that next week, because I think next week is when we're combined again. So, it should be Monday at 3 o'clock, which I've not scheduled. I need to do that.\n01:05:44 - Lorenz Schuerch (3)\nLet me open up my calendar.\n01:05:47 - Tina Marie (profitdriversinc.com)\nI just Let me do this real quick. If I don't do it right now, I might forget. And actually, I'm going to duplicate my gosh, go away. I'm going to duplicate. I'm going to move it to Monday at 3pm is what we discussed, right? Sure. I'm going repeat weekly on Mondays and we'll reschedule as needed. Oh wait. Okay. Good. That's that. So we'll just keep working on it. Now, if you have questions, if you have thoughts throughout the week, if you want to run anything by me or just share something or just an insight, feel free to send an email. We could have a Google Doc that's just kind of a back and forth journal about notes. So maybe you don't want to send an email and just like here's some notes or discussion. discussion points for the next week, you can delineate whether or not you want it to be the one on one conversation we have, or think that it might be useful to bring up with with Patrick. So you can just kind of like run it by him. So we can all kind of, you know, benefit from each other. But we will get into the flow of like that structure. But I'm thinking about you guys all week long. So, you know, if there's anything coming up, I would rather hear about it, or at least make sure that you get it out of your brain and captured. So we don't forget to discuss it on the next thing, because a lot of the time that intuitive stuff just comes when it comes. So if you don't capture it, then you could lose something that was really valuable and helpful. So I do want to make sure that you capture it and shoot it off to me. It's not going to bother me.\n01:07:48 - Lorenz Schuerch (3)\nI will welcome it.\n01:07:50 - Tina Marie (profitdriversinc.com)\nOkay.\n01:07:51 - Lorenz Schuerch (3)\nOkay, don't that.\n01:07:53 - Tina Marie (profitdriversinc.com)\nYay. Well, do you have any questions comments, concerns before we wrap up?\n01:07:57 - Lorenz Schuerch (3)\nNo, that's that's pretty much it.\n01:07:59 - Tina Marie (profitdriversinc.com)\nThanks for thanks so much. I what I do very much and the people that I work with. So my pleasure and also I don't feel like I hurt anymore. So it was nice talking to you enough that my body was like, hey, that's awesome. I'm glad. Thank you. You have a great day Lawrence. I'll talk to you\n","contentPreview":"00:00:09 - Tina Marie (profitdriversinc.com)\nCan you hear me?\n00:00:11 - Lorenz Schuerch (3)\nYeah, I can hear you.\n00:00:13 - Tina Marie (profitdriversinc.com)\nHow are you?\n00:00:14 - Lorenz Schuerch ...","processedAt":"2025-05-04T03:40:52.578Z"}