{"fileName":"Done Transcript for D&D Co & Profit Drivers - Weekly Review(13).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for D&D Co & Profit Drivers - Weekly Review(13).txt","type":"transcript","priority":"medium","content":"00:00:00 - Tina Marie (profitdriversinc.com)\nI cannot tell you how many times I am just picking up my phone to text you and then you log it.\n00:00:07 - Dan’s iPhone (danddcompany.com)\nYeah, it's like the internet stop working. I'm like, I'm disconnect the Wi-Fi and now I'm getting bombarded with like, hacks and I think I'm show you what going to show you.\n00:00:21 - Tina Marie (profitdriversinc.com)\nI was behind the camera, so I can't show you this, but I'm going to show you what I did and got home at midnight last night after having done. Hold on, cuz it was crazy, damn, where'd go, here, this, you have an iPhone so I can just send a bunch, use bunch of grandma's, well not everybody was a grandma, one was not a grandma, but I am. And now I have two grandchildren, let's see, this one and this. also that so that you can see we climbed a mountain yesterday at a top of a rock and there was legit rock climbing with no equipment and some of it was pure vertical and the only way I got up there was wedging myself between rocks and arm strength because I was too short to get the foot holds and hand holds that on that rock that mountain yes it was three and a half miles there and back and we watched the sunset on top of the mountain and we could see two volcano mountains from where we were that were a hundred miles away on one side and one hundred miles away on another side and then we climbed down in the dark with headlamp so I was in trumpet AF last night mmm that was a wild that was fun it was cool how to share Uh, hey, how did you talk to Lisa at all?\n00:02:06 - Dan’s iPhone (danddcompany.com)\nI sort of did, but not really. No, she's like in Jackson Hole or something. So she kept dropping out. So she was like driving through Nevada or something to Wyoming. We're not what the hell she's doing. So I just gave up.\n00:02:24 - Tina Marie (profitdriversinc.com)\nThere's so much of that and that is just dead zone.\n00:02:28 - Dan’s iPhone (danddcompany.com)\nYeah, so she was like, I lose you right here, losing him. I was like, and then it was like, no, here. No, no, no, wait, no. And then it actually got cut off and I was like, no worries. Oh, I don't know when she's coming back. think my mom told me, but I'm scared of me.\n00:02:46 - Tina Marie (profitdriversinc.com)\nAll right, um, so where's my notes, notes, she. So let's start with basis. How's that going since last week?\n00:03:00 - Dan’s iPhone (danddcompany.com)\nwith Frank yesterday and they kind of they be I'm a second visa or I'm a second visa and Eric like who all met exactly the second.\n00:03:13 - Tina Marie (profitdriversinc.com)\nYeah. Okay.\n00:03:14 - Dan’s iPhone (danddcompany.com)\nAll of them. Okay.\n00:03:15 - Tina Marie (profitdriversinc.com)\nYeah.\n00:03:15 - Dan’s iPhone (danddcompany.com)\nThey're all but Norio.\n00:03:17 - Tina Marie (profitdriversinc.com)\nWell, yeah.\n00:03:18 - Dan’s iPhone (danddcompany.com)\nYeah. they were they were just trying to like like the like imagine Frank is like the blocks expert, right? So he's unlike the cutting edge of all that, right? And WordPress will like change the name of something and Frank adopts it immediately. He's like, oh, it's called this now. So like some of the some of the names we're using are not what they are now. So when he hears, but the word still is around.\n00:03:53 - Tina Marie (profitdriversinc.com)\nIt just has a new meaning.\n00:03:55 - Dan’s iPhone (danddcompany.com)\nSo what we call a pattern, for instance, this is true, but let's say it is, what we call a pattern is now called a layout, and a pattern is now something else. So they got together and they said, hey, we think there's some confusion around, like we need to make sure we're on the same page about what these things mean, or make sure that we're all using this to correct terms, right, because we think that we say this, and it turns out they were right. So it was like, okay, so they got the same page about that. And then they brought him up to speed on some of the other stuff that he was confused about, like, hey, why are you using a cloud? Why do you want to use a cloud library for this? how are you doing this? Eric's like, I think we got it, like, we definitely got it now. he's like, I think he was impressed even more. was like, oh, okay, got it. So then they said, for now, like, ranks, sort of like coming at it from a long term approach, like, Hey, you know, when you have a hundred clients, you're gonna want to be have this. And he focuses sort of in there. And they're like, we appreciate that. But we want to, we need to be working on the short term rather than the long term.\n00:05:21 - Tina Marie (profitdriversinc.com)\nSo we work on the short term.\n00:05:24 - Dan’s iPhone (danddcompany.com)\nAnd for us, the short term is being able to do XYZ, whatever. he's like, got it. Okay, yeah, it's like, it's not that we don't want to do what you're talking about. It's like, we don't need that now, we need that then. But let's do the now, now and then then. And then Eric today was like, he was like, Hey, I just want to let you know, like, if it would be possible to keep him around for like once a month calls, like once we get this stuff out of the way is like to keep him around as an advisor for some sort, he's like, I think that would be super beneficial. I said, sure.\n00:05:59 - Tina Marie (profitdriversinc.com)\nThinking about having. Yeah, more long term anyway.\n00:06:01 - Dan’s iPhone (danddcompany.com)\nNo, no, okay, no, because I don't, I wouldn't assume that that was possible. So he never mentioned anything about like a monthly engagement or anything like that. All that he has said to me was, Hey, maybe maybe when we're done with this, you could help me sell my stuff. Or do you know how to do that? I'm how to do this. Maybe there's mean we can work either like that. And funnily enough, Eric was today, before I said this, Eric, Eric was like, man, if Frank used our stuff, he'd sell so much more of his course or whatever.\n00:06:39 - Tina Marie (profitdriversinc.com)\nHe's like his check out and all his stuff is terrible.\n00:06:43 - Dan’s iPhone (danddcompany.com)\nBut the code is good, right? So it's like, he's like, he's good at code, like really good. So that's the threat. So now they were like, this is what we want, we want to be able to do. These are the things, the problems that we have, let's resolve these problems. ones. So an example would be when we import a cloud template, make sure that it adopts all the styles, being able to set the global styles so that when you add a block or a gravity form or whatever, it adopts all of those. So that's what they're working on. And then showed him why it might not be the best solution for some of the that he's talking about, or we can do it like this. And he was like, oh, okay, yeah, that makes sense too. So yeah.\n00:07:45 - Tina Marie (profitdriversinc.com)\nAll right, the goal is still to get wolf or done by October, okay. And the G4, the journey, how are we doing?\n00:08:06 - Dan’s iPhone (danddcompany.com)\nI think there's something wrong with one of our plugins. have to, I set up a test yesterday because I implemented our lead tracking on CMA. I'm for sure getting leads from ads and what I'm seeing, those events are not firing in, oh, you know what it is, the GTM container. I have to go to the container. It's not finally the container.\n00:08:45 - Tina Marie (profitdriversinc.com)\nthink I just figured it out. What is CMA?\n00:08:50 - Dan’s iPhone (danddcompany.com)\nThe certified management accounting exam.\n00:08:55 - Tina Marie (profitdriversinc.com)\nOh, okay.\n00:08:57 - Dan’s iPhone (danddcompany.com)\nSo we launched that site, whatever, like a year ago. It's. been steadily getting sales. So then I purposely tried to get leads. I'm getting like two or three leads a day right now. But they are not going up in Google Ads or Google Analytics. But I think I just can't a step. Do you know?\n00:09:22 - Tina Marie (profitdriversinc.com)\nNo, you cannot, Dan. You cannot skip a step.\n00:09:25 - Dan’s iPhone (danddcompany.com)\nI followed the swap that I created. I would have realized I'd skip a step and I'd just get it on the fly. Did you follow the process? I did not. No wonder I didn't work.\n00:09:41 - Tina Marie (profitdriversinc.com)\nI did So what else in that journey, what else did you want? I don't know what else did you do related to G4.\n00:10:03 - Dan’s iPhone (danddcompany.com)\nSo Melissa is that she'll have all the stuff reviewed by the end of the day today. then she wanted to meet tomorrow. I'm not sure I can because I didn't think this stuff was tracking. But now I do think that stuff is tracking. So I need to go also saw something else weird yesterday that to go look at. Like there was an event firing in CMA that technically shouldn't be unless the way I defined it was URL based. And I said something like, hey, anytime a URL has SP in it, which would be a sales page, then do this. And if that's the case, then it would be correct. That is not the case that it's incorrect. And if that is the case, then I should have seen two other events and I didn't. So either the one event has messed up something's wrong, I think. So I have go look at that because the stuff that she's going to build is based off these three events firing on the sales page. But it would be that only a ninja because they just got a custom set up. It could and should be that they do fire on all sales pages across domains because they're not in any way product specific or page specific other than sales page is like this.\n00:11:26 - Tina Marie (profitdriversinc.com)\nThe should only throw in a sales page.\n00:11:28 - Dan’s iPhone (danddcompany.com)\nSo I'm going to go make sure that a they're actually all firing correctly on ninja CPA. And if they're not, then I can't be with her because they're needed to build the report. If they are, then I can be like, okay, yeah, let's jump on a call and do at least one. Let's just do that one. Just broken the fix.\n00:11:51 - Tina Marie (profitdriversinc.com)\nOkay.\n00:11:54 - Dan’s iPhone (danddcompany.com)\nI'm still going to like the custom JavaScript version of his thing, which is custom JavaScript, which I do not do, but I'm going to learn how.\n00:12:09 - Tina Marie (profitdriversinc.com)\nGood. What does that allow you to do?\n00:12:16 - Dan’s iPhone (danddcompany.com)\nI think it's going to allow me to fire custom events based on custom documents, right? So the JavaScript says sort of like an if this, then that. If this happens, then fire writes out an example would be using that to fire my new customer event. So I'd say hey, if this is a new customer, then fire a new customer event. There's nothing built into GAPore or the GTN plugin or Woo that's made for that. So it's going to allow me to do this custom JavaScript.\n00:13:11 - Tina Marie (profitdriversinc.com)\nI'll be interested to see what those events are and so if you can't do it in GA4 or custom JavaScript, can you give me an example of the event?\n00:13:27 - Dan’s iPhone (danddcompany.com)\nBecause I think of that and think you can do it with custom JavaScript. It's not going to be a default event, so a default event in GA4 would be a form submit, they have a built-in event that I see firing that I didn't set up, so a custom event would be not default, it's not built-in at all, and then it's also you're defining it, right?\n00:14:02 - Tina Marie (profitdriversinc.com)\nWell, like for example, was it be scrolling to a certain page?\n00:14:05 - Dan’s iPhone (danddcompany.com)\nIs it add the card? Is it add the card?\n00:14:07 - Tina Marie (profitdriversinc.com)\nNo, no, yeah, all those are all those are built in.\n00:14:11 - Dan’s iPhone (danddcompany.com)\nThat's fine. Yeah. So it's outside of those and then it can be completely custom, like new customer. No one is going to be, I mean, I'm not going to say no one, but probably very few people have ever set up a new customer event. So that's going to be me waiting for the order transaction result page to hit. And then I'm going to do a look up in the blue. I'm going to say, is this a new customer or not? If yes, then fire this custom JavaScript and call it new customer. Like event is new underscore customer.\n00:14:49 - Tina Marie (profitdriversinc.com)\nOh my god, what purpose like just to know that this transaction was from somebody that you've never had before or like to what end is what I'm getting at.\n00:14:59 - Dan’s iPhone (danddcompany.com)\nOh, so then. in GA4 I can say, show me new customer sources. I say, your new customers come from Google organic.\n00:15:11 - Tina Marie (profitdriversinc.com)\nGot you.\n00:15:13 - Dan’s iPhone (danddcompany.com)\nGot you. Got you got you. Also, like, you know, then it would be like, you got this many new customers along the stuff that we already know, but it would be in that place too. And then, if I can do that look up and fire it into GA4, then I could also say, and go apply this tag in the infusion talk.\n00:15:35 - Tina Marie (profitdriversinc.com)\nWe used to work around with that with Infusionsoft and onto port with what we call the sandwich page. That was sandwiched between checkout and the thank you page, the landing page that the customer got to once they purchased. in the checkout page settings, you can always say, okay, where do they go after completion of checkout? so it would go to a sandwich page and all that was on there. was a pixel, a tracking pixel, and a redirect, a meta redirect, so that it happened, you know, within seconds. And so the customer never saw it because it's a blank white page, and it just looked like a page was loading. But that fired the pixel, and then it would go to their landing page, and it happened so quick that, you know, nobody was upset or bothered by it, but then it allowed us to get a fire, a pixel fired that wasn't built into any of the systems.\n00:16:31 - Dan’s iPhone (danddcompany.com)\nYeah, similar principle, except just JavaScript faster. Yeah, well, and you can do more, right, so I can like delay, I could send the event in the data layer after the fact, I can send it with everything else.\n00:16:47 - Tina Marie (profitdriversinc.com)\nYeah, that appending data is amazing. And I only seen that though, what JavaScript and jQuery.\n00:16:55 - Dan’s iPhone (danddcompany.com)\nRight, same principle.\n00:16:58 - Tina Marie (profitdriversinc.com)\nthat's cool. love that. You're, this is a whole, I probably said it last week though, sharpening your saw and like, you can hire people for this stuff but not really well because people that do it as a job, do it as a job and their interest level is not optimized, it's not leverage, it's not simple, it's always bloated, it takes too long, it's not super refined, it's not as excellent as it can be whereas if you do it, even though it's working in your business, it's still working on your business because you're setting up the foundation for like, it's the vision, right? Basis is the the basis, that foundation tech stack that is, it's the tools but it's the systems and it's the processes and it's the methodology of using everything to it's fullest. It's potential, which is why Mercer will always have, you know, job security and you will end our business, however you want to look at it. But it's just such higher level than what almost everything else has done. It's the leverage. It's the data. It's clean data. It's fast data. It's attached data. It's data that tells the whole story from beginning to end so you can figure out what works, what doesn't work, how well it works, what works best, blah, Nobody else is going to do that like you would do it. So I'm glad you're doing it.\n00:18:35 - Dan’s iPhone (danddcompany.com)\nYeah. That's thing is like you can't, you can't measure what you don't know, right? It's like, I'm figuring out like, oh, yeah, want to measure. And then his custom JavaScript, so mine's like even more custom. And I can't, there's this, there's this idea that you can, you can take something like that and you can put it in as something else I can't remember the name of. But he's like, it's very rare that people use this, and I'm like, I have a feeling that's exactly what I'm going to need. And then his custom JavaScript is to do other things, like maybe you're combining events or you're defining your own where they scroll and stop plus 40 seconds. Like, I think you have to create a timer which JavaScript it does the 40 seconds. And they're like, okay, now fire it. So I'm getting into his stuff. But I think there's, and then I think once I go through his stuff, then, of course, that's going to make me go, Oh, I could do this, this and this too. Yeah, Lucy's, Lucy's working on the Lucy set up the creator user on form. It's working. We're making sure that doesn't break anything. He said, doesn't break anything. been live for like two days. Nothing's broken, but I know I haven't seen anything bad. And now I have to take the next step there is for me to get him to to insert custom meta on like I got to define the meta and then send it to them and say okay great create this meta so when they submit the form and you create the user also attach this meta magnet notes source whatever the source is in PGT I just have to look for and see like it'll probably like source not medium maybe campaign or keyword probably keyword oh and then Norio's gonna have to like I didn't know this but they've added utms so there's some new utms and then there's these new utms that have been added and then there's these other utms that are usable but not officially added that you know just allow you to and more data so Norio would have to like expand our plugin to include those, but we don't need them right now.\n00:21:07 - Tina Marie (profitdriversinc.com)\nOkay, one tab, there we go. yeah, so how's Noriel's stuff with high level and fan flow going?\n00:21:26 - Dan’s iPhone (danddcompany.com)\nUh, so he and I went around and around and there was some, so he has to sort of learn it, right, and then, but he gets to learn it, Ruby going, oh no, no, no. Go here, look at this, it does this, so he sort of gets short cut, only thing is to wait. Well, he doesn't really have to wait, right? By the time his email hits me his day is over and then when he wakes up the next day, he's got his answer provided I responded, and then lately he's been staying, he's screwed up later in the day, he was emailing me yesterday or he's working later because he was emailing me like definitely after her day was over but I think I got um everything he needs to get his first app working and then the the mod side or whatever the JD photos was named in their company the JD photos guy we we hooked up with them because they had the custom value updater that's how I found them so I paid 250 bucks to get access to their it's like lifetime access to their custom value updater but we keep running into it not working like intermittently and we don't really know it didn't work until somebody notices something's wrong kind of thing or something breaks essentially and then we'll trace it back and be like oh the values didn't get updated so those guys don't know when it breaks clearly we don't I don't know when it breaks, and then we hit them up and say, hey, this isn't working. So on the call of Monday, I'm like, man, this, when I was already thinking this, this doesn't work long-term. Long-term we need our own custom value updater, and we need one that would check, did the update occur? No, then run it again, or did the update, and if you can't, then it would send a message and say, custom values did not update something, something that would let someone know it's wrong. Ultimately, it would just not, it would just work or self-correct. So I hit up Norion, I was like, hey, I'm going to see if these guys will sell me their code. What do you need? And he's like, oh, you know, I need a walk-through or docs, and just that explains how it works, and he has seen some, he's seen the code that they write, and he's like, dude, their code's terrible. It's like it works, but it's not good. I'm like, not our concern at the moment, Norion. focus on the first part.\n00:24:01 - Tina Marie (profitdriversinc.com)\nIt was.\n00:24:03 - Dan’s iPhone (danddcompany.com)\nSo he like used some of their code to write his app. And so he's like, yeah, we can we can do that. I hit up those guys and told I explained to him, hey, look, listen, breaks. We don't know when it breaks. Ultimately, we need to own our own version, and I buy a copy of your code. And then we'll move it to our server and, you know, do that. Like, I was like, let me ask the developers. And then he came back, he's like, yeah, sure, we can sell a few 700 bucks.\n00:24:31 - Tina Marie (profitdriversinc.com)\nDone. What?\n00:24:33 - Dan’s iPhone (danddcompany.com)\nYeah. So Stacy literally just sent them 700 bucks. And, uh, Nario just, I told Nario needs a loom. And, and then he's already worked with them to move code around. So they'll get it sent up on the server. And then Nario will tell me, I'll tell him what's wrong with it after the fact. We don't know when it doesn't work. So I'm sure he'll be like, that's easy.\n00:25:00 - Tina Marie (profitdriversinc.com)\nYeah, typical, or real fashion. Um, okay. Hold on a second. Seriously, click over there. So like, what is the, I have to go back and look at my notes from last week. Hold on a second. Was all this week? No. Yeah. I don't have like, what are the targets for what Noreo is doing?\n00:25:34 - Dan’s iPhone (danddcompany.com)\nMeaning.\n00:25:35 - Tina Marie (profitdriversinc.com)\nWell, what do you, he's working on building fan flowy, right?\n00:25:41 - Dan’s iPhone (danddcompany.com)\nBut he's finishing the wedding, the, the wedding time. Yeah, but that's still, that's Abishik keeps finding like bugs and whatever. So there's, it's like true bugs and Noreo's fixing those and then there's nice to house or what if it. And the what if it did nice to haves are being Saved but not worked on so nor is just fixing the bugs and He got another round of those literally on Monday right right up to the meeting So he's like I'm not sure what I'm gonna be done. It's weeks, but he's like provide it He's like I thought Abhishek was done, but I literally just got an email with like five more So but he had talked to Abhishek about hey just yes, I want to hear it all and separate them like this And so they're doing that He's like man. He is good at finding this stuff and he really is So that will probably be done I would say by the end of September and Then Eric is talking to Norio about What to confirm is what we tell you about the summer day So we have the free wedding seating planner for epitome and then I bought the way of that So that's basically just a lead gen site and it's fill out this form and get access to our free win and seeding planner The idea being we generate leads they tell us engage pop up by Budget all the good stuff and then we give them access we limited access to Perfect wedding timeline just the seeding planner portion So Eric's needs to talk to Noria about okay, how do we do how are we doing that? It's gonna be a gravity form to what a webhook an API What and then once that function is worked out Greg's already done the design and then we'll just do like a super simple I mean problem. I mean I say a one-page site might legitimately mean it like there might be some Content pages that we do in the background that are for SEO, but like they're not in the nav Right, there's there's nothing for sale on that site It's just straight up you want to pre-winning seating planner popped in.\n00:28:07 - Tina Marie (profitdriversinc.com)\nOkay, I like that. And what is, do you have like a target date for that?\n00:28:15 - Dan’s iPhone (danddcompany.com)\nNo, I mean, we can't use it until the software is done. So we're going to try to, once we know the connection, then, I mean, I might look at like, it's like, what is a good, I'm sure there's one, I'm sure there's one from back in the day, where it's like just a pure lead gen site. Like to me, it's just like, that you're free-winning, like, and every email. And then of course, it'll just expose the other fields. So I might just look for like, what's the best opt-in site ever? Great, someone had like a free SDO analyzer, like back in the day, like crushed.\n00:28:57 - Tina Marie (profitdriversinc.com)\nThings just didn't.\n00:29:00 - Dan’s iPhone (danddcompany.com)\nIt'll be something like that. I'm going to go find something like them and just do that. Fine. I mean, that will take Craig. 20 minutes, and it'll take like, and I'm still at the thing where I'm like, I don't want to build sites until this stupid thing is done. So there's also that. I'm interested to see like how far they get. I think they meet with Frank every, I think it's every week.\n00:29:23 - Tina Marie (profitdriversinc.com)\nNow they just back on top of vacation.\n00:29:26 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:29:30 - Tina Marie (profitdriversinc.com)\nOkay. Right. Oh, I have the notes about high level is raising third party integrations, but I just kind of left that hanging and I don't know. remember talking about it, but I don't remember.\n00:30:00 - Dan’s iPhone (danddcompany.com)\nscenario to review but it's not like unlocked yet you can't even what they do is they they release stuff in the lab so it's going to be in the lab I want to say like yeah I want to say it's like three weeks but there was some doc there was some documentation on it when I sent you to Norio okay and on Monday he's like all review it and like you know like sort of was like this is what I'm thinking like that it's going to be like another level of being able to integrate with it and I mean that's exactly what it sounded like so it's like beyond APIs I'm like I don't know what that really means that'd be interesting yeah I think it's that you can get access to like user ID and stuff that you can't get access to be just the API so we'll see um let's hold on a second\n00:31:00 - Tina Marie (profitdriversinc.com)\nOh, yeah, so the conversation about basically having the kind of menu items and what the team can provide when people request custom work or, you know, like what's the scope of support basically for basis customers, Bobbi was getting back at that and making sure that everybody's on the same page with that.\n00:31:28 - Dan’s iPhone (danddcompany.com)\nWhere is that at right now? I don't know. Did I not go to meeting on Monday? I missed it.\n00:31:38 - Tina Marie (profitdriversinc.com)\nwas like, it had to be over within nine minutes because I went there. was like, holy crap, I snoozed the alarm one too many times because I was making lunch. I was like, oh, it's like night after. And then I dial in and there's nothing.\n00:31:55 - Dan’s iPhone (danddcompany.com)\nWe definitely didn't talk about it.\n00:31:58 - Tina Marie (profitdriversinc.com)\nNeed to talk about it?\n00:32:00 - Dan’s iPhone (danddcompany.com)\nWe didn't talk about it. mean, I know he was working on, but I don't know. don't know that I'll see if it should be a task somewhere. I don't ever go into work.\n00:32:35 - Tina Marie (profitdriversinc.com)\nI'm going to knows of. If she doesn't know of it, then it's probably not passed out, but we'll see. Just to make sure that it's getting traction. Oh, Brunchy, no more issues, only reset you with the last thing.\n00:33:26 - Dan’s iPhone (danddcompany.com)\nSo we figured out the fact that if user logged in and creates an API, it's only visible to that user. It's not visible to anybody that has admin access to the account. So Heather had logged in and created an API key at one point. Ross had logged into their account, Ross had landed, logged in and created an API key at one point. I wish I could be J had logged into range. And then they were something, whatever, one of the sites and they'd created an API key. So then when Eric or whoever was going in and changing the API key and I'm replacing it on the site, there was always another API key that that person couldn't see. One way or the other. So there was Eric, he didn't see Abishik. He didn't see Abishik, he didn't see Eric, so it was Heather. She didn't see Eric, so there was Eric, he didn't see Heathers. So in essence, it was always an API key available. So when the one, you know, Heather and Ross and those guys, they're not working on the site. So what was happening was Eric would change the API key and whooper and it would still happen. We're like, how is this happening? We never understood how it was happening. It was because there was an exposed API, there was a compromised API key that was there that nobody essentially knew about. So now they've all been deleted. And then Only we are creating API keys and those like do not create API key and it's definitely quelled it almost completely but Wolfers We're trying to get them moved over to stripe and then brain tree still giving us a bunch of Like we're like we're not even using you guys anymore and they won't the account Because they're like your account is still at risk. We're not using it So it's not at risk and they're like you need to put capture on your checkout will unlock the account That was this morning like oh my god really So soon as that one gets out of risk they'll unlock the account and then proceed with the migration step but they have not done that yet and I think with Think with Reset you there were so few that they just manually migrated them or they're going into, but in the brain news off. So the other two are underway. They will hopefully be off within a week or less. And then we're done with brain tree.\n00:36:16 - Tina Marie (profitdriversinc.com)\nI was the most outcome. how is another 71 doing just any updates since last week?\n00:36:51 - Dan’s iPhone (danddcompany.com)\nActually the week part is the same at the weird part is. It's the same average of last year where last year we thought we're going to increase sales because they're changing the exam, right? Which now seems like maybe wasn't totally true. Maybe it was just, I mean, again, we don't have enough data, right? Because if you go back three years, you're in this COVID world. So we're like point, like point one off. So like, let's say last year we were averaging 30, 33 point or 34 sales a day or something. Right now, we're like 33.9, oh my God, so it's like nearly identical. And then that persisted through, well, that went well into December with this gigantic spike right before the exam was removed. So we don't know. We don't know what's gonna happen. We're just keeping on, keeping on. It's still just going to come down to where the new customers come from, especially where the new customers come from in 2025, or at least from May of this year forward where things sort of return to normal, but then more so in like, okay, this is normal. We're in a normal year. Where do these people come from? It's still going to come down to that. Even if we're just back on track or back, we're at this pace of like the best pace ever. I think we're up to like almost 4300 subscribers. It's still going to be like in order to grow this.\n00:38:44 - Tina Marie (profitdriversinc.com)\nWe have to know where your customers come from. Right.\n00:38:47 - Dan’s iPhone (danddcompany.com)\nthat's... We bought CMA exams.com, like a week, a week ago, two weeks ago. So I just was texting Bobby about that, so we're building that site. So now we'll have CPA exam.com, CMA exam.com, there isn't an equivalent for CPE, but we started getting some CPE sales, our renads for those, we started getting sales, but I'm not sure they're coming from there yet, but that'll be the thing, it's like, okay, once I can get all this tracking lined up and locked in, then we're gonna know. Oh, and the other, and then we figured out, I never thought about this before, so we started ranking for ethics exam, so the ethics exam is this exam that they have to take after they've passed all four sections, so it's like literally your final step before you get licensed, so we had ethics exam pages on CPA exam.com and then I noticed, I think it's like an off-sh of the other SEO that maybe those started ranking better, and then we've gotten an uptick in leads there, and then I was like, wait a minute, we could rank for all 50 states for those, and essentially you're gonna get a bunch of people that pass the exam with who knows who, I don't care. I don't care what you bought at this point, but I do know that you're gonna need CPE in the near future once you get your license, so that we have an ethics exam guide for all the states. So like, if we start SEOing that, then start pitching those people into CPE, that could probably work out. So Gert and those guys, we gave them, we bought like 25 SEO pages of them. We're like, hey, can we take four of those and do these four ethics exam pages, we just picked the top. Like, I know, I think we've picked Delaware for some reason. Oh, because it was the most representative what the content should look like. So we actually took one page, sent it to them. They're going to optimize that one. And then we're going to say, great, not going to these four based on the template you just came up with. So then they'll do California, Florida, Texas, New York.\n00:41:22 - Tina Marie (profitdriversinc.com)\nThat's I mean, that just seems kind of like this similar type of stuff that we've been doing with Mark, which is leveraging more, don't know, sources, not necessary sources, but entry points. Yep, it is too. Yeah, the market increase and that those analytics like that systematic, detailed, accurate level, analytic stuff that you're working on and building is who else is doing that? else is doing that. Like I feel like you're going to exceed your goals quickly. I don't know what quickly is. can't quantify that, but I think that the pace will be like when you get there be like, damn, I don't like, look what happened.\n00:42:09 - Dan’s iPhone (danddcompany.com)\nYeah, and it's all like, you know, whether you sell it or not, you, you know, just make more money.\n00:42:19 - Tina Marie (profitdriversinc.com)\nYeah. You were talking about getting back to your breathing stuff.\n00:42:30 - Dan’s iPhone (danddcompany.com)\nDid you do that? Yeah, I did. I did something else, but I did it on Mondays. What'd you do? Yeah. got it. It was this other sort of guided thing because I was at home. So I like, I can't really. was at home and I had the dogs when I can't really check out for an hour. So I was like, I could probably check out here in the hammock for 20 minutes. Mm-hmm, and it worked whatever was I forgot about it was one I'd never done But I was like, oh it was it was one that was like It's like a meditation to get in touch with your spiritual guide. I was like, I'll try that I found an audible weirdly enough Interesting I want to my thought about me either I've got like a gazillion audible credits lined up.\n00:43:32 - Tina Marie (profitdriversinc.com)\nSo then I proceeded to buy like five books Okay Snaps, Snaps I I'm scrolling back to obvious eight and it says that your peak in the past was 4,000 60 active subscribers and did you just tell me today?\n00:44:00 - Dan’s iPhone (danddcompany.com)\nat your 4300? Oh, no, the 4,060 is the proverbial glass ceiling.\n00:44:07 - Tina Marie (profitdriversinc.com)\nOh, that year passed?\n00:44:10 - Dan’s iPhone (danddcompany.com)\nWell, yeah, but I realized you can pass it, right, during your peak season. So my guess is, let's say, so yeah, we're passing. So let's say we, I think we hit that early July mid mid-July. I think we hit a mid-July. So from that day forward, my guess is if I take that number and the number on January 1st, the average will be 4060. It can't really be more than that because the math dictates. But can you exceed it right now? but then I also know in December, we will get three or four hundred cancellations. So let's say we get up to 44. for 100, which we may or may not, but whatever it is, we know there's going to be a mass exodus in December. And then if you were to average it out, your average is probably going to be somewhere in the neighborhood of 4060. And Bobbi's like, we're past it. And I was like, yeah, that's true. But there's some missing something. And then I thought, oh, wait, yeah, of course you can exceed it.\n00:45:22 - Tina Marie (profitdriversinc.com)\nBut averages are basically not that. Well, that's going to be fun to see and interesting. It'll be funny, even if it's true, because the numbers, well, yeah.\n00:45:36 - Dan’s iPhone (danddcompany.com)\nSo the only thing that will change it is if the 33 remain, right? That's based on it being 31 average as well, right? So if the average is stays at 33, which we won't know until November, then you can exceed the 4060. Then it would be whatever I'd have to rerun the math and be like, okay, now it's 40 109 or whatever that\n00:46:00 - Tina Marie (profitdriversinc.com)\nWhat is 33 being new, um, customers, right a day, uh, subscriptions, new subscription, not new customers, customer, the customers is a 21 or whatever we've always been using 21 and 31.\n00:46:28 - Dan’s iPhone (danddcompany.com)\nThose, those are the ones that got us.\n00:46:32 - Tina Marie (profitdriversinc.com)\nSo I really want to, like, make this stand out so I can find this, that's easy because what I really would like to have for each of these projects, because my notes are weekly, right, and I go review and sometimes I copy and paste notes from the week before into next week's coming out or like save this for next week and just copy it so that I know I want to talk about But what would be really good is if while I'm talking, I've got the stats of whatever it is that we're working on because I have to keep a lot of that in my head or be able to scan through the notes quickly find it. Teamwork as a system for kind of tracking progress by itself isn't that great. probably just need to have like my own kind of stats spreadsheet. So I have this, so I'm not like asking that constantly and it's always staying in my head. It stays in your head because you're doing it all the time. But I ask better questions if it's in my head all the time also. And when I'm thinking about it throughout the week, I'm always thinking about these things throughout the week, then it's more effective too. So anyway, not to self, actually, I'm going to send that email to myself. And apparently the problem with email is not on the Y. That's weird. Oh, just because you have so many things going on, you're the only person that has so many things going on, but I have so many things going on and you have so many things going on. So that's a lot of my brain, which is low to my brain, and the nodes do help a lot, but I think that they could be better if I had those particular things, which are especially because the goal of being creating the market share increase, the value that we want to get to, like those are all the bullets that I want to have is like where we're at, when's the last time we measured and what are the things that are doing and just kind of, and I don't think you look at it quite the same way I'm talking about doing it. I think that it'd probably be helpful to you too, just to go like, oh yeah, it's actually this. And then what I know about your brain is when you see something more often than you would have put it in your face because you do have all the things going on. Your brain just goes light up and thinks of something else and then you go do something else. Incredible. And then come back like, what happens when I do this? So anyway, I will set that up. What is this? Oh, that was the new product for another 71 that you were talking about. You've launched that, right?\n00:49:39 - Dan’s iPhone (danddcompany.com)\nNo. met Melody was getting some pushback from Melody and she wanted to build it a certain way. I'm like, no, no, no. And then she's like, we need to talk about this. I attended the call and she explained it. And then when she was done talking, she was all like, this is it. I just said, wrong. It's like, that's to be rude. Wrong. He's like, no, no, no, no, no. Like, we don't like this. And then I explained it to her and her and the other guy were like, yeah, we could do it that way. And then we all get what we want. Your way, I lose a lot. You gain a lot. And I lose a lot. This way we both don't lose. You gain what you want to gain. I gain what I want to gain. And it's all better off. So then they're like, then now they're going about building that, which is essentially it involved like re-architecting the tags. It's like a slight re-architecture. But but because it's across like six products and yadda yadda. and we had to remove a bunch of tags, they're like, all right, we're gonna go build it out and then, I'm right, I mean, I know I'm right, because I thought about it, I'm like, I'm right, this will work, and it will resolve a bunch of issues, so they're in the process of doing that re-architecture and creating the missing tags, and then writing down, okay, we're gonna get rid of these tags, and this is how we're gonna get rid of them, and then they hooked up, they hooked up a plugin yesterday that helps them, they're very concerned about like, people losing access when they have two subscriptions, which really isn't that big a deal, but even that will be resolved, and then part of the plan would also be to eliminate the infused Woo plugin, which their convinced is somehow causing some of these issues, which may or may not be true, and I was Like, that's fine, because I took portions of that away from that. I took portions of the functionality away and put it in Zapier, and it's worked fine, but we could use make, like, either or, um, so the plan is for them to get it all mapped out, built, essentially, and then, then we're going to figure out when we can launch it. And we're basically at, like, the price is going to be, like, 77 and 87, think. Jeff didn't want to do the 77. I'm like, we have to, because if nothing happens, we've done this for nothing.\n00:52:43 - Tina Marie (profitdriversinc.com)\nRemind me with the 77 and 87 are.\n00:52:47 - Dan’s iPhone (danddcompany.com)\ndo have that, but I didn't do it good that 77 a supplement 87 is full course, right? Okay. And we just had someone, this was online. like last week someone went on a Reddit and they started this thread and it was like do not buy me just cpa review it to rip off and it the guy was complaining that he was complaining about he was complaining that that didn't refund them or something it was like super super ready and then like a mild pile on started with this other guy that came in and then all these other people started commenting and it was just it's just so sad that it's so clear they think it's a supplement they think it's a supplement and then they also questioned the sixty seven dollars i'm like oh my god and then our people showed up the ninjas showed up and they're like what are you talking about like do the math If you buy a Becker for 3,000 if you buy a ninja and you take each second up to the three months at a time time 67 you're only spent you're spending less than a thousand dollars, and then they're like just the best I've never had a problem with him. He's the only person he's been in this industry forever He's the only person that comes right just the deluge of defenders and then I guess the mods came in They weren't around and they're like yeah, we're deleting this whole thing This is this person just joined reddit and their first thing is to to track and slag on one of the best cpa review courses There is delete they deleted the whole thing.\n00:54:35 - Tina Marie (profitdriversinc.com)\nDid you get the screens?\n00:54:37 - Dan’s iPhone (danddcompany.com)\nThat's first no like I Was like it I was like on my phone To get well we have tons of those there's tons of those on on reddit So I do want to start using them on the new sales page because I think they're more powerful than yes You know testimonial block We have great ones. We have whole threads that just wave about us.\n00:55:07 - Tina Marie (profitdriversinc.com)\nYes, but you for sure should be using them in your marketing.\n00:55:10 - Dan’s iPhone (danddcompany.com)\nNo, I don't. We have one that's literally called is Ninjacy. And this is like someone asking a question for real. Is Ninjacy Pay Review a scam? Like I couldn't have paid to have someone do that. We use it in our emails. In case you're wondering if Ninjacy Pay reviews a scam, go here. And it's all these people raving about it. We have this one dude on Reddit that's like are one of our biggest defenders. He's like, I passed all four sections using Ninja whenever, but his screen name is Nutella Nick. Oh, I know. I'm like, oh, buddy, it's hard to recognize you in marketing. Only because it's a trademark term, not no other reason.\n00:55:56 - Tina Marie (profitdriversinc.com)\nRight.\n00:55:58 - Dan’s iPhone (danddcompany.com)\nYeah, yeah. But he showed up. He showed up and like went off like, this is .\n00:56:06 - Tina Marie (profitdriversinc.com)\nI mean, but couldn't you use it and then just like black out parts of the username like and you.\n00:56:16 - Dan’s iPhone (danddcompany.com)\nOh, no, we don't even need to use this. No, there's tons of them. But I want to use those instead of the, I mean, we created these testimonial blocks. But I'm like, and we have like the Reddit logo. I'm man, we should be using just straight screen caps of those. And then, and then them in those locations, rather than us cutting pasting the actual thing and linking to it. Like we'll cut and paste and then link to the actual thing. But no one's probably clicking through. mean, that's something I can look at. But I doubt people are clicking through. Whereas they, if they see it's from Reddit, just from the, like literally like a better and then videos. It's like, okay, those are probably your two. best but i can split test this video testimonials yeah we use those those totally work i was just about to ask you about them because i think that like we have tons do you have a social media account or you just share that stuff regularly uh we i run them as ads on facebook this one this girl made is so good oh like oh my god you couldn't it's like it's like she made it on purpose but he didn't right and she sent it to us and we turned into an ad where do you stockpile your testimonials the video ones are in this service called boast and then the text ones we don't even gather anymore we just have so many it's ridiculous yeah but you should keep them current uh i mean they're not I don't think the date. I don't think we put dates on the testimonials. Um, any of them, really.\n00:58:08 - Tina Marie (profitdriversinc.com)\nI don't think I don't even think we gather.\n00:58:12 - Dan’s iPhone (danddcompany.com)\nI mean, we gather them on the cancel. So they do, they do updates. I just haven't used a new one recently. Sometimes I'll you, I'll check out the video ones and maybe I'll swap in the video one here and there. Uh, but I try to let, you know, I'm trying to get someone that's like, they use Becker. They, they're a ninja only, right? I can only use like so many. Like I was with Becker and then this, right? So it's like, okay. and then I ran some of his ads and like you see which ones did good as ads, then I put them on the landing page and then I ran a test on the landing page at which one do people watch the most and I made that one first. Did you like that?\n00:58:54 - Tina Marie (profitdriversinc.com)\nI wish that we got to do another 71 completely separately because I I would so love to drive growth there, that would pay, would love to drop growth there too, hopefully I'll be able to do that as soon as the stupid tracking is worked out because I don't know how to drive growth there. I have so many ideas and there's stuff that you touch but not systematically. But once you get that set up, we'd be able to track everything. But it needs to be set up because I literally just been throwing stuff at the wall for years.\n00:59:45 - Dan’s iPhone (danddcompany.com)\nI'm still convinced I could turn off all the ads and nothing would happen. Or it would happen but it would take six months. I'm like, I don't want to find out that way.\n00:59:55 - Tina Marie (profitdriversinc.com)\nNo. Gosh, it's crazy just thinking about, first of all, it was seven years ago, and then you're like, I don't do email. I'm like, it doesn't work. I know, I know, look at that. And then maybe you might still be right. But regardless, the thing is, we've watched, we've learned it together with Mark is that there is a, you know, having multiple, so for him, it's vendors. For you, I think it would be channels, ad channels. Oh, yeah, like a formal approach and multiple tactics to what you're applying on those channels that don't in and of themselves make huge differences. But the compounding effect are like, first of all, anytime things dip, you don't really dip, you don't even feel it because everything else just kind of buoyed it up. But yeah, but the analytics portion of it is to be able to have very clear, reliable data is huge. And just\n01:01:00 - Dan’s iPhone (danddcompany.com)\nall the things that you've learned over the years anyway adding adding into that anyway that's awesome holy crap how's it 105 i could just whatever toy flies okay wait so meditations we're good you're taking care of you sound good found the good you've only just got her moving date so we gotta go visit the campus and then she moves in on his two day 2021 20 is a Friday i'm like probably moving in on the 21st that's a temper yeah she got her dorm assignment she's gonna have two roommates and a expert large triple and everything i mean it's the oh she told me the name of the building it's like an author's last name no i think it's a hog So I think can tag another, I don't think that is another, so the HAG haul, I guess, and I don't know what the hell is up with college right now, but you want to talk about a light schedule. I was like, you're kidding. That's it.\n01:02:18 - Tina Marie (profitdriversinc.com)\nWow.\n01:02:19 - Dan’s iPhone (danddcompany.com)\nwas like four classes, period. What? That's it. That's it. And they're on the quarter system. So it's 10 weeks. And we have four classes, 10 weeks, and then 10 weeks. I don't know if some of them carry over, they're two quarter classes or whatever, but she's like maxed out on credits, which is like, I literally can't take anymore. She's like one credit guy, I'm like the total max, and that's four classes or something. And then her earliest classes at eight and her latest classes at eight p.m.\n01:02:53 - Tina Marie (profitdriversinc.com)\nWow.\n01:02:54 - Dan’s iPhone (danddcompany.com)\nBut also also.\n01:02:59 - Tina Marie (profitdriversinc.com)\nthat's a wide.\n01:03:00 - Dan’s iPhone (danddcompany.com)\nbreath yeah so what's she taking on that like what's her major bio no biology microbiology okay how far away is she doing the school yeah it's eight hours drive uh it's an hour of life hour now how is Denise doing i'm waking up in the middle of the night thinking able and leaving really yes yeah you don't need the care i'm like for though i just look at it as part of life i mean it's what happens unfortunately things move forward where we march on it's going to be interesting how mario handles not having a sister around even if they don't get along you what she's already acting weird yeah it's it's hard i don't know if it's related, but it's like, I think it might be.\n01:04:03 - Tina Marie (profitdriversinc.com)\nYeah, they're they're talking, they've been talking more than ever the last like two months.\n01:04:09 - Dan’s iPhone (danddcompany.com)\nYeah, like amongst themselves or whatever. And she's definitely over the I hate Evelyn face. I wasn't that long, but it would be had for a while. Yeah. then, yeah, so it'll be interesting see how her and Denise react.\n01:04:26 - Tina Marie (profitdriversinc.com)\nYeah, and you revolve car, you need the ocean, and you need to figure out how to keep those two happy, because this is going to be very hard for them.\n01:04:36 - Dan’s iPhone (danddcompany.com)\nRight, I, whereas I was like, you know, she apparently, so Jenny DeRoz went to the school to UC Santa Cruz. And I don't know what I said to her, but she's like, Oh, yeah, no, like, you're only guaranteed housing your first semester. And then the second semester, it's like hit or miss, or your first year, you have to live on campus for year, you can't have a car. And then your second year, you can apply to live on campus. But it like hit her mess. She's like, it's like, she said when she was gone, there was like a borderline crisis to get housing. And then everyone's like, no, it's still like that. Like everyone's saying like getting housing the second year. So then you have to get off campus. And Jenny's like, when we went to go off campus, she's like, I literally, you need a dossier on yourself to get the gut housing. And then we go apply for it. 50 people are applying. And then it's like hit her mess. And of course, my takeaway is like, oh, I should buy two bedroom condo and Santa Cruz, little mirroring.\n01:05:40 - Tina Marie (profitdriversinc.com)\nI love that play.\n01:05:43 - Dan’s iPhone (danddcompany.com)\nI was like, that's the entrepreneurial take is property. Right. I'm gonna, if I'm gonna pay rent or, or boarding to the school, why wouldn't I just pay to myself? Right.\n01:05:56 - Tina Marie (profitdriversinc.com)\nI'm paying it either way.\n01:05:57 - Dan’s iPhone (danddcompany.com)\nYeah. like, I should go to, so a two bedroom condo. 800 grand, so I'm like, hmm, let's see how this election pans. I got about a year. like, can hit the fan between it's gonna hit the fan soon. What? they just revive, you see that the labor, the jobs, number revision that they just did, they're like, oops, turns out we were over by 800,000. You're kidding. Really? So that, until that, so that was like two, three days ago, leading up to that, and still even yesterday, people were talking about, oh, bed's gonna lower the rates. Well, part of the way they do that is they're using employment or rather unemployment as like a leading indicator. So it's like, they're like, unemployment's good, so you can lower the rates, is sort of already. And it's like, hmm, but if that number It was run by 800,000. Isn't this other number wrong? Like, isn't this leading indicator fake balls incorrect? Well, it's like, yes, but if they so they lower the rates, I mean, it sort of where this if you I was someone would show these charts, like the parallel between what's happening right now and like the two right before the 2008 crash is like very similar. A lot of the indicators look the same. So it's like, why wouldn't it go that way? And then lowering the rate. People are like, you know, a lot of financial people are like, you can't lower these rates. Like, you can't do that. You could trigger a much worse outcome. Ron doesn't say the whole time. There's no way this ranks. She's like, there's no way. There's no way that they keep saying soft landing. She's like, I don't see it. I don't see how it's possible. You have to pull a rabbit out of a hat. She's like, I don't believe it. I don't believe this is real and I would come in due time, like it's either it's going to happen, and then that would be like this quarter, right? They do. They only meet once a quarter. That meeting's probably in the next couple weeks. So they're either going to do it or they're not. And then the markets will react based on that. And we'll see. And then God only knows what happens with this election.\n01:08:24 - Tina Marie (profitdriversinc.com)\nI don't want this. I don't want either one of them. But here's the thing about Trump is like, we know who he represents him. He represents who he is, what he is. We know his pattern. We know his MO because he's a steady douchebag. But like what his strengths are, we have some definitely definite economical power, There's there's some good.\n01:08:51 - Dan’s iPhone (danddcompany.com)\nHe's disgusting.\n01:08:53 - Tina Marie (profitdriversinc.com)\nThere's right. Kamala is a puppet. Like she we don't I don't even know who she represents. I don't know what she represents. Somebody's behind her, now no idea who it is. I don't know what their MO is. I don't know anything about that. so she is a wild card that puts us at huge risk. And we have no idea. But why I think she'll win, which I don't want, but why I think she'll win, is because I think she will bring out the female and black voters just because she's woman and black, and that between the two of them, that's a population that has been largely just like, if everybody, I don't really care. I think a lot of females that never voted well now. And same with black people. And I think, and especially looking at the stats right now, how amazing she's doing, which is, again, terrifying. She's stupid. She doesn't know what she's doing. She doesn't stand for anything. And I don't know who's behind her. That's the most, yeah. So like in terms of like business and needing to create as much. Like I want to get to being able to rent my house out, buy another one, like have some property investments as soon as possible. There's no solid guaranteed investment, but the one thing about like in my church, we do food stores. I'm like, I'm gonna have property stores. If I meet family to live, you know, it can either make me money or it can house my people, but one way or the other, like that's where I want to start with it. Like yeah, kids. So okay, let me get back to your Denise Rowland for a second and the girls eight hours away, holy crap, you should buy the property. She is gonna hit the fan. I'm so glad that you're doing the work of the analytics right now because that foundation, like as she hits the fan, there are, and this is why I teach what I teach, it's fundamentals, right? There are certain types of things, clean, accurate data so that you Because a lot of people are going to be trying to guess and figure out what to do, and you're going to have the ability to know what to do, plus all the things that you've already built, the systems, the teams, the reputation, having had a very smart offer for a while now, especially with it being the subscription model that you already paid the price for, all the dip and finances. There's so many things that you've been doing, and we knew that the recession was coming. It took longer than most people, most of the analysts, most of the VCs thought it was going to take because they pumped money in, but we knew it was going to happen. And it gave you enough time to do such a good work, but I don't like, I mean, you might feel a dip, but it's not going to hurt you at all.\n01:11:52 - Dan’s iPhone (danddcompany.com)\nRight. Why don't you think that will be a dip because in 2008, I went and looked at this at one point. randomly because of David in 2008 when that uncertainty enters right it's not going to help it helps his business because people are like I need to get a new job right I need to they also retreat to education so they go my domain and yours so they retreat to education and there was like a we got a bump a noticeable bump back then and we didn't have our own product so it was like oh that's interesting and you could see I look up here I think I looked at search day I looked at a bunch of stuff I was like oh that's interesting plus we the if a pandemic didn't take us out pretty sure research is not like it was like they shut\n01:13:00 - Tina Marie (profitdriversinc.com)\ndown the entire business and it was like and we made it yeah that's it's crazy but it's awesome also if i can just get through whatever the it's just the having taken care of everybody so long getting myself so far in debt trying to do that when i get this going and all the data that i have with it like i don't worry about anything also because of the investing that i'll do but like there's so many there's so much volatility for so many people which is why i'm helping three other families but it's it's scary for other people and then i'm going to see so many people i care about just struggling because they're already struggling because things are so expensive but it's also amazing to me what being strategic and consistent can do for people yeah yeah anyway all right well good job I'm so glad you're doing the GA4 stuff. I cannot state that enough. It is so important.\n01:14:07 - Dan’s iPhone (danddcompany.com)\nAnyway, good job.\n01:14:08 - Tina Marie (profitdriversinc.com)\nReally make some good plans for Mario and Denise and Evelyn too, although she's probably going to be having fun, but then she's also going to get very homesick and that you're going to be in the middle of all of that. Good luck.\n01:14:24 - Dan’s iPhone (danddcompany.com)\nI do think it's great. Here's the silver lining. If you time it rightly, that's a word.\n01:14:32 - Tina Marie (profitdriversinc.com)\nRight.\n01:14:33 - Dan’s iPhone (danddcompany.com)\nIt actually is a word. That's the right way. You can like a flight to San Jose is like 60 bucks. So I was looking at that in my company. That's what we doable. So you could go visit her at the drop of a hat and it's not going to, right? Like 45 minute drive. Easy peasy. Like you could do that in the day anytime. Anytime you wanted, um, which was not the case for my parents playing from Boston to DC there in the sixty nine dollars life Made major of airports. You could just show Denise all the things that are on the table because she still doesn't really get like what you're Doing this. Yeah, we're gonna go. We're gonna go visit now because now we can go visit I was hoping it would play out like this. I go. Okay, great. I can buy a flight for like next Wednesday We fly up in there in the morning running a car driving the campus ago. This is your dorm This is where your first class is.\n01:15:34 - Tina Marie (profitdriversinc.com)\nThis is this.\n01:15:35 - Dan’s iPhone (danddcompany.com)\nThis is that We're looking at like theirs target. Okay, great because we're gonna be here in two weeks doing this. Yeah, we're three weeks doing this again.\n01:15:44 - Tina Marie (profitdriversinc.com)\nUm, good. They're gonna do good, but keep using that brain of yours for Building your family because this transition period sucks. It's hard But it's better when you're when you when you do the planning and when you do all this stuff. they're just going to need you. That's all I'm telling you. They're going to need your even killed and an entrepreneur. We solve these things.\n01:16:09 - Dan’s iPhone (danddcompany.com)\nOh, that bothers you. Let's fix that. Goodness. No parking. We're at the office. He's like, something's here.\n01:16:23 - Tina Marie (profitdriversinc.com)\nYou took her to the office.\n01:16:26 - Dan’s iPhone (danddcompany.com)\nSomeone was supposed to be here. I mean, Eric and Stacy, and then I was like, can't be at home. Someone else was supposed to come out of office, who I think just, if it's them, I'm going to be surprised that you knew it was somebody else. Because Eric and Stacy, walking around the whole time, you haven't made a sound. I guess this is the other person's here.\n01:16:47 - Tina Marie (profitdriversinc.com)\nWho do you have, Zinni or Bell? Bells. All right, so I will let you go figure out who that is and I will talk to you Monday.\n","contentPreview":"00:00:00 - Tina Marie (profitdriversinc.com)\nI cannot tell you how many times I am just picking up my phone to text you and then you log it.\n00:00:07 - Dan’s iPhone (danddcompany.com)\nYeah, it's like ...","processedAt":"2025-05-04T03:40:52.610Z"}