{"fileName":"Done Transcript for Maria & Tina🪄(6).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Maria & Tina🪄(6).txt","type":"transcript","priority":"medium","content":"00:00:21 - Maria Gudelis (Maria Gudelis)\nOkay, I'm just going to move on Yeah, I can hear you now. I'm just going to move down to my family room to sit on a more comfortable chair. I was in my other room office, but I got a nice chair here to sit on. Oh, yeah, yeah. I decided not to do anything with my hair or change it to a fancy shirt for any videos, even though I just did a little free coaching call to my school community. And I just think. Yeah. Totally relaxing. get my nails done at 4.15, so I can't wait for that.\n00:01:04 - Tina Marie (profitdriversinc.com)\nYeah, I'm going to do my this now, but up again. is literally what I slept in, and this is my sleepy hair with a little bit of blushing. Yeah, let me get one, my little laptop thing that you put in your lap.\n00:01:21 - Maria Gudelis (Maria Gudelis)\nOkay, you buy those at Staples or whatever, of course.\n00:01:25 - Tina Marie (profitdriversinc.com)\nYeah, I've got a couple of them.\n00:01:34 - Maria Gudelis (Maria Gudelis)\nOkay, good to do. Get there.\n00:01:39 - Tina Marie (profitdriversinc.com)\nOkay, good Lord.\n00:01:43 - Maria Gudelis (Maria Gudelis)\nSo you've had really bizarre sleep patterns, huh?\n00:01:46 - Tina Marie (profitdriversinc.com)\nYeah, this week has been nuts. I don't know like what's up with my body.\n00:01:51 - Maria Gudelis (Maria Gudelis)\nIt's actually like it's a good thing. Like I have more energy because I'm not wiped out all day long.\n00:01:55 - Tina Marie (profitdriversinc.com)\nYeah, but yeah, it's a little weird.\n00:02:04 - Maria Gudelis (Maria Gudelis)\nI like your voice message.\n00:02:07 - Tina Marie (profitdriversinc.com)\nwas fun. You must have just woke up. You sound very sleepy. Oh yeah.\n00:02:10 - Maria Gudelis (Maria Gudelis)\nI was still in bed. Cool.\n00:02:16 - Tina Marie (profitdriversinc.com)\nThat is how that was. mean, hi, browser.\n00:02:20 - Maria Gudelis (Maria Gudelis)\nHey, how's that YouTube video going or YouTube out going for you?\n00:02:24 - Tina Marie (profitdriversinc.com)\nGetting nothing. But Dan said, well, like you said it's not clickable. And I just left it there. It's gotten views, but not a good ad.\n00:02:38 - Maria Gudelis (Maria Gudelis)\nSo I think it has to be over a minute because I see it end up becoming a short, like when you send it to me. Yeah. I think that's why it's not clickable.\n00:02:46 - Tina Marie (profitdriversinc.com)\nYeah. I don't care.\n00:02:52 - Maria Gudelis (Maria Gudelis)\nI thought you did it.\n00:02:53 - Tina Marie (profitdriversinc.com)\nNo, no, Yeah. That was the whole point. And it was not like not telling you like, I don't care. It's that. I actually care leaving it up causes me more discomfort and it's a good thing because it's need to do that. So I am in the practice of doing things that stretch me. Yeah. So that is the primary purpose of that. is this going? don't even know what this program is. trying to close. I don't even know what the app is. So I can't like, oh, that's CapCut.\n00:03:35 - Maria Gudelis (Maria Gudelis)\nWell, for a quick CapCut.\n00:03:39 - Tina Marie (profitdriversinc.com)\nGoodbye. Thoughts you are going to block me. I don't think so. Okay. Now the app store is blocking me. None of my are dragging me nuts though.\n00:03:54 - Maria Gudelis (Maria Gudelis)\nMmm. Yeah. had to take some Claritin the last two days in a row actually.\n00:04:00 - Tina Marie (profitdriversinc.com)\nI would not be able to breathe without it. I have really bad asthma and L.R.G.'s. Okay. So one thing is, can we move this call half an hour later?\n00:04:14 - Maria Gudelis (Maria Gudelis)\nYeah. It could be later than half an hour, too, if you want.\n00:04:18 - Tina Marie (profitdriversinc.com)\nYeah. when I said it, I'm like, I'm going to be up, but I'm not even getting back from taking my daughter to school until almost 8, Not exercise eaten, and let me go look at my calendar real quick and see. Okay, so on Wednesdays, I've got missionary training. That's why I wanted it early on Wednesdays. Yeah, if we could do it at like 10, 30 or 11, which is two hours later or two and to all. all. at at not Let's see, let's this for next week. I'll put that there with this and all following events. Didn't move, it's not move, hold on. And then Tuesday. That will be amazing. That will be way better. Because I really want to be able to show up. But you were three hours ahead of me and you seem to be an early bird.\n00:05:45 - Maria Gudelis (Maria Gudelis)\nI was like, ah, but I am an early bird. So in your nighttime, I'm like, I shouldn't turn my phone off at six or try not to that on weekends. I'm usually not on or if I am on it's more, I don't know. Yeah, yeah, just creative spurt.\n00:06:00 - Tina Marie (profitdriversinc.com)\nYeah, I've always been like that and my girls are like that so I can train myself to do whatever Yeah, to an extent. I definitely I'm physically affected by the moon the Sun the bar a barometric pressure Significantly I ache even if I don't know that the weather has changed. I feel it in my house in my bed. It's um, but I Teenagers and they don't want to talk into like midnight They're gonna be gone soon. So I want to be available and I'm like Yeah, so that's happened a few times to this week at them early and Yeah, this is this is the season that I'm in and I Oh, I'm not gonna get emotional, but because it's almost over.\n00:06:53 - Maria Gudelis (Maria Gudelis)\nI'm just here for all of Okay, so you\n00:07:00 - Tina Marie (profitdriversinc.com)\nI got to find a Google Doc. I want to talk about all the things. There's so many things that are being things that you're working on, things that I'm working on. My most exciting thing that I want to talk to you about is what we can do together, but I do think that it's an exploratory process. So, and I want to put a priority, top, top priority on how do we get Maria incoming money right away?\n00:07:34 - Maria Gudelis (Maria Gudelis)\nBecause Maria always does that for everybody else, I want to put that script in. Well, and also in a smart way that like, I, you know, I could, you know, put up a thing in analytics thing to do some stuff. It's just I don't want to be then tied up for the next month, doing done for you work at the cost of my stuff. So, so there's a happy medium. But I do know that I got pretty energized when I saw that YouTube video this morning about those guys that made it two million to nine months. I'm like, what? But yeah, I mean, there's, there's, and I have some, like, like one gal just paid me 500 this morning just to do a VSL script for her, which I know should be more, but I figure if it only takes me two solid hours to do it, I could just leverage that and sell maybe a few more in Ellen's group, because I just mentioned to her all, I was thinking of doing this, and she said, okay, I'll pay you. The licensing of the funnel that I've built, I'm in talks with this one guy that might want to buy it. So, but I've never done it before licensed on actual funnels, so I don't know what the details, so we'll see if that goes anywhere. But that basically, I would transfer the funnel, my ad copy, the actual ebook I created into his thing. But, There's some nuances to it though because it wasn't a profitable funnel. It's a break even funnel Which is still amazing for look take a funnel that was meant to sell People to kreena's and mine like you know now it's for just one cape product program and book a call to her 4800 things So that's the only thing and part of me was like if I have money just sitting in the bank account I could just run out to it in a new account and find a really good ecom Academy ecom course to Be an affiliate for and use the funnel cuz it was 20% conversion rate like for this $3 thing So I'm like man But that's the issue just missing a back end So I don't know if this guy would want it without a back end and I'm not going to that's kreena's intellectual property like how to Build a drop ship store and I don't want to go create a course without I don't want to sell it to him Without him knowing all of the details like I never want that because he could be someone to be the future that would buy other funnels that I'm make or something he knows.\n00:10:00 - Tina Marie (profitdriversinc.com)\nRight? So I mean, as long as you're up front about what he gets and what he doesn't get, then let him design.\n00:10:09 - Maria Gudelis (Maria Gudelis)\nOh, yeah, that's what I've done. I've sent him everything. All the Facebook ads cost the screenshots of all the funnel stats, everything. So from the get go, this is really built for someone who already has a mid ticket or high ticket 1000 or more ecom kind of course and then it's perfect for them. But it's interesting. was I'm learning this because then he's like, let's say a ClickFunnels platform. said, well, no, I wouldn't get my ClickFunnels account. Like, so all these things, I guess some people who are into buying and selling funnels, it's a really interesting, you know, I guess they're used to you just giving them everything. So I think, like, if I were to do it again, I would put it into System IO and be like a separate account, right? Because like, that's it. And then here, here's just this my account and the email I set up for this funnel like that.\n00:10:57 - Tina Marie (profitdriversinc.com)\nSo, yeah, you could duplicate eight. So, and this is what I was talking to Seth about doing, too, is because he's got that breakthrough challenge. And in Ontoport, you can just shove it into somebody else's Ontoport account. You can do that in high level. It's called Snapshot. And if you did that in System.io, but what if you duplicated that in these other things, and you said, oh, if you got System.io, it's already built for you. Here you go. Here's the cost of, so it's not even really a licensing fee. It's a, you know, how we had those, like, templates for VSLs and things like that. You could get infusion socks, campaigns, where they had it. It was, it was basically a part of infusion soft. wasn't a show they do it now. It's not even called that anymore. Now it's like a keep or something, right? Anyway, but you could either do it yourself. It probably wouldn't take too long as long as you were familiar. with it. But if it's basically so you've got landing pages, sales page, checkout pages, unless they're all in one, order bumps, fulfillment. Well, thank you pages, right? And then whatever the sequences are, all of the platforms are relatively similar. As long as you can navigate to it, you just create it and create the automations. It will probably only take you a few hours. And now you've got it in multiple platforms, and you can tell it to people on the platform that they're on. As long as the platform allows you to share it, like high level does, on-trip port does, and you'd have to have an on-trip port account, which is way too expensive for that, but high level.\n00:12:47 - Maria Gudelis (Maria Gudelis)\nYeah. And system IO would be just copying the funnel or if I just create a separate account. Yeah. I'm still here. level for that too, to an extent. so yeah, so, so it is, we'll just see where that goes. And because yeah, I just had that brainstorm yesterday morning, I'm like, wait a minute. There's one on that basically, I created some tip to tail and it's like, what the ? Like, I should be compensated for this, you know? So, but it did make me think of all my other stuff, too. Like, I have micro for magic. I've got high ticket toolkit.\n00:13:28 - Tina Marie (profitdriversinc.com)\nDo you have, like, a document, a library of what what offers you have and what you sold them for?\n00:13:36 - Maria Gudelis (Maria Gudelis)\nUm, up to date current one, but yes.\n00:13:42 - Tina Marie (profitdriversinc.com)\nYeah.\n00:13:43 - Maria Gudelis (Maria Gudelis)\nUm, I would probably just need an hour to make it up to date with stuff.\n00:13:49 - Tina Marie (profitdriversinc.com)\nYeah. Well, what if, what if you did that and we brainstorm together and figure out maybe there's a different type of stock that you could offer or you offer this and then upsell down to all the type of thing. just to generate some cash for you without bogging you down timeways and done for you type stuff.\n00:14:08 - Maria Gudelis (Maria Gudelis)\nYeah, yeah, yeah. Because if I crack the core on how to sell, like you mean like sell the funnel to other people, like to like.\n00:14:16 - Tina Marie (profitdriversinc.com)\nYeah, well, so like, yeah, the micro offer magic, like itself, if it's a course, like what I wanna see, what is your library of things that you have that you've sold that you could sell again, maybe with a couple of tweaks, maybe you need to update a checkout page, maybe you need to connect to people. I don't know, like what is everything that you have that is still relative, where you could put together an offer and say, you know, here's all the things, pick one, choose one, or pay this price and get everything, that type of thing.\n00:14:50 - Maria Gudelis (Maria Gudelis)\nOh, like to the consumer to buy. Yeah, than like sell the actual pay, this is a converting funnel, I want this. Yeah, yeah, I can do that.\n00:15:00 - Tina Marie (profitdriversinc.com)\nBecause, so you said you need $3,000 a month, is your, like, light's on cost?\n00:15:08 - Maria Gudelis (Maria Gudelis)\nUh, yeah, $3,000 a month, doesn't it? was really $5,000 a month?\n00:15:13 - Tina Marie (profitdriversinc.com)\nYeah. Okay. if we could figure out, um, just, so I like to do hybrid things so that we reduce the burden, um, it's the done with you done for you stuff that has higher ticket and you can sell easier, but it comes with a bigger burden. So you want to kind of offset that with another type of offer, if you can, which doesn't increase the burden so much, but also gives you a little bit more income and then potentially has, you can sell other things affiliate offers, your own offers, whatever. But, um, so in order for us to sell, like, a 6k package, we don't have to do anything other than. Write an offer get some eyeballs on it. I'm thinking and You I mean if we sell two of those you're good We're right and and if if we can sell to you we can sell two more we can sell two more like Not all the ones right, but build up the queue for it. feel like that is the simplest way to Put some money into your need account and then siphon off the tiny for whatever We might be building and meanwhile give us a little time.\n00:16:32 - Maria Gudelis (Maria Gudelis)\nGive you some breathing space So that we can build something that's scalable and build some con together So wait, so let's just repeat that last part like if I brain just zoned out for a second but to me like If you and I create a 6k offer Sales page for or even a Google Doc with what's including right here's we get here's the problem is here's what you get That might be a faster path to cash in the next two weeks.\n00:17:04 - Tina Marie (profitdriversinc.com)\nThat's exactly what I'm saying.\n00:17:05 - Maria Gudelis (Maria Gudelis)\nSo yeah, that's what I thought. And I agree. That's sort of why I've held off. was going to send out 30 looms a day to all my people saying, hey, I've got this 100 days to 1k days. You know, thinking of, you know, launching this and book a call for me if you're interested. then I was going to sell whoever gets on the call, but I know it's not a. I wanted to wait until we kind of strategize because yeah, because I'd rather have something we build together.\n00:17:35 - Tina Marie (profitdriversinc.com)\nif I'm going to do looms, I'd rather do looms than to that.\n00:17:37 - Maria Gudelis (Maria Gudelis)\nYeah.\n00:17:38 - Tina Marie (profitdriversinc.com)\nAnd that's the most lovers thing because there's no overhead cost to that. So we can just split it 50 50. I can pay for ads if you're strapped right now and we just figure all of that later. So. And or I just paid for it and like you're doing some of the looms like that's the thing we can figure out how to split like I don't. there's a lot of things I don't like to do that you love to do. So if we figure out a good balance where you're happy with what you're doing, I'm happy with what we're doing. You know what I mean? Like, I'm sure that we can find those things really well. And of course, I'm a grown woman, I can do things I don't want to do and will do things I don't want to do. And likewise, but I think that's the fastest easiest thing to not bog us down to also establish a little bit of a brand awareness with us operating together. A kind of a mutual audience, which is going to have a different vibe than just Maria or Justina. And then when you have the money and you're reading, you're not like, how do I hustle up some money? Now we can talk about structure more frequently and really build out what's our long term thing, build our maybe individual courses, not individual, like a combined course, serve in the way that we're talking about, you know, we could and calls and co-working all of that stuff that we were discussing, but I think it's not, we can't even have that conversation until we've got money coming in for you if you don't have to worry about it.\n00:19:14 - Maria Gudelis (Maria Gudelis)\nYeah, yeah. Well, I'm supposed to get started for us working together, right? So now it's time to pull the trigger.\n00:19:21 - Tina Marie (profitdriversinc.com)\nAnd it'd be so great to fulfill that for somebody. You can't get a quality, that. I don't even know anywhere where you could go get somebody who's going to give you the business structure that I would give them and the marketing that you would give them. For that price and for the level of service that we would give them, the handholding that just we've got you and not talking down to you.\n00:19:50 - Maria Gudelis (Maria Gudelis)\nThere's so much condescension in this world.\n00:19:54 - Tina Marie (profitdriversinc.com)\nYeah. You know, like, and I was talking to my love last night and he is so glad that I'm working. with no years and doctors and things like that. he's like, you just, he goes, I'm glad you're done with the internet marketing world.\n00:20:05 - Maria Gudelis (Maria Gudelis)\nI said, I'm not, I'm never going to be, but here's why.\n00:20:09 - Tina Marie (profitdriversinc.com)\nPeople need me. Like, I wouldn't be, I wouldn't have this experience if it wasn't for my path through here. Well, there are so many of us who, people just, they go here because the marketers are marketing. All they know is I need to make money and I need to do it from home because I've got kids or I'm taking care of my parents. Like I can't leave, but I need to change my life and the opportunities available to me aren't working. So they go online about business, the people that are the loudest are internet marketers. So that's who they're going to hear. said, I have to be there to teach them there is real business to be learned and taught and available to them in where they're at. They're in the internet marketing world. I'm going to be here being a voice of reason and logic and real systems. Real service, real values, real KPIs, you know, and not just how can I get money out of people as fast as I can and launch the next thing before they catch on to what I'm doing.\n00:21:11 - Maria Gudelis (Maria Gudelis)\nYeah.\n00:21:11 - Tina Marie (profitdriversinc.com)\nYeah.\n00:21:13 - Maria Gudelis (Maria Gudelis)\nSo, Oh, this is reaction.\n00:21:15 - Tina Marie (profitdriversinc.com)\nHe said, yeah, you're right. I know you have a call. just say it like that, but. Yeah, but it's been a long time trying to get him. Because he just hates that. He just knows how many of these people that and some of them look like. Christian choir boys and they're in the back rooms like bankrupting people and getting them to sell their houses and mortgage them to buy this mastermind coaching thing. And then these people aren't qualified. They just got sold and they lose their houses and they lose their, you know, they get divorced. They just, it destroys them. people suicide, like it's. Yeah, really.\n00:22:00 - Maria Gudelis (Maria Gudelis)\nhorrible thing and they're out here like I'm the greatest thing in the world and people are literally worshiping them and It's really disgusting So yeah, that's why I have my pros and cons because there's a bit of a bro culture, you know Alex from Ozzie and who he attracts, right?\n00:22:19 - Tina Marie (profitdriversinc.com)\nYeah, I don't want anything to do with it I almost even don't study it because I look at it and then as soon as I hear like The things that he has said he's like, yeah I was willing first of all he lied and he admitted to lying and he was like whatever it takes to make the money and He said different things I'm like you told me enough to know that you have no integrity that Selling is the bottom line and that you can't be trusted Why would I listen to you that that makes no sense? want nothing to do with pretty much everybody in this world Or they're all about and hub and yeah, just go park it over here And I'm just like I there is a group of people that you know, and it's not the super religion disorienting, but it's the conservative. Like, I want to make money. I do love marketing. It's exciting. But I don't want to be slimy about it. And I don't want to be condescending. And I don't want to sell a grandma out of her home or a dad out of his retirement or, you know, all that kind of thing. And there's particular language that's used in a particular vibe, energy. And I'm in that world, but I'm not of that world.\n00:23:32 - Maria Gudelis (Maria Gudelis)\nDo you know what mean? Yeah, exactly. No, I'm the same. Yeah. What do you want to do?\n00:23:37 - Tina Marie (profitdriversinc.com)\nyou want to open up a Google Doc and start mapping out? Yes. So you now is the thing that you were looking at today, the YouTube stuff relative to what what we were doing. Does it have any bearing in terms of like creating an offer or structure?\n00:23:53 - Maria Gudelis (Maria Gudelis)\nwe'll open up the Google Doc. think you started one, right? It might as far as The initial part of the YouTube video was kind of interesting how they just decided to throw up a 5K offer that really wasn't really created yet, but they were always one week ahead, right, and but they made sure they treated the customer like gold so they got what they want. So, it probably was your typical thing of they, I mean, it was all in German, right, so I don't know what the inside of the school program is, but it was probably definitely all about having a good offer building an audience, you know, having accountability. That was one thing that was intriguing. They offered a weekly accountability person or no daily, I think, so we could have Sally check in on them every day if we wanted to, you know. But yeah, yes, so I mean I can take a look at this off.\n00:24:45 - Tina Marie (profitdriversinc.com)\nAnd I've got Stephanie Stephanie's $30 an hour and that's mostly because it's partially benevolent and she needed and I believe in a button so I don't do that but she could help with that too.\n00:25:02 - Maria Gudelis (Maria Gudelis)\nSo, yeah, and, and, or even down the road have a I be that person right that yeah, I'm trying to get my documents alone.\n00:25:20 - Tina Marie (profitdriversinc.com)\nOkay.\n00:25:21 - Maria Gudelis (Maria Gudelis)\nSure. Yeah.\n00:25:23 - Tina Marie (profitdriversinc.com)\nMama, I'm a bear marketing that one. Okay. Let me share. Okay. That's weird. You just said participants can now see your application, which I've never. It's never said that before.\n00:25:49 - Maria Gudelis (Maria Gudelis)\njust. Yeah. Oh, yes.\n00:25:59 - Tina Marie (profitdriversinc.com)\nThis doesn't really have. Um, the offer, I put it, it was in, I think I just set it in box or my bad. Hold on. I don't want this.\n00:26:09 - Maria Gudelis (Maria Gudelis)\nYou gonna buy another backup?\n00:26:10 - Tina Marie (profitdriversinc.com)\ndon't know. I think I might just pin a room like I really don't even want to do any video period, but I'm like, do you think this is upstairs?\n00:26:20 - Maria Gudelis (Maria Gudelis)\nTwo of our bedrooms are that dark blue color actually that you have.\n00:26:25 - Tina Marie (profitdriversinc.com)\nI, I like these just, um, when I, when I look at, like the contrast and the energy of the light in, in some videos, I also like there was, they have this like bright yellow and I just think the energy of the bright yellow is really nice. Um, and I, I think about energy and I think about the color psychology, uh, a lot yellow is calming and trust, blue is trust also. anyway, um, see, here's your Google doc. I'm not open to that. And then also, I think it was just a voice message that I left you about what we could do or maybe we just talked about it.\n00:27:09 - Maria Gudelis (Maria Gudelis)\nI don't know. I love it in the voice.\n00:27:11 - Tina Marie (profitdriversinc.com)\nDid I put it in a Google Doc? About the offer? Let me look at the amount of shared stuff that you shared with me. Okay. I think it was in a voice message to be honest.\n00:27:25 - Maria Gudelis (Maria Gudelis)\nYeah.\n00:27:26 - Tina Marie (profitdriversinc.com)\nOh, I just put a path for making $50k a month. There it is. It's a different doc. Oh, Tina Partnership. Yeah. I've been almost manic this week, but yeah, so I went there like SL, $6,000, a written custom business, ops slash system slash team plan, and a custom marketing plan. We'll create it together on a two hour call with them. We do not fulfill it. it's created, right? We don't build anything. just tell them how to do it. But then what we could do is upsell them into a group coaching where they get support or it could just not be group coaching if we don't want to have like a group offer with them and anything. But the follow up is, you know, 200 or $400 a month and I would go more with like 400 a month for ongoing support through voxer and email. So like they could ask a question and be like, I don't know what to do about this or I'm stuck. got a row of blocks. So maybe they need some brainstorming. Maybe they need us to build a formula for them to do some calculations because they can't put the things together. But what I'm thinking here is before, so we can sell it to anybody, but we'll give them some criteria for us. have to have this, right? So anything that basically spells out, you know how to make money and you're not going to risk losing your home or not beating your kids in order to make this payment and investment with us. We could do some financing offer as well, but I still would want to put this in here. And I do think we should offer financing because I think that people that we want to help most might need that kind of help. So then what we do is we have them fill out a very thorough thing form and it will help us understand what their assets are.\n00:29:33 - Maria Gudelis (Maria Gudelis)\nWhat do you have that you have sold before?\n00:29:36 - Tina Marie (profitdriversinc.com)\nHow many times did you sell it? How much did you make over what period of time? How did you get leads and eyeballs on it? Do you currently have, you know, a flow of eyeballs, even if it's five a month on your offer? Do you have a social media following? Do you post blogs? you have a group like all of the potential ways that you have organic traffic coming to your offer? Do you You have money for an ad budget. If so, what is it? You know, we want to be able to spend at least a couple dollars a day because we could do something with that little bit, even if it's on YouTube. Are you comfortable with making videos? Have you made videos? you have a video editor? All of these types of things, right? OK. We're going to tell them $6,000 plus. You should set aside roughly $1,000 budget for contractors and ads. So we're going to minimize everything. But I think that we could get, if we needed graphics or video editing, we could get that done. And we could give them a decent ad budget with an extra $1,000 that they spend. And so part of our marketing plan would be taking stock of what they already have and who they have, right?\n00:30:52 - Maria Gudelis (Maria Gudelis)\nAnd what their products are and say, OK, and we would do the same thing for them that we would do for us, which is not the best. Sorry, Chin, you want me to start writing this?\n00:31:00 - Tina Marie (profitdriversinc.com)\nin there because I'm not as much an auditory person like I can do whatever you like yes I do have badminton recording so um okay from there too okay okay I lost my train of thought and it's totally okay it's just the way my brain works um so so my thinking was that if we do a really um thorough written intake so if they can't express to us in writing what they have if they can't answer the intake form well we already know we're gonna have issues being successful with them okay okay um but but if they have something so we're we're going to say okay here is the most leveraged offer that we see and I would do for everybody a hard-brid thing so I would say I would um now we would do this together right and and and come to some sort of agreement kind of riff a little bit before we talk to them but I think our target should always always be help them find kind of the tier thing which is done for you done with you and DIY type of version meaning there's either a product that you buy yourself and maybe it's not done anything you don't have to do anything maybe it's just a product that you purchase but we want to figure out a value stack where there is a scaling because we want them to get their money back ASAP right and we know that the higher value things generally tend to be a bigger investment and if they were already good at packaging these things together then they wouldn't be reaching out to us so that's my premise is that they're going to need help figure out that option so then what we have to look at and is go okay what would it take to fulfill this what kind of support do you need are you going to need somebody to help you create some graphics for social media or for ads are you going to You need a video editor, know, did you because YouTube ads are going to be the least expensive if you're willing to do it and probably get you the best results in terms of getting leads. Can you write it? Do you need to go hire some copywriting help? you like some AI prompts to help you write stuff because we can help you with that? Well, um, so I think that if somebody, so what we would want to do is figure out what is the baseline of what somebody's doing like, can they, are they already generating or have they ever generated even $2,000 on selling something, selling a service or product? Maybe that number needs to be like for my clients, it's a minimum of your earning $50,000 a month and that's minimum because Even at that point generally their profit margin suck and they're not managing money. Well, it's just this weird Growth period generally it's not super optimized They hustled to get there and they're like I can't get out of this thing Whereas it's lower they're more conservative with the expenses because they need everything to count so Yes, so I thinking about what the parameters are and giving some really clear examples So a person who fits it can look at it and go yeah, that's me.\n00:34:30 - Maria Gudelis (Maria Gudelis)\nThat's totally me.\n00:34:31 - Tina Marie (profitdriversinc.com)\nOh That makes sense and then so We would do a profit calculator Well Okay, so I have different versions of this and I just plug in people's numbers and There are formulas that you can do change. So I'm going to duplicate this. This was actually something I had been thinking about for myself. Um, so let's say, um, Maria, Tina, um, joint business plan, um, and offer creation. And it's 6,000. And if we sold three a month, um, then we come over here. There's no attrition. So that's just how much it would make us. But then let's say that we upsell them to, um, private access, and it's monthly and it's $400. It's those same people. So, um, oh, sorry. Yeah, sold is three. And it's price annually, price monthly, 400. And so then that would come over, I'm thinking it was wrong with that one. Yeah, price annual, price quarterly. Yeah, anyway, we'll just do it this way, 1,200. It'll go populated like it's supposed to. It's not there's something wrong with my formula. But anyway, fix the formula. But we could do something like this with them and show them, OK, here's all you have to do. And so you play around with prices a little bit until you get a number over here that matches what they needed to be. And the first target is going to be how much money they need to make. And the second target is going to be how do they see how their investment in us has returned to them. At the very least, they should make their money back. But, you know, we'd like to at least double their return on investment and that shouldn't be hard if we're selecting the right people and just giving them the value is the clarity and the confidence. So most of the time people have stuff and they're like, yeah, but I don't, should I do this? Should I do that? And so they're not clear. And when they make a decision, they're still, I don't know if I should do this. I'm picking something. And so they hesitate, hesitate, hesitate, they don't pull the trigger, they do it and they're like two days later, it's not working and they abandon ship and they go do something else. They don't have confidence, but you can't abandon ship. It takes weeks most of time to get an offer to convert, get the ads to work well, to dial the audience in that type of thing and start actually making money. It can be different, it depends on where you're running ads, depends on how good your ad is, depends on your offer, it depends on your pricing. along all of these different things. But on average, I would say roughly around six weeks before you really get some kind of traction. So anyway, and so we can look at the different things that they offer and say, okay, so here's where people come in, and maybe it's a $5 offer. How many people do you need to make X? And if that conversion rate percentage is 2% up to the next offer, then at this price point, how much does that make? That type of thing. I've seen you do those types of numbers in your posts, but this would be something where we clear it and we'd make all the formulas correct and make sure that they're working. And so like lead magnet here, leads per month, let's say it's 500 eyeballs on there, cost per lead is, we'll say it's $2, convert to product, we'll say it's, so if you did a $3 offer, you got like 50% right?\n00:38:59 - Maria Gudelis (Maria Gudelis)\nConversion was 20%. Well, it's 29%.\n00:39:02 - Tina Marie (profitdriversinc.com)\n29%. Price of product was $3. And so average cost probably, why not? I definitely average value per lead. Oh, yeah. So if they upsell, but then you had a $25 offering and more converted to that, right?\n00:39:23 - Maria Gudelis (Maria Gudelis)\nYeah. Well, the average order value one day or value was about $30 as well. But then within 30 days, like they're on a thing to buy a $1,000 or $4,800 thing, but we've never ran it long enough to calculate, you know, what the conversions were on that.\n00:39:43 - Tina Marie (profitdriversinc.com)\nYeah. So there are some things missing in here because I was doing it as an exercise and then I stopped, but we could create something like this where we screen share and we walk them through and we would populate it with information from their intake form. They already told us about their products and they already and we would have gone and looked at them So we'll do a little research before getting on the call so that we can make that two hours and be done We're done.\n00:40:12 - Maria Gudelis (Maria Gudelis)\nYeah Well, I walk people through on today's it's okay if I share screen.\n00:40:17 - Tina Marie (profitdriversinc.com)\nYeah.\n00:40:17 - Maria Gudelis (Maria Gudelis)\nYeah, me stop. I'm sure what I got I walked through and maybe we make an amalgamation of stuff But I walk people through today like a customer journey map, right? Like and actually was giving examples one was even yours PTM Maximizer and say you offered a six and six score of six figures six months. Okay, whatever free school please example and I share with them my you know journey map here, but then it goes into a Like this is rated live on the call with one of the people today So then it goes into a value ladder like this kind of a high-ticket ascension thing from low ticket So yeah, so her case it wasn't free. This is this was your micro offer So basically, where's your micro offers? hers was Facebook ads for financial advisors, let's say it's 1440, and then what's your order bump? 27, it doesn't have to be in order but this could just be upsell or whatever. So maybe that's better if I just say upsell, upsell one. And then I'll just, just for the remedy, I'll just take up 100 deals, pack of the safe proven, Facebook and IG proven templates. And then I asked her what does she want next, her lifestyle? Cause she does have a hot done for you stuff, like, but she said, I'd like to select her 1000 of course, that's more passive. So yeah, let's create the 100K scale fast systems on nine seven. So then it fills all this, populates this out, right? So did you build this? Yeah. Nice. So yeah, and also I have a whole ad challenge calculator, all that stuff too. then here if we work backwards so let's work backwards how much do we really want to make and she said she wants to make 15 grand a month so okay so we weren't just played to the numbers everything in blue is what you change so well let's say um you want seven sales of a thousand and and that's almost 7,000 here right let's just for easier number let's change just a thousand so i'm a graphical person right so i like seeing graphically what it is uh oops i love that so step 300k skills this is so so say we got seven sales that's seven grand and then okay well how what's the agreement going to be of the people that bought up cell one um it could be of people who just bought the micro carbon can skip step two but i like to have it up so on yeah so so this is five percent so so so in order to make 7,000 here we need 140 people here right the five percent and then that's um you know total revenue here would be 380 because the Facebook and IG templates was 27. could always change that price point and that changes this too. And it's like, okay, what's the conversion rate, people for $27, people who bought the $14, you know, Facebook ads for financial buyers, what's the conversion rate needed? An order of $1 should convert at 30 to 50% or else you're bad, you know, and an upsell should convert at about 30%, especially since it's only $27. So, 40% is very, very conservative. That's going to bring in this money and then how many, you know, sales of this micro-off you need 350 sales. So, that's a 10% conversion rate because it's only $14. Again, this could change drastically if it's like 3%. So, that's for $15,000. So, how many page visits do you need? $3,500. I have a whole ad calculator. Basically, if you're paying, say, this could be all organic, first of all, or joint ventures, know, people have your email. I'll give you a 50% commission on the front end or whatever, or it could be, hey, you're paying a dollar or $2 per click, then you can figure out your ad spend as well. So still good. If you're paying $2 per click, $7000 to double your money when it's almost passive. That's cool. So that's what we have. then like when we do it list, so moving is something pretty like this. I did your PT maximizer, say, okay, you have a school. So, so, uh, 100 days to 10k. So no less up that one. Is it here? Yeah. So I was like, okay, your value ladder was you had a school group, and you have a private time energy maximizer, 20 bucks, and then you've got 6,000, you know, 6,000 a third course and that 6,000. So wherever the course name is, right? So, so two sales, you know, that's that's 12 grand, say 5% of the people to buy profit time energy maximizer. buy it. So the thing that's wrong with this is that you could skip this middle one and just have two steps. Like, so 5% of these people, 267 people buy it, right? But anyway, say you have a 15% of your free school community buy your $20 thing, then you only need 267 people in your free school community to produce 12,800 a month, sort of. Anyway, so yeah. Yeah.\n00:45:27 - Tina Marie (profitdriversinc.com)\nI love that. Yeah. Video came back and I'm like, oh, I just moped.\n00:45:32 - Maria Gudelis (Maria Gudelis)\nSorry. Sorry. Sorry. Sorry. Sorry. Sorry. But I guess the biggest thing is, so what's the promise?\n00:45:42 - Tina Marie (profitdriversinc.com)\nLike, always work backwards.\n00:45:44 - Maria Gudelis (Maria Gudelis)\nLike, we're going to learn each other how we each work. But what's the ultimate promise? We're giving them like, for these guys, they're promises like five figure months, right? So in a six week course, they gave them all the tools to create test optimized. They had a community. Coaching forward to our calls a week, which is a lot. I wish they had accountability. Again, accountability partner who supports you on a daily basis, support by the community and chat. But there was no done for you stuff there either. And if we come back to, there's.\n00:46:17 - Tina Marie (profitdriversinc.com)\nNo, there's two articles one on one or group group.\n00:46:21 - Maria Gudelis (Maria Gudelis)\nwas the price? Yeah, group.\n00:46:24 - Tina Marie (profitdriversinc.com)\nOkay.\n00:46:24 - Maria Gudelis (Maria Gudelis)\nOkay.\n00:46:25 - Tina Marie (profitdriversinc.com)\nYeah. What was the promise?\n00:46:27 - Maria Gudelis (Maria Gudelis)\nYou. They, they kind of are promising. So here they're levels. They have the free community. They have this mission five, six weeks. A self-employed person, you can grow your monthly sales in a relaxed manner to five digit figures. So they're promising five figures a month, whether it's 1000. Wait, no, is that 10,000? so 10,000. Yeah, they're promising 10k months then. Actually, their YouTube video was called YouTube. They had a YouTube. to video. I think it had the word 10k in it. Yeah, become part of the school revolution, learn how to easily make 10 to 15k a month with one hour day. That's, that was their promise.\n00:47:13 - Tina Marie (profitdriversinc.com)\nYeah, so I think that the promise is that we cut your time to actually launching your products like by 80 or 90 percent and actually make sure you do it with clarity and confidence. Because if you're trying to come up with a business plan yourself and figure out the offer, the offer is one of the hardest things for people to figure out, to figure out the price points. We could offer, so not only the offer but the hook, right? Because it's going to happen in our heads where we're going, this is why somebody would want to buy this. So the hook for the coffee is going to come out. The USP is going to come out.\n00:47:57 - Maria Gudelis (Maria Gudelis)\nWe will help you define your USP.\n00:48:00 - Tina Marie (profitdriversinc.com)\nWe will help you define, so in your offer, that's going to be the price points, the potential order bump, upsell one, upsell two, so an entire value stack, as well as a way to create where possible. We have to put a caveat, a recurring subscription revenue, MRR for you. There is no, we can't guarantee you're going to make sales. Now we can also offer to create an ad set for them, just some really basic stuff. You've got Canva skills, I've got Canva skills, we've got people, when you put the hook, like we have some kind of templated meaning, I mean, there's just a really basic thing, there's the kind of glory shot, there's a picture of whatever the product is, or a screenshot of the result, or it depends. and all of the product is by far, right? And then a headline and then a call to action. We could do that in our sleep. So we could just go ahead and create it. We could have some different Canva templates or get a low cost person to do this for us and build that in, right? So we're gonna invest maybe bucks having so many creative graphics. But ultimately we should have somebody who's working for us build a library of ad graphics that we can use and just rotate through, changing up the color scheme, dimensions, things like that, depending on the platform. We would also give them channel marketing, channel advice, right? Here's how you put this up to Instagram. Here's and we would tell them, so like Instagram, TikTok, YouTube, and then Twitter, potentially LinkedIn, depending on who it is. And, basically say, okay, here's the version of the content that you use for this, this, this, and this, give them advice. And that's it. We're structuring everything for you, but also, so a lot of times, people are like, oh, I can't. I don't have anybody to help with this. I don't know how to we'll write a copy for you. You and I can rip copy out, but it is correct. We can recommend copywriters to you so you get access to our Rolodex, right? We'll introduce you to somebody to hire for copy for graphics, for video editing, for any of the things that you need. So you get our our service provider, Rolodex. And then, like, so now you have of a plan by two marketing and business mavens with a combined nearly 60 years worth of experience in business and a top level experience, making a lot of money and in a sustainable way and integrity. Right? So we've seen we've both generated millions for others tens of millions of hundreds millions from over a million for myself personally while barely working really and taking care of my kids. So what we're doing is in the matter of two hours taking all the stuff that they've had and they've been thinking about and will create multiple versions of the offer, right? Because you're The document, the calculator that you just had did that, mine does it where you can kind of mix and match, like here's the different things that you can offer. Some people will take this, people will take that type of thing, so a different kind of offer stack. We could help them define their avatar so they know who they're marketing to so that they can dial in their messaging and get really clear on their messaging. It's probably too expensive for us to pay for a similar web, if we have a few people buying this, I would love to have an account of similar web and look at their competitors and figure out how they could stand up there.\n00:52:51 - Maria Gudelis (Maria Gudelis)\nLet me ask you a question, why do you like similar web so much versus just doing like a typical, like, like, I And I'm just riffing with you here because you can see where they're paying for ads that you can't necessarily see in a Google search.\n00:53:06 - Tina Marie (profitdriversinc.com)\nOkay, so like there might be a place that they're running ads and spending a lot of money that you can't tell on a Google search, which means your buyers are there and you know that because because I tell them to do a abundance analysis right where you just competitive analysis, basically, where they I line competitors, what their headline headline benefits are, but I get what you're saying, so they know that that's great too. And it's probably better for somebody who's got a lot more money to spend and who can go, you know, spend money in these areas where it, but it's basically just a potential pools of customers that you can't identify.\n00:53:49 - Maria Gudelis (Maria Gudelis)\nSo it's not just who your competitors are and what their offer is, but it's true.\n00:53:54 - Tina Marie (profitdriversinc.com)\nare they getting their customers from?\n00:53:56 - Maria Gudelis (Maria Gudelis)\nYeah, yeah, yep, yep.\n00:54:00 - Tina Marie (profitdriversinc.com)\nSo it's really just market research, but yes, yeah, so and we would do that ahead of time and bring that to them to the call We wouldn't spend our time doing research on the call what we would do is show them everything that we came up with and Spend all the time making sure that they're really clear on what we figured out Hmm, I think we could do that in an hour of our own time before the calm. Yeah so They're coming away with like I can do this and then though so We would recommend and say 90% of people are going to want the follow-up because you're going to have questions and You know, this is a this is the plan, right? is $6,000 is plan It's not the support, but the support is only $400 a month and you get access to us through water If you want another call, could have all a cart kind of price for getting on a call with us. That needs to fall within our effective hourly rate of time that we're willing to do. Because the difference with the call is now I have to block off time on my calendar and we have to coordinate, whereas with Boxer I don't have to do that. So that is why Boxer can be so inexpensive. But they get the same quality really. You don't get the feeling of they've got us on a call and we've locked up our time. We have to tell them we can't make a promise that you're going to get your money back. You can make a promise that you're going to have experience that is worth the money. Because everything that we're going to teach you about your own stuff, about the offer, about how to launch it, about how to pay for support. who, who to get support, we can even make that connection, we're going to save you more than $6,000 worth of time. So let's say your effective hourly rate, theirs, so let's say $6,000, is divided by $50,000. would be 120 hours. And if you think about that, you know, somebody's, how many months do people generally spend before, like, while trying to think about product and put it together. If they actually even launch it, could Karina have launched the stuff that she did without you? right, okay. yes, we're going to show that, but we're also going to show what are the odds of and the statistics of my daughter. Also, I just realized I am missing, I just missed a train. Oh, no, did you go to it? No, I need to do this. But. I can't see the doc now so I lost my train of time.\n00:57:04 - Maria Gudelis (Maria Gudelis)\nI'm going to reach, reach, get, get, go.\n00:57:07 - Tina Marie (profitdriversinc.com)\nOkay, yeah. statistically, most people will. Hum and ha about trying to create an offer and it can take them years. To launch something. So they generally make their money. Just kind of hustling. And it's not a well thought out offer. It's not scalable. It's not evergreen. So they're constantly launching thing after thing hustle after hustle. They end up taking clients that they don't like just to be able to get by. And they're doing it alone. And they don't have the feeling of experts have given you validation for your offer. And I helped you structure it. Like where else are you going to get to like time tested experts who. Like, my clients pay me $1,000 an hour, they're getting two hours, but they're also getting a very specific plan and your time, and we're going to spend time doing our research and preparing for what we ever get to the call, so it's not just two hours of our time, you know, we get on a call.\n00:58:34 - Maria Gudelis (Maria Gudelis)\nOkay, get it.\n00:58:37 - Tina Marie (profitdriversinc.com)\nUm, yeah, so.\n00:58:41 - Maria Gudelis (Maria Gudelis)\nIt sort of reminds me a little bit of, um, do you remember, did you want redend Kennedy's books ever and stuff?\n00:58:49 - Tina Marie (profitdriversinc.com)\nI mean, no, I hear about them all the time. It's not audio, so I can't say, but I can't read anymore very long.\n00:58:58 - Maria Gudelis (Maria Gudelis)\nGod, yeah, he was like, who I learned marketing.\n00:59:00 - Tina Marie (profitdriversinc.com)\nfrom ages ago, probably 25 years ago.\n00:59:03 - Maria Gudelis (Maria Gudelis)\nhe used to have, and I doubt if he doesn't anymore, because he's like, yeah, he's probably tired now, practically.\n00:59:09 - Tina Marie (profitdriversinc.com)\nBut he's all his stuff.\n00:59:10 - Maria Gudelis (Maria Gudelis)\nThey worked together. You didn't know that? Yeah, yeah. No, you bought his stuff.\n00:59:13 - Tina Marie (profitdriversinc.com)\nBut like, I don't think he's like working every day anymore stuff.\n00:59:16 - Maria Gudelis (Maria Gudelis)\nLike he was like, his peak was 20 years back to him by now. That's right. That's right. Yeah. His peak was 20 hours, 20 years ago. Sorry, but yeah, he would have a diagnostic day where he charged 18,000 for a client to come in and spend the whole day with him. And he would map out their entire plan. if he wanted Dan or his team to build it, then that would be another fee, but he would reduce that fee by 19,000 that you paid.\n00:59:45 - Tina Marie (profitdriversinc.com)\nWell, so maybe then we build in the voxel support, because again, it gives us some freedom and maybe it's for 90 days. if you want more time after that, that way the support is built in.\n00:59:58 - Maria Gudelis (Maria Gudelis)\nIt's not a sticker shock price kind of thing.\n01:00:00 - Tina Marie (profitdriversinc.com)\nIt's okay so and it kind of stacks in the value right so it's more of our time um And it shouldn't be more of a commitment and I would want to make sure that they're being successful and And getting through it and maybe after we do a few of them we can figure out how to restructure it um I don't know.\n01:00:22 - Maria Gudelis (Maria Gudelis)\nWhat are your thoughts? I like it because you're right you you this is something you hit nail on the head If I were to share the screen, but I know you better go soon, right?\n01:00:31 - Tina Marie (profitdriversinc.com)\nmany more minutes do we have until till 10?\n01:00:34 - Maria Gudelis (Maria Gudelis)\nalready missed this training, but I'll I can watch the recording. Okay, so um They are constantly launching thing after thing because they're hustling and taking clients just to get by And they are feeling alone like that. think Is the most emotional aspect of it because that is probably so many people there and that's me too You know, um It's why I spent two thousand dollars in a micro after thing. And I'm very good at this.\n01:01:05 - Tina Marie (profitdriversinc.com)\nYeah, I need help that much. Then I'm just like, no brainer, take my money. You know, there are other people. And so, yeah.\n01:01:16 - Maria Gudelis (Maria Gudelis)\nYeah, and it's bespoke. Like we can kind of make it bespoke because we're not saying, well, correct me if I'm wrong, you're not thinking of the path that we're building a micro off of them, right? Like it's whatever fits their needs, right? So it's bespoke because it could be a via self funnel. It could be just a YouTube video. Like, I don't think I shared with you, but one of my friends, Carrie's doing the most amazing thing. Well, is it it's okay if I digress to another avenue, but it's just good data point for what we're teaching. So, Carrie is a guy that paid 15 grand to Ravi Abubala to scale his company. He teaches a clean business opportunity, which is meaning he teaches people how to start a remote cleaning business and he's the real McCoy. So I was this customer services manager at where Avi's company, this is a few years back. And Kari asked for a refund. He's pissed off because he's just like, you guys just want to throw Facebook ads at this to be self on it. But I'm telling you, organic LinkedIn is what worked for me. How come you're not teaching really much? He's like, the only person that ever added value here in this company was Maria. You know, so we kept in touch, right? We're good friends. And also he's, he's, he, he of went down a dark hole after that and just took a off and just, you know, he's very Christian as well. So he, that's why we stay in touch. And he was, anyway, it was all good. But to make a long story short, he just continued his organic thing and he goes, we're out. So six months ago, I'm just going to do TikTok and I can't believe in 30 days. I actually made more money than the last six months. He just went live every day on TikTok, just talking about, yeah.\n01:02:49 - Tina Marie (profitdriversinc.com)\nme tell you what I'm wrong.\n01:02:50 - Maria Gudelis (Maria Gudelis)\nI think we should do that. I think so too. And then with that, well, this is where it gets interesting. With that confidence that he built and probably got boy in bed, Messer, he then went. to YouTube but not post every day or maybe not even every week but he created the most amazing YouTube organic funnel I've ever seen and he shared it with me. It's a like hour-long training but it's not like a webinar like traditional five-step webinar this is what you do the bold prompt of a lot. It was pure teaching but this is where his magic comes in. He shows his face and he's talking the video, hey look this works for me. I'm doing this is how much money making. I've all these other testimonials people doing really well with it so let me just walk you through how to start your own remote cleaning company. He goes and he opens up a Google Doc and he's got all the steps and the words to it everything so it's like a business plan of how to start a remote cleaning company and he goes listen I'd love to share this follow-along document with you underneath this YouTube video in the description just click on it all you have to do is enter your email and you will get this like he gives away the document right and then of course he's under on the thank you page giving the document click here for the Google Doc. Actually, it's a notion template underneath it. He says, if you'd like to call for me to help you with this, you know, we do have a course for this. So it was a very, very pure value, so many comments on that video saying you're the first person that's done a YouTube video or a webinar that's actually given value, this is so valuable, I can go off and do this on my own even without you, but, and then people go with him. So he's now selling a $10,000 a day to 5k packages a day through this organic funnel. Now he's going to add more fuel to it by doing Instagram lead ads or Facebook lead ads that take him to that YouTube video, but it's that YouTube video. It's different than anybody else in the marketplace is doing. He's basically given so much away.\n01:04:45 - Tina Marie (profitdriversinc.com)\nYeah. There's a lot of, I mean, Bob Berg talks about go giving, right, the go-giver stuff, and, the thing, and that's why I've thought about, you know, I would just give away the profit time and do max. because it teaches people what to do, but if they know that I can do that for them in an hour for free, why wouldn't they spend money with me if they've got money to spend it? Yeah. So we could do that exercise, you know, make it a video where we take somebody through it live and, you know, make it a real-time thing and offer it to somebody in the group, say, hey, this is what we want to do. want to make this a video. It's going to be on YouTube. you know, you're, you have to be willing to answer these questions. You can look at it in advance to know if you're okay with that, but this is what we want to do. And then the other thing that we could do is we could do one of these offers, free offer reasons, and do that with somebody. You know, somebody who can will take that and just like, thanks, I'll just go do it myself. Great. We don't need everybody. We don't like to force it. Well, the month, you know, so let's say 200 people see it and 196 of them do it themselves.\n01:06:06 - Maria Gudelis (Maria Gudelis)\nAnd four people say, I need Tina and Maria to do it for me.\n01:06:10 - Tina Marie (profitdriversinc.com)\nYou know what I mean? So that's the power of abundance. And I do think that that's actually a much better model. I think that you get higher quality followers and bands that way. Yeah, I think that you they tell more people about you. And I think that's where, and also when there's this is what I know about people that have a lot of money, there's no barrier to entry and they can see everything that you know. They'll just reach out to you and they'll just say, look, I they'll offer you money. They'll say, I want to work with you. Here's a whole lot of money. Can I get some of your time because they already know, you know, and you didn't just give this away for free. Yeah. Yeah. And we, I really do think though that TikTok is the thing. I think, I think it's a fresh audience. think that are a lot of people who don't know anything about anything. So I don't think they're brainwashed. Um, internet marketers in Facebook and Instagram is the same because it's not the same. It's definitely different audience, the different people. But meta knowing what meta knows about everybody kind of puts people in this echo chamber of similarity. And TikTok is different. It's a completely separate algorithm with different data points of different, well, different algorithm. And then YouTube. So I would want to create the lives on on TikTok. And then so YouTube doesn't care about consistency. TikTok does and frequency. Very, very much. algorithms are about going live very frequently and when people are on and interacting with them. YouTube cares about how long people watch your content so quality because when they're serving up and it's just like you know SEO with Google like if you're bouncing up their pages they're not going to rank you high it doesn't matter if you stuff all the keywords in there if people aren't saying page then obviously they're not happy with what YouTube has served up and people won't stay on YouTube if they go search for something and YouTube gives them a video that's boring they don't like it whatever so they care about that you create it does not matter how consistent it just matters that the content is good yeah yeah so if we create that offer and so two videos that we could do is walk through the PTE maximizer with somebody and just gift it to somebody who has Sunday thing, leverageable, where they're like, because they're already making money. Maria, like anybody else is like, I've been doing this a while, I make money. But I don't feel like I've just like, I'm crystal clear on somebody like, I get up and I know what I'm working on every day. I don't stress about it. The money is there, money easily, even when I don't know what I'm doing, I don't spend my will too much. Because I know what my most leveraged things are. And I get to it. Because once I've learned it, I always learn it. You're not going to stop forgetting that. most people aren't that way. So that's the gift that we give somebody, but they have to have something that is clear, like a real estate agent showing houses versus making phone calls. They needed to have somebody else make the phone calls. They should be showing houses. That's like a sales call. So a salesperson doing sales calls versus writing copies. Somebody else should be writing the copy.\n01:09:55 - Maria Gudelis (Maria Gudelis)\nThey should be on the call because that's where the magic is.\n01:09:58 - Tina Marie (profitdriversinc.com)\nYeah. That's everything. For some people, it might just be creating videos, creating YouTube videos, creating TikTok videos. So your guy that you just talked about, his thing would be teaching and making sure that people actually know what they need to know so that they want to come and buy the things for them. So it's basically just informing his audience and that goes to people through the level of awareness by teaching them in different things about their business. So anyway, so we could create a really quality video walking somebody through that exercise and we can deal it a few times. So you've got a few different versions of the video. We can break that up into little shorts that we put on TikTok. We could break it up. We could make it a long, you know, whole-contained video on YouTube with some shorts also. And we could put it out too. We could put the bits, know, to the other platforms. I think if we focused on TikTok for live engagement, YouTube for low-cost leads, low-cost, high quality, targeted leads, think it's been very little money and do very well if we've got a great offer, and if we're demonstrating our value through the videos.\n01:11:24 - Maria Gudelis (Maria Gudelis)\nYeah, yeah, which, yeah, I always believe like the Eve Hutton thing, like when I open my mouth, they listen to me. I always know that, right? But it's just getting visible, right? Still about getting visible. So, TikTok for live interaction or engagement, as it is. Yeah. YouTube. Long-term growth. didn't even say those exact words, but something like that.\n01:11:57 - Tina Marie (profitdriversinc.com)\nTikTok is so for low-cost. high quality leads targeted, but the content that we put there would be longer and higher value in that it's a complete picture, like girl trainings.\n01:12:15 - Maria Gudelis (Maria Gudelis)\nYeah, so now Kari, here's his channel, Boring Business Growth Hub and Boring Business. I love that. Yeah, yeah, he's really funny. You'll love him. He's a really cool guy. Um, so yeah, so anyways, like he's he keeps pumping stuff out, but here's build, build a tent. In this video, we will overview the process of obtaining a trial. That is an ad. Hold on. A version of REX. All right, you guys. So in this video, we are going to be talking about building a. So he looks like a nice guy. He is. He created a four part series. And then if you haven't watched part one of this training, make sure you do go here. Like, so it's like a flywheel. Welcome to my YouTube channel, we show you how to build a remote cleaning business. It's just so good. his promise is $10,000 a week, by the way. don't think he has a guarantee on it anything, but he certainly has people who achieve it. But again, he goes follow along, so he goes, share the resources you will need, grab every single one of them. So he's got a follow along document here. you click here, and it comes over here, get you copy the follow along document, get my document. So we could totally create this kind of, I call it a mouse trap too.\n01:13:37 - Tina Marie (profitdriversinc.com)\nThis is our cheese. And I've been seeing that too, like that exactly, that's the model. And what I love about TikTok, and you can do it with YouTube too, is that we can join each other. So you can go live with another person. Because my biggest thing is I don't want to talk to myself. I don't want to talk to you, the ethers. I love to talk to Maria, and I think that we would riff so good. There might be other people that we might want to do additional conversations with them, so one great thing about TikTok is you're doing that type of thing with other people, so you get their audience, they get your audience, so if we're strategic about it and we're not overlapping the exact type of stuff, or just having abundance mindset know that it doesn't matter if we're not overlapping, because some of their people will like us better, some gave them all the gifts by letting them see that there's something else available.\n01:14:34 - Maria Gudelis (Maria Gudelis)\nYeah, and he's making money, he says he's making about 4,000 a month now recurring, just because people are, this is his go-high level version that you know, say even if you don't buy my course, here's the booking software mandatory. cannot automate your business without it. We will use the software during the training 14-day free trial, and this is his go-high level snapshot for a cleaning business.\n01:14:58 - Tina Marie (profitdriversinc.com)\nI love that, and that is the other thing I want to do like I hate spending money where it's not making me money but I think that there is a lot um available in I mean go high level will pay for itself very quickly if we create our own snapshot and sell it as low cost so um I've got a girl that could help build that honestly we could probably build some of ourselves but uh and I don't know what they would be but like your micro offer whatever we come up with for these people um maybe we could say for the first um 10 people who buy this will build the automations for you in high level and if you we can put it in your own high level account don't have one get it through us yeah now we've got some people um buying it and uh so we could spend a little bit of money but we'd have the money coming in where we could spend that little bit and I've got a great girl that we could do it I have the ability to build some stuff too we can go with Dan so Anyway, we could make some money quickly with that, I think.\n01:16:07 - Maria Gudelis (Maria Gudelis)\nI think so. This could easily become, if we wanted to, 25K product, this is better than any masked maniac. I still have my friend, a frickin Russell Brunson, 25 grand for their inner circle mastermind, whatever. all they just taught them how to do a challenge, here's your challenge course, and you could get on group coaching calls, that's it.\n01:16:29 - Tina Marie (profitdriversinc.com)\nAnd that's all they provided. said to me, what the hell? Which they ripped off of Seth. What? Which they ripped off of Seth, from Seth.\n01:16:38 - Maria Gudelis (Maria Gudelis)\nOh, no, wasn't that kind of challenge. No, it was like a live, five day challenge, like I used to teach and stuff. Oh, okay.\n01:16:45 - Tina Marie (profitdriversinc.com)\nSo, because Pedro Adao taught Russell Brunson how to do stuff, but Pedro got it from Seth.\n01:16:52 - Maria Gudelis (Maria Gudelis)\nPedro, well, Pedro teaches live challenges, like Pedro got it from Jason Flatt, and he got it from me. Because back 12 years ago, and. And Jason said it, Maria, you're the OG of doing challenges.\n01:17:02 - Tina Marie (profitdriversinc.com)\nYou had 30,000 people go through your page. Girl, how did I never hear about you?\n01:17:06 - Maria Gudelis (Maria Gudelis)\nI know, because like I didn't continue with one thing. Like I just shot an object.\n01:17:12 - Tina Marie (profitdriversinc.com)\ndid so many different things.\n01:17:14 - Maria Gudelis (Maria Gudelis)\nthat's how. And so Jason created Pedro, because that was when I was doing stuff with Jason about eight years ago still. And Jason's like, Maria, I just got to tell you something. said, I'm going to help Pedro break out into the big group space, because I hate how it's all close knit group and stuff. He's done a few live challenges like you, but I know you're the OG, but he's kind of using a new modern way of Facebook groups and stuff. go, Jason, I'm using Facebook groups now too. Like when we used to do it eight years ago, yeah, we used just go to webinar. And that's it, because Facebook groups didn't exist back then. But I was, oh, I didn't realize that. But Peter had already paid Jason like 25 grand to get coached on it. So Jason then introduced him to all the other people. So I'm like, oh my God. So that's how Pedro got all the big name clients.\n01:18:00 - Tina Marie (profitdriversinc.com)\ninitially to and then that success breeds success right so we had this first few wins big name points and yeah yeah so there is and and to me this is not a shiny object again I like multiple options first of all because I do so it satisfies the shiny object by having different things I could bounce to but they're all within the same room so we could do a challenge around an offer like your marketing offer and we could teach people to do what we're going to do for somebody else right so if you want to put your own brain power in it but if you've got enough money that you would rather us do it so that you're really confident you did it right yeah and you want that one-on-one time because I would do that I don't I don't want to be in the group I don't want to have the group conversation not when I have money buy of money I just want to get it done fast right so some people don't have the money but they need the path and and that would be you are kind of give back thing. We put them through a challenge, sell it cheaper, but it's the same thing we're doing. So we're not jumping around from type of offer to type of offer. It's all about get started, get clear, and leverage and optimize your offer for a sustainable business that you keep running. It's an evergreen offer. So back to the fundamentals, like we're not here if you want to do launch after launch after launch after launch. You have to have something of value that has lasting quality and value. If you want to do the launch fine but we're not talking to you about that, we're not suggesting it because that's rework, then you're building yourself into a job of having to come up with the next thing. We don't advise that. That's hustle and grind mentality that will take a toll on your health, mentally, physically, emotionally on your relationships, and we don't. on anything to do with that. best of luck to you. Bye. Yeah. Um, now, if you would like to build a business that can support you, that can allow you to fill your purpose in life and serve the people that you feel called to serve, but be able to make money where you're not stressing about it and worrying about it. And then build something that has a compounding benefit where you're earning more month over month, year over year. Let's talk. Here's the system for that. Here's what you need to know, figuring out how to make it work takes a while. So, you need emotional support. That's what the group is for. You need structural support. That's what our plan is for. And then you just need to keep on keeping on until it works. And we've got the experience to show you what happens if you get stuck in a pitfall and you can come to us for help. That's what your money goes for.\n01:20:55 - Maria Gudelis (Maria Gudelis)\nYou just create, you just take that part of the recording.\n01:20:57 - Tina Marie (profitdriversinc.com)\nThat's the manifesto.\n01:21:00 - Maria Gudelis (Maria Gudelis)\nI love it. It's awesome. I loved what you said when you feel called to serve. So I love it. That's a good way to end this call. know you got to go.\n01:21:08 - Tina Marie (profitdriversinc.com)\nSo okay. So I get you supposed to so happy. I feel like our calls are so productive and we get a little bit clearer, but I also feel like we're going to give so much to people anyway.\n01:21:17 - Maria Gudelis (Maria Gudelis)\nSo what are the next steps? you want me to put together like a small offer dock and then you just go at your magic and just revise it and stuff?\n01:21:27 - Tina Marie (profitdriversinc.com)\nThat would be the best thing for me. if we were to like this, that would be great.\n01:21:32 - Maria Gudelis (Maria Gudelis)\nSo it comes out of me verbally, very quickly and pretty clearly.\n01:21:38 - Tina Marie (profitdriversinc.com)\nPutting it onto a document for whatever reason, generally I will pause. But if somebody starts the document, then I'm like, oh no, this, I did this. And then the structure gets really clear, really fast. And then we pick steps, tasks, assignments, due dates, execute, and then voila.\n01:21:56 - Maria Gudelis (Maria Gudelis)\nOkay. So I'll do that this afternoon. I'm just going to go and pick up my dog. And then I got my nails appointment and uh no I love it because because then we literally probably could launch this early next week like um I mean if we get it done earlier Friday Saturday we could but I think I'm traveling this weekend I'm going go see my sweetheart and he's taken to me to a football game so I'm I'm being out of pocket for a few days or not see your sweetheart what he doesn't live where you live where does he live no he's in Arizona Vegas he's got a few different houses but generally Arizona Vegas gotcha gotcha I used to have a house in Arizona Vegas in my real estate days when I was flipping luxury homes um so okay so is Monday feasible if you want to do what's um Monday's always kind of rough for me anyway because I have a lot and I'm not getting in until like one o'clock in the morning so let's do Tuesday okay that's cool and what we can do uh yeah so I'll start on the google doc and we'll just refine it refine it and uh this will be some gosh I'm even thinking maybe I think, well, so a lot. We got to maybe limit it so we make sure that it's good.\n01:23:07 - Tina Marie (profitdriversinc.com)\nAs we get clear on it, once you set an intention and you get really clear on it, people magically and it's not magically, it's synergistic, and I think it's God. But it's asking you shall receive, and you can call it lot of attraction, doesn't matter, once you get clear on it, things just start happening. So if somebody comes along and you're like, I have this perfect offer for you, and you're want to sell it, just sell it, and then we'll fulfill it and we'll figure out the details. I'm just saying, in that amount of time, knowing you and the conversations that you have and because we got clear, there may come an opportunity where you're just like, I could sell this to this person right now, sell it, get paid, we'll fulfill it, we'll deal with money up later.\n01:23:51 - Maria Gudelis (Maria Gudelis)\nGot it. Yeah. And then also just go back to the thing about Seth and this counseling, yeah, like I know my friend Cindy Mulcaney, she loves Seth and I I remember she thought Seth's thing, that's why I bought it. And she said she was going to see that's an interesting person for me to reach out to. She never launched it. Like, she wanted to launch the thing like Seth. And she's doing other stuff, don't be wrong. She's making money and doing good stuff. But I just got a feeling it's like her, that would be a perfect client, too, because it's like, I mean, it launched it. Like, you said you're going to do it. You bought one Seth thing, all excited about it. And instead, she went all down the path of the AI, which is still good. And she's offering some kind of AI coaching offer, and a go high level affiliate. But still, it's sort of like, you know, she believed in something and then she never launched it. So what happened? we're here to go in for helping people in between that.\n01:24:44 - Tina Marie (profitdriversinc.com)\nLike, I think that's the issue. So people have been Yes, it is. It's doubt and it's too much work, and I need help. I don't know how to hire people. Seth can't hire people. Seth cannot manage a business.\n01:24:57 - Maria Gudelis (Maria Gudelis)\nHe can't. He will never happen.\n01:25:00 - Tina Marie (profitdriversinc.com)\nI'm not talking bad about him. His genius is just he cannot, will not do it. He will jump to all kinds of other things in order to avoid actually structuring things. And he doesn't even know where to start. And so literally saving him. And we don't, we see people like that and we don't know because we see their strengths. But that's the truth is that most people are thinking and so beneath their potential because they need support of some sort. So here's, we could do $10,000 done for you. And here's why I think that would be a good thing. We could take that money, put it into getting support in a person building an automation. But then we're building a snapshot at the same time that we own. So we give them their version of it and then we keep a generic version of it. Doesn't have their copy, doesn't have their anything. But, so I don't think we build too much work for ourselves if we do that for you, because we can whip out, like I can write copy, we could just literally talk about an offer, the copy will come out of my mouth.\n01:26:15 - Maria Gudelis (Maria Gudelis)\nI'm pretty sure you could do the same thing if we do some research.\n01:26:18 - Tina Marie (profitdriversinc.com)\nSo we would literally just have to transcribe it and then go have it edited into it, it'd be so easy. We could do the same thing with the email follow-up sequences, like we could spend maybe 10 hours for $10,000, you and I would both be well paid. You'd have enough money for a couple of months, comfortably, well, if you got it all, if you didn't, we have it one month and we could sell anyway. So I'm just telling you, those are some options to think about, because I know you know people, and I think God is going to give you, I think he's going to show you who you need to talk to and who you can help. So, you're not allowed own. You're not doing all the work. You're not going to be overburdened. If the person that you know needs this is available, sell it, take the money, get paid, know that you're taking terms, we will fulfill it very quickly.\n01:27:16 - Maria Gudelis (Maria Gudelis)\nThank you. Okay, let's go. So, send me the recording when it's ready, when I have time, that'd be great. So I could take a look at the notes and I'll create the Google Doc. I'll have that done by the end of the day today for sure. Okay. have to craft it, not like done done.\n01:27:32 - Tina Marie (profitdriversinc.com)\nYeah, I will go to do that right now and then launch my missionary meeting because this is devotional so I want the prayers and all that goodness.\n01:27:40 - Maria Gudelis (Maria Gudelis)\nNice. All right, all right, talk to you later.\n","contentPreview":"00:00:21 - Maria Gudelis (Maria Gudelis)\nOkay, I'm just going to move on Yeah, I can hear you now. I'm just going to move down to my family room to sit on a more comfortable chair. I was in my other r...","processedAt":"2025-05-04T03:40:52.568Z"}