{"fileName":"Done Transcript for D&D Co & Profit Drivers - Weekly Review(6).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for D&D Co & Profit Drivers - Weekly Review(6).txt","type":"transcript","priority":"medium","content":"00:00:05 - Dan Ryan (danddcompany.com)\nThere we go, there we go.\n00:00:10 - Tina Marie (profitdriversinc.com)\nYou ready for orange charts?\n00:00:14 - Dan Ryan (danddcompany.com)\nYeah.\n00:00:15 - Tina Marie (profitdriversinc.com)\nYeah. Sir.\n00:00:21 - Dan Ryan (danddcompany.com)\nYeah.\n00:00:22 - Tina Marie (profitdriversinc.com)\nHow's the week been?\n00:00:25 - Dan Ryan (danddcompany.com)\nPretty good. Good. Nothing. Nothing out ordinary. No, no drama. Just moon here disappearing. That's it.\n00:00:42 - Tina Marie (profitdriversinc.com)\nThis doesn't happen with his daughter.\n00:00:54 - Dan Ryan (danddcompany.com)\nAre you there? I can't hear you. we're because I'm gonna switch to my laptop. How can I do this? I don't know if I can do this work. This is my fear.\n00:01:16 - Tina Marie (profitdriversinc.com)\nI can hear you now.\n00:01:18 - Dan Ryan (danddcompany.com)\nThat's weird. It's like my volume or something. So Eric's sort of freaking out about it. I do, you can freak out. But he is.\n00:01:34 - Tina Marie (profitdriversinc.com)\nUm, I don't know if you said something, but wasn't there something wrong with Mani or his daughter?\n00:01:39 - Dan Ryan (danddcompany.com)\nYeah. He's got like a six month old that's got some sort of viral something.\n00:01:47 - Tina Marie (profitdriversinc.com)\nOh, she had to see a RSB?\n00:01:50 - Dan Ryan (danddcompany.com)\nNo. But he lives in India. I can stick in India front with the best place. to music based on what I was checking. And cells in their last. Oh, something weird is happening in the zoom. What's this? That's weird. Something on zoom is like. Going in and out. I can see it on the screen, but I don't know what it is.\n00:02:34 - Tina Marie (profitdriversinc.com)\nUh, something in zoom is going in and out.\n00:02:38 - Dan Ryan (danddcompany.com)\nYeah, like something was turning green and then red.\n00:02:43 - Tina Marie (profitdriversinc.com)\nBut.\n00:02:47 - Dan Ryan (danddcompany.com)\nNo, I don't think I don't have. I mean, if I turn up the iPods. And you have to switch to laptop. Which I lose my big screen. How do I not have pulling in headphones here? Don't go. Cause I don't use for your headphones.\n00:03:17 - Tina Marie (profitdriversinc.com)\nThat's why. Well, uh, and it's a PC Mac, but like it's Bluetooth though.\n00:03:24 - Dan Ryan (danddcompany.com)\nYou should be able to pair AirPods with it. It is. They're just whatever's happening is happening. I don't know what's happening.\n00:03:33 - Tina Marie (profitdriversinc.com)\nWell, I mean, worst case scenario, you could call in and still share screen.\n00:03:40 - Dan Ryan (danddcompany.com)\nFinally enough, that's what I was, that was my original plan. And then I was like, no, I'm going to, I'm going to try it. That's what you get for trying, Dan.\n00:03:51 - Tina Marie (profitdriversinc.com)\nI know. trust the technology. I was playing around with. day period yesterday and um for either what do you call it have them or zoom i i set up two different ones oh i wasn't sure like you were hearing and dialing it anyway um my goal what i want to be to do is have it extract any of the comments from the transcripts that are mine and see if there's anything that's like is that a value or principle that i have right is that something that i was teaching or whatever so it can kind of put in my library of stuff yeah um so we'll see if it captures anything today what's the zap doing um so there's one that goes from fathom that's supposed to extract this transcript and but the fathom zaps weren't really in the So I honestly don't expect to do anything. Also, it wasn't really clear to me, and I'm not as a pure user, really. And then the zoom one, it went from a zoom transcript to, and I wasn't sure that I choose the right thing. It's like it has a built-in parser, but you don't see the parser. It just shows you the different things, but it's looking and acting like a parser. So I think that's what's happening. But anyway, so it goes from that and then dumps it into a Google Doc, the transcript into a Google Doc, and then you interact with chat TPT in that recipe and that's up and give it a message. And the message is, I want you to extract anything, you know, that's said by Tina Marie and, you know, store to my library. whatever that all the instructions that I wanted to do. So we'll see if it does anything. I imagine it's going to be several iterations and tweaking and probably some customer support, but if somebody else hasn't already thought of that and done that to be like, okay, let me build my library of my own content kind of thing. I'm sure I'm not the only one who's thought of it.\n00:06:22 - Dan’s iPhone\nI have a buddy that's well, Vans. Vans, I don't even know what the he's talking about. But he is like, you know, he's not trading crypto anymore because his buddy traded the account. So he went down the AI rabbit hole and he is building personal exactly what you're talking about. Like, it's you and AI is what he calls it. And he's he's built this thing where you feed the AI your stuff. And it becomes like an extension of you. So I was I turned him on. like, oh, it's like second brain. It's like, what's that? told him. Um, but he's like super duper into this now where he built one where like, I mean, might get this wrong, but he was saying like he's built one that like a preacher can use to help write his sermons, but you're constantly feeding it your stuff. And then you're asking it things from you, from you. Like you're asking new questions or something like, I don't know, but he says it works great. He's like super freaking jazzed on it.\n00:07:39 - Tina Marie (profitdriversinc.com)\nlike, okay. Yeah, I can't remember because, um, almost a year ago, there was one that I was starting and I created a Tina bar. even remember what it was now. I'm doing a search and I can't find a thing. I originally started it.\n00:07:59 - Dan’s iPhone\nIt's crazy how much more there. is one. He built it himself. So he's he's building it like yeah, we're using chat using open AI 4.4 or four lower cases.\n00:08:14 - Tina Marie (profitdriversinc.com)\nOh, whatever the hell it is. And probably Python because chat TBT can tell you how to do it and build it. They're not hard to build. No, yeah, I abandoned it in the first place because I'm like, I'm going to go build my own. And then I couldn't get one single file to be found. And it like for days that kept happening. I'm I'm not gonna tell me to spend days on this.\n00:08:37 - Dan’s iPhone\nTotally. Eric and I were working on something for quick and flowing. We needed to do like a date reformat. I was trying to send it to Zapier. Reformat it and then bring it back in. But when you brought it back in to high level, like you couldn't you couldn't get it back into high level in a way that you could use it the way that we needed basically. Just it wasn't going to happen. So then we were like, he was like, oh, we could use the custom code function. They have this new custom code function that it's JavaScript only. And I go, okay, great. Just have chat GPT write the JavaScript. And he's like, I've never done that. so I don't know what his prompt was, but he gave it a prompt to write this date reformatter code. It spit out the code. Then he had to figure out how you present that code in this function inside of go high level, which took a couple tries, but then ultimately it worked. It was like, holy , dude. So now we can have chat GPT write this JavaScript whenever we need to use in this custom code block. And then right after that, He's they're complaining about how Munir blah blah blah blah blah like what are we gonna do and Somewhat jokingly, but not really I'm like Gutenberg blocks their JavaScript. I go. Why don't you just ask chat GPT, but that's how to make a Gutenberg block.\n00:10:17 - Tina Marie (profitdriversinc.com)\nOh, you said and It does He's like, can I can I explore this?\n00:10:28 - Dan’s iPhone\ngo absolutely like you so now if we have these finished blocks that need to be tweaked That seems a lot easier to do than just start Building blocks from scratch not having ever built a block, right? So you know Munir's experience is baked into these blocks, but he didn't invent the code He just knew his way around so I go.\n00:10:52 - Tina Marie (profitdriversinc.com)\nI guarantee you I was just gonna say I bet because we're the GPT for oh, um the token limits have increased exponentially. But you could probably dump as much of his code and you could dump multiple snippets. the limitations that used to be, you can only upload four or five files at a time. And the last time I uploaded eight at one time in one session, one comment. And, but you could like have it look at his code and say, you know, is there, do you anticipate any compatibility issues with your code in this code?\n00:11:38 - Dan’s iPhone\nYep. Yeah, and it's like, and they, this one, and there's code, I think they want to borrow from one block and bring to another. So I'm like, if you have the code, then you can probably give it what the code and say, hey, this code does XYZ. I need to take that and put into this. So he was like. Oh my God. So that's why I'm like, Muneer's not really part of the team. Anyway, we can now, we wouldn't have been able to ride all these blocks on our own with Chad TBT, like it wouldn't be anywhere near as good, but now going forward, we can maintain that and extend them came over.\n00:12:19 - Tina Marie (profitdriversinc.com)\nYeah. Which would be great. I still keep thinking about whatever Muneer's done. So I had one dollar almost die from RSV and it's really common.\n00:12:32 - Dan’s iPhone\nSix months is the age, the page.\n00:12:35 - Tina Marie (profitdriversinc.com)\nIt's usually between two months and two years, but it basically think of COVID, but for babies.\n00:12:43 - Dan’s iPhone\nYeah, yeah.\n00:12:44 - Tina Marie (profitdriversinc.com)\nI know what it is.\n00:12:45 - Dan’s iPhone\nHe just didn't, he didn't indicate anything. was. But I will.\n00:12:57 - Tina Marie (profitdriversinc.com)\nYeah. It is. It's a new. age. I've been spending I don't even spend a lot. Okay, this is how weird it is. I was on the gym last night and normally I can't do my workout without like a particularly paced type of music. It has to be at a pace to keep my energy and my heart rate going or I just kind of start to fade. But I was talking to GPT. I was like banging out chapters and telling stories and stuff. It was just so weird. I was just watching myself. I'm like, I'm walking through the gym talking to a robot. It's just so weird. It's so weird.\n00:13:43 - Dan’s iPhone\nBut it's awesome.\n00:13:46 - Tina Marie (profitdriversinc.com)\nIt's crazy. Okay, so here's one thing that I did. last night I was telling the story and I was talking about how it's crazy to me that a year ago I started lifting weights. And my primary thing at that point was just trying to heal my immobility, my mobility, but because I couldn't, I could barely move my shoulder. I had frozen shoulder, I had really bad tennis elbow. Glenn couldn't help me. I think because Glenn was bathing me too much because he's like, you're in a lot of pain and I just don't want to mess it up. Like he was scared and that wasn't helpful to me. But anyway, so I was telling it, I'm like, I started going to the gym and I was trying to heal something. And then what I've noticed is that within a few months, know, my I wasn't having that pain anymore. But then other pain I didn't even know I had was going away. Like I realized that I'm popping up and down the stairs, carrying, having things and my knees like feel great. But I didn't really, lies how bad they had been feeling going down the stairs and that I was I was bending my knees out when I would go down the stairs like I was changing how I walked because it was hurting and I'm like now it's a year later and some of my muscle groups are increased by 200% and others by 300% based on you know how much I can lift and how fluidly and whatever and but I really have only been going once maybe twice a week and sometimes some months it was only like there would be 11 day gaps between going or 16 day gap was the longest one when I was sick but I'm like even still like my body composition has changed completely I've lost inches and I don't have any pain anywhere ever even with fibromyalgia and it was just crazy but I was I was telling it I'm like this is an application for everything in life even business if you show up consistently everything improves. You don't even have to do it every single day. But if you if something is on your mind constantly and you keep applying yourself to it, there will be improvement. And there will be improvement you didn't anticipate happening. And so I was just like store this because I'm gonna I need to find a place to use it. And it's like, okay, let's put this into building a solid foundation chapter two. And I was like, what the. So it rewrote my chapter, inserting my story, and then pulling it out for the different sections that we had already written and finished. And that was really cool. Because GPT for like the one before this could not have done that.\n00:16:46 - Dan’s iPhone\nRight.\n00:16:49 - Tina Marie (profitdriversinc.com)\nThose iterations are wild that this and but like we really only started using this about a year and a half ago. Right. Now look at what it's at. And the pace is only going to get faster because the learning models are feeding each other. We've got all these new engineers on it and new prompters plugging data into it, learning how to work with it. That pace is just going to go crazy. So in terms of like teams. Who we need to do what some things are just going to be not necessarily obsolete, but how they show up is going to need to be different. So people that were. Show up and I do this in my job kind of thing, right, that coast coasting is going to go away for most of these positions because people hiring them are going to be like at your pace, I could go get a robot to do that. Well, I need you to do is take what I can't do and be strategic and say, do this, that, the other thing, but anyway. It's eye-opening, what it can do.\n00:18:06 - Dan’s iPhone\nIt's a brand new world, as they say.\n00:18:09 - Tina Marie (profitdriversinc.com)\nYeah. Yeah. it keeps being a brand new world. That's what's even crazier. like blink and it'll change. Okay. um, or start, um, kind of what do you call it? Like prompted by thinking about what to give us role in what he's doing. And even more after the conversation we just had. and also, like, so just to recap what I was talking about last week. Um, to look at where you're at, where you're going by the end of We're taking a look at it. Potentially. wanting to do something with Joe where you've got multiple people on it of a certain type. know, I just want to really look at what we're working with right now and just kind of get an update visual on where we're going. So anyway, you had it in like, it was a flow chart type thing. I feel like I can't remember what it was called. I know because I've used it for years, but I don't use it consistently.\n00:19:39 - Dan’s iPhone\nI said, your guess is as good as mine.\n00:19:41 - Tina Marie (profitdriversinc.com)\nIt wasn't like mine, Meister, but it was something like that, like, gliffy, gliffy.\n00:19:48 - Dan’s iPhone\nYou either loose the chart or if you think it was gliffy. I know I used both at different points in my career.\n00:20:01 - Tina Marie (profitdriversinc.com)\nI know, oops, but I really do think it was goofy, because I don't really use listed charts, but it could have been, let me just search my fee.\n00:20:12 - Dan’s iPhone\nI'm just going to log in and see what's where.\n00:20:15 - Tina Marie (profitdriversinc.com)\nThere you go.\n00:20:29 - Dan’s iPhone\nA little Losing chart, my dog is losing his mind because he wants a my daughter's Oh, he's searching dead.\n00:21:00 - Tina Marie (profitdriversinc.com)\nI'm Ryan and Glippy. Oh accountability and org chart, but that was like 2018. And then Evan Mark Katz came up. Your buddy accountability and org chart. Glippy Google Drive. This is. I remember because it was an export and I can't see it and drive. It's very whatever needed to see it would be. Let's see what the log in. I overdid it at the gym last night. I'm my shoulder. It's hurting me. My neck, neck, shoulder.\n00:22:02 - Dan’s iPhone\nI'm like, they're stuck and I'm like, what is this? I didn't make this.\n00:22:08 - Tina Marie (profitdriversinc.com)\nWe had Stacy do the last arm chart now that I think about it.\n00:22:16 - Dan’s iPhone\nNope. No, she didn't.\n00:22:19 - Tina Marie (profitdriversinc.com)\nNo. Let me search Tumor for arm charts, see what we can find.\n00:22:28 - Dan’s iPhone\nNo one to glippy. Yeah. Your account has expired.\n00:22:34 - Tina Marie (profitdriversinc.com)\nI, you know, I just got the same thing.\n00:22:37 - Dan’s iPhone\nI don't want to buy it. Where's the preversion glippy? Right. I don't know if there's anything in here. I don't want to buy. I don't want to That's all I know. All right. I haven't had what, I haven't had a Glyphia accounts 2019, I don't think Stacey was here.\n00:23:21 - Tina Marie (profitdriversinc.com)\nNo.\n00:23:24 - Dan’s iPhone\nOh, I think it's actually in Google. I think it's a Google, what you're going to say.\n00:23:31 - Tina Marie (profitdriversinc.com)\nYeah, like a flowchart.\n00:23:33 - Dan’s iPhone\nWhatever their thing, their slide thing.\n00:23:38 - Tina Marie (profitdriversinc.com)\nYeah, because we did have her do something. Okay, yeah, that sounds about right.\n00:23:54 - Dan’s iPhone\ndoesn't seem like it's been that long. The one that you and I missed. Or that this is the last. What I mean, that is so grossly complicated. So this ain't it or if it is, it ain't.\n00:24:14 - Tina Marie (profitdriversinc.com)\nWhat do you got?\n00:24:15 - Dan’s iPhone\nLet's see. Wait, hold on, looking at what other ones I have. And here's Bobby, did this one come for? Yeah, I mean, this doesn't even have Stacy on it. This was accurate at some point. This is what I thought it was going to be. It ain't this.\n00:25:01 - Tina Marie (profitdriversinc.com)\nOh. Let me see, like, let me open my assume more. No, going. Oh, yeah. Um. David, look, I forgot about him.\n00:25:28 - Dan’s iPhone\nHe's still mad.\n00:25:30 - Tina Marie (profitdriversinc.com)\nIs he?\n00:25:31 - Dan’s iPhone\nOh, yeah.\n00:25:32 - Tina Marie (profitdriversinc.com)\nOh, yeah. Oh, yeah.\n00:25:38 - Dan’s iPhone\nNo, he worked out of the office. He comes here, like, multiple days a week.\n00:25:44 - Tina Marie (profitdriversinc.com)\nSometimes I'll...\n00:25:45 - Dan’s iPhone\nWhat does he do? He doesn't do anything to me. Oh. He just works out of here, I should say.\n00:25:53 - Tina Marie (profitdriversinc.com)\nHe can't do He He doesn't have lunch sometimes, because I think, Brandon... Mm-hmm.\n00:26:08 - Dan’s iPhone\nI mean, more when you own the building, that's what I'm in office space for years, like I've never ever charged him. He's been in the last two, right? I don't think he ever came to the one and he's a skate one or he never worked out there, he worked out a skateboard one, skate shop one. He's a little to do stuff. He's great. Don't need him yet.\n00:26:49 - Tina Marie (profitdriversinc.com)\nYeah, let's see. Can you share that so I can look at it without squinting? he's squinting. Yeah, zoom or email with.\n00:27:15 - Dan’s iPhone\nOh, there we go. Your share is free.\n00:27:20 - Tina Marie (profitdriversinc.com)\nYeah. yeah. Okay. Okay, where's the zoom in? Okay. Where's that? Seriously. It will not zoom. Okay. All right. Holly. Well, now, so this isn't labeled. Okay, that is basis. Oh, who's Holly?\n00:27:59 - Dan’s iPhone\nThat was the. the role. So Holly was the person at the time, I was like, oh, was going to be somebody it would be her. That now became Stacy.\n00:28:10 - Tina Marie (profitdriversinc.com)\nOkay, so let's change that.\n00:28:18 - Dan’s iPhone\nBut that sort of role still.\n00:28:22 - Tina Marie (profitdriversinc.com)\nBut I she's more like, what would you call her?\n00:28:27 - Dan’s iPhone\nI don't know that I'm not good at that. I don't I don't do titles. So I don't use them and I don't grant them.\n00:28:37 - Tina Marie (profitdriversinc.com)\nThat's kind of my issue with org charts and like corporate style type organization for small businesses because I call it compartmentalized rules.\n00:28:51 - Dan’s iPhone\nYeah, I call her a side. Like, what if what does Stacy do? like, she's my sidekick. I don't know what that is.\n00:29:05 - Tina Marie (profitdriversinc.com)\nI would call it more like administrative supports because you being admin but like she helps in everything and it's generic but that's because she does so many different things.\n00:29:20 - Dan’s iPhone\nI mean she's yeah exactly it's like project management but it's not much because it is I don't know but I'm not going to get hung up on that because it's for nobody so right well if that's the case then do you not want to do this at all? No no I'm just saying so here it is I mean this is way less than this right it is so like you don't have anybody for sales it's you no it ain't me I don't even know sales like this I mean I'm not thinking about like you talking to Joe are you talking about anybody anybody that's\n00:30:00 - Tina Marie (profitdriversinc.com)\ninterested in working with you is because you've talked to them. So if sales exists, it's damn.\n00:30:06 - Dan’s iPhone\nI wouldn't even say it's a real role though, right?\n00:30:09 - Tina Marie (profitdriversinc.com)\nIt's like this, it's this temporary thing. Well, so like there's the difference between roles and function. And then there's the question, do we organize according to roles or function?\n00:30:27 - Dan’s iPhone\nI don't think it's function. In my version of the world, it's never going to exist. It existed here because we were going to start selling it to everybody. But in the version that I actually like, I don't want it to be associated with me at all. I mean, I think you could have it here and say, there's someone else wanted to do it, yeah, but I'm not even doing sales, right? me talking to Joe is like me partnering with Joe, right? Right part was the word that I was like, yeah, I had like partner relations Yeah, Joe's gonna sell it, but he's not selling basis really he's telling his his Partnership version of right his sort of Whatever right it's like he's not Really not like if it weren't a pot if someone came along and they weren't a podcaster I would never expect him to talk to them or deal with them at all right if a cold lead came in It's never going Joe.\n00:31:30 - Tina Marie (profitdriversinc.com)\nI don't know if it would go to anybody I put it here partner relations today and yeah, I mean that's accurate so then Just get rid of sales Well, I mean part of me thinks I should That's a good idea Yeah How about you make a copy and you keep that and we work on this one\n00:32:00 - Dan’s iPhone\nI'm going to make a copy and work a couple.\n00:32:03 - Tina Marie (profitdriversinc.com)\nOkay. Then I need the copy shared.\n00:32:07 - Dan’s iPhone\nPlease. I know these people aren't. Maybe it's in a shared folder. Poop, poop, poop, poop.\n00:33:03 - Tina Marie (profitdriversinc.com)\nSo I got my new food service started and I love it but yesterday I was supposed to get a delivery and I got held up and I'm like, oh, I just put myself in a situation that I really don't like. I'm expecting something I want and I can't have it. I don't like that. But it has already been opening my eyes to like other options and things that can get that are clean that are at the grocery store that are pre made. Not a few but some brands that I didn't know about. But it's been really nice having variety and healthy food like there's like this cauliflower and we need to know about super good. My daughter's like, I almost. I up in my mouth. I liked it.\n00:34:06 - Dan’s iPhone\nWhat if I put my own on?\n00:34:10 - Tina Marie (profitdriversinc.com)\nDude, oh, there it is. There's the dog. Okay. Okay. in this one, we could either just disconnect sales or just get rid of it. But I think we should make it according to what we're doing now and just get rid of it. They can always be added back in.\n00:34:31 - Dan’s iPhone\nWell, I'm gonna leave it because I have no idea how to edit this. So removing is easy. Like I don't want to know who made this.\n00:34:40 - Tina Marie (profitdriversinc.com)\nI guess it was me. Yeah, I think we did it together because I remember this. Let's see. Define, join, change, rotate, ungroup. I'm gonna do this and then see if I can undo it.\n00:34:58 - Dan’s iPhone\nI don't know if that wasn't it. Well, well, well, well, great thing is a nice show.\n00:35:04 - Tina Marie (profitdriversinc.com)\nWell, I do.\n00:35:07 - Dan’s iPhone\nCan't hide.\n00:35:09 - Tina Marie (profitdriversinc.com)\nOh, no. Just like. Oh, look what I did.\n00:35:26 - Dan’s iPhone\nYeah. That works. like.\n00:35:35 - Tina Marie (profitdriversinc.com)\nOkay. Okay, you don't exist right now.\n00:35:46 - Dan’s iPhone\nIs there any.\n00:35:48 - Tina Marie (profitdriversinc.com)\nCan we drag over? But at least we know like we can tell just by that that it's not something we're doing right now. Okay, so David, all of that stuff. Same thing. Can we just get rid of that part?\n00:36:00 - Dan’s iPhone\nWell, no, I mean that there's some validity to that. I think what is the new represent so we have partners migration. Oh, new sites.\n00:36:12 - Tina Marie (profitdriversinc.com)\nAnd then maintenance, but David's not the dude.\n00:36:18 - Dan’s iPhone\nAnd there's no dude really.\n00:36:22 - Tina Marie (profitdriversinc.com)\nWell, would you not call that so like what happens is you tell Greg to go design something. I mean, so far there hasn't even been like a new new site, right?\n00:36:39 - Dan’s iPhone\nYeah, probably would be with the podcasting building one right now, but it's not for basis. So has there been a new new site that is not JB? And then I mean the podcasting isn't everything. But it would go under partners though, right?\n00:37:07 - Tina Marie (profitdriversinc.com)\nWell, I think it would be new sites, but under partners.\n00:37:13 - Dan’s iPhone\nI mean, there's things like literally yesterday was thinking, what if it's only ever that, right? So I'm like, I should position it to start as that it's the solution for podcasting, period. And then later on adding these other things if it ever comes to that. So it's like shouldn't the messaging be, hey, I know that we made this full podcast. That's all we do, even though it's not the plan, but that's the current plan. Maybe the current plan is the plan. So in that regard, then there's just production and no partners, there is maintenance. There.\n00:37:58 - Tina Marie (profitdriversinc.com)\nI mean. Open. you do this you're going to be doing something similar with mom right so it's not just podcasting like you have at least two legs on this no nothing none of that it's built on none of that gets built on basis oh okay yeah that's all it gets built on high level and bampoli which is a totally different org guard yeah which i need to make a note for that that we want to have a org chart for that for mom um okay well so the org chart should be based off of what we're doing now and what we're working on now and even you know with the conversation once now through the end of the year i don't see you going just knowing the pace that you work at unless something presents itself but even still it would only be in the beginning of like let's talk it out there mazes. So we can make this around podcasting. So there's the functionality of the current thing. So there's partners because you have, what's his face, binaural beats. Jodi, I can't say Cody, but I'm like, it's not Cody. Um, Jodi, and strong marriage now. Empire.\n00:39:36 - Dan’s iPhone\nNo empires in that part.\n00:39:39 - Tina Marie (profitdriversinc.com)\nOkay. Um, Jodi and strong marriage now, then, and Wolfar, which probably is maybe going away, but.\n00:39:51 - Dan’s iPhone\nWell, I mean, in that part, you know, my plan is, are there going to be any future partners? No. Right. So it's like, partners even goes away.\n00:40:00 - Tina Marie (profitdriversinc.com)\nSo if this is that it doesn't because it's still like this like unless you're planning on getting rid of all those it still needs to be done right now they're just maintenance there there's you know I mean there's no stand alone so then you're just looking at like this yeah I still think that there should be something specified between in-house like I guess it's under development and this all should so production is it even production or is it under develops the dev ops the maintenance production Do you got an I in there? Is that not Avishak and Vijay in there too?\n00:41:25 - Dan’s iPhone\nIt's really these guys.\n00:41:27 - Tina Marie (profitdriversinc.com)\nSo it's like I'm just going to call them repressed because so what is these guys these three Eric have a check oh oh you're not looking at zoom I'm looking at it in the actual document so when you said these guys I was like what are you talking about okay so that team right so they're like a like a team yeah um there no I can have it so\n00:42:00 - Dan’s iPhone\nBut I said, I was like, this is your stuff. Bye.\n00:43:00 - Tina Marie (profitdriversinc.com)\nYou You don't have anybody for that?\n00:43:15 - Dan’s iPhone\nThey don't currently exist, but like a future role, particularly.\n00:43:26 - Tina Marie (profitdriversinc.com)\nHow future?\n00:43:29 - Dan’s iPhone\nSo right now it's just Noriel, so I mean, I guess it's Noriel really right now. It depends, it depends, it depends if we need it. Right now we don't necessarily need them.\n00:43:50 - Tina Marie (profitdriversinc.com)\nSo why would you put that there and not the, you know, future or, you know, down the side at the bottom or something?\n00:44:00 - Dan’s iPhone\nunder Noreo. So I did like what Noreo and I discussed was all right you're what if we just move you to being the code over Lord therefore he would be over some level of larval developer but right now he's occupying that role so okay about hey if I reduce what I pay you and we bring in junior dev to do that that's that's where we're at so the person exists by the end of the year okay it can see me everything there should be no TBD like that should be separate let's not do that language okay sorry right so that role exists there we do have a larval dev so while I'm looking at underneath bobby um in the project management and you've got css pine and you don't even use pine grow anymore do you we're I'm still up here we gotta get our way down there\n00:45:00 - Tina Marie (profitdriversinc.com)\nOkay, okay, okay. I'll calm myself.\n00:45:03 - Dan’s iPhone\nYes, that doesn't even exist then Because the blocks right right Oh Yeah, I forgot about that CC. Right.\n00:45:50 - Tina Marie (profitdriversinc.com)\nSo like teach day You Okay.\n00:46:31 - Dan’s iPhone\nI know, I'm like, I can't even see those numbers.\n00:46:39 - Tina Marie (profitdriversinc.com)\nSo where does give a fit in this? doesn't really, or doesn't do something. No.\n00:46:47 - Dan’s iPhone\nNo. He's just like a floating. It would be like, he's like an upward person, right? They don't have a permanent. It's a if and when kind of thing. It's like I'm floating out, don't even know, like it's none of these.\n00:47:04 - Tina Marie (profitdriversinc.com)\nWho is responsible for managing any like temporary contract tech people?\n00:47:12 - Dan’s iPhone\nNo, he doesn't manage anybody.\n00:47:15 - Tina Marie (profitdriversinc.com)\nNo, I'm asking you who me. Yeah.\n00:47:22 - Dan’s iPhone\nAnd they're, you know, are you not part of the dev ops team though, also? No. I have no idea what's going on there right now. Like illustrated earlier. So like I hear about it, but I'm not intimately involved. I'm hit right. I basically try to get into him and to him. To Noria or Eric. I don't really ever talk to Avish. I can DJ unless they ask me stuff directly, which happens here and there. Or Stacy will tell me they asked me something, which happens more frequently. the other? Did you answer their question? What question? They asked your question.\n00:48:06 - Tina Marie (profitdriversinc.com)\nOh, okay. Well, I just think like just the hiring and the giving the jobs and who does what you do that and it's not represented here.\n00:48:25 - Dan’s iPhone\nI think there's not even the same. Well, it's not because I hire people on a lark for like random that I do, right? when I hire somebody to do a straight, I mean it's whatever.\n00:48:45 - Tina Marie (profitdriversinc.com)\nSo it kind of falls under ideas.\n00:48:47 - Dan’s iPhone\nYeah, it's so infrequent. It's not frequent or there's no level of permanence to it. These that grow up permanent, although even\n00:49:00 - Tina Marie (profitdriversinc.com)\nOkay, so let's get down to production then.\n00:49:13 - Dan’s iPhone\nWho singing? This is. Traverse.\n00:49:31 - Tina Marie (profitdriversinc.com)\nI thought somebody in the office was singing because I can't really like hear music. It sounded just like somebody in the background singing without music.\n00:49:41 - Dan’s iPhone\nThere is the music. It's a lie about.\n00:49:48 - Tina Marie (profitdriversinc.com)\nOkay. So. And Eric takes over like any new projects, right, he's like in charge of them? No.\n00:50:23 - Dan’s iPhone\nNo. Okay. So it's, I mean, again, this is where you'd say it's like the WordPress team, but it's not even, it's, that's the thing, right, I don't even know that there's really no dev in production. It's done over here and then given to production.\n00:50:52 - Tina Marie (profitdriversinc.com)\nOkay, so define the process. What happens when you're like, we need a new site, or we need to migrate site.\n00:51:00 - Dan’s iPhone\nwhatever. It gets Stacy's sense of damage. That's it. Okay, so like Bobby doesn't know Eric doesn't get the introduction Stacy, not Bobby. Right, that's what I'm saying. Like Bobby's definitely not down here.\n00:51:20 - Tina Marie (profitdriversinc.com)\nOkay. And then would you not maybe just drag that up and then like take the lines over to WordPress instead of things underneath it.\n00:51:48 - Dan’s iPhone\nWell, so over here there this is where they do dev outside of like for product not as part of production like so let's say that these guys I'm trying to think of it like them doing this whole block thing like it has nothing to do with production.\n00:52:06 - Tina Marie (profitdriversinc.com)\nIt's part of WordPress, so it's like production is just like, I get that, I get that, which is why I'm saying production is its own block, but it links to those people that already exist on the org chart rather than duplicating them on the org chart.\n00:52:30 - Dan’s iPhone\nBut no, right? So yeah, mean it would go to these two guys, so you could definitely do that.\n00:52:38 - Tina Marie (profitdriversinc.com)\nAnd those two guys are still serving the same overall skill set function in the business. It may be a different department that calls on them, but I think, so I always think in terms of simplest, right? Rather than have a whole bunch of blocks and positions and seats, whatever, sometimes we have, I mean, whatever, they are the WordPress people and they're, they're used for internal and, and other projects. I just, I just don't think that any name should be repeated more than once if we can find a way to organize the structure that really shows what it actually looks like and I don't know how else to explain it. I'm bringing us not doing that well, but I don't, I think that we should try to, I think the simplest format is one where one person's name only shows up once and everything that's attached to them is attached to them.\n00:53:46 - Dan’s iPhone\nYeah. Yeah.\n00:53:55 - Tina Marie (profitdriversinc.com)\nBecause that's more accurate like we, it's a lean team. If we can, I think having the ability to visualize its simplicity, as it is, will help us as we're looking at growth, but also as you look at other projects that you're maybe influencing, or even just like, like David, you know, if you're having a conversation about how simple things are, and go like, look at this, this is my team. Look at everything that we do. You know, you've got another 71, which is a different org chart, it's a small, but it's still a small team, and it's still, you know, almost a $4 million.\n00:54:44 - Dan’s iPhone\nIs it? don't know where it's at Okay.\n00:55:03 - Tina Marie (profitdriversinc.com)\nYeah, you know that that's and how you know how many of them are actually full-time Or work full-time Work full-time None Yeah, so Probably. Yeah Anyway, just that's the thing is And the other thing is when it starts to get too big and too complicated is when implosion happens and that's relative Impertinent and important information for somebody like David because he tends to Just go to horizontal And David who go ahead and I'm just saying you have a habit, like people ask you for advice and sometimes that leads to new partnerships, but either way, if you have a visual way to represent how simple your step is, number one, I think we've run it better, I think you are better, you know, help other people that you just, you just do it anyway, but now you've got a visual tool. Well, I don't think we have enough visual representations. I don't think there's enough documented for any of our stuff, and especially in its simplest form, and I think that that's something that I think it's a lever that's been neglected and definitely because I haven't been helping it the way I should. Wow, you are first key today. Remember that the commercial for Frisky food for the cats, they were just pouncing on everything. I'm like playing with balls. That was the assignment today, Dan. But please put Greg in design because it's driving me next that it's TBD this long.\n00:57:42 - Dan’s iPhone\nI already did that.\n00:57:44 - Tina Marie (profitdriversinc.com)\nThat's weird.\n00:57:45 - Dan’s iPhone\nIt was because he was in a different block. No, I just moved this block.\n00:57:50 - Tina Marie (profitdriversinc.com)\nI didn't see Greg show up.\n00:57:53 - Dan’s iPhone\nThere we go. I mean, here's the thing, right? It's like, do you even separate production? I mean, I guess we could do. Oh, I gotta go backwards now. I can use myself.\n00:58:18 - Tina Marie (profitdriversinc.com)\nIt's worth the effort. I can almost guarantee them. Can't, because it may not be this way, but you going through this, you'll just be driving along and have another epiphany because you saw something that you didn't really notice, you saw. Every time we do a visual exercise, something comes out of it that wasn't anticipated.\n00:58:50 - Dan’s iPhone\nThat's pretty, this is pretty much it. Because Greg Design exists outside of production, technically. sometimes he designs stuff. that has nothing to do with production, right? it'll be doing logo, it has nothing to do with the thing being built. So like, I think you're still producing it. Yeah, but it never touches these guys, never touch it. They never see it as nothing to do with anything down there. So it's like, before me or like, so right now he's doing a graphic for fan flowy, right? Which is, I mean, that's not even on here, right? Well, it is the site's being decided and well, it's just four. It's like part of would you put it under maintenance? No.\n00:59:55 - Tina Marie (profitdriversinc.com)\nEven if it's just straight under production, it's under production. It would stay to not send Greg information?\n01:00:02 - Dan’s iPhone\nNo, it goes straight from you every time. Like 99% of the time.\n01:00:09 - Tina Marie (profitdriversinc.com)\nI still think it's under production of some sort. It doesn't, I don't think it goes straight under operations. Or you change it to, it's not production, it's a website or something or website specific production that Stacey is over.\n01:00:52 - Dan’s iPhone\nWell, that we don't design is not just websites, right? I know that's what I'm saying.\n01:00:59 - Tina Marie (profitdriversinc.com)\nYes. Is that website? Site production is one thing and design is another thing and design goes under, you know, like it's attached with like finance, DevOps, legal, all that, it's its own department and then website production is its own department and design gets linked the same way that WordPress would get linked under website production and DevOps.\n01:01:30 - Dan’s iPhone\nIt's to, it's a trick, to make an elbow. It sounds familiar but I'm not getting a visual.\n01:02:00 - Tina Marie (profitdriversinc.com)\nWell, there's a wait.\n01:02:01 - Dan’s iPhone\nWasn't an epic?\n01:02:02 - Tina Marie (profitdriversinc.com)\nthink it was an epic. Anyway, there's one of these, uh, it's either that or Arthur and the Visibles, but I think it was an epic. And there's this dad that gets, his daughter gets shrunk down. And so he's giant and he's hurts his elbow and like he says it like really slow, but she's tiny and he's huge and my kids for years and years and years, is randomly will just, if somebody says elbow, at least just like reenact that whole thing.\n01:02:39 - Dan’s iPhone\nIt's a thing getting bigger.\n01:02:44 - Tina Marie (profitdriversinc.com)\nOh, your, um, chart? Yeah, because I think it's, it's fixed and maybe you have to like zoom out. But just drag it, drag those things up.\n01:03:02 - Dan’s iPhone\nDid you do that?\n01:03:04 - Tina Marie (profitdriversinc.com)\nYeah, I did that. The lines didn't follow. If I try to drag the bottom ones down. Oh, I know. Like that. Yeah. Yeah. Yeah. Oh. Oh. Yeah.\n01:03:53 - Dan’s iPhone\nI think Greg disappeared again. And and What if you put\n01:05:00 - Tina Marie (profitdriversinc.com)\nI don't know. I'm thinking about like production being to the right of DevOps and then that is Stacey.\n01:05:18 - Dan’s iPhone\nDevOps, they're developing like, for instance, basis itself. No, if they're developing something for fan flowy, if they're developing something for perfect wedding timeline, like those things have nothing to do with WordPress. Like Stacey has not worked on perfect wedding timeline ever.\n01:05:47 - Tina Marie (profitdriversinc.com)\nThat's not what I'm talking about. So I got to get through all of this to see what I'm talking about. But goes straight underneath you as the visionary and under, I mean, they're Stacey anyway, as liaison, which I don't think, I mean, don't know if she's like, maybe they're co integrators.\n01:06:18 - Dan’s iPhone\nHe doesn't ever, she doesn't do anything with like rocks or running the meetings or like he does all that stuff. I mean, the liaison thing isn't even going to exist anymore because if I get rid of all these partners, that's like, who's there to leave his with?\n01:06:38 - Tina Marie (profitdriversinc.com)\nGet rid of all these partners. So like, are you not going to do strong marriage now and vinyl beats and all that stuff?\n01:06:45 - Dan’s iPhone\nSo there's no one to talk to a strong marriage now. There's no one to talk to with vinyl beats. Like in my version of the world, like I just pay those people. Like, I don't talk to the strong marriage now people in years.\n01:06:57 - Tina Marie (profitdriversinc.com)\nWhat do you pay them?\n01:07:00 - Dan’s iPhone\ntheir rip So they get their rip their their profit share But I don't talk to them.\n01:07:11 - Tina Marie (profitdriversinc.com)\nOh You pay them because the money comes into your account, and then they get their their portion.\n01:07:16 - Dan’s iPhone\nYeah Look So that's The partner thing is old right Glenn's gone wolf or like That's I think that's gonna be gone Does Bobby give Stacy instruction about how to do her job and what to do On a regular basis now More often than not No So so this is my thing is I don't think we're pretty like do we prioritize the hierarchy of Tasks or people\n01:08:00 - Tina Marie (profitdriversinc.com)\npeople. And I think it should be tasks or people because it's an accountability chart.\n01:08:09 - Dan’s iPhone\nOkay.\n01:08:10 - Tina Marie (profitdriversinc.com)\nSo I think that and that's where my brain has been going with this is who's accountable to who for what. But primarily, first it's who's accountable to who for what is secondary.\n01:08:27 - Dan’s iPhone\nSo you forget it, but you have to separate the people from the role, right? Ultimately, the integrator like these people are accountable to the integrator before me, right? like Bobing talks to Abhishek and BJ once a week. I've never spoken to that and literally I've never spoken. So they're being accountable to the integrator.\n01:08:53 - Tina Marie (profitdriversinc.com)\nHe's making sure that she doesn't talk to them to know. Is Stacy accountable to Bobby?\n01:09:03 - Dan’s iPhone\nMe, she is, but they don't really communicate very well.\n01:09:07 - Tina Marie (profitdriversinc.com)\nBut is she accountable to him and he not accountable to her?\n01:09:12 - Dan’s iPhone\nYeah.\n01:09:13 - Tina Marie (profitdriversinc.com)\nOkay then. So I'm thinking that Stacy's line is on the same line as finance operations legal and DevOps.\n01:09:25 - Dan’s iPhone\nWhich, but what line is that? What is that role?\n01:09:30 - Tina Marie (profitdriversinc.com)\nWell, so, okay, so the role in the people, this is my issue with these systems, is that you have to choose what matters most because sometimes they don't agree with each other and they don't reconcile. And I think that it's more important that it be the people and the accountability in world. then the seat first in a very small team what I'm you're saying this block up here this thing yes I'm saying that doesn't exist okay then get rid of that yeah I don't think that exists okay so then the next thing is um I think production is on the same line also as finance as operations legal dev ops I don't think operations exist I mean look at it the only thing attached to it is production so then just put that into production move Stacey there and get rid of the operations block right because these are the same yeah yeah I mean that's as it exists right now I'm trying to hold on be still one tick actually I gotta run to the back.\n01:11:21 - Dan’s iPhone\nOkay, I play with this then Okay, I'm ahead look You I'm just go I can of I'm go ahead and see if I can Hi.\n01:13:00 - Tina Marie (profitdriversinc.com)\nI it. I did not break it.\n01:13:02 - Dan’s iPhone\nOh. I'm dead. Now it's ruined.\n01:13:08 - Tina Marie (profitdriversinc.com)\nNot ruined.\n01:13:10 - Dan’s iPhone\nYes.\n01:13:12 - Tina Marie (profitdriversinc.com)\nSo, um, what I'm wondering is. Okay. So production is websites. There's nothing else right.\n01:13:22 - Dan’s iPhone\nSo is that not redundant? Um, well, the problem is. Design is not a website, right? So design has to go down there. Design is not always websites.\n01:13:35 - Tina Marie (profitdriversinc.com)\nRight. um, what I'm saying is like there's production and then design comes off of that and then new maintenance, whatever. I don't think we need to have a thing that says websites because that's what it is. Period.\n01:13:50 - Dan’s iPhone\nYeah, but new and maintenance. Well, new and maintenance are new website maintenance website, but I'm just saying the block website goes away. Right. Right. Right. I'm going to it, technically.\n01:14:05 - Tina Marie (profitdriversinc.com)\nSo, like, new site. Right. And then what I would, I would want to see is like a line. Well, he's not a fan, nevermind. And do what I did. Okay. Does Norio ever use Abhishek and Vijay? Does Eric use them under DevOps?\n01:15:15 - Dan’s iPhone\nI mean occasionally.\n01:15:21 - Tina Marie (profitdriversinc.com)\nOkay, and also so under maintenance site, would you put Eric there?\n01:15:28 - Dan’s iPhone\nNo, he pretty much never does.\n01:15:32 - Tina Marie (profitdriversinc.com)\nAnd new sites like who does that?\n01:15:37 - Dan’s iPhone\nSo primarily that gets issued to Abhishek and then Vijay. Those two are like one guy. It's like they're like a duo. I don't even know who does what. I just know Abhishek's more of the PM of their thing, right? Abhishek's very organized. Yeah, yeah, I think they have. I mean, the other thing is you could get rid of Abhishek and Vijay and just call them one thing. Yes. Whatever their company is, the camera and the name of it. Yeah. You could do that because I think they also have a guy that we never interacted, but that they take the work done too.\n01:16:21 - Tina Marie (profitdriversinc.com)\nSo I think that's the thing to do. New site and maintenance site gets to be their agency, whatever it is, and we can put like a little note off to the side that agency is defined by Abhishek, Vijay plus whoever.\n01:16:40 - Dan’s iPhone\nYeah. So then I mean, yeah, can't put it over under here because Stacy never taught us the story of it. No more.\n01:17:30 - Tina Marie (profitdriversinc.com)\nIs there a spot for Munir on here or is he just like?\n01:17:35 - Dan’s iPhone\nHe's just temporary.\n01:17:37 - Tina Marie (profitdriversinc.com)\nConsider like in the idea realm because you talk to him and that's not a permanent situation.\n01:17:44 - Dan’s iPhone\nYou like yeah he's just temporary it's like it's a it's not permanent and it'll never be.\n01:17:54 - Tina Marie (profitdriversinc.com)\nOkay. So, what's the difference between new site maintenance and word press development?\n01:18:25 - Dan’s iPhone\nLevel of development. Or Eric is?\n01:18:29 - Tina Marie (profitdriversinc.com)\nNo. Right now where you're at. In the production.\n01:18:37 - Dan’s iPhone\nLike. Yeah, it doesn't really exist.\n01:18:44 - Tina Marie (profitdriversinc.com)\nThat's what I'm thinking.\n01:18:46 - Dan’s iPhone\nNot here. Yeah. Yeah, now you're just like.\n01:18:58 - Tina Marie (profitdriversinc.com)\nSo if you can't remember that company name, which\n01:19:00 - Dan’s iPhone\nIf you just go ab slash beach. Well, we literally call them and there you go.\n01:19:08 - Tina Marie (profitdriversinc.com)\nYeah, that works.\n01:19:19 - Dan’s iPhone\nWork. Scrap. Ah, what is it doing? Pretty great. Oh, come on. You\n01:20:30 - Tina Marie (profitdriversinc.com)\nHow and why did the yeah, okay OK, I was like, where does this come from? All right, this seems more accurate for what we have, and also what we'll need going forward, even with podcasting and stuff like that. Like, I'm just thinking of my mind. Do we have kind of a side chart over here of what goes under what, like, what in terms of, like, the maintenance? So we just kind of have a list for an example of, like, maybe a reference point. In my mind, I'm just thinking, like, what's the list of the maintenance projects? Like the paths or? No, no, and this wouldn't be part of the accountability chart, but it's kind of my, like, the next step. And how have we already been here now? for half, but okay. Anyway, it went fast for me. But this is good. But what I would want to do, so the next step to me of the conversation, not to me, this is accomplished, and I think it's good. But the next conversation I would want to have is, okay, what are we working on right now? are those stages? kind of plotting out where you want to go for the rest of fluid in terms of the conversations with Joe, like I think it's a very fluid pace, a loose pace. But I do think that there's some identifiable potential targets, emphasis on potential, right, because there's no contract, there's no anything. But I think that our experience, especially with people like Joe, meaning Joe is a one that is more guided than guided. thing. And if there's something to be done, you're the one or, or, but what he's got Heather, though, you know, that, that puts the framework and the outline of what is going to happen up. And I think that that's a conversation to be had and something to be working on for the rest of the year. In terms of like, what is the evolution of basis? That seems to be where the conversation goes most. Come in. Hold on one sec. Okay. Like we're wrapping up right now. Just a couple minutes. Okay. So that's where I would like to be talking about things and discussing next week and just kind of at where is basis going. Again, you know, there is a pace and a rhythm to it, which is pretty relaxed. But for it to get potential and to be able to keep traction in the best way that it can without being forceful and rigid, I think that's the conversation to have is to just kind of break down, okay, what could be happening, what are we going to be working on moving in specifics in terms of a project with Joe or anything else?\n01:24:32 - Dan’s iPhone\nYeah, got to.\n01:24:35 - Tina Marie (profitdriversinc.com)\nThis looks crazy different. you should go do a before and after like all the blocks we had.\n01:24:42 - Dan’s iPhone\nThere go.\n01:24:43 - Tina Marie (profitdriversinc.com)\nDude, yes. So one, two, three, four, five, six, seven, nine, 10, 11, 12 blocks compared to one account. That's at least cut in half.\n01:24:53 - Dan’s iPhone\nBut I feel like it's cut by like 65 way more.\n01:25:02 - Tina Marie (profitdriversinc.com)\nthat's good. That's good. All right, well, my brain wants to go ask a bunch of other questions, but my mom do these any minute.\n01:25:13 - Dan’s iPhone\nSo my next meeting is going to walk in the door.\n01:25:17 - Tina Marie (profitdriversinc.com)\nOkay. Well, then I release you.\n01:25:20 - Dan’s iPhone\nYeah, they're texting me right now. I'm like, I'm not going to answer this text.\n01:25:30 - Tina Marie (profitdriversinc.com)\nYou\n","contentPreview":"00:00:05 - Dan Ryan (danddcompany.com)\nThere we go, there we go.\n00:00:10 - Tina Marie (profitdriversinc.com)\nYou ready for orange charts?\n00:00:14 - Dan Ryan (danddcompany.com)\nYeah.\n00:00:15 - Tina ...","processedAt":"2025-05-04T03:40:52.601Z"}