{"fileName":"Done Transcript for Maria & Tina🪄(2).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Maria & Tina🪄(2).txt","type":"transcript","priority":"medium","content":"00:00:03 - Maria Gudelis (Maria Gudelis)\nHey.\n00:00:04 - Tina Marie (profitdriversinc.com)\nHi.\n00:00:05 - Maria Gudelis (Maria Gudelis)\nHow are you?\n00:00:06 - Tina Marie (profitdriversinc.com)\nNot as sleepy as yesterday, but still sleepy.\n00:00:10 - Maria Gudelis (Maria Gudelis)\nIt's so much harder for me because I'm like three hours ahead of you, right? So I'm like, let's go.\n00:00:16 - Tina Marie (profitdriversinc.com)\nYeah. If it was not time for me. That's, that's my, that's my highest spot. Yeah. I'm still adjusting. So let's, let's get into it.\n00:00:30 - Maria Gudelis (Maria Gudelis)\nWhat are you working on? Yeah. So I've got, I'm pretty excited about that. just share screen real quick and show you a couple of things that's working out really well. So this is the free school community that I'm doing just to kind of build up momentum. You know, my mojo back and stuff. So I haven't really launched yet, but I just got 10 members, just from family, friends, email. I didn't even email anyone yet, but tomorrow I'm going to launch it all. Anyways, I need logic. See, this is what I've been creating all the pretty stuff that will start here if the doggy It's so simple like my brain just goes, that's not that hard to do, but like I never think of stuff that looks that good. I think you That's one of my my funnels compared like my low ticket funnels for those images. They definitely help. Yeah. Yeah. So anyway, um So and then we're gonna have them complete like I'm gonna make a little road map image for them that once they Get get on that they get you done Aaron Fletcher stuff No, no, okay. Just curious. Yeah, but but you know what I do respect him a lot I've saw it when he and Frank heard of their stuff I think I bought something at Aaron Fletcher's literally 10 years ago and you know, know he's a cool dude I found it overwhelming. think one of my friends bought his stuff and she showed it to me. I'm like My brain just got like overwhelmed Yeah, and actually there's a lot of gaps in it.\n00:01:59 - Tina Marie (profitdriversinc.com)\nHe gets very Very very excited and this is not a bash on him thing It's just it's always interesting to me because he has a huge fan base Dan loved it and then he was like, but it's missing this this and this and Anyway, the one thing I get is that nothing's perfect and we all should make our stuff Yeah, oh, no, you're right, right?\n00:02:20 - Maria Gudelis (Maria Gudelis)\nSo so anyways, um the reason why I didn't want you it's so funny because it's like oh now There's this thing. Oh . There's that this thing because the minute someone joins you ask for their email, right? So now I got a zapped active campaign and because I didn't want to learn another email platform or anything Whether be go high level you know for free or whether it be a system. I know I'm like now I'm gonna just I've been using active campaign for over eight years So I'm just gonna so I had to create this app for that and they're like oh before they come in and like on the start Here folks, I'm gonna make in the community. I want them to come I'm gonna have every I might change around But right now Wednesdays at 10 a.m. Coffee Hour with Maria. So just once a week. So it's really like a disguise webinar too like upgrade by my thing so there's that and then I start to make the levels because there's leaderboards and these this is boring I want to call this maybe lurker and level two action to do.\n00:03:14 - Tina Marie (profitdriversinc.com)\nOh I love that.\n00:03:16 - Maria Gudelis (Maria Gudelis)\nYeah yeah since to make it fun right and then um and then the about I have most of this done but I just need create a VSL and I'm just working on a VSL script this morning and um and then by the way here's the community so this is why I like all this in one place by the way um but I'm going to tell you something um Tina that I realized when I was writing researching the VSL this morning I reflected I've done a shitload of VSLs like a lot yeah let me share something with you because I was actually I had an 8 a morning meeting with this guy I think as an india um and are you seeing the right screen google right now? don't know. Oh okay wrong Great. Let me I'll bring that over here. Oh, it's like this big. And you to read it that was.\n00:04:11 - Tina Marie (profitdriversinc.com)\nAnd so, so you know I see your desktop and BSL school.\n00:04:16 - Maria Gudelis (Maria Gudelis)\nHermoji dot text. Oh, that's it. Okay, I'm sharing one on desktop.\n00:04:21 - Tina Marie (profitdriversinc.com)\nOkay, there we go. You see this now? Yes, ma'am. Now I see.\n00:04:24 - Maria Gudelis (Maria Gudelis)\nWell, now see you too. Yeah, that's our one. Okay. So my this is my old YouTube channel like if I go. Videos and not if I go oldest 15 years ago.\n00:04:35 - Tina Marie (profitdriversinc.com)\nOkay.\n00:04:37 - Maria Gudelis (Maria Gudelis)\nBut here's all these people testimony. So I think I'm going to just use this one because he's a YouTube address. I started a new one because I haven't really used it much and these are really old videos and most of them were just embedded onto a sales page. For testimony of sales. He's like, you know, if you had like 10,000 subscribers and you barely had any activity on it over the last like 10 years. I'd say, yeah, do new one, but I kind of like how you've gone. Like a little bit of subscribe for her one, but I kind of like how you got videos from like 15 years ago Because then yeah Yeah, credible. Yeah, so so then I showed them then I was looking at this and I showed them some of the VSL is like offline consulting Oh, I like self-incorporated. but my business off the money mind map cash flow So this is like look at all this is so cheesy You know what works works. It's yeah, it fascinates me how The humblest videos just work so well. Yeah, so I know these videos I could show 13 years go 30 Yeah, but these videos brought in like in in my You know warrior form whatever I have like half a million dollars of sales 30,000 customers of just $17 $5 $1 dollar little information products, right and showing you've been doing micro offers a long time yes yes but also here's the the aha moment most always had some kind of VSL and you know this is what I upgraded and made a little video studio my background and downstairs like yeah dancing all that stuff your energy is one of my favorite things about you I love it I'm a bubbly girl and yeah I'm just like she is vibing that's my girl yeah yeah so so here's the thing two big things so the aha moment this morning when he's like oh wow you know lot of views over these videos what is that so well that's really like a VSL for on the sales page you go speed sells huh because you realize that Alex Hermoni just did a training yesterday because once a week Alex Hermonci goes and does free training within the school games and he was training them on how to do a proper mini VSL that goes on your about page and if I were to share the right desktop now desktop to if we come back to school, right? So about most people have a video here. So, so like, if you go, don't search, I don't have to go here and search, discover communities. Okay. so, I don't know, is there a VSL here? Yeah, see if she's got a VSL right here? Alex Hermosi just because they have access to all the school communities, right? He said that when people have a VSL on it and also work on improving it, it makes up for like, it was a crazy statistic. I'm going to go grab it from that video, but it was something like, like more than double, like maybe 300% higher conversions. If there's a VSL here. And as you know, they're, they could do Maybe every three minutes, they can be 10 minutes long, but the point is when I was showing the guy in India's name is Harut. That he's like, you're back on the experience and I love micro offers and we wrong, but there's a huge need to to done for you or help them with VSL specifically for your school community.\n00:08:14 - Tina Marie (profitdriversinc.com)\nSo, yeah, this gets into the conversations we really need to have, which is to go through your values and really think about your time. So there is this much time that we have, right? But it isn't just about time for money. It isn't just like there has to be fulfillment, excitement, joy, all these things. So one of the things that I was talking about is I love hybrid work. Okay. have so I have an Etsy store that I barely touched, but when I want to be creative and I want the outlet and also because when you create a product and Etsy, stays there forever.\n00:08:53 - Maria Gudelis (Maria Gudelis)\nYeah, I'll just randomly get sales.\n00:08:56 - Tina Marie (profitdriversinc.com)\nAnd I put things out there that are in my heart, their spiritual things. or funny things but funny clean things and it just stays there there's almost no cost to it and I've only been doing it for and not even whole year but I know that I'm going to want to keep it and I will just get random sales it's not a profitable business but it is one that it fulfills a need and an outlet and I enjoy it and I am okay with it breaking even honestly it could be a loss and still be beneficially beneficial for me tax-wise because I don't have enough investment so then I have my high-level thousand dollar an hour clients and they keep my sauce sharp I have to be on my tiptoes all the time I have to stay on the cutting edge of technology I always have to be thinking about them looking for leverage so it keeps my brain very very sharp to work with these businesses because they want to invest and show up and not have, you know, results every week. And I love doing it. And it doesn't stress me out though, because I have the benefit and especially because of how much I get paid to choose my clients carefully. And they just bring me people that are good matches. I had my attorney gave me a doctor gave me his wife. He's having me work with his wife. Like what an honor that it's just amazing. Anyway, so it's fulfilling. It brings me joy and it's super high level. But my mama heart, my I have been bankrupt from divorce. I have raised four children on my own while this narcissistic threatened them and hurt them and threatened me and hurt me. And I struggled so much. And it almost broke me emotionally. I almost broke my babies and I created this freedom to be able to be home with them all the time. And when they started struggling in school to rip them out of school and say, we'll do it our own way, they're not going to give us what we need, come home. We will fix it. We will do our own thing. when you want to go back, you go back on your own terms and you know that when a teacher or a principal tells you act right or else, you can be like, I got the or else right here. I got the or else. And so now I have these amazingly empowered children and I want that for other moms because they don't have, like I was born with fire. I was born with retaliation and I was born with a brain to be able to create solutions from the time I was an infant. I am not normal. And I can't give people my strength exactly and I can't give them my brain exactly, but my energy is contagious. I can give them fortification, people do feel stronger when I talk to them and they are smarter when I talk to them and they are clearer and they don't have to be me. I give them something that when it attaches to them it's part of them forever but they can't afford a lot so but if I did only that you know I wouldn't be that part of me that wants to operate at the high level she would she would languish and that part of me that wants to be created and put God out into the world on t-shirts and hats and things like that she would languish and so I have all of these things and so while you're creating your offers now here's the thing we have all the time we have until we're not here anymore right there is no urgency unless you can't afford to pay bills. Yeah. So we get time to figure things out and it doesn't have to be perfect. what I think that you should think about is what sparks joy in you first of all to create and to work on but second of all to give and to deliver to someone else. And what kind of people do you have joy serving? What kind of people maybe pay you more money but just leave you feeling dirty afterwards.\n00:13:31 - Maria Gudelis (Maria Gudelis)\nThere's a lot of those. Yeah. Yeah. And you know when I did some of this too since I last talked about what past things you've done but also I think over last month and looking at it and like it really came down to still being like I really do love crafting like giving birth to these finals. Like I really do because there's so much creativity in it, right? You know and I do enjoy working. can't really take it. side. I do enjoy working with beginners that take action and do it, right? But I hate it if they're the ones though that are stressed for money. It's like, oh my God, Marie, I gotta make money with this or else it's gonna, I'm not gonna be able to say rent, right? And I do enjoy working with existing business owners. Like that was in the joy belt, if you sell stuff, because some of the little take of funnels, power graphics, some of them, I'm like, no, you need to do a VSL, like one guy's that I'm dealing with a channel, a great guy, his dad's a doctor, runs these wellness anti-aging longevity clinics in Vegas, and has a real thing like, you know, that people go in and use that. So we're making little take a funnel for him, like, well, he's got to be on a VSL for doctors' white coat. So, but I enjoyed crafting his VSL for him, like the words, the script. And part of it, yeah, I was chat GBT, but a lot of it was also in my mind and looking at all the stuff. So that's where I kind of thought about the done for you VSL type service, because it's great. creative and it's done in a day for someone rather than like these little ticket funnels as I'm your client of mine can take like now instead of today's months for someone right. So and when I did this exercise a while ago, kind of a Venn diagram of my skill sets, people I've worked with and made money for. And then the third thing is, what do I really enjoy doing? It did still turn out to be working with women, typically they're over 40, typically they already have an audience and they have some kind of form of expertise. And I kind of just help accelerate like put gasoline on their business and accelerate their sales. sometimes it's not like I'm kind of full stack. Sometimes it's not a low ticket funnel. Sometimes it's a it's a free challenge, right? that then goes right to their $1000 course or their high ticket thing. So it's really, I guess it's just babying, birthing, a new marketing. If I had to summarize it and one thing, it's birthing, creative or innovative marketing campaign that gets them sales, builds up their list, audience and builds up their sales. Because you know what, I was looking today, the challenge ads that I created, because it takes a lot, as you know, brainpower to create something that really works and test it to get it working for ad copy. The product boss that went from zero to one million the first year and then one to four million second year, now they're probably at 10 million run rate. They're, I think it's the fourth year now. They're using the exact same ads and. I'd copy from four years ago when we first launched their challenge four years ago today. So I looked at, because they run it every, they run the challenge every September and October, rock your holiday promotions. And then in January, we have a different challenge where it just is more about how to grow your product based sales. But it's the exact same ad. So, you know, they almost got like a franchise in a box for me, like it's everything. And like, they didn't even know what kind of course to sell at the time. They didn't know what to say on video. So I did VSL scripts for them too at the beginning. But yeah, I love being innovative, like with my ads, with the creative, like I had Karina take a picture of you with a pie, a piece of pie, right? and now we're doing an ad that says, Hey, would you like a slice of the, you know, X billion dollar, you know, e-commerce pie, with my black lab, I have a burnagetal now, but when I was like, wow, I used to do videos with putting a pink bra on on on her back when I was walking her or just for something different for a video.\n00:18:08 - Tina Marie (profitdriversinc.com)\nYeah.\n00:18:09 - Maria Gudelis (Maria Gudelis)\nYeah. And then so then when I do webinars, okay, the game here is whenever you see the pink bra, one of my slides is like the Easter egg hunt or whatever you call it. You know, someone's gonna win a prize. And so when I was teaching that back then it was go to webinars, Zim didn't exist. If someone the first like I'd then have a big bra baby on the right corner of one of the slides on the 15th slide, whoever said pink bra first, comments, one like a, you know, $50 on gift card, you know, just things like that.\n00:18:44 - Tina Marie (profitdriversinc.com)\nSo I think that we should kind of create this thing with with all the offers, all your products, all your income generating things that you have, even if they're old and they're still on warrior form and I can't. Usually they make sales. I think that we should figure out what your first of all Do you know what what your monthly expenses are just to live and exist and operate as you do off the top of your head?\n00:19:12 - Maria Gudelis (Maria Gudelis)\nYeah, it's really not much like 3500.\n00:19:15 - Tina Marie (profitdriversinc.com)\nOkay, so do you have steady 3500 a month at least income?\n00:19:22 - Maria Gudelis (Maria Gudelis)\nI had up until last week when the whole breaking off with Karina And all that stuff.\n00:19:29 - Tina Marie (profitdriversinc.com)\nYeah, yeah, so what are you going to have next month if nothing changed?\n00:19:35 - Maria Gudelis (Maria Gudelis)\nIf nothing changed, I would basically have Like almost zero, but okay, I am changing stuff right because right what had happened just so you know So you know how giving I am and how stupid I am Um like there you are Yeah, well about two three months ago. said to Karina Why don't we just combine to both our businesses everything's 5050 so all those little ticket funnels I sold she got half of that right? everything. I know. Yeah, that's why when like, I need to get over because it's the past and it's not a lot. But all the funnels that I helped her make over the last seven months are assets. And I have had her hire a VA and how to find the right VA enough work, who now is just contacting people because she did a two step post in the 5,000 Facebook, she's making about five or 600 a day she doesn't want to split anything with me.\n00:20:31 - Tina Marie (profitdriversinc.com)\nI would love to help you with this. And we have to figure out the words, I don't know enough to be able to say what needs to be said right now. But we're going to let her know what she is going to give to you. you don't need to back it up. But I promise you, if I help you with the language, she's going to believe you in terms of like what kind of legal stuff is going to happen. It's not going to be a big, long battle. There will be probably a little bit of confrontation and words, but I can help you all want to know all the details, all the numbers, everything, and then we're going to say this is what you're going to give me, and it's going to be assets, not money. don't want money. We want assets, okay, so, and you can say, or you can give me a very large amount of money or we can go to court, and here's why I'm going to win very quickly, and here's what I'm also going to sue you for, legal fees and everything else. You're going to scare the crap out of her. That's what's going to happen.\n00:21:43 - Maria Gudelis (Maria Gudelis)\nListen, just let me go ahead and finish.\n00:21:47 - Tina Marie (profitdriversinc.com)\nYou're going to in your heart know that you'll take less than what you're asking for. You just need to have some of your assets assets back.\n00:21:58 - Maria Gudelis (Maria Gudelis)\nAnd even you don't So my daughter was about to eat the cats, okay.\n00:22:03 - Tina Marie (profitdriversinc.com)\nIt isn't about wanting to fight. It's about standing up for yourself and not repeating old cycles of letting people take over. Now we don't, it's not bitter. It's not angry. We're not going to use bad language. We're not going to intimidate. It's going to be way more respectful than it sounds right now, but it is going to sound. But the energy behind it is going to feel so strong that it will feel like, who is this person? It's not going to be bad, but you need to practice, Maria. This is what it's about, okay. This isn't about bitterness. This isn't about war. This isn't about retaliation or anything. This is about you having muscle memory of saying, this is not okay. This is what I'm owed. This is what you're going to do. And I'm going to stand up for myself. So we'll find something that you're comfortable with, but please let me help you have that experience, because here's what I know. Not only is it going to help you, but you're going to now have some new level of experience in handling people that you're, I know you're gonna give to other people. You're gonna give to other people every time. You see somebody in that problem, and you're gonna be like, look, this is what we're gonna do. And we're gonna take care of it. And we're gonna stop having these amazing people be victims of other terrible people who take advantage of them. And for their sake, but also for the sake of who they serve, because we're sorry. So when we're hurting and we're suffering, because somebody has hurt us, we don't get to serve as well. So even Jesus went through and cleansed the temple, like he was and peaceful all the time. But you came into his father's house, and it was Whips. cracking tables, turning cast out. There is such thing as righteous anger. And when you defile the home, you had a home, you had a business together. And she, that was dishonest, that was just to be like, we're just going to parkways, and I'm going to ignore you, and I'm going keep everything.\n00:24:23 - Maria Gudelis (Maria Gudelis)\nAnd that's not Cass and Stone yet, because basically I called right away, and she said to that, I said, well, no, that's not quite right, because, you know, we've spent a lot creating a lot of disasters. of them were hers at the beginning to exist with, but I took her from average order value from $60 to $100 and more. But I, and I said, and I also put in my sales over the last two months into it. I'm just burned out, and I own Facebook, like, I started with 30,000 debt, which I didn't tell you when you first came on as 5050 partner. And I now owe them 7,500. That's why the ads have been turned off for the last two weeks. I just need to get out of debt and make back stuff, but why don't we just revisit this in all fairness because I don't think she's a bad person. She really isn't. She just, she just said, I'm just working out. Let me just see what I can do to drum up sales about ads running. And that's, let's then reconvene, whether it's in one week or 30 days and then let's talk, you know, because from my perspective, I think she'll be reasonable if I just say, I want all the list that grow grew since I started because all that money that went into ads. that's been about 10,000 a month. We made more than what we spent on ads. because you decided stop doing sales calls isn't my problem, right? you, know, that's when the sales always started dwindling is when she no longer wanted to do sales calls. So yeah, and then I would probably ask for some sort of percentage of the sales in the future or maybe just an agreed amount that she still owes me and that she pays it over time. I don't believe she's I really believe she was burnt out. She really was she is in debt. she's never lied to me at that part, but it's just it's whenever I started asking for all the financials because I want to get more granular detail to make better business strategic decisions. That's when she said, Oh, I don't think this is going to work out our partnership. I still to the state never got all the financials, so I know I have to walk away and I'm okay with that, but I'm not okay with I just see like away with nothing. Well, I see just see $2,000 of sales come in the last four days all organic using the VA that I had her go higher and using my go high level system that's from my friend that she's using the contact everyone via social she's using all my intellectual property to continue making this money. So once she gets the Facebook ad debt paid off, you know, I talked to one of my other friends and she said, people when they're in a corner will act and do stupid things even dishonest.\n00:27:00 - Tina Marie (profitdriversinc.com)\nSo sure, and it isn't about thinking she's a bad person, but we still don't get to abuse other people because we're in pain.\n00:27:11 - Maria Gudelis (Maria Gudelis)\nYeah.\n00:27:12 - Tina Marie (profitdriversinc.com)\nYeah. so, but if you have a plan, I just don't want to see you just take it. And giving people grace, for sure, that is something the Lord would have us do anyway. grace as much as you can give grace, but also, we have a requirement. And this is the requirement. And maybe it's that you control the money for a while and you're like, I'll take 10%. I've never been to Psalmist, so I will take it and I will give you the money and you can control it because clearly by your own admission, you can't manage the resource as well. If you want, we can have a contract and you can hold me legally accountable. I have no issue with that because I know I'm not going to take money or mis-match it or anything like that. Whatever resources you have, if you want to take things, then rebrand it and just be like, okay, you get a copy, I get a copy, I get the list, you get the list, we're going to do this, whatever, like be creative and think about what would make you feel good knowing that you handled her with grace, the grace that you would want to have given to you if you had been in that situation, even if you would never be in that situation, so that you know you feel right with God and what do you need to feel like, okay, I at least have something I've worked very hard for and maybe I've paid a price for not requiring proper accountability, not having proper boundaries and so this is going to cost me and I will pay that cost and experience but this is what I should have moving forward, so I think that you should get really clear on whatever that is and think about what you control and be smart about that, be willing to use what you control with the grace.\n00:29:07 - Maria Gudelis (Maria Gudelis)\nRight?\n00:29:09 - Tina Marie (profitdriversinc.com)\ncome off strong and powerful and hard, but it's always like I intend to have grace. And I just want to make it clear that I am not going to be subject to what you dictate. I'll be subject to what the Lord dictates, who tells me a lot of times. Come down Tina. I'm down.\n00:29:31 - Maria Gudelis (Maria Gudelis)\nYeah. Yeah. No, no. And you know, you're right. My fault too, that shouldn't have shared the revenue that was for my business with hers. I just really thought, hey, this will keep things going while things slow down in the summer. And you know, she was traveling a lot on vacation because she has yeah, I think, but yeah, part of me was like a little upset too, because it's like the fall is always the highest sales month for her niche, like how to start a boutique. Because You sell based on get ready for Black Friday, several Monday sales, that's when you can make 10,000 days, you know, but at the same time, it wasn't in my heart to continue always selling how to start a boutique and helping with that, because I feel there's better models online, like if my best friend came to me tomorrow, Tina, and said, I just lost my job, what should I do online to make money? I really want to do something remotely. It would not be started with clothing boutique dropship. And so I think that's why the sales also went down, because I realized over the last three months, my energy wasn't as much into the business anymore.\n00:30:34 - Tina Marie (profitdriversinc.com)\nMargins suck.\n00:30:35 - Maria Gudelis (Maria Gudelis)\nYou've had experience with good margin businesses.\n00:30:39 - Tina Marie (profitdriversinc.com)\nFor me, with the Etsy store, my friend is like, yeah, yeah, I'm like, I can't get excited about 10 to 20% margins, and you really have to work hard for 20% margins, and then I'm involved in it. cannot be excited, but I can be excited about having a little passive engine that gives me some joy. But like you said, and especially... in this economy right now, that is not where you start. That's where you maybe expand and branch out if you want to. But yeah, anyway, so sorry not to take over.\n00:31:12 - Maria Gudelis (Maria Gudelis)\nYeah, no, it's crazy. And I think that's why she needed to make that decision for her own too, because she knew my heart wasn't in as much like she sends out. So that's why I'm saying it's the end result is yeah, I just want to have a fair agreement. And also that we do still, you know, because I do consider that she became a friend, I just know that over the last few months, you know, she had that financial stress, I wasn't even aware of that she told me about so. Yeah, it's hard to end.\n00:31:47 - Tina Marie (profitdriversinc.com)\nI'm sure you know what that feels like I think we've all been in a place where whether it was money or relationships where there was something we're like, I don't need anybody to know that that's hard. Not everybody like you hopefully have somebody that talked to But so I would love and I've got time and I've got energy. would love to come up with a plan, especially knowing that you need to generate some revenue. Really, honestly, every chance we get, and we could be talking on it through Boxer, I would love to figure out. So when I'm working, now, I only have one client for the last, I don't know, eight years, who's ever been in the situation of I have to make money. Well, too, everybody else is seven and eight bigger businesses. But I have had plenty of opportunity with the two to really have to go through these exercises multiple times over. it is to figure out what your assets are, including those connections, who would, like, if you put out an offer that is, say, 500 to 1,000 or if you're going to do the DFI, mean you could get your You could do that for $5,000 for the right person and then your your month is done And you're not overburdening yourself with so much work that you can't have enough time to build the smaller offers That are easier to sell that you can sell in your sleep because you know that system really well And in the meantime, you're also sharpening your saw again and refreshing your memory on a VSL on all the market research that has to be done on the language on the system, whatever, and If you happen to be documenting your process as you go, I can't remember What thing I don't think it's descriptive something where If you if it watches your screen record, it will turn it into an SOP Which then you could use as training for the done with you or the do it yourself ESL. But I remember when Ryan Dies first did his split testing on VSLs.\n00:34:10 - Maria Gudelis (Maria Gudelis)\nYeah.\n00:34:11 - Tina Marie (profitdriversinc.com)\nAnd because he always came back with his split test results. And this was like 13 years ago. And then I also remember the first time he did a split test on three pay. And he noticed that there was like only like a two to five percent dip. If you tripled the cost by turning it into a three pay. So like if you had an 80% conversion rate, we'll say 30% conversion rate at $2.99, you would have like a 28% conversion rate at three payments of $2.99. It was insane. I don't know that that still works because the customers are so much more savvy now. But especially in NIM. For sure. I mean, TikTok, Instagram, all the video channels tells us that people love consuming videos. Old school videos where you were trapped in a victim. Now, the conversion rates, because I've also worked with conversion fanatics when they were brand new company with Justin Christensen and Manish Punjabi. don't know if you know who they are. But anyway, statistically trapping people increased conversions. But my premise was that it decreased retention and increased frustration. So the other thing is you have to decide our conversions. The ultimate goal is brand reputation, which ultimately leads to more referrals and leads to happier customers that stay longer, that will tell their moms and their dads and their cousins and their brothers about you. I mean, is that more important to you? So, for me, it's not the conversion isn't the end all be all but it's the quality of the conversion and the quality of the retention that matters and so that's a way that you can stand out in this crowd and be like conversion isn't king but retention is and satisfaction is because of that referral and whatever so you know in terms of like standing out for people like did you ever you know watch somebody teach you about marketing and you felt gross afterwards because that's how I feel about almost all of it but then did you ever watch somebody go for marketing you're like I didn't so I love I can't wait to do that I've seen that happen too and there was a that I mean there was a polar opposite yeah but the these ones over here be like I make all this money but I've been behind the scenes and so have you we know how much hustling you do we know how much lying you do we know how much quitting you do we also know how\n00:37:00 - Maria Gudelis (Maria Gudelis)\nThat's for you've been. We know that you've been almost bankrupt multiple times. We know that you have partners that hate your guts because you destroyed everything and it almost cost them their families if it didn't cost them their families.\n00:37:12 - Tina Marie (profitdriversinc.com)\nWe don't want anything to do with that. We want this. So these people might make less money, but I bet you they keep more money. I bet you they have less stress. bet they aren't popping roll age 24 seven and getting the divorce than having ulcers and heart attack like freaking Grant Cardone. Yeah. Whoa, I'm grinding. just had a heart attack, but I'm in this bed and there's my wife looking disgusted at me. He didn't say that, but she was looking disgusted at him because he was in their hustle, hustle, hustle, blah, blah. I'm like, you're an idiot. You're an idiot and you're bragging about being an idiot. You just like, please don't. So anyway, you have a beautiful mama bear. Don't be just douchey kind of gift to give and there are so many women who are like, I can do this, I can do this, and they're going to be so excited to see this. Now, there are women, but here's the thing. Also, a few years ago, and then five, 10, 15, 20 years ago, when I was starting, you were starting, women didn't have money to do this stuff. The moms that we're working with now, they're like, first of all, I have to ask my husband, second of all, we don't have that much money. And third, I've got kids uniforms to take care of, and I've got all these different costs and things like that.\n00:38:34 - Maria Gudelis (Maria Gudelis)\nWomen have money resources now that they didn't use to have.\n00:38:38 - Tina Marie (profitdriversinc.com)\nSo they can make these investments. if you want to get high ticket stuff, it has to be okay, you're qualified, and here's why, because you're already making money. I know that if you go spend this, you're not putting yourself in significant financial risk if this doesn't work. Because I don't want you coming at me next week and going, okay, did we break even yet? It takes at least six weeks on average, it can happen faster to get really good conversions to be able to dial in the audience, to be able to read out the apps that don't work, to minimize costs for higher ticket, right? lower ticket, it's not as long. But it also depends on your niche. then, you know, we want to test upsells and order bumps and all this testing and analyzing, that takes time. That's very time consuming. You also have to write all the follow-up you have to test that, you have to look at your open wrist, you have to look at your inbox placement, like the funnel is not just sales page, order page, page, page, like there's so many moving parts. And it's like, if you created a flow chart and showed them all of these things, first of all, they have to be created. But second of all, they have to be strategically created, they have to be researched. Then they have to be tested, optimized, nurtured, if you've never done this, you have no idea how much time it takes. Now the one thing I can do for you is collapse my 20 plus years of experience and I have been able to distill this most potent impact in a lot less time than somebody else can because I've got funnel after funnel after funnel after funnel after all these things in my head and all these test results and all of these things to work with. I don't have to go read a book, don't have to do anything. I can just look at it and go, I know this, I know this, I know this, I'm going to go research that assemble and that's what they're getting out of you but you're doing it in a way that because you care about integrity so you're going to help them show up with integrity in their own market, which these slimy guys aren't going to help them do, these slimy guys are going to tell them some practices.\n00:41:01 - Maria Gudelis (Maria Gudelis)\nYeah, we're going to help you build something that you're proud of that you're not going to be embarrassed if your mom likes that, or if your children look at and it's going to make you money like we can't promise FTC, all that stuff.\n00:41:16 - Tina Marie (profitdriversinc.com)\nBut we can promise that you've got something workable and that if you already have an offer that converse, right? And you're just looking to leverage it and build a more solid solid engine, then what I can do is help you increase conversions and I'm willing to, you know, put my put my money where my mouth is, mouth where my money is, whatever money where my mouth is. And you can put in a guarantee, like if you and especially if they already have an offer that converts. And so you put them through this questionnaire, right? So get all their stats.\n00:41:50 - Maria Gudelis (Maria Gudelis)\nAnd you and I both know most of them don't know their stats.\n00:41:52 - Tina Marie (profitdriversinc.com)\nAnd so you say that the offer is contingent upon you validating the stats, meaning they will show you and walk you through it if you create the guarantee, right? So no guarantee is you don't have to show me your stats. Guarantee is you have to show me your stats. I have to be able to get access to the conversions and see it even if it's just you and me on a zoom call walking through everything and seeing it because you don't get a guarantee if I'm not guaranteed that you were already performing at this level. My guarantee is I can give you at least a 5% lift. Period. Like 5% but then here's the other thing is so what does 5% mean? Well if they're making $10,000 a month, 5% is $500 extra a month. So how long does it take them to ROI a few months? Depending on what you're charging them, right? No but let's say I get you a 10 or 20% conversion increase and you're gonna you're gonna drive for that, right? So let's say you do that well not necessarily conversion increase but revenue increase because then the other thing you do is you go inspect all of their assets and go, you don't have an order bump. I'm going to create an order bump out of your existing content. I'm going to rearrange your offer, change your price a little bit, whatever. So you're not just DFI VSL funnel. You also do marketing consulting, high level, because that actually makes the most money for you and gives you the best chance at conversion. Look, let me review your assets. Let me repackage something. Then I'll build a VSL for you, but an entirely different offer, because you and I both know everybody's leaving money on the table. They are not doing enough upsells. They're not doing enough complimentary offers, or they're trying to throw everything in this huge stack that overwhelms the screen, and nobody's actually sitting there and appreciating all the things. Whereas if you took something and said, this is $2,000, and they're like, no thanks. Okay. Okay. This is $500, and you get these things, and this is why they're so powerful. Oh yeah, yeah, want that. Okay. Well, here's these three more things, but it's $250 more. Oh, yeah. Okay. Okay. Here's another thing, but it's $200 a month. But this is why you need that. Oh, yeah, that makes perfect sense. I told they want that. Guess what? You got your key, but you broke it down because I got you in an elephant one by the time you broke the elephant down. And now they got to make all these little micro agreements and go, yes, to that little thing. Yes, that little thing. Yes, to that little thing. now I'm not overwhelmed. I know exactly what I'm getting. I'm super excited about it. Yeah, we did business and you got a lot of revenue. Not everybody's doing business like that.\n00:44:41 - Maria Gudelis (Maria Gudelis)\nYou know that.\n00:44:42 - Tina Marie (profitdriversinc.com)\nYeah. But you can, you can do that. Like you could do that in your sleep. If you could see somebody's assets and all the numbers, tell me your brain wouldn't go.\n00:44:52 - Maria Gudelis (Maria Gudelis)\nI know what we can do to make you more. Oh, yeah.\n00:44:55 - Tina Marie (profitdriversinc.com)\nTotally. In your sleep, right? So, um, So you can do that and come up with like, pitch that to whatever, just really break that whole thing kind of down for somebody and say, this is what I'll do. This is what I need you to get me. And this is what I'll create. And this is what I'll back up contingent upon. You have X amount of revenue, X amount of conversions, X amount of daily visitors, X amount of ad revenue. Right.\n00:45:28 - Maria Gudelis (Maria Gudelis)\nYeah. So traffic is a must existing traffic is a must because you can't be having existing conversions if there's not existing traffic.\n00:45:36 - Tina Marie (profitdriversinc.com)\nSo I need to know you have something workable and I'm going to be your Lyft expert.\n00:45:40 - Maria Gudelis (Maria Gudelis)\nYeah. I love that your Lyft expert. And that's so true because someone in an SP plus, because I'm in that, I'm in Spanish B plus is 500 a month. And it wasn't his fast forward, but. Yeah, one lady approached me and she just paid me $500 last week for a strategy call and right away, I just said, you know what, you need to just offer this new thing for 297. You're people asking for it. Here's how you do it. You just ask if they're interested in email, you get enough yeses. Then you do two preteaser emails, make a sales page. Here's the copy from chat. She did it right there. And created the copy for said, go, go launch this and based on her stats. She definitely has an 875 person list, but most of them are low ticket buyers of her wellness PR bundles to other wellness coaches. I said, you should convert 3%. Like, and I helped her increase her email open rate deliverability as well. that call, it was a two hour strategy go. And so I said, you could make like $26,000 just with 3% conversion. So I'll find out for the end of this week how much money she's going to be.\n00:46:53 - Tina Marie (profitdriversinc.com)\nShe's going to shoot tomorrow. Yeah. When she's done it, get her to give you a video testimonial because another quick way for you to earn some money is do so.\n00:47:00 - Maria Gudelis (Maria Gudelis)\nand strategy calls. Yeah, well, and that's what I was thinking. I'm not stressed about it because I was going to launch a mini challenge next week, too, to my own list as well. I have a couple other people that wanted me to work for them. But I said, this was two months ago. said, you know what? Let me revisit this in September, in September, because I do want to take some time off the summer and spend time with my mom and all that stuff. So do you know Laura Catella? She's like, I've heard that name. She's the female copywriter. She's the wife of the famous male copywriter, Georgie Stepheye.\n00:47:38 - Tina Marie (profitdriversinc.com)\nYes, that's how I know her, because they are friends of a client of mine, Glenn Dotson.\n00:47:45 - Maria Gudelis (Maria Gudelis)\nSo she was introduced to me by one of my longtime students, Greg Gal, Ginger Sorensen, and she entered her math line, and loves it, and I saw Ginger's transformation over the last six months, just be amazing. But. Laura knows me as the low ticket queen as well, so she hired me for a strategy call couple months ago. So I helped her with conversions over low ticket funnels, but I said, you know, you really don't have anything piecing it all together. So she said, would you for 2500 a month in 10% of, I think she said profits, I can't remember those profits or sales, would you just take over all my low ticket funnels and optimize them all? And I said, let me think about it. Um, I know I could make her low money, but to me, I don't feel 10% is the right amount. Because why not just do that for my own offers? Yes. Yeah, but she's a great person to work with because of the influence she has.\n00:48:41 - Tina Marie (profitdriversinc.com)\nShe's really connected. I, that never works out for people. Almost, almost, almost never. Um, and when it does work out, it wasn't necessary in the first place because that person would have gave them all the connections anyway. Um, yeah. Um, so one thing that's what her offer as health stuff, right?\n00:49:07 - Maria Gudelis (Maria Gudelis)\nUm, mindset. Um, Laura's is mindset.\n00:49:10 - Tina Marie (profitdriversinc.com)\nThe girl that I'm helping this week and like last year. Laura was who I was asking about.\n00:49:15 - Maria Gudelis (Maria Gudelis)\nYeah, she's all about mindset. She's a bit about cooperating, but she's now more to mindset. Like, like a Brooke Castillo kind of gal. the best life.\n00:49:24 - Tina Marie (profitdriversinc.com)\nThis is why the effective hourly rate exercise is so important. And I would do it from your peak time. Like, what was your effective hourly rate at that time? And you want to keep it below that. So, um, if you knew, do you know her baseline sales numbers?\n00:49:44 - Maria Gudelis (Maria Gudelis)\nNo, because I, if we were to go into that agreement, I'll get all that data from her.\n00:49:50 - Tina Marie (profitdriversinc.com)\nYeah. So one of the things you could consider doing is reach out and say, okay, I'm looking at some, working with some high level clients right now. Um, and I thought since I was opening up this offer in the summers over, I would give you first shot at it. However, I do have some parameters that have to be met first. So you're positioning from, yes, you're reaching out, but absolutely knowing your heart, you're not taking it if we're not meeting some baseline. So that 10% needs to give you another $2,500 a month. I that at $2,500 a month within, you know, two months tops. Otherwise, it's not worth my time because I've got other higher revenue stuff. But really, I expected to be giving me $10 to $15,000 a month. So if I see that potential there, then I'm willing to do this and I'm not. If that's something you're interested in, then let's have a talk and let's see the numbers and work on it together. So you're still coming from a power plate. And also you're not, you're not bogging yourself down. But if it's. making any kind of money like that, then maybe you could get, you know, go into like Brian Kurtz's world and get a junior copywriter or Colin Therio's world and get a junior copywriter or marketing expert. We can hire people that we didn't used to be able to hire even before COVID. Like COVID got so many people skilled at copywriting and automations that you could teach somebody really well to how to do what you do. So they started and then you go look at it top to bottom and go, yeah, that's on point. Nope. Let's fix this. Let's fix this so that you can take on some high level clients and you're not really managing a lot like really training junior, junior media buyers, junior copywriters and full on just dev staff team, but they don't have to be expensive. The Filipinos, the East Asian people, the talent is amazing right now and the prices that we can get and they deserve work too. mean, I'm a global person.\n00:52:03 - Maria Gudelis (Maria Gudelis)\nI'm not just American. know what I mean? Yeah, well, I guess you've got to talk this morning. He was only $9.9 a month.\n00:52:10 - Tina Marie (profitdriversinc.com)\nThat's how it's crazy. And sometimes you can get way better service because they're more humble and they just love their craft. And you know, and you get to help them rise up like other people have help you. So that's something to consider. Just don't put yourself in a situation of resentment with clients. So if you can think of an offer like, I'd be really happy with this because I know I'm not going to spend X amount of time. And if I want help, then I'm either going to say, okay, I want $1,000 a month budget for automation's copy, whatever else I want. If you agree to that I'm product. So that if there's a mess, right? there's a lot of stuff to clean up, then you're That's a lot of time and you what you're offering me isn't worth it I'm not guaranteed that you're going to stay all the way through it We can have a contract the contract is only as good as your effort and showing up the court I don't want to deal with any of that. So these are my terms. This is what I'll be really happy with You approach me to begin with Got this over and over again, and I've really been contemplating you know what I want to do with my business and where I'm growing and So I thought that there's some alignment want to give you this opportunity These are my requirements And again, it's muscle memory. So if she says no, you just like that's cool cuz I There's so many other things that you can do Well, yeah, yeah, like cuz this other woman if she does really well I quoted her two options last week.\n00:53:56 - Maria Gudelis (Maria Gudelis)\nSo what if I want to continue this well, then if you just want me straight up run all your ads and and run all your funnels, including the copy for them, that's 7,500 a month, but that includes, that's limited one funnel a month. You can't ask me to do three different funnels, right, because that's not going to be achievable. But I'm going to do that. And that's what Frank Hearn's Chief Marketing Officer did, Brad, something Brad Bearden, when he left Frank Hearn's, and I worked with him on Duwell on a client. He had that simple business model, 7,500 straight up, but includes everything. Like he'd create a funnel a month, that's the front end, the OTO1, OTO2, everything, right? The client just had to come and, you know, screw up.\n00:54:37 - Tina Marie (profitdriversinc.com)\nI don't think that price point works for most people anymore.\n00:54:40 - Maria Gudelis (Maria Gudelis)\nOkay, gotcha.\n00:54:41 - Tina Marie (profitdriversinc.com)\nAnd then I quote her, or 2,500 just to run your ads, 25. I have been watching every expert media buyer minus a couple who have just gotten so quiet, and they're just doing really big things, but they're not talking about it anymore. And to anybody, they are changing their offers. are changing their price points. It's because that works for an extent, but it's incredibly high pressure. The results that they want from you, the conversations that you have to have with them are not worth the price point. It is so much easier to lower the expectations to get a little bit of lift to spend a little bit of time, but then to not have to keep replacing clients because they want to keep with you because that lift compounds and you're knowing of their funnels compounds, so you have less effort every month that you have applied to it because you know, well, I just need to change this headline.\n00:55:39 - Maria Gudelis (Maria Gudelis)\nI just need to change this image.\n00:55:40 - Tina Marie (profitdriversinc.com)\nThis is working. Okay. The hook is working, but I bet I could improve it, you know, the little thing. So the job becomes easier for you also over time. My clients last nine, seven, five, they don't go away, they come and they stay. and I do something different. when you're getting results, you've got somebody who is still using your stuff four years later. So if you obviously understand, and this is what I wrote down right here, timeless principles that have worked for centuries, that's what Eugene's breakthrough advertising is all about. The things that have worked always work. Human psychology has not changed for centuries for it. What do you call it?\n00:56:28 - Maria Gudelis (Maria Gudelis)\nA years millennia.\n00:56:30 - Tina Marie (profitdriversinc.com)\nWe are the same. We think the same. So you must for it to have converted for four years tapped into that.\n00:56:42 - Maria Gudelis (Maria Gudelis)\nYou must have tapped into that basic psychology that doesn't change, that timeless thing.\n00:56:49 - Tina Marie (profitdriversinc.com)\nThere's no other way that that continues to work, because it would have had to have been a fad otherwise or. Right. So the fact that you have things that can work for years means you understand. stand human psychology enough to create an offer that is going to speak to every human that comes across it, that had that need to begin with. And you can even still stand out in the market because of it. So you have staying power, we know that. So if you're choosing clients who are not like, I want 10x by the end of the year, and I'm going to pay $7,500, but you better get it together. And every other day, Maria, what's our sales life?\n00:57:28 - Maria Gudelis (Maria Gudelis)\nMaria, why aren't I making more money?\n00:57:30 - Tina Marie (profitdriversinc.com)\nMaria, blah, blah, I know you've worked with those people before.\n00:57:33 - Maria Gudelis (Maria Gudelis)\nThey saw. Oh, yeah.\n00:57:34 - Tina Marie (profitdriversinc.com)\nThey saw life out of you.\n00:57:36 - Maria Gudelis (Maria Gudelis)\nWell, there's never enough. Like, that's why I left the product boss over two years, even though it was like 25k a year, and they would buy me gifts like a Peloton bike and all that stuff. It was never enough. They're now doing like almost million dollar launches on their challenges now. And it's like, it's never like take a break. It's like, go, go, go.\n00:57:57 - Tina Marie (profitdriversinc.com)\nOkay, what are we launching now? And you need to get out of that.\n00:58:01 - Maria Gudelis (Maria Gudelis)\nYeah, and I sort of have gone out with that, that's also why the whole thing with Karina why I need to know knew I need you something different because she was always like, I'd get a boxer at night, how can we make $5,000 in those three days like it was always like pressure pressure because she her daughter is a question horse jumper. She had to buy her $125,000 horse like she got her huge cost of living expenses.\n00:58:24 - Tina Marie (profitdriversinc.com)\nHe had to buy her $100, right?\n00:58:26 - Maria Gudelis (Maria Gudelis)\nThat's not the dollar. Oh, yeah. Yeah. Yeah. So, yeah. So that's sort of why I was going back to being an offer owner, right? And that's kind of why the school community teach them how to do digital offers, but then yeah, you're right. I looked under the dust and I pulled up my old laptop to fire up from 12 years ago. I had some really damn good products in the past. Like one is called Get Publish Mastering, you know, like teaching people how to get published on Amazon. Those are timeless things. I've got how to make ultimate consulting challenge was was the challenge that it led into to, you know, how to make 4K a month as a social media consultant, I have a lot of old stuff on the Warrior Forum still that obviously would have to be updated, but it's really classic. I've got video ads made easy, teaching people how to show up on video, all that stuff. So yeah, I've got a lot of things and that's why the community, I got, let me give some of them away for free just to start building up that community and then see what the market wants as well, right? Like, is it the VSL or is it done for you ads for $997 a month, you know, but it's only one campaign. They then want five different campaigns, five different funnels. Oh, no, no, the $1000 per funnel now, you know, like everything's manageable like that, you know.\n00:59:41 - Tina Marie (profitdriversinc.com)\nYes. Okay. Okay. I'm good at domains. That's pretty good, or market mama, marketing, market, marketing, mistress, marketing master. You don't want to go mistress because you're going to get some filthy dirty people, marketing master Maria, marketing mastery, Maria's marketing mastery because everything you're talking about is marketing.\n01:00:45 - Maria Gudelis (Maria Gudelis)\nYeah. So you love marketing.\n01:00:49 - Tina Marie (profitdriversinc.com)\nI do. You love markets. You love market tours. You love business. You love commerce, commerce and marketing with Maria. Thank you. So if you have this overarching thing, right? So because one of the things is people get, and my guy is one of the worst of them. But he talks about people hopping around and jumping around from this thing to that thing. But a lot of it is all under the same roof. So like VSL's micro offers, getting books published on Amazon, that's all marketing. It's all sales, it's all marketing and sales, right? So if you have a brand, a main brand, houses all of those other little things that you love to do, it ties the tether to say like, I am still, like this is all one thing, right? But this is a branch that's come out of it. So if you have this home thing where you can have all these different types of offers, you know, on the main page, and this is...\n01:02:00 - Maria Gudelis (Maria Gudelis)\nAnd it could be Maria Godelis, of course.\n01:02:03 - Tina Marie (profitdriversinc.com)\nBut in addition to it, you could have this page that is SEO-optimized, keyword-optimized, right? because it helps, because when people land on it, if they see the domain, they immediately know, oh, OK, this is what she's about. And that's the one thing that personal name domains don't necessarily give to us, and you could put all of those things there. Plus it also, if one domain ever has a bad email reputation, you can fix it, go to this one, if that won't get different type of thing. So those are some things to think about, oh, Maria's marketing mastery.guru, I need another one. think I did another with a dog guru, but anyway. What I would love to see you do, and if you do, and when you do, I know you're going to do this, if you, when you do some VSL finals, I think what you should do is just screen record all day long, everything you do. you're doing, it's going to take a lot. Use some sort of AI tool. Let me go find what it was real quick.\n01:03:08 - Maria Gudelis (Maria Gudelis)\nYeah, I know what you're talking about.\n01:03:09 - Tina Marie (profitdriversinc.com)\nSomeone else brought it up on the ANHV.\n01:03:11 - Maria Gudelis (Maria Gudelis)\nDescribe it.\n01:03:13 - Tina Marie (profitdriversinc.com)\nSo capture that and then you should have some training material that can help you with an outline and you're like, oh yeah, I can go talk about this, but you're not having to rework because you literally had somebody watching your shoulder while you were doing it. And then you could worry out some of those things and blur out and whatever. And so done with you could be, okay, I'm going to have you fill out this template and answer all these questions and then we're just going to have a jam session and I'm going to validate some of your ideas. While we're talking, we're going to go do some marketing research. you get to where you can afford similar web or something like that and go do some solid research with them. Yeah, yeah, little bit of keyword research. with them. And so they don't feel completely alone, right? maybe anybody that does that gets to come to your weekly, you know, chat session that you're doing, coffee with Mariana. So that's done with you. And it's much less. And you're only giving them a little bit of time, but the onus is on them to make it work. You're just having them get further faster than they would have alone. And the DIY is, look, you can't really afford a lot, but you can do something. Go ahead and do this. And if you want some feedback, upgrade to the D done with you, right? I'm joined the community and maybe it's a little bit less cost, but it's a monthly fee that you you do. I think you could kill it on these and these could be much lower ticket, right? The DIY could be super low ticket so that you feel happy like you're serving people. They've done with you a hundred or two hundred dollars a month. Um, you know, that's that it could be cause it prohibited for some people, but you don't have entire characters, right? Yeah. Show up. And also it helps make sure that you've got people who are actually showing up to your call so they're not empty and low energy, right? um, but the bread and butter would be the done for you for a little while while then you're spending the marketing money, building these up, sharpening your saw here, you're getting real time test results to tell the community down here. And, um, then you can, you know, expand to promoting all of the other things and just kind of building your marketing library and whatnot, but in the meantime, you're very active in the nothing held back and commenting on whatever, um, and you can have like a pinned post that be like, Hey, um, I am loving having these conversations. I'm at this point in my life where I want to be home with mom and take care of her. and I love talking to some more people. So here's my pedigree, my marketing pedigree. If you want to talk with me, here's my offer. know, you can get on on my calendar. This is the amount that it costs. This is how many slots I have available per week during these times and they don't get to see those slots until they page for it. So you're not just have everybody go, oh, she's really available, you know. And I am very confident that you could get all the money that you need to get by before you really desperately need it.\n01:06:40 - Maria Gudelis (Maria Gudelis)\nYeah. No, I agree. Yeah, that's why I'm very calm about it. Yeah. Like, I even had someone like, that's what was weird. Like, you know, also, like, because I've been, you know, reading the Bible every morning and journaling for the timer off for 20 minutes. What's weird is Charles Kirkland out of the blue on Saturday said, hey, I think I have some leads for you for some dumb for you low ticket funnels because he's a friend of mine. We keep in touch Everyone's well, and then out of the blue mind you haven't changed it over because it's in Karina's ClickFunnels accounts But again, there's trust enough that I'm just gonna invoice her and she's paying you back out of the blue Someone bought my low ticket $10 for emotional state marketing course And there's an order bump on there for a hundred ninety nine dollars for one hour strategy session with me So there's like two hundred dollars that came in on the weekend Sale and I didn't know she bought it until she Facebook message. Hey, I can't believe you're having this offer It's so damn good. So I bought it when can we get together? So I'm meeting with her on Friday. So that's cool So yeah, got people like I mean, I was one of them. I saw you know, was like hell. Yeah, give me that Yeah, yeah, exactly. Yeah, so I mean and that's a proven offer to like I know we say dumb for you VSL funnels but really Scripting the VSL is like a separate thing But I mean yeah, the low ticket funnels are there and there's definitely it definitely works when people actually then traffic to it. So yeah.\n01:08:04 - Tina Marie (profitdriversinc.com)\nI would love to see you do some higher ticket, higher value stuff for a while. And then, you know, I would love to see you focus on this and this be as an aside, right? So hey, I'm doing this, but just for just you know, guys, I've got this for you because I know that high ticket can be really intimidating. It really triggers that imposter syndrome. And the truth is the only way to get rid of imposter syndrome is to just keep doing a thing long enough that people give you feedback and tell you what you need to hear until you finally believe it. Because I can tell you, you know, all the mindset coaches can tell you all the things. But the only thing that gets rid of it is experience and um, evidence, right? telling you repeatedly. Thank you. Thank you. Thank you. Thank you. the only way over it is the only way to it is through it.\n01:09:00 - Maria Gudelis (Maria Gudelis)\nit.\n01:09:00 - Tina Marie (profitdriversinc.com)\nSo I've made this for you. Now, I'm over here doing these things. But look, if you can't afford that, here's this for you. Plus, here's the community because I've been where you've been. And you know, people use that as a line, but that's the truth. I don't know what it's for you, but it is for me. Yeah, it is. Yeah, yeah. You've where you've been. And I mean, I mean, even now, right, like we go through these cycles where there's lots of money and then we're like, okay, life changed. in a new season.\n01:09:29 - Maria Gudelis (Maria Gudelis)\nI don't care about money as much. got to deal with this thing.\n01:09:32 - Tina Marie (profitdriversinc.com)\nYeah, especially as women, we don't, you know, sometimes we're just like, I got to bear down.\n01:09:37 - Maria Gudelis (Maria Gudelis)\nI can't do anything else right now.\n01:09:39 - Tina Marie (profitdriversinc.com)\nYeah, go through this thing. So anyway, but, but you want to make sure that you've always got what you need to never have to worry about money or energy or anything else, because you serve your people at the highest level and you give them the best service. because when you're not coming from a place of need, Maslow's hierarchy of needs, right? If you're suffering, you're not high functioning. So keep at the high level, make sure there's plenty of money coming in, but only good energy clients, smart people who really get it. So you know, it's not gonna be mega high ticket because those people have too high of expectations they're not, they're stressed out, their goals are disproportionate, their market. So then you have more money to hire other people to help you with the other things, to manage community. And build your own little company that if you wanna take the summer off, you take the summer off, you go play with mom, play with friends, go on cruises, go do a visit, Tina, that kind of thing. Do the things and have a company where you're giving jobs and employing other people. like you have all of that in you so like you can manage that forever and then you've got extra money for investing and retirement if and when you ever want to my brain never wants to retire but I may have to I may not continue so I want to make sure all of my investments are there and now especially we haven't bottomed out on the economy but when we do it's springboard and the reason it's a springboard is because of us it's of the market because of the entrepreneurs and you're gonna ride that wave build your stuff that is solid and it's all hierarchical right so you're serving everybody in the market from the bottom to the top you're getting a piece of all of that action but you're also giving and serving all of those levels of that market and you get compounding effective it just keeps building upon itself yeah it should sound\n01:12:00 - Maria Gudelis (Maria Gudelis)\nIt's by you fulfill you and also make you good money.\n01:12:04 - Tina Marie (profitdriversinc.com)\nYou let up marketing.\n01:12:06 - Maria Gudelis (Maria Gudelis)\nI do. I mean, I live and breathe it. I like at nighttime.\n01:12:10 - Tina Marie (profitdriversinc.com)\nI'd rather watch a marketing video than, you know, mad man, you know, something. Yeah, I do 100%. I like the psychology books, the leadership books, like persuasion. I gave, there's this young man at church and he's a very nerdy redhead. And I love him. And I gave him the art of war, persuasion. Originals by Adam Grant, who, which is amazing.\n01:12:36 - Maria Gudelis (Maria Gudelis)\nIf you haven't read it, you should read it. Originals.\n01:12:39 - Tina Marie (profitdriversinc.com)\nOkay. Yes. One of my friends from church gave it to me. She had read it and she says Tina, I read this book and I got goosebumps because I, it was all about you and she's like, you're an original. like, I, no, I have goosebumps and I'm, what was the other book? Art of war, persuasion. I should have written down what I gave him.\n01:12:59 - Maria Gudelis (Maria Gudelis)\n48 laws.\n01:13:00 - Tina Marie (profitdriversinc.com)\npower? No, um, actually, it was that's that is what it was.\n01:13:07 - Maria Gudelis (Maria Gudelis)\nYeah, what I was.\n01:13:09 - Tina Marie (profitdriversinc.com)\nI didn't think I'd given up.\n01:13:10 - Maria Gudelis (Maria Gudelis)\nYeah, but that was it. That was the other one. And originals. How non-conformist moved the world.\n01:13:18 - Tina Marie (profitdriversinc.com)\nYes, but I'd like, um, oh my gosh, I'll tell you like my favorite books are pre-suasion or per-suasion type books. Like, there's a book called Switch by Chip and Dan Heath.\n01:13:30 - Maria Gudelis (Maria Gudelis)\nI like Misbehaving by Richard Thaler.\n01:13:33 - Tina Marie (profitdriversinc.com)\nUm, the psychology books. I never really studied copywriting, but I study psychology. And I've been, if I've been head to head with anybody on a split test, I win. Now I haven't been against an agora copywriter, but I know the way people think and I study it. Um, a lot. And so it's interesting because I can see the correlations and all the copy stuff. I'm like, you're just like, you're just teaching how to write according to psychology.\n01:14:04 - Maria Gudelis (Maria Gudelis)\nYeah. So it's right. Sure. Yeah, I got some psychology books. I got, well, is it Carol Dies, whatever she's got one, one also cyber psychosibernetics, but that's more marketing, but psychosibernetics by Matt. Yeah, Matt Fury took over it, but it was by Moltz. Is it Moltz? Yes, psycho psychosibernetics, maximal Moltz. Yeah. That's a good book. So yeah, no, this is this is good. You know, it's funny because I was thinking because you have corporate world experience, too.\n01:14:53 - Tina Marie (profitdriversinc.com)\nYou know how a corporation has a board of directors, right?\n01:14:57 - Maria Gudelis (Maria Gudelis)\nSo I was thinking, like, if I build this out. Not if when I build this out, like you, because you're helping me and I haven't paid you anything, I know we're helping each other, but I still would like to give you a percentage of this company or the sales or the profits, know, long term, that you know, I don't know if you're like me, but you know when you birth something, know, it's, it's, it's kind of nice to actually also be a part of it growing up.\n01:15:23 - Tina Marie (profitdriversinc.com)\nI don't want to cry. I, that is the other thing is that I'm working on. I want to have rough shared deals.\n01:15:33 - Maria Gudelis (Maria Gudelis)\nwant to be part of something.\n01:15:35 - Tina Marie (profitdriversinc.com)\nI want to nurture it forever. I'm, I'm, I was a mom before I was a mom. We have, I think all women with a few exceptions are, and I mean that because of their hearts, not because they don't have children. Our mothers, we love, we care, we nurture, doesn't matter if we burn children or not. And I know that it's easy to say that because I've had mine, but. It's not because I would have more. I would have all the kids if I had the opportunity. But I've known so many women. have one of my previous clients, Francesca, she is a bold, outrageous lesbian, bold, like, she has to stand up. And I adore her and I love her. And she, all my profit drivers, YouTube, she left me a testimonial and she sent me message for my birthday to have a video of her ranch that she got three years early because we went through that exercise, that time exercise, and she's like, holy crap. And she knew what to do. Now, she'd been working with Dan for like three years and they split ways in a bad way. But yeah, that's different things than I do. She was not respectful to him.\n01:16:49 - Maria Gudelis (Maria Gudelis)\nOh, okay.\n01:16:50 - Tina Marie (profitdriversinc.com)\nUm, but she understood the math differently and she understood her responsibility in doing her. numbers and managing her numbers. so her dream was to open a ranch where she could foster children.\n01:17:07 - Maria Gudelis (Maria Gudelis)\nNow she's teacher.\n01:17:09 - Tina Marie (profitdriversinc.com)\nYes. And she got that three years and she's so happy. She is so happy. Now I am super religious. I'm LDS and you know like that my culture is very it's it's finally shifting people are realizing like you can't say you love Jesus and go around judging everybody like you you really don't know if that's what you think that he was about.\n01:17:34 - Maria Gudelis (Maria Gudelis)\nYeah.\n01:17:35 - Tina Marie (profitdriversinc.com)\nBut you know like she's always rolling blunts and she's like oh whatever she's got an amazing heart and that's all I care about and she loves me and I love her back and um but this this this is the joy like we get to be moms and instead of maybe teaching our kids how how to clean the house or like cookies or whatever, we're teaching them how to be independent and how to bring their gifts to the world. And birthing that is good. So anyway, Russia, I want that in my business to my, my guy, he's a, he's an angel investor, like he's a big money is almost actually been an issue because he makes so much of it. And his thoughts about it are different in mind are in humble. And I'm like, I, I don't want that. I, I get that you come from this world of life, billions of dollars. I, it, it becomes an issue at a certain point where people are obsessed with it. I said, I don't want to lose myself to that. Cause you always be like, don't let people in your business, Tina.\n01:18:45 - Maria Gudelis (Maria Gudelis)\nDon't, don't do it.\n01:18:46 - Tina Marie (profitdriversinc.com)\nLike he's, I'm so smart and he thinks I'm amazing and do all this. he's like, don't let people, I'm like, I'm like, but you need to understand that. Letting people in is my heart.\n01:18:57 - Maria Gudelis (Maria Gudelis)\nLike I am a family woman.\n01:18:59 - Tina Marie (profitdriversinc.com)\nI love someone I love. of them. And I want to share everything with them. And I will always be that way. And business can't be different. It is for other people. But that's why I have to be so careful about who I do business with. I will have very good contracts because people can change and they can go do. Generally, what will happen though is somebody else gets inside their head and tells them, Oh, and gives them the greedy talk. You should be getting this.\n01:19:26 - Maria Gudelis (Maria Gudelis)\nYou should be getting that.\n01:19:27 - Tina Marie (profitdriversinc.com)\nAnd so then they talk the business because somebody got in their head and ruined things. now I'm not doing business with this person.\n01:19:34 - Maria Gudelis (Maria Gudelis)\nI'm doing with person business with the person that's in their head.\n01:19:38 - Tina Marie (profitdriversinc.com)\nYeah. So anyway, yes, I want to work together. I want to create, however, supporting you. You supporting me. I'm sure that I value as you as much as you do me. This is a blessing to me. You're brilliant. I get excited watching you go through stuff. I'm I was so lucky. I was thinking that was lucky. I was watching your stuff.\n01:20:01 - Maria Gudelis (Maria Gudelis)\nI'm like, I am so lucky. Yeah, I get to spend time with her. oh my god. So well, did. Well, did.\n01:20:08 - Tina Marie (profitdriversinc.com)\nOh, yeah, like it.\n01:20:10 - Maria Gudelis (Maria Gudelis)\nSo okay. Um, yeah. So so I'm I need to go now because I'm you probably your belt to because I just got I think I just need to I can go for walk or something.\n01:20:23 - Tina Marie (profitdriversinc.com)\nneed to take this all in. Like, you know what I mean? Oh, I know I got that point to where I'm like, I can't take any more and I have to. So the one thing I'll say is about for the continuing conversation. Um, tomorrow, let's just check in with voxer. Unless unless you feel like, yeah, you've got something you want to talk about it. And let's, um, what if we just keep one call on the calendar? But I want to hear I would love to hear from you every day. I really like, I need that.\n01:20:57 - Maria Gudelis (Maria Gudelis)\nI would love to do real voxer, like not just Expect voice because I draw so much energy from voice.\n01:21:03 - Tina Marie (profitdriversinc.com)\nOkay, especially because you you get excited and you have this But what I would also like to do is be like if I really like I could really use some Maria like Braintime. Yeah, say hey, we schedule a call and you let me know if we can and vice versa I keep my schedule really open so that I can do that So I don't feel like well, we already had our one call or whatever Yeah, I'm pretty wide open schedule, too Yeah, and I protected it for my favorite things.\n01:21:38 - Maria Gudelis (Maria Gudelis)\nYeah, you've fallen that category Thank you and and tomorrow didn't really time.\n01:21:43 - Tina Marie (profitdriversinc.com)\nI'm not available because I'm going to go get my hair highlighted So yeah, well actually I'm going darker. I went and blonde because I'm so gray Oh, yeah, but and I didn't like the grow-out stops, but I'm just going frequently and I really miss my darker hair because yeah here it doesn't look so bad but when I look in like really bright light and just like yeah yeah not me I'm dark hair girl okay so boxers boxer follow up and just brain dump and we will just keep going and you process it and just yep I'm so excited all right thank you all right and I can see you guys later bye you\n","contentPreview":"00:00:03 - Maria Gudelis (Maria Gudelis)\nHey.\n00:00:04 - Tina Marie (profitdriversinc.com)\nHi.\n00:00:05 - Maria Gudelis (Maria Gudelis)\nHow are you?\n00:00:06 - Tina Marie (profitdriversinc.com)\nNot as...","processedAt":"2025-05-04T03:40:52.571Z"}