{"fileName":"Done Transcript for Basis Integration_Sweet Law(6).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Basis Integration_Sweet Law(6).txt","type":"transcript","priority":"medium","content":"00:00:08 - Tina Marie (profitdriversinc.com)\nare you here? can't hear you. Yeah, let me get on my time.\n00:00:17 - mark sweet\nYeah, I'm just as nice as about it.\n00:00:20 - Tina Marie (profitdriversinc.com)\nWhat?\n00:00:21 - mark sweet\nI'm just asking the code.\n00:00:31 - Tina Marie (profitdriversinc.com)\nI want to set up a new computer and I have to everything's changed since the last time I've done it. Oh, good. Thank you.\n00:01:24 - mark sweet\nYeah, sorry, I'm trying to get caught up on a couple of things I had America puts you other list of all the doctors that we've kind of worked with over the last year or so and then sort of put that in a map so that way we can start planning doctor trips basically. Nice. You really see about three to five people. It's true just more than that I can see a little bit too crazy.\n00:01:55 - Tina Marie (profitdriversinc.com)\nSo trying to figure out how to Yeah, Marcus quiet again, that's what it is.\n00:02:14 - mark sweet\nYeah, I'm always quiet.\n00:02:20 - Tina Marie (profitdriversinc.com)\nOkay, so even this looks different. If I didn't change, did it? Okay. Okay. It looks different.\n00:02:57 - mark sweet\nMight just be the view. There's a way to change on the different view.\n00:03:03 - Tina Marie (profitdriversinc.com)\nIs the view not set by user?\n00:03:08 - mark sweet\nYeah, but I don't know if I had to change around an octave and plan around with some AI implementation stuff.\n00:03:14 - Tina Marie (profitdriversinc.com)\nOkay. Well, I don't know how to get to where I want to go.\n00:03:26 - mark sweet\nDo you want to share a screen and then?\n00:03:28 - Tina Marie (profitdriversinc.com)\nYeah. Oh, . I did not know what happened here. I mean, I guess it's fine, but, uh, where's screen share? Seriously, everything looks different. That's tough. Even that's like, it's not showing me which thing I'm sharing. I've got to see if this is the right one allows you to open some some settings. Sorry, I've got. All these things to set up. Can you see my screen?\n00:04:11 - mark sweet\nNope.\n00:04:12 - Tina Marie (profitdriversinc.com)\nOK. Let's try this again. Oh, that's why. It's not going to let me do it unless I quit it and reopen it.\n00:04:32 - mark sweet\nGot it.\n00:04:34 - Tina Marie (profitdriversinc.com)\nSorry. So I can tell you what I can't. I need to screen share. Hi, Dan. you good? I'm going to do this quiet today.\n00:04:50 - mark sweet\nI don't hear anything, Dan. I heard it. You did, but I don't hear anything.\n00:04:58 - Dan’s iPhone (danddcompany.com)\nListen up.\n00:04:59 - Tina Marie (profitdriversinc.com)\nI hear it.\n00:05:00 - mark sweet\nYeah, Dan has arrived.\n00:05:06 - Tina Marie (profitdriversinc.com)\nDan did the accidental video last week. He was like, how do I turn this off? I have that same situation today. Only I didn't know. We should just do video one day and actually see each other. I do video with my, my lady friends. Sorry, that's James loud. Okay. I can't. I don't want to end the call, but I can't see little. So maybe somebody else in screen. Sure. We can go over numbers that way because I, hey, Dan, can you log in the little fire and see if it looks different to you? Because you have this in the log and I use.\n00:05:43 - Dan’s iPhone (danddcompany.com)\nDifferent. Different. Different. What's different?\n00:05:49 - Tina Marie (profitdriversinc.com)\nUh, the layout. I don't know how to navigate to the reports.\n00:05:53 - Dan’s iPhone (danddcompany.com)\nI want. Okay. Let me see.\n00:06:00 - Tina Marie (profitdriversinc.com)\nLet's see, I didn't think that's one. Let's scroll down.\n00:06:16 - Dan’s iPhone (danddcompany.com)\nHello. Working on it.\n00:06:26 - Tina Marie (profitdriversinc.com)\nOkay. I don't have I mean, no, it doesn't look like this. Okay, so I used to see at the top all these different menus, and one of them was reports, and one of them was dashboards, or maybe dashboards was under reports, but for the whole long list of things that are not there anymore.\n00:07:00 - Dan’s iPhone (danddcompany.com)\nmore. Yeah, I mean, I see them as normal.\n00:07:05 - Tina Marie (profitdriversinc.com)\nWhy would I not see them?\n00:07:08 - Dan’s iPhone (danddcompany.com)\nAnd you're logged in as Lauren?\n00:07:10 - Tina Marie (profitdriversinc.com)\nThis is the only one that there is.\n00:07:12 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:07:15 - Tina Marie (profitdriversinc.com)\nit can't screen share because I haven't set up zoom permission yet on this laptop. And it won't let me do it unless I turn it off and back on. So Anyway, sorry for wasting time. Can somebody, can we look at our numbers?\n00:07:34 - Dan’s iPhone (danddcompany.com)\nThat's somebody me because I'm on my phone so I can switch to my laptop.\n00:07:39 - Tina Marie (profitdriversinc.com)\nI think Mark's in the office.\n00:07:42 - mark sweet\nYeah. I gave mine just my nose. That's little different.\n00:07:45 - Tina Marie (profitdriversinc.com)\nYeah. You don't have the same dashboard that we do?\n00:07:47 - mark sweet\nI don't know anyone.\n00:07:50 - Dan’s iPhone (danddcompany.com)\nAlrighty.\n00:07:52 - Tina Marie (profitdriversinc.com)\nDon't worry. Monday Monday.\n00:07:55 - Dan’s iPhone (danddcompany.com)\nIndeed.\n00:08:00 - mark sweet\nYou want to make me host?\n00:08:03 - Tina Marie (profitdriversinc.com)\nOh, yeah. Wait, that should automatically allow multiple participants. You should be able to just share.\n00:08:15 - mark sweet\nOh, yeah.\n00:08:16 - Tina Marie (profitdriversinc.com)\nI'm like, I have that setting. If you need to make it a bit bigger than me. Like, zoom completely looks different on this laptop. it's still a Mac, so I'm just not expecting all these changes. Okay, and take Swiss or Swiss State. All right. Oh, so let me get back to my notes while I'm a second, which is also different. I'm going to show a contributor. Teamwork. Sorry, teamwork is now on here, too. So to go through some of my stuff. Uh-uh. It did actually start this 10 minutes early to be prepared. I just didn't know I was going to need more than that. I apologize, sweetheart.\n00:09:35 - mark sweet\nIt's usually a little bit of a tip.\n00:09:38 - Tina Marie (profitdriversinc.com)\nWhat's that?\n00:09:40 - mark sweet\nThis is the other one that we tend to look at.\n00:09:45 - Tina Marie (profitdriversinc.com)\nYeah. I mean, it's looking good. It's the 17th. It looks better than it has at this point in the month for the last several months.\n00:09:56 - mark sweet\nYeah, but there's usually a week slow down.\n00:09:58 - Tina Marie (profitdriversinc.com)\ndon't know if it's going to be this week, next week.\n00:09:59 - mark sweet\nRight. Right. Right. Right. But it is what it is, quantify seems to be a pretty big success, the only problem is they really can't scale.\n00:10:14 - Tina Marie (profitdriversinc.com)\nSo what is the ceiling, what's the cap, like, if they can do that?\n00:10:20 - mark sweet\nthe next year, like, maybe 20%. So it was another like two to three needs per state, it wasn't a lot. Well, at least they're being honest. Right. No, you're not wrong, you're not wrong.\n00:10:39 - Tina Marie (profitdriversinc.com)\nThat is something. Oh, sorry.\n00:10:42 - mark sweet\nThe cost per acquisition is pretty solid with it. We'll keep that going. wish I had two or three more of them, obviously, but it is what it is.\n00:10:49 - Tina Marie (profitdriversinc.com)\nWhat is their cost per acquisition?\n00:10:56 - mark sweet\n3500, I have the exact number somewhere, but it's around there. So, yeah, about half what monkey is, yeah, but monkeys are the best attorney's fees. So we're going to keep monkey on again. The biggest issues on Felipe, their costs and their average attorney fees very close to each other. So the $300 difference doesn't make any sense. You've got to feed the beast at some level, but if you talk to them, I had them full, basically, from Washington because it's just not working. We go state by state to put more money into New Mexico and Arizona, which should help. Because they're doing well in Arizona in New Mexico, but doing really poorly in Washington.\n00:11:52 - Tina Marie (profitdriversinc.com)\nOh, my gosh. I saw another sweet James freaking billboard. I don't like how that guy looked. You saw a sweet change billboard? Yes, because I'm in Arizona.\n00:12:06 - Dan’s iPhone (danddcompany.com)\nOh, I'm only like an hour and a half away from Lauren's right now. Oh, that makes sense.\n00:12:13 - Tina Marie (profitdriversinc.com)\nYes.\n00:12:15 - mark sweet\nInks and Phoenix.\n00:12:18 - Tina Marie (profitdriversinc.com)\nWait, he's in Phoenix?\n00:12:19 - mark sweet\nHank.\n00:12:20 - Tina Marie (profitdriversinc.com)\nOh, Hank. Yeah. Yeah.\n00:12:23 - Dan’s iPhone (danddcompany.com)\nI don't know.\n00:12:24 - Tina Marie (profitdriversinc.com)\nI'm I'm in Tempe. Oh, yes. You're close. Yeah. Yep.\n00:12:32 - mark sweet\nSo you are near where we're stuck here.\n00:12:36 - Tina Marie (profitdriversinc.com)\nI was in Gilbert Saturday.\n00:12:41 - mark sweet\nI went to the temple. A of C physical medicine.\n00:12:45 - Tina Marie (profitdriversinc.com)\nI was in Chandler this morning.\n00:12:48 - mark sweet\nThey're like. Like. So I had America put this together where we've sent a lot of. Cases too. So we're trying to plan trips.\n00:12:59 - Tina Marie (profitdriversinc.com)\nI love that.\n00:13:00 - mark sweet\nIt's lot easier to go from here to here than like here to here.\n00:13:03 - Tina Marie (profitdriversinc.com)\nRight. That's really smart.\n00:13:08 - mark sweet\nSo we'll show up with that together.\n00:13:10 - Tina Marie (profitdriversinc.com)\nLook at the big brain from you. Yes, let's not do that or fall down any stairs at parties either. It's supposed to laugh. No, they laughed. Come on. We don't remember this story. Listen, if you guys are going to be this boring on a Monday, I'm going to leave.\n00:13:42 - mark sweet\nWow.\n00:13:46 - Tina Marie (profitdriversinc.com)\nHere I am now. Entertain me. Come on. All right. So also just not being on my normal computer. It's very disruptive to my brain. So let me go back to now. Right. Our sources. So let's go down the source. Let's real quick, um. After math, we still don't engage that's gone now, right?\n00:14:21 - mark sweet\nYeah. I mean, that's just the chat on the website. think that really was much of anything.\n00:14:27 - Tina Marie (profitdriversinc.com)\nUm, so do you have any other potential? What do call those vendors? Talk to you. And what is your process like for? Do you do you set aside a day, a week, a month, whatever to go look for some things? Like how are you coming across them? Um, through the grapevine is an intentional. Is it as it happens?\n00:14:59 - mark sweet\nSome ambitious Google. playing and trying to find it and just giving them 10 grand to see what's going to happen. And again, most of these are going to fail.\n00:15:08 - Tina Marie (profitdriversinc.com)\nRight.\n00:15:08 - mark sweet\nMost likely. So it's just more of that asking the after hours call center. And then obviously this HQ intake that they've worked with that have had decent results because they want more business. So it's pretty clear in that regard. Beyond that, they don't have a lot else.\n00:15:32 - Tina Marie (profitdriversinc.com)\nSo Google searches, there's not anybody that you haven't tried yet.\n00:15:39 - mark sweet\nThe only one that I haven't tried is Quintessa. But given how often she gets sued, I don't really want to try her. So that's the only big one that we haven't.\n00:15:52 - Dan’s iPhone (danddcompany.com)\nI was going to say there's many a fly by night of their own.\n00:15:57 - Tina Marie (profitdriversinc.com)\nSame. Random thought, but. So let's say there's somebody that's a newer SEO company getting attorney leads, but they're only doing it in Montana and they're small, know, so they don't think about advertising in California. What if you did a search for attorney leads in Montana to find some little thing that little, you know, agency mama pop shop who's doing a good job with that in Montana that maybe has a different kind of approach or something. I don't know, like I'm just trying to think out of the box and where we could find skill and talent that's kind of flying under the radar, but also price-wise is going to be lower. Maybe it's not possible because they're still have to be getting attention in your area with all the competition, but it's worth trying.\n00:16:58 - mark sweet\nI mean my own concern of course is When you go from a less competitive to a more competitive state, you generally don't do very well versus the alternative.\n00:17:07 - Tina Marie (profitdriversinc.com)\nYeah.\n00:17:09 - mark sweet\nif you were able to kick out some California, you'll kick out some Montana. But I think if you're looking for like New Mexico specifically, Missouri specifically, I've just been looking more generally. It may not be a bad plan to kind of do town per state.\n00:17:30 - Tina Marie (profitdriversinc.com)\nOkay, so can we make that a specific action item of. Looking per any of the states that you're currently in or potentially looking to be in.\n00:17:41 - mark sweet\nYeah, that's a good idea. think I should do that because I'm. Pretty well, I'm on page like seven or eight at this point. So the quality is not.\n00:18:00 - Tina Marie (profitdriversinc.com)\nYou So when will you do that so that I know when I can follow up with you about having checked it out?\n00:18:06 - mark sweet\nI'm probably not going to be adding a new lead source for at least the next 30 or 45 days because I want to see how quantified it's going to kind of finish out and how absurdly does since we started giving them some more money.\n00:18:20 - Tina Marie (profitdriversinc.com)\nOkay, starting though and doing the research and having conversations just to know that they're there because there's a whole process. I mean, would you be not be willing to look into it first?\n00:18:33 - mark sweet\nYeah, just usually processes. Okay, would you leave?\n00:18:37 - Dan’s iPhone (danddcompany.com)\nYeah, give me money.\n00:18:38 - mark sweet\nGive me money. Here we go.\n00:18:40 - Dan’s iPhone (danddcompany.com)\nDan, Eric, make this happen. It's literally 72 hours.\n00:18:43 - Tina Marie (profitdriversinc.com)\nOkay, all right.\n00:18:48 - mark sweet\nIt's fun to know it takes the longest period of time, so you're right though. I mean, it's been a little bit of time with that.\n00:18:56 - Tina Marie (profitdriversinc.com)\nOkay, and I mean, and if we could find a few quantified five who don't know how to scale but can compete at that level like getting even two to three leads for 3500 and depending on what the attorney fees on those I mean a handful of those would be amazing right no um you're absolutely right it's just finding those kind of folks right you lost a lot of money uh so far but that's okay yeah but there's there's no way we're winning without trying I think we just keep also true um and the rotation of who is the the primary you know winner monkey versus walker versus Felipe has done much better at times um the cost per vendor but also the cost per state there's so much variance and I mean it all it all You know, so the more levers we have to move, the more control we have over the movement. So, but that doesn't come. It just doesn't fall in your lap. So that's my pitch. Just let's keep at it. Okay. Let me go down here. Mark wants to know if we can have a widget made in our management dashboard that says conversion rate. Dan, do you have anything to report back on that?\n00:20:32 - Dan’s iPhone (danddcompany.com)\nJosh hit up Stacy. was like very apologetic. guess their firm has been super busy. He's like, I've actually been working at the firm. But he said he would have all the last round of stuff done today or tomorrow.\n00:20:47 - Tina Marie (profitdriversinc.com)\nOkay. Cool.\n00:20:49 - Dan’s iPhone (danddcompany.com)\nSo, I mean, we can send him more stuff.\n00:20:52 - Tina Marie (profitdriversinc.com)\nRight. All right. don't know. I don't think I found him. that properly. I know it's in here in recording, but I don't know how to get it to highlight yet. So, the next one was, um, status of unified beta functions. Mr.\n00:21:18 - Dan’s iPhone (danddcompany.com)\nI think we're, he's just waiting, right? Yeah, that hasn't been released.\n00:21:26 - mark sweet\nIt hasn't been, we put in all the packages that we need to implement. so now it's just on let it find.\n00:21:34 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:21:41 - Tina Marie (profitdriversinc.com)\nOkay, okay. intake scripts. sent something over.\n00:21:51 - mark sweet\nYeah, um, I wasn't thrilled with it. Just, it wasn't thrilled. So I had Patsy kind of put together the basics of what we need, and then it was A to put his spin around it, I guess, right? If he's the best guy on the phone, having him put together script makes the most sense, right? Here's what we've had before. Here's what we're doing. I'll send you what he made, but I wasn't super happy.\n00:22:34 - Tina Marie (profitdriversinc.com)\nSo then what's the next step to get to something that you are happy with?\n00:22:41 - mark sweet\nWe're trying to go back through it, and Patsy's been on vacation for the last five or six days.\n00:22:48 - Tina Marie (profitdriversinc.com)\nyou know, like, I'm pretty good at this chat GPT thing and have been from the beginning, so we ever want to have the AI session on down. seriously could you like have some caffeine or something both of you gee oh my god I've been up since 430 because the certain little black somebody is not loving this cray training I'm like oh my god you know we're talking about kids you don't send me dog pictures Dan what I want to do this look into a pool this weekend you what that the pool oh there you go what into the pool the dog look look look running oh my god well he can swim right yes and he help me by the way dress super fast oh but he shook a lot oh okay hold on a second where the great training oh my gosh that lasts for like two years for me horrible until\n00:24:00 - Dan’s iPhone (danddcompany.com)\nThey're really generous already. She's a chewer already.\n00:24:03 - Tina Marie (profitdriversinc.com)\nOh, yeah. Is she a lab? No, told me she's something German Shepherd.\n00:24:09 - Dan’s iPhone (danddcompany.com)\nWhat's hilarious is the other German Shepherd. The first two minutes, it was like, Oh . This might not go well. She was like, and she freaked out and Denise was like legit scared. I'm like, Oh, and then it was like, all right, let's keep, keep them set. Of course, I'm, I tell them like, Hey, don't just bring the dog in the house. Don't just walk in the door with the puppy. Like we have to let her. What do they do? They just walk right in the house and be like, Oh my God. So Zinnia freaks out. And now she's like the mom follows the puppy around everywhere. Dangle toys out of her mouth to get the puppy to chase her. was like, this is great. It's like a built-in babysitter. perfect. Although she doesn't like the crate training either. can tell you that because she was all over again last night.\n00:25:09 - Tina Marie (profitdriversinc.com)\nOh, go away. Um, I'll, yeah. What was funny to me is my, my Bishan, like, she didn't like the crate, but then when the alternative was that or my girls, she was like, I'll take the crate because your kids are crazy. yeah, I feel safe here. Okay. Um, so I put that in house box. Intake. Oh, so the question, we need the legitimate answer, like the real answer, not if it's not going to be chat dbt, like, what's the next step for improving the intake script?\n00:25:47 - mark sweet\nI'm just going to sit down with Jose and pass it when she's back from our vacation, go through it again. We've had better scripts before. I mean, look, this is still better than what we've got right now, something new home. I sent to you guys, but It needs some simplification right now. It's just mostly you're surrounded around the questions they have to have answered, which I mean, again, it's good that everyone knows what we need to have answered. But I need a little more help on the, how you greet people and, you know, how you get into it.\n00:26:22 - Tina Marie (profitdriversinc.com)\nGood. So. Have these having a baby though, right?\n00:26:26 - mark sweet\nYep.\n00:26:27 - Tina Marie (profitdriversinc.com)\nSo she's on vacation now. She's not on my turn. And she's leaving and she's not coming back, right?\n00:26:33 - mark sweet\nNo, she's coming back.\n00:26:34 - Tina Marie (profitdriversinc.com)\nOh, okay. Okay. Okay. Yeah. Personally, I thought like.\n00:26:40 - mark sweet\nShe's gonna for at least six months. longer.\n00:26:46 - Tina Marie (profitdriversinc.com)\nOkay.\n00:26:48 - mark sweet\nSo we're actively looking again for a new intake manager.\n00:26:54 - Tina Marie (profitdriversinc.com)\nWhat's that going?\n00:26:56 - mark sweet\nNot great. No, not great. A lot of ex-suite James people, but yeah.\n00:27:06 - Tina Marie (profitdriversinc.com)\nI've seen that dude's picture, I can get it. You know how some people just look proctorial?\n00:27:15 - Dan’s iPhone (danddcompany.com)\nI guess.\n00:27:17 - Tina Marie (profitdriversinc.com)\nThank you, somebody's actually alive.\n00:27:19 - Dan’s iPhone (danddcompany.com)\nI'm going to come over and check your pulses. I'm not sure. Are you talking about the glasses?\n00:27:24 - Tina Marie (profitdriversinc.com)\nare we talking about?\n00:27:25 - Dan’s iPhone (danddcompany.com)\nYes. Yeah. he's not a good face person. Who is that? That's not Steve.\n00:27:31 - mark sweet\nJames, divorce, complaint, and yeah.\n00:27:35 - Tina Marie (profitdriversinc.com)\nWho is it? What?\n00:27:38 - mark sweet\nI didn't hear what you said because I was still talking about it. Sweet James, divorce, complaint.\n00:27:43 - Tina Marie (profitdriversinc.com)\nLook it up.\n00:27:44 - mark sweet\nIs that your thing?\n00:27:45 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:27:47 - Tina Marie (profitdriversinc.com)\nHold on. Well, this is not an appropriate use of your time. Sweet James, divorce, complaint. I'll look it up later.\n00:27:55 - mark sweet\nNo, it's highly entertaining.\n00:27:57 - Dan’s iPhone (danddcompany.com)\nEnjoy.\n00:28:00 - mark sweet\nIt's public resource. I'm not talking about anyone.\n00:28:03 - Dan’s iPhone (danddcompany.com)\nIt's out there, right?\n00:28:05 - Tina Marie (profitdriversinc.com)\nToby took Google something.\n00:28:07 - mark sweet\nThat's legit. Yeah.\n00:28:09 - Tina Marie (profitdriversinc.com)\nI will check that out later because seriously, I took a look at that and I was like, oh, not even speak to that person.\n00:28:16 - mark sweet\nSo it doesn't matter. What we're learning is it doesn't matter. you have more money than anyone else, you win.\n00:28:25 - Tina Marie (profitdriversinc.com)\nDefine winning.\n00:28:27 - mark sweet\nYou get more cases. Well, I think you have three or four divorces.\n00:28:33 - Dan’s iPhone (danddcompany.com)\nYeah, it's not winning and a drug habit.\n00:28:37 - Tina Marie (profitdriversinc.com)\nIs that winning, Mark?\n00:28:39 - mark sweet\nFor him it is, but yeah.\n00:28:42 - Tina Marie (profitdriversinc.com)\nOh my gosh. You need to know that is not winning.\n00:28:47 - mark sweet\nIt's fine.\n00:28:49 - Tina Marie (profitdriversinc.com)\nThat is earning and that's but that's not winning. The bill comes due, Mark.\n00:28:57 - mark sweet\nLook, they're doing well. I hope we keep doing well. But I would like them not to keep going in the states that I mean, because I think it's just not a very long matter of time until they're in Washington.\n00:29:07 - Tina Marie (profitdriversinc.com)\nDippola does a job of spreading.\n00:29:09 - mark sweet\nThat's just what it does. Yeah, they just open up taxes so she keeps busy for a little while.\n00:29:16 - Tina Marie (profitdriversinc.com)\nOkay, so intake script, we're working on that. Okay, I just want to make sure we have time to get through everything.\n00:29:24 - mark sweet\nWe got Hank going. We give him his first case. We have him mostly working on just the cases right now. It's where everyone starts. So just trying to get through some of those, which is good because it takes some of the pressure off. You know, the other attorneys because those are the ones that just take a lot of time. And not a huge great opportunity.\n00:29:47 - Tina Marie (profitdriversinc.com)\nSo is he going to stay in Phoenix?\n00:29:50 - mark sweet\nYeah, he lives in Phoenix.\n00:29:52 - Tina Marie (profitdriversinc.com)\nOkay, so.\n00:29:54 - mark sweet\nSo him and Liz are in Phoenix. So the goals. Once he really understands what we do, so it's kind of started from the back end and moving. being forward. Then we'll keep building up this caseload. So we've obviously got to make sure we get plenty of Arizona cases for him and Lorenz. But Lorenz just got overlaid, just overwhelmed, it was just too many cases, too many files. he's just slow and he struggles with structure and everything else. So we need to bring someone else to help him.\n00:30:28 - Tina Marie (profitdriversinc.com)\nI could be a training issue and Tina can help with that. Just say.\n00:30:34 - mark sweet\nYeah, can I hire Tina to help train Patrick and Lorenz?\n00:30:40 - Dan’s iPhone (danddcompany.com)\nProbably. Okay.\n00:30:42 - Tina Marie (profitdriversinc.com)\nLet me.\n00:30:44 - Dan’s iPhone (danddcompany.com)\nYes, my issue. It sounds like you could.\n00:30:49 - mark sweet\nLorenz responded well to it originally, right? did what two sessions with him.\n00:30:54 - Tina Marie (profitdriversinc.com)\nHe lit up the first call, but on the second call. Like, he hadn't stopped thinking about it. He is a perfect candidate.\n00:31:08 - mark sweet\nSo as much as wish Sam or Tyler would do it, I just, I don't see it. I'd rather not waste money and time on them, but I think both Patrick and Lauren's are super highly trainable. So if you guys are okay with it, I think having you Tina meet with them at least once a month would make sense. Quite frankly, it takes some of the training of how to manage people off of me.\n00:31:33 - Dan’s iPhone (danddcompany.com)\nAnd... Oh, I also talked to her differently.\n00:31:36 - mark sweet\nYeah, that's true.\n00:31:40 - Tina Marie (profitdriversinc.com)\nYes, but the other thing is though, I have not had any success talking to anybody only once a month. Okay. It's just now there could be a difference between like meeting and talking, right? So there can be some type of team chat, whatever. or it can be text, it can be slack, whatever, to email, it can be email, but he would have to be very thorough in that and very truthful. The thing about calls, and I'll say that versus a meeting per se, because sometimes meetings are really inefficient, is that even without looking at somebody through their voice, I can hear their energy, I knew immediately Samantha was like polite in the beginning, but guarded, and Lorenz was very open. So anyway, but when people are emailing, it's less easy to interpret and to know that there's a problem, especially with people who are skilled at not revealing too much, which all attorneys have that skill, but you know what I mean? So at least every other week. And I don't know what your goals are. I don't know what the pace is.\n00:33:04 - mark sweet\nweek is fine. mean, again, Michael's just to try to make them better for lack of better term. We're spending a lot of money on marketing, a lot of money on, you know, there are teams. So if we're able to make them more efficient, we get more money out of each case or able to more cases, that's a win.\n00:33:25 - Tina Marie (profitdriversinc.com)\nattorneys, we don't get trained on how to manage people like they're still new, can train them anything.\n00:33:30 - mark sweet\nNo, not really.\n00:33:32 - Dan’s iPhone (danddcompany.com)\nYeah. No, no things.\n00:33:35 - Tina Marie (profitdriversinc.com)\nThat was well, yeah, I mean, and just the results that we got with that little bit of time. But so, I mean, we could talk about it here offline, whatever, but every other week at the very least, but then we need to have weekly check ins and, you know, UVC seat on it. And included. So there's like an official kind of reporting process. I don't know, depending on what is comfortable, it's new in terms of like how I'm structured and modeling, but corporate world is not new to me. Doing the training is not new to me, I've been doing this for 28 years. So anyway, we just have to talk about like what the goals and what the structure are, but for sure once a month just isn't enough, there's too many things. After a week, people start slipping. So we could, let's just talk, because I need to think about it, but as a structure of talking on, and it could be half an hour, it doesn't have to be an hour. Like we have your whole business to go through top to bottom. We would, we'd have his, his team. So, you know, maybe the first couple of meetings are 60 to 90 minutes, and then it could probably go to half hour every other week with a structured email follow up and I have an idea of the overall goals, right? You want to have a certain level of attorney fees. You want to make sure that they're hitting targets for what do you call it? policy limits and just, I mean, I would get more information there probably than I have in a lot of our calls because he's like frontline with his team. So there are questions. I don't even know that I'd be asking right now that I would be asking. Yeah, I mean, if we, if that's time track, I would love to get them into that.\n00:35:46 - mark sweet\nI think that's not where we start, but yeah, I know, but they need a lot of help on how to work with their Wait, who both Lorenz and Patrick need a lot of help. I mean Patrick is really young, he's like 25. This is his first job out of law school really. So, you know, he needs a lot of help, not that it's fault in any way to shape or form. But, you know, if you say every week, every two weeks, every month, whatever you think they need, I'm four. But I want to try to straighten these team people because we're not funny, a lot better people out there, to be honest with you. So, go figure out how we can make them stronger.\n00:36:30 - Tina Marie (profitdriversinc.com)\nI mean, we've been watching the hiring process with you for the last few years, so I get that. And that was a conversation we had in the beginning, too, hire B players and turn them into A players or sometimes C players and turn them into B plus players. yeah, the really, it just depends on how they do. Some people don't need a lot. And you give them a little something and they stay top of mind and they run with it. And so, We can kind of, we could come up with an ideal structure and then get some feedback going between you and me on how it's going if they need more, they need less. They need less and just build that in if you want to talk about that.\n00:37:18 - mark sweet\nYeah. Dan, as a best friend, me and Tina to communicate on that or I don't know if figured that.\n00:37:31 - Dan’s iPhone (danddcompany.com)\nAll right.\n00:37:32 - mark sweet\nThanks for asking.\n00:37:33 - Dan’s iPhone (danddcompany.com)\nThanks for asking.\n00:37:34 - Tina Marie (profitdriversinc.com)\nYeah. He's for not requiring me to do that.\n00:37:37 - mark sweet\nI don't want to go around people. Right?\n00:37:39 - Dan’s iPhone (danddcompany.com)\nSure.\n00:37:40 - mark sweet\nBut yeah, I kind of figured you really want to be involved.\n00:37:44 - Dan’s iPhone (danddcompany.com)\nYou figured right.\n00:37:46 - mark sweet\nOkay.\n00:37:47 - Tina Marie (profitdriversinc.com)\nCool. Let's talk about the lead stuff and then I can check out of this call for the rest.\n00:37:51 - mark sweet\nOkay.\n00:37:52 - Tina Marie (profitdriversinc.com)\nCool.\n00:37:53 - Dan’s iPhone (danddcompany.com)\nI'm doing the lead stuff right now.\n00:37:56 - mark sweet\nYes. Yes. So. We need to change his right on loose deal that now we're getting some of those directly or that hasn't picked in yet.\n00:38:08 - Dan’s iPhone (danddcompany.com)\nUh, they, they, so we, they were doing the routing. Right. We, we weren't. So Eric is talking to, I forget her name. I think what he's going to do is say, Hey, take off. This is my guess. He'll go. He'll tell her take HQ out as an email reference and then we'll handle rotating because they're not rotating at all. Right. They just were, they're just being duplicated in two places. So he can then apply a rotation to it. So it'll hit us first.\n00:38:42 - mark sweet\nAnd then he'll rotate in and out, in and out, in and Got it. Okay.\n00:38:57 - Dan’s iPhone (danddcompany.com)\nAnd then the other ones are done.\n00:39:00 - mark sweet\nRight. So the Sunday thing now is done. We're interested to see how that goes. mean, I only got one call a Sunday, but yeah.\n00:39:13 - Dan’s iPhone (danddcompany.com)\nWell, yeah. And by, I mean, leads come in through the other things too. So, yeah.\n00:39:25 - Tina Marie (profitdriversinc.com)\nOkay. Mark, do you have any other things? Like, so you were asking about this still, like, what's on your agenda to go over today?\n00:39:37 - mark sweet\nWe go over Rolex because that's ever certainly right.\n00:39:41 - Dan’s iPhone (danddcompany.com)\nI just updated all their stuff. So a bunch of their stuff is ending. Not really just it just finished lastly. So there's not a lot. They got a bunch that are in and out of internal and with zoo. So probably have a better idea in the next day or two.\n00:40:00 - mark sweet\nOkay, I've seen a lot of the leads coming through, but I haven't seen anything of any value. So that's just why I was touching this a lot.\n00:40:07 - Dan’s iPhone (danddcompany.com)\nRight. So a lot of their, I send them all the outcomes. So like I showed them and they refund. They're really good about that. So like anybody that's retained, they just refund. So I think two or three, I just updated that they already have, they were already retained. And then I send them whatever the whatever is in Littify or wherever I'm getting it from, right? So I'm either getting it from each Q sheet or I'm getting it from Littify here. But they just right now, they just have a bunch that are open. So there's nothing to really see yet.\n00:40:46 - Tina Marie (profitdriversinc.com)\nWho is Russell? That's thirdly. Oh, okay. I'm safe to put that in my notes and teamwork, right?\n00:40:55 - mark sweet\nBecause nobody outside of us sees that. Correct. Okay, we've been sending a ton to Morgan and and they seem to be signing up a bunch of them. So we've got paid their leads are legit, but our turn down reasons are also legit. That's sort of the interesting thing. Right.\n00:41:19 - Dan’s iPhone (danddcompany.com)\nThey're not, it's not like they got a ton of, oh, we can't get in touch with this person. It's limited no treatment gap and treatment like they're all whatever. So it makes me, I mean, I think after this round, I'll be like, hey, you guys, like, what does your form look like But they went and did the math. I was like, go show me the math of this. And they did it and they brought it back and I was like, okay, so they're, they seem like perplexed. They're like, why the you edition. could be working better. They have another guy in Washington where they're like, he's getting a better result. I go, well, you're seeing our turn down reason. So either he, either where they're signing cases that are subsequently going to get dropped, or they just signed cases in their bad lawyers, and they don't realize, hey, there's limited no treatment there, you shouldn't be signing that, which I 1000% believe could be true. But yeah, I'm like, that's the difference. You're seeing exactly why we're turning them down. They're not being turned down because they don't sound good on the phone. It's like, they are not a good fit. What like, they're not a good fit for that other firm either. They just don't know it. That's what I think might be happening.\n00:42:48 - mark sweet\nWe'll see.\n00:42:49 - Dan’s iPhone (danddcompany.com)\nBut the math ultimately worked out in their first round. So it was like, okay, if we could keep that math. And then I told them, they didn't that they could do Spanish leads. And I was like, Oh, yeah, no, 100% Spanish. And they were like, Oh, I don't think they've ever actually really done that. So I see some Spanish leads came in. So we'll see. We'll see how those go.\n00:43:13 - mark sweet\nDefinitely handle Spanish.\n00:43:14 - Dan’s iPhone (danddcompany.com)\nYeah, they were like, wait, what? go, yeah, which was surprising. I'm like, really, your other firms aren't bilingual. Okay.\n00:43:23 - mark sweet\nDo you have what else we could do in New Mexico? Because New Mexico is looking good for us. It's just the volume is low.\n00:43:35 - Dan’s iPhone (danddcompany.com)\nI mean, those guys are in New Mexico, but yeah, volume is low.\n00:43:39 - mark sweet\nAnd that just may be just the New Mexico thing.\n00:43:44 - Dan’s iPhone (danddcompany.com)\nRight. Just purely based off of population size.\n00:43:49 - mark sweet\nAlthough there's way more than 20 good collisions a month.\n00:43:54 - Dan’s iPhone (danddcompany.com)\nRight.\n00:43:58 - mark sweet\nOkay. Then you know, we've Yeah, so have we got any retainers there yet, cases? Nope. You got like two leads so far. I'm going to refer down, but that's it so far.\n00:44:16 - Tina Marie (profitdriversinc.com)\nFrom where?\n00:44:18 - mark sweet\nWalker. It's a six month gap in treatment, so didn't want to screw down with it.\n00:44:28 - Tina Marie (profitdriversinc.com)\nYeah.\n00:44:29 - mark sweet\nBut I've got three firms that I would consent stuff to there.\n00:44:35 - Tina Marie (profitdriversinc.com)\nThree firms you can send stuff to there in Missouri. Burns.\n00:44:43 - Dan’s iPhone (danddcompany.com)\nThey get referred out.\n00:44:45 - Tina Marie (profitdriversinc.com)\nOkay.\n00:44:46 - mark sweet\nI've got a place to put them if they're not for us. So at least I get some kind of money back, hopefully at some point.\n00:44:51 - Tina Marie (profitdriversinc.com)\nOkay. That was, I was like, wait, are we talking doctors or?\n00:44:56 - mark sweet\nOkay. No, the doctor referral network is there and waiting for them to sort of send them. cases. But yeah, I'm not doing that.\n00:45:03 - Tina Marie (profitdriversinc.com)\nOkay. And is Monkey working on getting new leads there?\n00:45:31 - mark sweet\nValium's been the main one, I want to say in New Mexico.\n00:45:35 - Tina Marie (profitdriversinc.com)\nNo, I'm asking for Missouri.\n00:45:38 - mark sweet\nI think they said they were full.\n00:45:45 - Dan’s iPhone (danddcompany.com)\nThey do.\n00:45:48 - mark sweet\nBut I can certainly ask them again. mean, got a decent relationship. Right. So, hey, we lost. Let me know if there's any additional volume.\n00:46:00 - Tina Marie (profitdriversinc.com)\nRight. Okay. Um, is that anything Felipe can do?\n00:46:11 - mark sweet\nI'm trying to use them less and less to be frank with you because I just, their cost is just so high and it's just not great.\n00:46:22 - Tina Marie (profitdriversinc.com)\nDo you think there's any, do you think there's any possibility that that's different in Missouri?\n00:46:32 - mark sweet\nUm, I guess it's worth asking them.\n00:46:35 - Tina Marie (profitdriversinc.com)\nmean, because you don't have to do anything that you could, you could ask all the right questions, you know. I'm a big fan of asking.\n00:46:46 - mark sweet\nYeah, I'm going to text the morning.\n00:46:48 - Tina Marie (profitdriversinc.com)\nOkay. Okay. Okay. Let's see, oh yeah, I wanna write down. It's America that's building out that doctor map.\n00:47:13 - mark sweet\nYeah, so we have the excel of it, now she's putting it into a map.\n00:47:21 - Tina Marie (profitdriversinc.com)\nI love that you showed it to us because I can visualize it now and it makes it so much easier to just be like, oh, okay, that's great. So when you said that ideally, well, really that your max would be like three to five visits or three to five doctors per visit, is a visit a day? Is it a week? How do you think?\n00:47:50 - mark sweet\nYeah, because I really can't get through visiting more people than that in a day. Okay, give you hour, hour and a half for each doctor, plus usually at least 30 minute travel. time within each one. So, you know, I'm talking about give or take two hours and I don't want to rush necessarily.\n00:48:09 - Tina Marie (profitdriversinc.com)\nNo, right.\n00:48:10 - mark sweet\nEven if it's to five doctors, two hours, it's 10 hours and unfortunately sometimes it's tough to do a lot more than that.\n00:48:18 - Tina Marie (profitdriversinc.com)\nWell, and also the diminishing returns of just the conversations you're going to have towards the end of the day and that could have been one of the better doctors, know, that having more energy would be better for it. know what I mean? Like there's there's probably a sweet spot in there where those are going well.\n00:48:41 - mark sweet\nSo, five is okay. It's just when we're trying to do like seven or eight. It just it's too much crazy running around and we end up missing someone.\n00:48:48 - Tina Marie (profitdriversinc.com)\nWell, five well, then that's great. You're you're machine.\n00:48:57 - mark sweet\nGo out it like, you know, six in the morning.\n00:49:00 - Tina Marie (profitdriversinc.com)\nLike it's a very long day, but it's only one day you're still young. You you have I don't but it's fine, but again, I'd rather do that than spend two or three days in the same place Okay, let's see New hires How's it going on trying to find a Seattle attorney?\n00:49:27 - mark sweet\nUh, I think we might be giving up to be honest with you. Okay Because Most of our creators have said we spent way too much money trying to find one and you said no to everyone And every person we've interviewed so far has behind us So it seems like it's better for us to go and I find one of these older attorneys who for 100 bucks an hour we can just ask legal questions of just build out a person or two here so at least we'll get some of the legal brain drain that we need but we're just not finding the right person that is a strategy and it might be pretty cost-effective that's interesting you know again just we're not if we're not not finding the person and our big problem has been we don't necessarily know everything that we're doing talking to you know older slash semi-retired attorney at least he knows from the legal side yeah he's not going be as aggressive as we are whatever else but we can ask legal questions well not only that though if you establish relationship and they being local might hear through the grapevine when there is somebody that's good and then on your way like there's so many different\n00:51:00 - Tina Marie (profitdriversinc.com)\nways that can turn around something even better than just some good answers.\n00:51:04 - mark sweet\nYeah, that shoots me.\n00:51:07 - Tina Marie (profitdriversinc.com)\nYeah, I mean, and I think in that instance, then I would prioritize, obviously, the knowledge of the law and their willingness to just share that despite whether or not they agree with your strategy and then just the overall, I don't, it's not camaraderie. I can't, I don't know how to say it, but the openness, basically, that would allow you to establish a relationship that would be conducive to that kind of thing, you know, passing people on to you. It has to be something.\n00:51:47 - mark sweet\nYeah, I don't know to build it to the law. I mean, again, they're semi-retired.\n00:51:51 - Tina Marie (profitdriversinc.com)\nOh, so you have a specific person? Right, that's true. No, no, I'm asking you. Do you have a specific person?\n00:51:59 - mark sweet\nOkay, that's- So they posted on the list or like, hey, I'm looking to do more mentorship. want to charge like a nominal amount in like a hundred bucks an hour. What do you guys think?\n00:52:11 - Tina Marie (profitdriversinc.com)\nFascinating.\n00:52:14 - mark sweet\nSo I'm going to chat to them and. We got emails them already.\n00:52:21 - Tina Marie (profitdriversinc.com)\nWhat's that?\n00:52:22 - mark sweet\nI already have an email to him.\n00:52:25 - Tina Marie (profitdriversinc.com)\nOkay. Do you have a first name? So when I ask you, I don't want to say the guy.\n00:52:30 - mark sweet\nCurtin.\n00:52:32 - Tina Marie (profitdriversinc.com)\nWhat was his first name? John. Okay. Moving along.\n00:52:42 - mark sweet\nYou know what? the Arizona.\n00:52:46 - Tina Marie (profitdriversinc.com)\nWhat might be.\n00:52:47 - mark sweet\nThis guy, thought he was in Washington. Oh. But even still Arizona is the same idea.\n00:52:55 - Tina Marie (profitdriversinc.com)\nYeah. Well, you already have two attorneys here.\n00:52:59 - mark sweet\nYeah, neither one. really knows what hell they're doing. Again, just having someone like an expert. Yeah, you can just, you know, talk to you and whatever else.\n00:53:11 - Tina Marie (profitdriversinc.com)\nI really like that strategy. It really speaks to more of what Dan has kept trying to push towards just leaning out, uh, out, leaning out, um, out. Yeah, I said it, but then I was thinking about like leaning to the side, but you knew what I meant anyway. Yeah. Okay, let's see. Einstein, AI, client breaking. Oh, that's, and that was the litify stuff.\n00:53:47 - mark sweet\nWait, no, it wasn't. Notifies the sort of on some AI, but I still think we've got to build us out ourselves. And the reason for that is, uh, um the litify price is ridiculous oh yeah right the one like five dollars a file which is just oh yeah um so i think there's some there with Einstein uh Isaac's been out sick the last week or so oh also Isaac's been a child just FYI in November Isaac is i mean he's not the one physically but yay that's awesome congrats Isaac and is he taking paternity leave?\n00:54:31 - Tina Marie (profitdriversinc.com)\ni don't know i need to ask him about that i don't think so because he's the main breadwinner but i'm not sure um so then what do we have any thoughts on how we would implement building something in house i mean it could be really minimal that's what i was hoping\n00:55:00 - mark sweet\nthing, maybe Dan and Josh kind of had, because I'm more than sure Josh is going to say the same thing of $5 a file is just dumb. Yeah, like there's no way they're going to pay that. And so maybe if we all kind of work on it together, we can find some of the all of us. But I would ask him like, Hey, did you see the pricing on it?\n00:55:25 - Dan’s iPhone (danddcompany.com)\nBecause I'm sure he has.\n00:55:30 - Tina Marie (profitdriversinc.com)\nAll right, well, that's a start. So Dan, do you want to ask Josh about it? Mark, do you want to email Josh and Dan and like, how do we get this to move?\n00:55:44 - mark sweet\ndon't really communicate with him too much. So I'll be better for Dan.\n00:55:52 - Tina Marie (profitdriversinc.com)\nDan, do you need a reminder for this? Nope. Okay, so the notes that I have regarding Einstein AI was client ranking, so I want to just make sure that I don't want to direct something wrong. So what would we want to be doing with the AI?\n00:56:39 - mark sweet\nSo what we found solidified built out was taking a scan document and renaming it, being able to pull in information with their visual AI, whatever they're calling it. Einstein AI should be able to do the same thing, which again, is taking from scan to pull up and client name, data service, the data incident, the amount, and then being able to put that and create the fields within our data.\n00:57:34 - Tina Marie (profitdriversinc.com)\nAll right, Dan, I am Kinging Stacey for a task for you with that information that Mark just gave.\n00:57:45 - Dan’s iPhone (danddcompany.com)\nDon't up at 4 a.m. on Mondays anymore, okay? Okay. Well, now I'm talking to Eric about these themes.\n00:57:55 - Tina Marie (profitdriversinc.com)\nOh, yeah. forgot it was a doggy thing. Hopefully that gets regulated. Think couple months some Warren G out there to regulate All right Case that's good.\n00:58:14 - mark sweet\nSo the money is gonna be here very shortly. So yay. it's great. Happy Upset about that But now it gets you tax planning yay.\n00:58:27 - Dan’s iPhone (danddcompany.com)\nOh Oh, yeah, Dan.\n00:58:30 - mark sweet\nCan I pay Tina for like a year ahead of time or six months at a time so I can take more money off Oh I can run that by my account especially if you pay especially wait how do I get ambax points off that when we can think of that? Yeah, I mean it might count shortly Okay, yeah, no that all makes sense Yep, I'm all for the em exponents make it make sense. That's all I say. I don't even know So for discount for paying up front, that's right.\n00:59:02 - Dan’s iPhone (danddcompany.com)\nYou wouldn't go in anyway. Oh, speaking of paying up front, why am I not charging you for lead flowy?\n00:59:08 - mark sweet\nDoes anyone know this?\n00:59:10 - Dan’s iPhone (danddcompany.com)\nUm, I was like, I'm like, what? Can you see not been paying for this this entire time?\n00:59:16 - Tina Marie (profitdriversinc.com)\nIt stays as like, no, don't you have our fees integrated in? So I don't know how that happens.\n00:59:28 - Dan’s iPhone (danddcompany.com)\nNo, everything is separate. Okay. like multiple everything. I'm the worst bookkeeper ever.\n00:59:36 - Tina Marie (profitdriversinc.com)\nLiterally everything.\n00:59:38 - Dan’s iPhone (danddcompany.com)\nEverything is online.\n00:59:39 - Tina Marie (profitdriversinc.com)\nI know.\n00:59:40 - Dan’s iPhone (danddcompany.com)\nOkay. Um, yeah.\n00:59:46 - Tina Marie (profitdriversinc.com)\nmean, that would be so let me go.\n00:59:50 - mark sweet\nSo I mean, you charge 41 grand since June 1st.\n00:59:58 - Tina Marie (profitdriversinc.com)\nCool.\n00:59:59 - Dan’s iPhone (danddcompany.com)\nWhat? Wait, um, Well, yeah, that's because I that's because I am ex you I chart. Have absurdly charged me and then I charge you one.\n01:00:09 - mark sweet\nThat was a 25 grand, right?\n01:00:11 - Dan’s iPhone (danddcompany.com)\nYes, that's me fouring points and then I I have the SEO company charge me and then I charge you No, I'm cool.\n01:00:22 - mark sweet\nNo, I'm cool. I'm cool.\n01:00:23 - Dan’s iPhone (danddcompany.com)\nYeah. so I just everything everything except No, even Tina Tina charges me and I charge you so yeah Within three days of each other Yeah, so the fourth out one of the four thousands is the Google my business guys got it one's us I mean Stacy Denver, but they're definitely the actual Yeah, they are the act what they're actually for is in there just not what you're saying Because your peeps are always like where's the blah blah blah to send whatever they want.\n01:01:01 - mark sweet\nGot it. Okay, no, as long as it's legit, because usually when I see like back to back like a question mark, but no, as long as it's good, we're good.\n01:01:09 - Dan’s iPhone (danddcompany.com)\nIt's legit.\n01:01:12 - Tina Marie (profitdriversinc.com)\nIt's legit.\n01:01:13 - Dan’s iPhone (danddcompany.com)\nAnd can it quit to quit?\n01:01:15 - mark sweet\nAnother not quick, because it seems to generally work. So then, Dan, you and I need to find the time to talk to the hot people, because that's going to keep going on for a little while.\n01:01:28 - Dan’s iPhone (danddcompany.com)\nYeah, I don't even really know what they do.\n01:01:30 - mark sweet\nSo, yes. Okay.\n01:01:33 - Dan’s iPhone (danddcompany.com)\nLet's put them over a barrel.\n01:01:36 - mark sweet\nI'm cool with that.\n01:01:37 - Dan’s iPhone (danddcompany.com)\nYeah.\n01:01:38 - Tina Marie (profitdriversinc.com)\nYeah, like Thursdays.\n01:01:42 - Dan’s iPhone (danddcompany.com)\nThursdays. Target a Thursday.\n01:01:44 - mark sweet\nYeah.\n01:01:44 - Dan’s iPhone (danddcompany.com)\nOkay. I'll tell you, I'll look at my calendar that I don't use, and then tell you what my openings Don't be this Thursday because I got to cook for the office this Thursday again.\n01:01:54 - mark sweet\nYeah, maybe pictures of that. It's just barbecue day.\n01:02:00 - Dan’s iPhone (danddcompany.com)\nYeah. And by cook, is this you opening take up barbecue from somewhere else and putting it on the grill and then putting it on a plate or is there going to be raw food involved?\n01:02:10 - mark sweet\nVirtually probably because now we have to like sit there and cook on one small grill.\n01:02:14 - Dan’s iPhone (danddcompany.com)\nMark's going to be like, I slaved over these are three day baked baked baked beans. I've been, I soaked the beans first, then I'd get out my amens.\n01:02:22 - mark sweet\nsystem we picked each and every one.\n01:02:24 - Dan’s iPhone (danddcompany.com)\nYep.\n01:02:24 - mark sweet\nI grew these in my backyard.\n01:02:27 - Dan’s iPhone (danddcompany.com)\nAll organic.\n01:02:31 - Tina Marie (profitdriversinc.com)\nLike a Korean barbecue, Mark's going around with all these lungs.\n01:02:35 - mark sweet\nNo, they want the Mexican stuff. want carne asada, oh yes.\n01:02:43 - Tina Marie (profitdriversinc.com)\nI'll probably cook some of it the night before and just reheat the next day. Yum. Well, I think I had a good breakfast or I'd be hungry and mad at you guys now.\n01:02:54 - mark sweet\nBut it's always a matter of the general rule of thumb.\n01:03:00 - Dan’s iPhone (danddcompany.com)\naccurate.\n01:03:01 - Tina Marie (profitdriversinc.com)\nLet's see, Dan wants Mark to get Patsy's hub valiant to show us inside. Oh, husband. Oh, yeah. My shorthand size. Uh, how's that? Um, can we? Patsy's husband.\n01:03:23 - mark sweet\nI always forget his name. It's Mary's, but that's okay.\n01:03:26 - Tina Marie (profitdriversinc.com)\nOh, okay.\n01:03:27 - Dan’s iPhone (danddcompany.com)\nMy bad. Mary's somebody's husband.\n01:03:30 - Tina Marie (profitdriversinc.com)\nYes. Mary has, what's his name?\n01:03:33 - Dan’s iPhone (danddcompany.com)\nDon't know.\n01:03:34 - mark sweet\nUh, Devin.\n01:03:36 - Tina Marie (profitdriversinc.com)\nValiant. Oh, yes. In parentheses, I know, but I need all the different anchors in my brain so I can not combine things together to show us what he does. So who's trying to talk to him?\n01:03:54 - mark sweet\nAre you trying to talk to him, Dan? I just sent him a message, but Dan, no more, be under the hood.\n01:04:00 - Tina Marie (profitdriversinc.com)\nWell, What?\n01:04:00 - mark sweet\nDan wants to be under the hood what he's doing.\n01:04:02 - Tina Marie (profitdriversinc.com)\nhe's making it work, which. Right. I mean, Dan getting sneak peeks at things is how Dan does like some crazy magic. So that would be cool. OK, I've gone through my list. We got that one task, everything else. And you're going to work on the intake script with those guys.\n01:04:31 - mark sweet\nI sent to you. Take a look at it. mean, maybe I'm being too harsh.\n01:04:38 - Dan’s iPhone (danddcompany.com)\nWell, yeah, I mean, I just listened to the calls. And it was like the my takeaway from listening to the call was like, oh, my God, they waste so much time not. It's like it's like it's two things. The first section is like, should I even be on this call? Then it goes into a script, right? So it's almost like the. There's just like this qualification question or three that then would that then would turn into more of like what you were getting at where they're the rapport and the bump of fire, whatever. But I mean, I listened to a handful of calls and I was like, Oh my God, they're eight minutes in and the person's just recapping the accident that subsequently turned out. There was no injury. It's like, you got to get that out of the way up for impossible. Or it wasn't a car or it was like not even a car accident, right? There's a few of those.\n01:05:33 - mark sweet\nwas like, Oh, yeah, was playing this. Uh, said tomorrow the one came today asked about Thursday. We'll find a time.\n01:05:44 - Dan’s iPhone (danddcompany.com)\nOkay.\n01:05:46 - Tina Marie (profitdriversinc.com)\nUm, so I have a question though. Yeah, you said you listened to calls. Did Mark send us calls or did you listen? Because I would love to hear how that goes.\n01:05:55 - Dan’s iPhone (danddcompany.com)\nOh, you can. I can get you. They're in the lead flow. You can just go and listen to them.\n01:06:00 - Tina Marie (profitdriversinc.com)\nI spent six years at a call center, so learning how to kind of craft that with something that I spent a lot of time on. How can I get into lead flowing into this?\n01:06:12 - Dan’s iPhone (danddcompany.com)\nWell, I'll add you as a user.\n01:06:14 - Tina Marie (profitdriversinc.com)\nOkay, cool. Do you need a reminder?\n01:06:18 - Dan’s iPhone (danddcompany.com)\nWell, I'm thinking, I don't know, I don't know if you, have you seen, have you used the new thing?\n01:06:22 - Tina Marie (profitdriversinc.com)\nDo you have the paid chat, GPT, Tina?\n01:06:24 - Dan’s iPhone (danddcompany.com)\nDoug.\n01:06:25 - Tina Marie (profitdriversinc.com)\nAs soon as it was optional, yeah.\n01:06:28 - Dan’s iPhone (danddcompany.com)\nOkay, so have you used the thing where you create your own agent, so whenever?\n01:06:34 - Tina Marie (profitdriversinc.com)\nI think I've created one, was playing with it, but I'm, no, I've played with the agents, but not.\n01:06:41 - Dan’s iPhone (danddcompany.com)\nSo now, yeah, there's like a new section where you could go in and like create an agent. Yeah, so I was, I messed with it with Eric and we created. So basically for lead flow, like some of the stuff that we did recently, you have to use these custom JavaScript elements and it was like. Okay, well we need to write JavaScript and then I was like, well, we could just make an agent that writes a JavaScript for us, right? And so first we had Chachi indeed just write JavaScript and it totally worked, like right out of the gate. We just had to figure out how to present it in the workflow or whatever, but ultimately the code was worked. We just had to tweak like two things. So now we've created this, the implementation there is what's called vanilla JavaScript. So it's like not using outside libraries. It's like straight JavaScript. So we created a vanilla JavaScript agent that we now just use. So all it does is work with us on JavaScript. So you could create an agent in GPT and call it like literally like an intake, legal intake agent. And it can listen to recordings that we could feed recordings into it and say, Hey, here's these recordings and then start to ask your questions like what and tell it what the goal is right and then see how are these calls line up against that goal or something like that that could be interesting yeah private server though right there's the turning client privilege issues are they a client yet there's a turning client privilege issues okay it's it's a self-contained yeah it's like your gpt or the account holder's gpt so it would be like if tina built it in her it would be in her gpt it's not publicly accessible okay so it basically has the same kind of privacy as like litify does it's on their server but you know it's it's protected by privacy laws in the same kind of way okay but first of almost just listen to calls.\n01:09:02 - Tina Marie (profitdriversinc.com)\nYeah, for sure.\n01:09:03 - Dan’s iPhone (danddcompany.com)\nBecause the other thing is you could just take the transcript and be like, Hey, here are the, it would just be interesting to be able to know like, what is similar about the first three minutes of these calls without, right? It's like, are they, I don't know, find the same old table, like, what are the patterns? You can find the patterns, then you can deal with the patterns or, or, or overcome whatever. Yeah, I'll get, I'll get to your user and then you can just go start. You basically just sort by time and then you can listen to like the calls that have some bulk and then you get an idea.\n01:09:45 - Tina Marie (profitdriversinc.com)\nGot it. I'll probably have questions too before I start listening. I can kind of zero in on what are the best types of calls. So I can get a good sampling.\n01:09:56 - Dan’s iPhone (danddcompany.com)\nWell, the other crazy thing is that now you have like, this the AI agents the voice AI oh yeah so like imagine all your calls I'm not saying you do this right now but if you have a voice AI that acted as like acted as I'm just gonna say secretary but active like the first line in of every call goes to this same person and all their job is is to do that qualification piece have you been in an accident oh okay great let me let me put you in touch with and it could literally say Patsy and then it would try to transfer the call to Patsy like automatically you could definitely get to that in the very near future yeah which is still got some more I'm sure you saw like McDonald's stop doing it so the other ones it yeah you have to train the AI 100% well we're actually testing so we So, I don't think I've ever mentioned this before, initially we had going back to when we first started Leopler, where it's not a bot, but we had this text automation. We're like, hey, you're probably on your phone right now, going to try calling you. That's all just if then type , it's very linear in a way. There's some decision. Free stuff happening, but then we put in the AI bot. Just overnight, like, let's say we did two months ago, I forget how long ago we do it, but we compared the chat automation versus the AI bot and they're kind of neck and neck. So now we opened up the AI bot a little more to some of the other leads, but we're, we're going to go out and test this other AI bot. that's even more intelligent than what we had. So Eric's building that bot right now, but that service that we're using that we're testing, they actually doing voice AI as well, but I mess with that side of it. Yeah, we'll see.\n01:12:21 - Tina Marie (profitdriversinc.com)\nIt's not working interesting. Are you from now? For I don't like to put dependencies on new technology that could be expensive if it failed. I like to play with new technology when it's just a playground and it's kind of sandbox and it can't hurt anything. But for this type of thing, because your front line is so important, I'd probably wait a few months at the very least, but if not more like a year until that's really honed out. Well, the other thing is, then they're becoming... comes a greater market awareness, more people are familiar, hey, there are AI agents, you know, we're talking to people and it just becomes a little bit more accepted and more mainstream so that you don't risk alienating people that may be like, oh, there's a pause in between every conversation. This is AI, you know, I don't know how many people know but those are just the things to think about as technology evolves and arises. I think that we're going to want to implement it. I think that it is the way to the most leveraged business but I think that the on-ramp should be slow. I'm a huge proponent of the technology and AI. love it but I think it has to have guardrails and I think certain types of it need to really be well refined than what other people be guinea pigs before we go. there and the front line of your business is definitely one of those places.\n01:14:06 - mark sweet\nIt's cool. But yeah, I get what you're saying.\n01:14:09 - Tina Marie (profitdriversinc.com)\nYeah, Dan has a rule of, you know, what would be cool is, yeah, I don't hate it. No, no, no, you know what cool, you know, what could be cool is bad. It's automatic red flag.\n01:14:24 - Dan’s iPhone (danddcompany.com)\nYeah, it's a yeah, that might be cool. But what would be cool is if you could burn more leads period.\n01:14:31 - Tina Marie (profitdriversinc.com)\nYeah, which is, you know, we've got a good plan in place. So, oh, wait, the question was, my last question, Dan was, do you need a reminder to set me up an account so I can go listen to calls?\n01:14:46 - Dan’s iPhone (danddcompany.com)\nNo, I'll do right now because I'm already in there.\n01:14:51 - Tina Marie (profitdriversinc.com)\nYee-haw. And then Mark to follow up with you on Lorenz and Patrick, how would you Do you like to proceed?\n01:15:01 - mark sweet\ncan email and we can talk to them and see what their schedules look like. And I'll just text you on the side and we'll figure it out.\n01:15:10 - Tina Marie (profitdriversinc.com)\nOkay. And also, if we're doing whatever the pay in full for the year, would rather that.\n01:15:19 - Dan’s iPhone (danddcompany.com)\nOh yeah, there you go. Because you paid differently. No, what do you mean? There you go. I have no idea what I'm talking about. Bill, I'm going to do that on task.\n01:15:28 - Tina Marie (profitdriversinc.com)\nBill doesn't do me. Anyway, I don't know how you pay Dan, but he pays me through PayPal, and I'd rather not have PayPal take a huge chunk out of that. So I can send wire information or something.\n01:15:42 - mark sweet\nSo I do for a bigger contract. to vote Dan and I like our points a lot.\n01:15:46 - Dan’s iPhone (danddcompany.com)\nOkay. That's right.\n01:15:49 - Tina Marie (profitdriversinc.com)\nThat's right. I do.\n01:15:51 - Dan’s iPhone (danddcompany.com)\ntake fees too, but I can all take fees.\n01:15:54 - Tina Marie (profitdriversinc.com)\nI think PayPal and Stripe are pretty much the same. right? I have no idea.\n01:16:00 - Dan’s iPhone (danddcompany.com)\nYeah. don't know.\n01:16:01 - Tina Marie (profitdriversinc.com)\nI'll go. Oh, I'll look and set up one thing for you. I don't know.\n01:16:07 - mark sweet\njust think they're sure.\n01:16:08 - Tina Marie (profitdriversinc.com)\nOkay. Anything else that we did not discuss that needs to be actioned or noted to be actioned and talked about next week?\n01:16:20 - mark sweet\nMonkey just got back to me that they don't have volume right now, but they might in the next month or two.\n01:16:27 - Tina Marie (profitdriversinc.com)\nOkay. Well, that's something.\n01:16:29 - Dan’s iPhone (danddcompany.com)\nAll this honesty. They don't want to get. They're like, we don't want to get canned on what we're already doing.\n01:16:38 - mark sweet\nThey're like, I mean, we got to be one of their bigger players at this point.\n01:16:42 - Dan’s iPhone (danddcompany.com)\nYeah, and super consistent.\n01:16:44 - mark sweet\nYeah. So yeah, I'm sure they want to try to make sure we stay happy. Okay. See where it goes.\n01:16:50 - Tina Marie (profitdriversinc.com)\nOkay.\n01:16:52 - mark sweet\nOkay. else? Nope. Okay.\n","contentPreview":"00:00:08 - Tina Marie (profitdriversinc.com)\nare you here? can't hear you. Yeah, let me get on my time.\n00:00:17 - mark sweet\nYeah, I'm just as nice as about it.\n00:00:20 - Tina Marie (profitdriversin...","processedAt":"2025-05-04T03:40:52.621Z"}