{"fileName":"Done ranscript for Maria Gudelis.txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done ranscript for Maria Gudelis.txt","type":"transcript","priority":"medium","content":"00:00:03 - Maria Gudelis (Maria Gudelis)\nHello, hello. Hello, hello.\n00:00:15 - Tina Marie (profitdriversinc.com)\nI can't hear you.\n00:00:18 - Maria Gudelis (Maria Gudelis)\nI can.\n00:00:19 - Tina Marie (profitdriversinc.com)\nIt looks like you said you can, but.\n00:00:23 - Maria Gudelis (Maria Gudelis)\nYou can hear me.\n00:00:24 - Tina Marie (profitdriversinc.com)\nI cannot hear you. I can't of what they're working.\n00:00:34 - Maria Gudelis (Maria Gudelis)\nTesting testing.\n00:00:35 - Tina Marie (profitdriversinc.com)\nTesting one to. I can't hear you.\n00:00:38 - Maria Gudelis (Maria Gudelis)\nI went into my own settings and check like aah.\n00:00:42 - Tina Marie (profitdriversinc.com)\nHow are you?\n00:00:44 - Maria Gudelis (Maria Gudelis)\nGood, good, 1996, I was Apple support. You're kidding.\n00:01:01 - Tina Marie (profitdriversinc.com)\nNope. No way.\n00:01:03 - Maria Gudelis (Maria Gudelis)\nYup.\n00:01:04 - Tina Marie (profitdriversinc.com)\nI supported PowerMax and the first IMAX and I also worked for Intel as a technician and I built networks and I supported their network adapters and so I talked to people in NASA and the Pentagon and helped them fix their networks and.\n00:01:20 - Maria Gudelis (Maria Gudelis)\nHoly crap.\n00:01:21 - Tina Marie (profitdriversinc.com)\nThat's amazing. I can build a network from the ground up like the server including the cables I can crimp the cross over cables and networking cables and I'm a nerd.\n00:01:33 - Maria Gudelis (Maria Gudelis)\nYou're really cool. My first when I left Delight Tush I was actually where for computer sciences corporation when I left Delight Tush they had a hundred of me to go into the States and then when I left them in 1999 I started a software company hosting websites in Southern California and cable Tron systems, the competitor at that time to. that? The big one that's there though, didn't tell anyway funded us like over million dollars to use their servers instead for our server farm and it was a brilliant venture capital financing because like they find us as a million dollars but it was in equipment. So it's a win win for everybody right because that was the most expensive thing at the time. So different now right, but at the time like you could charge $50,000 to build a website and host it for these medium sized companies California.\n00:02:34 - Tina Marie (profitdriversinc.com)\nYou have been in it for a while. Corporate experience was my first business experience I didn't like it's really a long time to get comfortable with certain amounts of money and things and realize that that's what I was doing. Because I did the technical stuff but then I became a technical lead but I was responsible for hiring, managing, training, supporting. meeting metrics, meeting with the clients, meeting with the head honchos at Intel and at Apple. And I would also play Peaceball with them and beat them and then get free dinners because I want like what, learning about staffing and understanding the metrics because we were constantly getting threatened with losing our jobs. They would be going to either Costa Rica or the Philippines. And so the reporting was really archaic at the time and we had Lucid technology systems for our phones before they got bought out by Orion.\n00:03:36 - Maria Gudelis (Maria Gudelis)\nthink it was or the other way around.\n00:03:38 - Tina Marie (profitdriversinc.com)\nYeah, yeah. But, and I fell in love with telephony rooms and systems and IT at that time, but so I figured out how to be proactive about learning our numbers and our metrics because what would happen is we would get yelled at, we would see our person coming down the road now. call centers where all most of them were entry-level job positions. Yeah. people come in and be trained and the managers weren't much better. were recovering drug addicts, you know, like the town that I live in, we rank in the top five for domestic violence and unemployment and poverty, and all these other things. And so that was the hiring pool, which made performing well really difficult. And so most of the head level leaders were imported from other places. But anyway, there was a lot of, you know, not really corporate kind of handling of things, a lot of threats, lot of, a lot of, a lot of, lot of things, a lot of sleeping around, all kinds of more accessible stuff. So, but if anything would go bad, you would just see them just down the aisles like, well, what just happened? Well, they got chewed out by Intel for not meeting metrics. And so now everything flows downhill. I got really tired of having my job buttons. I was a mom and I didn't want to like, I don't want to do this kind of stress. So like, how do I figure this out? And so one of my nerdy friends, who was also LDS, I'm more in church of Jesus Christ Latter-day Saints. Anyway, he's nerdy. And I would see him in Excel all the time. might teach me about this and he taught me about formulas. And I'm like, so if I took this report that doesn't have all the data I want. But if I could plug it into this spreadsheet and then have another tab that got this other report and another tab with this other report, I could pull this data from five different sheets and get a summary tab that had calculations that told us exactly where we are at with metrics. And he's like, yeah. So I took about an hour and figured it out. And so now what used to take people days and several hours to figure out because they didn't even know where to get the data. Which by By the way, the same situation I still find with business owners all the time when I asked their metrics, they're like, I don't even know where to get that. So, nothing's changed because that was, you know, years ago. Yeah, 28 years ago. And so, it would take me, once that started to happen, I just did it every week, every Monday I would get my data, took me about 15 minutes, so I'd import each of them and then just go make sure the calculations were correct and make sure I could wrap my brain around what was happening. They ended up implementing it worldwide, corporation as a worldwide company. And it took me probably 10 years before I realized how exceptional that was, had no clue. But they were using a system I came up with in an hour all over the world. Like, I still think about that, sometimes I think I probably don't appreciate the way my brain works. works and but also this is it simple systems yep so nothing has changed people still over complicate things and mostly it comes down to you they don't ask good questions and then they don't force themselves to come up with the true answer so when i talk with people i saw your post today and i'm like i bet we're very similar to the saying but you will probably ask the question and be like oh wait get the answer go ahead that's how i said i'll just be on a call and and they say i don't know i said okay let's find out and we'll have to go look at this and this i'm i got an hour you paid for it let's go get it yeah yeah yeah well all my other questions i love asking on like more like well it's business coaching but it's really life coaching where a lot of them always say like this is not to be about kpi's or metrics but specific to like you know sometimes they don't know the strategy they should do or that's not the right word but that is i always i think what if you did\n00:08:00 - Maria Gudelis (Maria Gudelis)\nNo, like what if you didn't know, you know, you just keep digging and digging.\n00:08:03 - Tina Marie (profitdriversinc.com)\nTell me more. Yeah, tell me more is great.\n00:08:06 - Maria Gudelis (Maria Gudelis)\nYeah, so that's interesting about your background. That is cool. So like, wow, have you thought about with your background then? explains why you're still going to what you do. Have you ever thought about starting your own software type company then?\n00:08:20 - Tina Marie (profitdriversinc.com)\nNo, there's a whole lot of things. This is the thing I've had to learn is that I'm really good at a lot of things, which is because I can doesn't mean I should. I'm working on my psychology degree and it has nothing to do with my business other than people also say, can I need you to be like coach Tina today? And I have an attorney in LA and they do about four million a month. And he says, do you help people find their purpose? I was like, nobody hires me for that, but it's happened accidentally. Yeah, you're talking.\n00:08:54 - Maria Gudelis (Maria Gudelis)\nThere's a lot of skills that I have, but what I feel called to most.\n00:08:59 - Tina Marie (profitdriversinc.com)\nYeah. is being God's love. And there's just not enough, but there's very judgy Christians. There's very, there's just a lot of pain and anger. But are you familiar with the parable of the seed? Not the mustard seed, but the seed that landed in the desert, landed in the rocks, landed in the, and got blown away. Like there's four different places, I think, where the seed landed. when it landed in good soil, that's when it grew and nurtured. And so I don't have to really preach the gospel. I can be God's love. I can be the example so that when the time comes and they get introduced or they're ready to live any kind of way, he won't be strange to them because they will have felt unconditional love. Because, sorry.\n00:09:55 - Maria Gudelis (Maria Gudelis)\nIt's okay.\n00:09:58 - Tina Marie (profitdriversinc.com)\nBut God's house. to the house of water. I bring order to their business and it comes out in their homes. When I help people install boundaries into their lives, into their business, they install them in their daily lives with their spouses, their kids, with themselves, with their friends, their lives change and they become stronger, they come and more independent, they become better leaders, they become more sovereign beings and to me, that's the kind of people that are God's people. So even if they don't really feel like I still feel like I'm serving Him and giving His love. So there's a lot of different ways we can serve but I feel like my best, like I used to post on social media a lot, the reason I haven't been out is because I really felt like I needed to concentrate and think of like when you get concentrated juice versus when it's watered down. potency is different. so there was a time I felt like I needed to concentrate more on my immediate sphere, on my children, on my sweetheart, on my sisters, on my friends, on the closer people. And I feel like I've been able to serve and strengthen them well enough that now I can go out and increase in my circle of influence. But it is really going to be around strengthening people, helping them become their best selves, become the leaders that they can be in their own spheres of influence. And again, there's lots of ways to do that. But really, it is through teaching people, improved operations that, you know, it starts with business, but it really applies to life and they and they overlap because it's people that run business and people that run their lives. I won't be distracted into any other Shiny object and opportunity because this this is my calling for sure.\n00:12:04 - Maria Gudelis (Maria Gudelis)\nCool and it's funny like and I don't know how much work will get done right now this call because we can hook another call right um and don't pay for it. just want to the book. Oh no it's fine. Yeah getting to know each other but that like it's fun you know because we all went through a lot of life stuff over the last few years um when my dad did pass away I like obviously I went on a downward spiral because I was the closest to my dad of all the siblings like and I was the youngest one right so the baby and uh how many siblings do you have?\n00:12:33 - Tina Marie (profitdriversinc.com)\nWhat's it? How many siblings do you have?\n00:12:35 - Maria Gudelis (Maria Gudelis)\nThree.\n00:12:36 - Tina Marie (profitdriversinc.com)\nOkay just wanted to put that in perspective okay.\n00:12:39 - Maria Gudelis (Maria Gudelis)\nOh got you have older sister older into all their older brothers and um I think and I'm the only one that's the entrepreneur the rest are scientists chemists and yeah my sister's a uh doctorate in uh pharmacology toxicology and and she's a cool stuff of children's age research you know. When it. like there's more than 90s and stuff, she's retired now. yeah, the other two are engineers, but so I went the business route. But I think also, because I'm the youngest too, I always I realized after my dad passed away and all this life changes about my own inner work, is that I realized I was doing a lot of things to please my dad. I didn't realize that the laughter. And I also asked my mom a few times because she's very spiritual and I said, know, like, what do we hear for? You know, because it's like, what is this early all about, you know, because that was the first close death to me. And it's an interesting, my mom said, well, it's it's to be God's love, you know, so it's funny what you say, because like, you know, lot of people have different answers, like, why are we here on earth is that? But that's why mom says, it can be that simple, you know, and I'm like, wow, I never thought of it that way. So, so yeah, I'm sure there's a reason you're right. Well, I are process connected. We say, if you're big hug, I'm a big hugger. Oh, thanks. Yeah, yeah, so so I've been having fun the last little bit. I'm helping some people with their their funnels and all that, so. I'm not sure which way you want to go, you know, what do you want to take this call?\n00:14:22 - Tina Marie (profitdriversinc.com)\nWell, what I want to know is you had notes. You had notes when we talked to you said you have ideas. I want to hear for those ideas.\n00:14:29 - Maria Gudelis (Maria Gudelis)\nwill pay to hear those ideas. Oh, OK, I have to go up and get it.\n00:14:33 - Tina Marie (profitdriversinc.com)\nIt's in my I'm downstairs right now. Do you mind?\n00:14:37 - Maria Gudelis (Maria Gudelis)\nI don't mind. I'll wait. No, yeah, what I'll do just give me about five minutes because I got to go find the art book. I can't remember whether it's up in my office still or over.\n00:14:47 - Tina Marie (profitdriversinc.com)\nI have like three places in my home I work from. I am not in in a hurry. My life and my work is so leisurely. Maria and the people that I work with, I choose the same kind of vibe.\n00:14:59 - Maria Gudelis (Maria Gudelis)\nSo whatever it takes. I'll just do some stuff. Yeah, give me about five, seven minutes. I'll actually put the T kettle on too and make a cup of tea. And because I, yeah, like I, it's funny because I'm going to take my mom to the art store again soon, I was like, oh, out of artwork. So I have to find where I put it, because it was once after your meeting, it was full.\n00:15:20 - Tina Marie (profitdriversinc.com)\nSo yeah, so give me five, 10 minutes. I'll be right back.\n00:15:24 - Maria Gudelis (Maria Gudelis)\ncool, love it.\n00:15:59 - Tina Marie (profitdriversinc.com)\nOK. You You You\n00:22:00 - Maria Gudelis (Maria Gudelis)\nYou All right, she's getting back. Oh, no, it's keep going. I'll just keep breathing.\n00:22:53 - Tina Marie (profitdriversinc.com)\nKeep going. My little FTT month slack. Okay. Yeah, I'm right.\n00:23:01 - Maria Gudelis (Maria Gudelis)\nOkay. Cool. Cool. I brought my iPod down to and connected it and we can even just be drawn as if you need to go to. Yeah, I got this an action. can take a picture of it, send it to a boxer after or, you know, yes, please, ma'am. Yeah, I'll do that.\n00:23:17 - Tina Marie (profitdriversinc.com)\nSo let me go with going people about to telling friends about you about how awesome it was talking to you and what your notes look like when we were done.\n00:23:25 - Maria Gudelis (Maria Gudelis)\nlike, oh, her brain is different. I want to see it.\n00:23:31 - Tina Marie (profitdriversinc.com)\nCool. What's like that?\n00:23:33 - Maria Gudelis (Maria Gudelis)\nI'm a weirdo. I love it. love it. Let me. Oh, well, you're going to be able to see the picture. But anyways, there's one picture we didn't I remember from the last call that was the beginning as well. So we thought just doing some the audience building with some quality videos. So this thing I just sent you this on Voxer, like it was kind of the videos you see video one and then V2 for video two. So video one is just about client's day with me for nine years. So I thought that was huge. So I really just took notes of some of the kind of repeatable tuples that you say as well, but it was really too, I don't know like what I did, hey, hey, hey, no, Merlin, no, sorry. doggy. Was that a dog? Yeah, yeah, he's I don't know how well you can see it.\n00:24:57 - Tina Marie (profitdriversinc.com)\nThere he is. Merlin. Yeah. Oh, he's so cute.\n00:25:03 - Maria Gudelis (Maria Gudelis)\nHe's probably getting scared because I think there's a big thunderstorm coming our way. You know, when the heat dropped, the heat got so hot, you know, all that could be storms coming. So yeah, the wind now just picked up and yeah, anyway, yeah. then, so, anyway, so yeah, so the thoughts I had were to just start creating this kind of connection. I don't know if you want to call it a connection connection, social funnel or culture, social funnel, whatever the words out there that people use nowadays. But it's really a bottom line just creating these three to five minute videos. We're just giving good value content with no intent to sell right away, even though obviously that's what we're going to do.\n00:25:52 - Tina Marie (profitdriversinc.com)\nWe're building up your invisible list, so to say, right?\n00:25:55 - Maria Gudelis (Maria Gudelis)\nSo for example, like me, Karina and I have one video. video where I scripted for her and I said, hey, just do this, like 10 reasons to trust us, right? And she's Shopify certified partner. So she kind of lists 10 reasons to trust her like, hey, I've also built a million dollar business on Shopify, still on the boutique, it's still running, all these things. it's not really like, okay, my stuff. It's more just, hey, here's 10 reasons to trust it and it shows, hey, I don't want my mom, you know, with my husband and kids and stuff. so, but funny enough, that video brings in sales. I was just looking at ads this morning and showed the purchase column and it's like, don't know exactly which thing they purchased because we have a few things. That business model is more like what we call the, do you remember the Sears catalog?\n00:26:39 - Tina Marie (profitdriversinc.com)\nOh, yes. Yes, I do.\n00:26:43 - Maria Gudelis (Maria Gudelis)\nAnd Avon catalogs.\n00:26:45 - Tina Marie (profitdriversinc.com)\nyou remember when we opened? I'm also Avon and Tupperware and Mary Kay.\n00:26:50 - Maria Gudelis (Maria Gudelis)\nYes, do. Yeah, so like, there's so many ways, as you know, to build a business that makes sales. But one of the ways that I think is like strong now, um, because of technology and social media reach and adds the way it's beneficial to videos. Anyway, like, you know, we all bought through catalogs when we're younger or my mom too, like she's Avon seller and and and Sears catalog come wait to have it come out and go buy. Do you need the Christmas catalog? Yes. And then I busted my marketing chops going through the JP Peterman catalog before the internet existed. So I would like learn from the direct sales master's back then was like, yeah, yeah, Robert Colier. I used to buy for me, be his antique books used to be a pastor and then became. Oh, wow.\n00:27:41 - Tina Marie (profitdriversinc.com)\nWell, I did. I did Don Don happy days.\n00:27:47 - Maria Gudelis (Maria Gudelis)\nOh, I'm not Don Tom Bosley's SNC.\n00:27:53 - Tina Marie (profitdriversinc.com)\nOkay, okay. Don Don the pre's as like, I did my tone and everything. and Melaleuca and everything and a lot of my friends are in direct response and oh cool one of my clients is Brian Kurtz as partner so I've been working with him for six and a half years and Brian threw that as well so yeah it's it's a small world I was I was going through because I do my research and looked at all of your Facebook profile things because that's what we do it's we suck face images and I saw a picture of you with Seth Laraby. Seth sensed my sweetheart my fiance to go on the internet and be on Facebook and now we've been together for 10 years so oh my god small world how we all interact and impact each other in a professional way but in in a really personal way because I was not looking to date I was I was gone through divorce and he was um well I told God if he wanted me to be\n00:29:00 - Maria Gudelis (Maria Gudelis)\nwith anybody you'd have to drop them on my lap. So I love it.\n00:29:03 - Tina Marie (profitdriversinc.com)\nlove it. Yeah. I was coaching soccer and raising four girls and teaching music in Sunday school and running business. And anyway, but, but yeah, our history is amazing. I was looking at it and I saw something you did saying you've been doing this for two decades. I'm like, I've never met another woman that's been doing this this long. And then the post today about people call you like the mom of their business.\n00:29:31 - Maria Gudelis (Maria Gudelis)\nI'm like, I've never heard anybody else be that, but I've been that for a long time.\n00:29:35 - Tina Marie (profitdriversinc.com)\nAnd I'm like, this is just like, how did it take so long to even know? That's what I'm like.\n00:29:42 - Maria Gudelis (Maria Gudelis)\nBut anyway, that's cool. That's cool. Yeah. Well, actually, when my dad started getting sick about three years ago, I kind of hid for a while. So I wasn't really as much. I was buying the scenes as the chief marketing officer for a couple of companies.\n00:29:55 - Tina Marie (profitdriversinc.com)\nBut yeah, so, so yeah, going back to the catalog model.\n00:29:59 - Maria Gudelis (Maria Gudelis)\nSo yeah, we have a of my business model, because I have a percentage of her company, is more selling all the little things like this for three bucks, this for 20 bucks, this for $30 like a catalog model. So, because once they find one thing, as long as they're good quality products. And of course, you just have some mid ticket, like $500 and $4,800 high ticket. But most of the sales are driven through the low ticket. And the exit strategy, we figure for that in a couple of years is the boutique brain software, AI software that we're going to come out with in about August. But so for you, we don't know what path and since you're so open talking about it's cool, we don't know what path even God's going to have for you. But I know that if we start creating your audience, that's something cool could come or we just stick with what you already are, you know, selling. But the first step is like just spend the first month or two, sort of my cats, stairs, it's a bedroom divergent office.\n00:30:58 - Tina Marie (profitdriversinc.com)\nI think they're just all going bananas because I'm down.\n00:31:00 - Maria Gudelis (Maria Gudelis)\nhere.\n00:31:02 - Tina Marie (profitdriversinc.com)\nThere's cuddles, but what's going on?\n00:31:05 - Maria Gudelis (Maria Gudelis)\nWell, it's only 334 here and she doesn't get fed to five, but she's acting like it's five. So anyway, so one of the things that we should just do is like just like all these videos, we start creating them and then run $5 day ads to them and to find out which audiences are working and which videos kind of work better and then there's KPIs that come into place.\n00:31:34 - Tina Marie (profitdriversinc.com)\nLike, you know, many people stay watching 25% of the video?\n00:31:38 - Maria Gudelis (Maria Gudelis)\nWhat's the cost for 25% of the video? Because like when I first started now with Ginger for about a month, it started about $0.70 to $1 for every 25% video view and different angles like Gary Vannerchuk audience, Marie Forleo, a reporter field, digital marketing, software companies, because she builds websites for people. And So, in her case, after a few weeks, we found some of the better audiences and tweaked some of the videos so that she now has more like under 50 cents video view, which is like almost a hundred percent decrease in her cost of building her video views audience. And when you, Green and I have been doing the video views for over six months, we're now down to some videos are getting like 10 cents per 25 percent video, which is really good. Yeah. every day's for sure. Yeah. Yeah. So every week we can, you know, gain like about 2000 people that and they're not just watching 25 percent of the video view, then percentage of them go on and watch like 75 percent of the three to five minute video, which is priming that person then to whatever, say just to choose a simple model, like let's just open and close, Hey, the higher ticket product three days every month. So So for Kreno, we're opening and closing a thing for $500 for the next three days. because we've built up so much brand equity from the video views and value videos and I don't know the right word for it, it's not culture equity, it's not community equity, maybe it's connection equity, but like silly videos too about like 10 reasons to trust us are a little bit more about you, know, like the client stayed with me for nine years. I don't mean that silly, the word silly is the wrong name for it, but it's like not a typical direct response video where you're teaching here's right for you to double your average order value, which are good videos to have to, business, know how to, but the client's statement for nine years just build a, wow, that's a big deal.\n00:33:49 - Tina Marie (profitdriversinc.com)\nWell, a huge person of why people will say you don't keep talking to anybody that doesn't have a personality.\n00:33:55 - Maria Gudelis (Maria Gudelis)\nI have personality.\n00:33:56 - Tina Marie (profitdriversinc.com)\nIt will come out, but if I were just to talk about the business stuff and not show my personality, which means there will be silly videos, sassy videos, things like that. It is for people to stay with you a long time, they have to have relationship. You're not going to have a relationship with anybody that is tedious to listen to. That isn't entertaining to some point, and especially that you don't feel so to feel connected to somebody near a neuron being what they are, you have to feel like they see you. How do I make people feel like they're seen through the video? Well, it is through talking about my stories, and I know you've experienced something like this, not this, and the language, the nuance of the language is really important. I have a client, I keep brow beating him with these like, nobody's doing this, nobody's ever seen this. I'm like, you're wrong about that. You haven't seen anybody else doing it, but to be so arrogant as to think that you're eight figure and I'm for your clients. I've never seen anybody do this. They're playing in a different pool than you are. First of all, they're all over the world. And I know people who are doing what you're doing. They're just not broadcasting it. They're secret weapons working silently behind the scenes. But what I'm going to tell you is the one day that somebody besides me tells you, you're not the only one doing this, like it's going to hit his ego really hard. And it's just just being mindful. Like you don't have the Lord over people. Because you know you have a powerful, potent skill. I am incredibly rare. Few people can do what I can do. But I also know there are a lot of people who can do things I can't do. I am cut off at the knees if I have to do everything by myself. Some things I can do by myself which makes me powerful. Yeah. Building my own business, I cannot do by myself because I will lose. I am a social creature. I draw energy from other people. So in serving other clients, there's always other people, but I can't do that for myself. So what good does it do to be great at business if I can't do it for myself, by myself, right?\n00:36:11 - Maria Gudelis (Maria Gudelis)\nI need people.\n00:36:12 - Tina Marie (profitdriversinc.com)\nAnd anyway, making videos and helping people see one of my, I think special talents is, and I get this from a lot of people is they'll have something in their brain for a really long time. But because they've never spoken in, and a lot of times even they've tried to, and they don't know how to, but somehow I'm able to find the words and it's usually a story or an analogy and say, it's like this, where they're like, I've never heard it put into words. And sometimes it's years that they've never heard the words spoken, they've never heard articulated, which means they've never understood it themselves, and or felt understood by somebody else. And so what I found in my years on Facebook, which has brought me all the business I could handle up till now is that even in my posting, just written text, people feel that, people feel connected to me, people will tell me a post of mind changed their lives. I have people that are making videos that have huge followings that never made a video until I did a video challenge about 11 years ago, and they made their first videos. now video is their life and their TikTok and Instagram and YouTube stuff. And I just think, I don't know how a big ego about it, but I wonder how much I showed up and people were following me and they had been following me, but silently, we weren't connected, but now I've had people send me jewelry that they made. one girl sent me a shirt that said, Team Tina on it. And I just post a little bit of stuff, so I know that. I do know how to connect with people and to the we don't know what God is going to call me to. I don't care what works or how it works. I care that I work, meaning that I shoulder to the wheel elbow grease work. Yeah, I mean, what comes out of it is always enough. I always have what I need as always taken care of. I've been poor, I've been rich, I've been everything in between and that doesn't matter. What matters is that that I'm doing the work, so I don't have a lot of attachment between the work very easy to do because the goal is serve people and I'm taking care of. It's always been like that. God has made it that way. If I will go where he wants me to go then he will. So in terms of like these videos, the picture that you sent me. these are things that I feel so okay. In terms of like what I could get from help with you and it's. also crazy too that at the same time as I found you and I'm like I really want to talk to this lady because you stand out and all the ways I told you you did. I've got these old clients that want to do work and it's a husband and wife team and their kids have watched them grow up and we work together for you here and she wants to do this because I had put together your hosting can I share my screen? Yeah absolutely and I'm just going to the the TV automatically went on down there I'm just going to go turn it off hold on just let's see you\n00:40:24 - Maria Gudelis (Maria Gudelis)\nOkay, back back back, here we go.\n00:40:28 - Tina Marie (profitdriversinc.com)\nI showed her this yesterday, whoops, apparently I'm on my keyboard. That was like this, I'm not greedy. I want to work on a profit sharing model. I mean, not just that, I'm willing to pay base pay because I'm all pizza, I get paid plus rev share. But there's also, so there's a couple things like, for example, my fiance is very wealthy, but I, I keep a very independent work of my business and the biggest reason is because I want to be able to show women what's possible when they're doing it on their own.\n00:41:09 - Maria Gudelis (Maria Gudelis)\nAnd that's been a huge thing before we get married. I'm like, I need to have accomplished a certain amount of things, not pride, it's not ego, it's evidence based.\n00:41:22 - Tina Marie (profitdriversinc.com)\nPeople listen to the people that they feel like understand and have gone through things because I've gone through a lot as a single mom. And because one of the the biggest ways to convince someone is to be like, I've done it. Yeah. So to kind of take the excuses away. Anyway, but the other thing is like, you know, in the men's world, they're ref sharing partnering, helping each other make money all the time. women are just paid. can't tell you how many millionaires I've made, Maria. Yes, I know. Well, going bankrupt, by the way, I fired a client when I had no other income.\n00:42:00 - Maria Gudelis (Maria Gudelis)\nIt was, they built something called Coffee Shop Millionaire, this dude named Anthony Trister.\n00:42:07 - Tina Marie (profitdriversinc.com)\nAnyway, it took them two and a half years to make a product and launch it.\n00:42:13 - Maria Gudelis (Maria Gudelis)\nWhen they launched it, it's made $80,000 like in a couple of weeks, but then it goes out to $3,500 a month on ClickPink.\n00:42:21 - Tina Marie (profitdriversinc.com)\nAnd so they did that two months in a row, they're like this sucks. And his partner's name was Manish. Well, I met Manish through Eric Luvier and job crusher. And because I was working on job crushers payroll for a while, right around divorce, transition time. And Manisha, hey, can you help with some tech stuff? Because I can do all this technical development. I made my bread and butter customizing WordPress themes for a while. Like I can do the copy.\n00:42:55 - Maria Gudelis (Maria Gudelis)\nI can do the graphics. can do everything.\n00:42:58 - Tina Marie (profitdriversinc.com)\nYep. Anyway, Um, so I came in there to help them with some, some tech stuff, some automations, but they had a developer. And the biggest thing that they did was they had created this. It was, you know, make money online activity coffee shop millionaire. He was not a millionaire. So there's integrity issues already.\n00:43:19 - Maria Gudelis (Maria Gudelis)\nUm, and what Anthony did was just went around and hustled.\n00:43:23 - Tina Marie (profitdriversinc.com)\nHe was in the affiliate market and the, you know, the mastermind circuit, all that stuff. Well, by the third month of $3,500, they had asked me, would you be our business manager?\n00:43:35 - Maria Gudelis (Maria Gudelis)\nBecause I would ask them questions. are you doing this? Why are you doing that? Why are doing this? Yeah.\n00:43:40 - Tina Marie (profitdriversinc.com)\nFinally, um, four months into working for them. So I started in March, which by the way, this is how God is. I had zero clients. I had taken my girls into homeschool because my ex was abusive.\n00:43:53 - Maria Gudelis (Maria Gudelis)\nAnd I was like, if you're going to get bullied at home, you're not going to get bullied at school.\n00:43:56 - Tina Marie (profitdriversinc.com)\nAlso, I can't at least keep you here. can watch you more. So I hadn't taken any clients. for a while. So I had no money. A week after I left, I got this job and was on payroll and was able to take care of my family. So God is so good. Anyway, this is all relative to what's happening. So this is my first time making a million dollar company in less than a year. And so took the two and a half years to make it, did their launch 3,500 a month for a few months. And then I'm like, why am I even your business manager? You should go find somebody else because you don't listen to me. You don't do any of things I tell you. You have the same conversations week after week after week and I wrote money. They get paid to hear this stupidity all the time and be forced to listen to this. I have to take care of kids.\n00:44:43 - Maria Gudelis (Maria Gudelis)\ndon't want to do it in business too.\n00:44:45 - Tina Marie (profitdriversinc.com)\nSo they're like, fine, we will do what you say. Eight months after I started working with them, they had three other products on the market and they had broken a million dollars in sales. That was not them. partially for sure. But they were spending their rills. They didn't know how to do it. And then, are you familiar with Ryan Moran?\n00:45:05 - Maria Gudelis (Maria Gudelis)\nYeah.\n00:45:06 - Tina Marie (profitdriversinc.com)\nOkay. Well, he wrote a book last year, I think, called 12 Months to a Million Dollars. It was about a company called St. Labs that I helped him build as his business manager. So they were already doing pretty well. But when I came in and I have a testimonial from his partner, I helped them 400 times what they were doing.\n00:45:28 - Maria Gudelis (Maria Gudelis)\nYeah. No, I remember you were mentioning that.\n00:45:31 - Tina Marie (profitdriversinc.com)\nwas like, yeah. So and all it was better meetings and whatnot. But anyway, those people will profit share profit share.\n00:45:39 - Maria Gudelis (Maria Gudelis)\nThey were paying me $15 an hour, Maria. Yeah. That's the hour.\n00:45:45 - Tina Marie (profitdriversinc.com)\nWow. Yeah. And so then I was like, I'm no, not going to do this. Okay. So I had to do this whole quitting thing, big drama.\n00:45:52 - Maria Gudelis (Maria Gudelis)\nThey came up, okay, well, we'll you $40 an hour.\n00:45:55 - Tina Marie (profitdriversinc.com)\nSo within a few months, I was getting paid $500 an hour, but not for from them. And then Ryan called and offered me to one third of his company, if I would come down to Austin and run it for him. He said, everybody's got their prize, Tina.\n00:46:10 - Maria Gudelis (Maria Gudelis)\nYeah, you can't pay my Ryan.\n00:46:14 - Tina Marie (profitdriversinc.com)\nSo I don't hate men by any means, bags, and they can be nail and female.\n00:46:21 - Maria Gudelis (Maria Gudelis)\nAnd there's lots of I agree, I just don't want to work with them.\n00:46:25 - Tina Marie (profitdriversinc.com)\nAnyway, so you may or may not have any interest in this. Shando did. And she's like, I will, I will do this. This is not ownership, but it's profit sharing. I want to be able to own my content and what I create because this is my two decades of experience and things. But, and I don't know if you would have any interest in it. I, there's definitely an overlap, but there also could be multiple marketing efforts coming because I create content and you two have very different personalities. And maybe I wait and see what happens with her and if it doesn't work out see if you want to I don't know that sounds kind of do She to me, but I'm also just a Throw everything out.\n00:47:09 - Maria Gudelis (Maria Gudelis)\nI bomb it and see what happened. Oh, yeah I mean never know until you start working with someone, you know Yeah, we want to go what would the topic of this be this product?\n00:47:20 - Tina Marie (profitdriversinc.com)\nSo this is So I have a I've put together a We'll call it an e-book right now. It's ultimately going to be on it. I think it's a crap I think it's gonna take a long time No, that's not it. Hold on sec There's my VSL from like 12 years ago for a product I mean I called my freedom systems 20 minute VSL because that was the thing and they worked Yeah, yeah, it was crazy. Um, let me which accounts my Sorry So, so first of all, there's some, these could be trip wires, they could be free. I could do, I've got like nine different things. I think the ones that are the most powerful would be simple finance systems. This is, these are all first draft, but transform your business finances. Actually, you know what, let's go to the time one. I'll show you the time one, because I had people do you know who Tyler Ellison is?\n00:48:53 - Maria Gudelis (Maria Gudelis)\nNo, probably if I saw him, I might recognize some of the stuff because he is a media buyer.\n00:49:00 - Tina Marie (profitdriversinc.com)\nAnd, matter of fact, he was the media buyer for sheer strength labs when it got started. That's Ty.\n00:49:10 - Maria Gudelis (Maria Gudelis)\nWe're cool.\n00:49:11 - Tina Marie (profitdriversinc.com)\nAnd he, he's been doing stuff with the Annalene anyway, he bought my program 12 years ago and said that this time sheet homework was worth the $97 out by itself. And I had a lot of people go through it, let me see, open it up real quick. But, and I won't say nobody else does this, but this is definitely not a, everyone does this kind of thing. few people do it. So I have three primary, well, four primary principles, I would say, hold on, principles and priorities, finance, time tracking, let's see those three. The first thing is just teaching people about principles and priorities. And the reason is one of the biggest issues that people have is that in the same reason that we have people showing up to meetings and you're talking about the same thing and it didn't get done. Why didn't get done? Were you not working? Of course not. Of course I wasn't not working. I did this instead. I did this and said, well, why did you not do the thing? Because it wasn't a clear enough priority to me that I knew that that was what I had to be working on. And the reason that is is because we didn't establish values. So even when you're one person working in your own business, a lot of times people just sit. All right. What do I do today? do I need to work on? Well, if you have established that you need to work on X because X is going to give you this and Y and Z can't really be done well until X is done. Then you're very clear that X has to be done because it is, it's the cornerstone. own of everything else that you're doing. But you don't know that unless you've asked yourself what matters. Well what matters. And then you get into and almost all the time people can't tell me what does matter. What they can tell me is what they don't want. They can tell me I don't want to work after six o'clock. I don't want to deal with bad clients. I don't want to do my taxes.\n00:51:22 - Maria Gudelis (Maria Gudelis)\ndon't want to do you know what I mean?\n00:51:23 - Tina Marie (profitdriversinc.com)\nThere's like types of activities, types of people, amounts of times and how much money they want to get paid.\n00:51:30 - Maria Gudelis (Maria Gudelis)\nThose are some very clear I don't want this.\n00:51:34 - Tina Marie (profitdriversinc.com)\nBut they can tell me what they don't want clearly without being able to confidently say but I do like people can tell me I don't want to work past three o'clock but they don't want to say I want to be done working by three. only want to work six hours a day. It's this weird thing it's almost like they haven't given themselves permission yet. So I removed that. They don't even know I've removed it. They don't care that I removed it because I'm me them say it in a way that didn't scare them by saying, I don't want this because they're good at saying what they don't want. Anyway, all of that can be done in a little product, a little seven dollar product, $20, whatever product. When they've determined that, but sometimes they can't determine that. So sometimes we have to mix it with this activity. And this is the thing that has brought people hundreds of thousands of dollars just by going through this because it's a mindset shift. So when you figure out your mostly profitable activity, I had a real estate agent, he went through this, he's like, holy crap, I'm spending my time doing whatever kind of basic stuff when really my money making comes from showing houses. So I need to get this stuff off my plate. I sometimes people just don't ask themselves what's their most profitable activity. Most people, ask themselves what their most profitable activity is. Then you think about what's the other stuff because you have to know what's there. And then when we get to the time sheet exercise, I'm going to wrap this up really fast because I'm sure you probably have another call. Time sheet exercise, a lot of times people will under predict how long it'll take. Well, it's only going to take me half an hour to write this copy. Yeah, plus six hours, something like that. You know, people tend to underestimate.\n00:53:29 - Maria Gudelis (Maria Gudelis)\nSo once we start talking, I try to do that all the time. Yes.\n00:53:34 - Tina Marie (profitdriversinc.com)\nSo but once you start to be more mindful of it, you start to be able to better engage and then you give yourself a little break and go, Oh, the reason I didn't get this done is because it takes longer than I thought it did. Yeah. So then you start to give yourself some grace and time things better. So but then a lot of times they'll plan out their work week, but they won't take into account that is gym night. Well, for me, when I go to the gym, the next day I am diminished. I don't have as much strength. and energy. I'm tired. I need like 10 hours of sleep that night instead of eight. I'm going to eat more the next day because I've left heavy weights. And so the day after needs to be calculating what's happening that day, people don't do that generally speaking. so they're just like, I'm dragging what orchestrate a day that is compatible with the activity of going to the gym the night before. Date night, a lot of times we'll energize people if they have you know, a good experience with it. And so I talk about energy sandwiches. If there's something that really sucks in your life and you have to do it, sandwich it in between the really good stuff. Yeah, yeah. So anyway, these are things that and I bought another hour so we could schedule that another time and go through it because at the very least, I would love to have your mind just say, this is what I think that you should do. This is where I think you stand out.\n00:55:00 - Maria Gudelis (Maria Gudelis)\nThat's part of why.\n00:55:00 - Tina Marie (profitdriversinc.com)\nI'm talking so much because you have experience so you could say, Tina, I've never heard this where I rarely hear this. We need more of this in the world.\n00:55:11 - Maria Gudelis (Maria Gudelis)\nI think if you say that to me, I'm going to trust your expertise because you've been around a long time.\n00:55:16 - Tina Marie (profitdriversinc.com)\nSo I benefit from you specifically because of that. So my, I'll tell you all my modules if I can get to my chapters. So principles priorities start by defining what matters most.\n00:55:32 - Maria Gudelis (Maria Gudelis)\nSimple finance systems, what comes in, or it needs to be greater than what goes out.\n00:55:37 - Tina Marie (profitdriversinc.com)\nTime mastery, making the most out of the hours you have, things like that. Business and project management, it's the same thing. It's teaching people the simplest, but as you can see, they build upon each other. Knowing what you want to earn and how much you want to earn starts and works best when you have your priorities and your values. Because so many people are like, I'm going to earn a million dollars by that. Why? Well, so and so did. And I'm like them. Yeah. Like, well, that's, you know, that's not gonna make you happy. Anyway, dream team, people want to hire when they have no business hiring, when they have no skill about delegating, when they don't know how to train, when they don't even know how to hire. And they want to go spend $3,000 a month when they're making $10,000 a month to hire somebody.\n00:56:26 - Maria Gudelis (Maria Gudelis)\ndon't know how to lead.\n00:56:26 - Tina Marie (profitdriversinc.com)\nYeah. So a whole long conversation about before you do this. Here's how you do this optimally to get your money back and to increase your energy, not just your revenue, by who you bring on to your team. Optimizing iteration, scaling, which is not the same optimized, obviously is making it work the best you can scaling it is growing what's already working good. And this, I don't really hear people talking about this but sharpening your saw, whatever you're good at, keep getting good at it, keep getting better at it. They're one of the reasons I never lose clients. I won't say never lose clients, but I have it. I fired them. They haven't fired me is because when I feel a lull and they're showing up and we're having the same conversation and there's no excitement and they're like, yeah, everything's okay or everything's good. But they're not like, oh, great idea, Tina. But they don't say that to me for a little while.\n00:57:23 - Maria Gudelis (Maria Gudelis)\nI need to go have something better for the table.\n00:57:28 - Tina Marie (profitdriversinc.com)\nBut also I become happier because I'm investing in myself and I'm learning more like working on my psychology degree so I can understand how the brains work better and how my people work better and things like that, including my own children, finding your heart. We lose people, we lose pets, we lose spouses, we lose parents, we lose kids. If we don't fortify our brains and our hearts and our spirits, like filling them up with good books, good stories, good understanding. underdog stories, especially things like that, then when things go bad, we don't have anything in the tank to go and help us through this. But it's inevitable that a human will go through this. That human that's running a business is going to take their business with it. And all the people that rely on them and work for them and the families that rely on their parents who work there. So I just want to fortify the people that lead and the businesses that they lead. And this is what I'm doing. But all of this is segmentable and iteratable, which means there is a tiny portion that I can give away, a tiny portion I could sell at the next level. There is an ascension in all of these. How a person who's making zero money applies this is going to be different than how a person who's making $10 million a year applies this. It's going to be different than how somebody making $100 million a year applies this. But all of these principles will apply.\n00:59:00 - Maria Gudelis (Maria Gudelis)\nDoes that make sense? It does, it does.\n00:59:03 - Tina Marie (profitdriversinc.com)\nSo, like, how does this work? There is a personal story in anecdote several and infinite really for all of these in terms of stories content creation of my own of other people calling in other creators and collaborating with them. This is a this is a community thing like we all need these things we all have had these issues and nobody is ever mastering all these things at all times. No. So, this is timeless. I'm not the expert in all of it, but what I bring to the table is the depth of the conversation so that you and your own skill and your own talent and you talking about these things with the brains around you and the hearts around you are going to be better and going to be four to five for your whatever investment in this is going to pay you back over and over again. I'm confident about that.\n01:00:02 - Maria Gudelis (Maria Gudelis)\nWhat's the example Jack's 90-day plan?\n01:00:06 - Tina Marie (profitdriversinc.com)\nWhoa, where are we at?\n01:00:08 - Maria Gudelis (Maria Gudelis)\nWell, on the left-hand side, I'm looking in the table of contents, yeah.\n01:00:13 - Tina Marie (profitdriversinc.com)\nThat's realigning his actions with his vision values. Jack set a goal to increase his digital marketing agency's client by 15% over the next 90 days. Using the smart framework, Jack made his goal specific, measurable, achievable, relevant, time-bound. He then created a 90-day plan to break this goal into actionable steps, so I actually have like a 90-day roadmap of these are the things that we're going to do. But they're not, that is a pace, and it wasn't actually Jack, it was Dan, between you and me. But the pace is very specific to the person and what happens most of the time, is people get overzealous in the pace, and they're mad that they don't get there, and then they feel like they feel feel feel. And worse, they feel like their team has failed, and then whole thing. Dan is very laid back, so this is much slower. This tends to happen over a year, but we did create the 90-day roadmap, kind of working off of Aaron Fletcher's stuff, but it was already things that we were doing. He's like, Tina, you already have this.\n01:01:20 - Maria Gudelis (Maria Gudelis)\nYou already have this.\n01:01:21 - Tina Marie (profitdriversinc.com)\nRight, But we don't have it written down. Anyway, Dan is one of my biggest fans who's never made a testimony.\n01:01:28 - Maria Gudelis (Maria Gudelis)\nHe's like, I'm not that dude. I'm like, I know it's okay. I was just curious, it's kind of a big deal, too, the 90-day goal setting, creating a 90-day plan. 90. And the other thing that intrigued me is the scaling your business is hot, as you know right now. Hot trend, hot words over productivity, but the productivity time is powerful, but often is the vitamin that you put into the program, and I know you know these things, but... Yeah.\n01:02:01 - Tina Marie (profitdriversinc.com)\nMm-hmm. Sell them what they want.\n01:02:03 - Maria Gudelis (Maria Gudelis)\nGive them what they need. Yeah.\n01:02:05 - Tina Marie (profitdriversinc.com)\nthem painkillers because that's what they want.\n01:02:07 - Maria Gudelis (Maria Gudelis)\nGive them vitamins. Yeah. So, yeah, cause I know a friend of mine just bought someone's course and she's going to stop the monthly because it was like no contracts. It was like 300 bucks a month. But she's intrigued by it because the promise was, you know, get a hundred K months. Line with your heart and stuff. But once you got in, she kind of, cause she's already, already wasn't Taki Moore's black belt program. I'll go because a lot of it was all just that. But the interesting part is that he sold her what she wanted. The hundred K and result goal. But once you got in, a lot of it was, which is just important, but she already knew it. As a line in your, your business around the life that you want, run your values so that you don't create a monster of a business that you want out of. That's all synopsis, right? But he led with the hundred K months, but. Yeah. once the 90 day roadmap or something that's always really hot even when I do surveys to people.\n01:03:05 - Tina Marie (profitdriversinc.com)\nYes so this this the thing is I usually custom customize this them for people and the other biggest problem is that usually this 30 days ends up being 90 days this 30 days ends up being 90 days this 30 days ends up being it depends on the person and how much they show up but generally really there's a whole lot of resistance that happens in here a whole lot of um executive dysfunction yeah I know I need to define this I know I need to crunch the numbers I know I need to ask myself these questions but what happens is is they think about everything that's attached to that question of why am I here after I've been doing this for 10 years they start asking themselves other questions which overwhelm them depress them cause them anxiety and make them want to bury their heads so they do don't do this until they get back on the call and I drag it out of them on a call which is one of the reasons a lot of this stuff doesn't work without coaching because the thing that's stopping you is your own mental stuff and there's nobody there to extract you from your stuff and your stuff from you. It's a huge part of the work and if somebody doesn't have the mental fortitude to do that on their own they're going to continue to spin their wheels until they get somebody to help them. Yeah. That's what's hard and nobody wants to hear that but there's enough people I can sell this to who have been doing this enough that they know that they're in their own way. Yeah. And that they know there is no diet pill that actually will give you the body that you want. Yeah. have to do diet, you have to do exercise. I only want to talk to people who are not trying to buy lottery tickets.\n01:05:00 - Maria Gudelis (Maria Gudelis)\ndiet pills anymore. There's a lot of tickets and diet pills. You haven't got where you need to be to talk to me. I've already got them for you as well.\n01:05:09 - Tina Marie (profitdriversinc.com)\nBecause I stay it all the time.\n01:05:11 - Maria Gudelis (Maria Gudelis)\nYeah. I get some diet.\n01:05:16 - Tina Marie (profitdriversinc.com)\nI mean, right? You want the easy way to riches, you want the easy way to health and it doesn't exist. Now, there is an optimized way, there's a leveraged way, but there is not an easy way. Simple, not easy.\n01:05:36 - Maria Gudelis (Maria Gudelis)\nHow does this phrase resonate with you?\n01:05:40 - Tina Marie (profitdriversinc.com)\nLeveraged I recall it leveraged abundance because riches to me puts a very specific connotation of money. I also don't want to deal with FTC, but abundance is a whole different kind of thing. When I think about even the. for I had a lot of money, I had a lot of wealth, the kind of freedom I had over my life and the relationships I had with my kids, with myself, with God, with my, that was, that was exceptional, even then. It led to the money. So leveraged, leveraged abundance or leveraged wealth, even.\n01:06:25 - Maria Gudelis (Maria Gudelis)\nBut yeah, I like abundance. I like wealth. Don't get me wrong, but there's already, I'm trying to sort of kind of also as you're talking, think of how you can be a category of one as well, like from a branding perspective. Yeah, because in these videos too, like, like typically after the I've been, you know, I've helped create, you know, multi-million dollar companies or sold company in 18 months for a million dollars. Like, I'd say some accolades, right and for you and then you can create.\n01:07:05 - Tina Marie (profitdriversinc.com)\nI think I can help you with this. I don't know anyone else that was a single mom of four kids who works less than 20 hours a week making six figures growing million dollar businesses for my clients and still having time to coach soccer. I've never met anybody else that could do that.\n01:07:23 - Maria Gudelis (Maria Gudelis)\nSo so so you're you're yeah like you could be known as that I like that yeah that would be it and then also maybe like you're you're known as like leveraged abundance is sort of the portfolio of products that you have or something. I was just trying to think of it.\n01:07:45 - Tina Marie (profitdriversinc.com)\nAbundance has its connotation to you. It is what my stressed out anymore. I had one question. client who showed up and he went to all these masterminds and he spent so much money. And he's he's in the guru network. And he's like, I always show up to calls ready to be beat up and I'm intimidated and I'm anxious. And he says, I just feel you love love. Now I beat him up. Yeah, beat him up. I called him out every time I said that , you shouldn't do this that you should not be doing that. No, you should do not. He's like that hurts. He goes but I still feel love and I feel anxious. And and he had peace and he told me that I made him a better father and a better husband.\n01:08:39 - Maria Gudelis (Maria Gudelis)\nBut I was here for work in business.\n01:08:41 - Tina Marie (profitdriversinc.com)\nAnd there's video on my wall somewhere about it that that he left me. And and when my dad's are like, I'm picking up my kids and I'm taking naps and I'm less it's less stress. They're happier. They're less stressful. They're busy. this are growing, I really have, know, people will say, double your income, cut your time in half. I've done that with people over and over again, but that's not the best part. The best part is they were happier, they were less stressed, they liked who they were working with. And so the thing that I tell people is, where do I have it? But it's, I have to sustainable growth and the business that you love. Where the heck? I have an Etsy store too, so I'm good. That's my fun thing. That'll do it right there, I think. Maximized profits, streamline operations, love your business. That's the big thing right there. Whoa, not going to be happy. If you're stressed, you're not going to be happy. If you're broke, you're not going to be happy. If you're hustling and grinding and chasing everything, you can't be unless you're leveraged and optimized. You're not going to love your business. Most people don't love their business. I do.\n01:10:17 - Maria Gudelis (Maria Gudelis)\nI would do this for free if I didn't need money.\n01:10:20 - Tina Marie (profitdriversinc.com)\nI still do it. I've done it. I do it for free.\n01:10:24 - Maria Gudelis (Maria Gudelis)\nI've got clients I work for for free.\n01:10:26 - Tina Marie (profitdriversinc.com)\nNow, that I've worked with for over a year, because that's how much I love what I do. And that's also very unique. Not a lot of people can say that.\n01:10:38 - Maria Gudelis (Maria Gudelis)\nYeah.\n01:10:39 - Tina Marie (profitdriversinc.com)\nSo anyway, I don't know what the hook is. I've never known what it is. So many times people try to tell me, ask me, Tina, tell me what you do. I'm like, I do so many different things. It's really more relative to you, which is not a great answer. So to tell you what I have to do, I have to know what you do.\n01:10:56 - Maria Gudelis (Maria Gudelis)\nSo I could tell you what it would be helpful, blah, blah, blah, blah, Got you, got you, got you. That's where I started. I go, Maria, no, but I do like all the thoughts, leverage and optimize happy leaders, double your income time and half. Yeah, because, because when you show me that spreadsheet earlier, like the, the other one with the financial performance and stuff, seven dollar to a Facebook ads, like a productivity kind of product working that well, you know, unless I'm just having to.\n01:11:36 - Tina Marie (profitdriversinc.com)\nI don't really think Facebook is the place for me. think you too. And talk would probably be ideal. And I think that whatever I do on one, I'll duplicate on the other, maybe with a tiny tweak, according to that platform and probably Instagram because they're very similar. But my priority would be to talk in YouTube because I think that they have the most leverage compensation opportunity. I think that my personality will do very well on both of those platforms to get people to help me come out of my shell enough to do it. I've really struggled with that because I'm making claims and I am very private and YouTube is not private.\n01:12:20 - Maria Gudelis (Maria Gudelis)\nAll your neighbors see everything.\n01:12:23 - Tina Marie (profitdriversinc.com)\nThis has been a very separate world from the rest of my life. Nobody knows what I do. There's been a lot of resistance to that, but anyway, I think YouTube and TikTok have a lot of these types of things, actually, and I think that they could do very well. I think at least the first two could do really well. I think the group membership from what I've been seeing, I don't know about that price point, but the great thing is about this, so suggest change to something and let me show you, it's a formula.\n01:13:00 - Maria Gudelis (Maria Gudelis)\nOur offer, we've been doing really well with filling out $3, and then you'll end up getting 20% conversion rate. It's a change of $3 to $20, which is insane.\n01:13:11 - Tina Marie (profitdriversinc.com)\nYeah, so look how fast that changed, but let's reduce these then. Let's change this to $67, instead of $9.97, and that's still a very healthy margin. And let's just say nobody bought that.\n01:13:30 - Maria Gudelis (Maria Gudelis)\nAnd the 20 should become 17 if that were to be an order bump, because we've tested 19, 20 versus 17, 17, magic number. think it's because 17 plus three is 20. So when people see that, they're okay with 20, but they're not okay with 22. That's weird.\n01:13:45 - Tina Marie (profitdriversinc.com)\nAnd I think groups do better when there's a ton of people in there. And if I have to hire help, I'm really good at hiring. I have a whole huge talent pool I could tap into, and if it's making that amount of money, I get multiple people. to come in and help because a huge part of what I want to do, Mariette, give more jobs.\n01:14:04 - Maria Gudelis (Maria Gudelis)\nI want to be a job creator for women.\n01:14:10 - Tina Marie (profitdriversinc.com)\nSo anything else that you would play around with in here?\n01:14:16 - Maria Gudelis (Maria Gudelis)\nSo the book, Digital PDF, that is $20 price per unit.\n01:14:23 - Tina Marie (profitdriversinc.com)\nChange that to $17.\n01:14:26 - Maria Gudelis (Maria Gudelis)\nAnd then is that going to be like an order bump in a funnel?\n01:14:29 - Tina Marie (profitdriversinc.com)\nIs that what your vision is? go ahead.\n01:14:33 - Maria Gudelis (Maria Gudelis)\nChange the conversion rate from 17% to 45%. That's what we're getting right now in our $3 funnel. Conversion rate on the three buck offers between 20 and 30%.\n01:14:45 - Tina Marie (profitdriversinc.com)\nSo I'm being conservative. How many eyeballs are you getting on these offers?\n01:14:56 - Maria Gudelis (Maria Gudelis)\nLet me share a screen.\n01:14:59 - Tina Marie (profitdriversinc.com)\nOK, you OK?\n01:15:00 - Maria Gudelis (Maria Gudelis)\nQuestions? Yeah. Because we're using with like Facebook ads, so it's often hard to scale. Do you follow Maria Wentz stuff, by the way?\n01:15:10 - Tina Marie (profitdriversinc.com)\nI feel like I know the name.\n01:15:12 - Maria Gudelis (Maria Gudelis)\nYeah, she says a lot of low ticket stuff, having the catalog model, right? Seers catalog game on catalog, you know? But she came up with this. I'm not buying it, but I always see what people are offering and the business coach on Demento, but it's all sheets, level one, level two. What custom business advice on what you should be doing based on what you want. Here's your input, calculate your monthly sales goal, cost the business coach on the mail, spit out custom checklists for you. Like I was like, holy cow. And then she's linking, I think, to the actual thing. she's charged with January seven, but again, I'm not going to buy, I'm just curious. She's always launching some interesting thing, but see level one, getting your first 1k, level two, your first 5k.\n01:15:53 - Tina Marie (profitdriversinc.com)\nthought that was brilliant. I've never seen anyone do that. Yeah.\n01:15:56 - Maria Gudelis (Maria Gudelis)\nI've not seen that either. Yeah, I'll show you the link and it's funny because. years ago, I was thinking of, oh, you know, when someone buys our product, I should have three different levels that, okay, level one, go here to this training level two, but yeah, and that's something I've been trying to figure out, like, how do I segment because all of these are universal for everybody, but they are applied differently when you're in a different place. Yeah, yeah, I love that. So there, so I just I just shot that over to you there in the zoom chat, but yeah, let me log in to click funnels. So because I want to bring up the stats specifically for the three dollar thing. Now our account will never show the stats for the high ticket stuff or 500 stuff because that's through directly through Stripe. And so, whoops, well, I'll drop sets there so you can see here as well. Okay, slow to me. comes up and okay so let's we're just gonna go just go back here for example my filter so that's going take a while so let me just pull up another click button let me pull up the the thing we just launched last week and we're slowly scaling it this is the three-dollar one that surprised us because we're getting like like crazy um conversions on it remember 29 I can't remember whether we launched it on the 28th front after the 30th so I'll just go here my filter so this one's now so this we're going to push the system i.o. maybe because click panels keeps Come here. So, well, I'll just show this to you. So, this is just like a week or like maybe six days of running some ads. And again, it's not including if they buy the $500 thing or they call them by 4,800 high ticket thing. But anyways, this is showing 275 unique people coming to the page. So, I know it's not a lot right now. It's been running for like six days. The option rate click phones is showing clearly wrong stats because I can't believe it up 92%. But we were running at 80%, which was crazy. That's like the initiate checkout. Because again, it's only $3.\n01:18:39 - Tina Marie (profitdriversinc.com)\nOkay.\n01:18:41 - Maria Gudelis (Maria Gudelis)\nwhat's is that 73 people bought. So 73 divided by like say take the 229 number, it's showing 31%. So that's insane because when I come over here. And gosh, I wish I could just pull up a whole years here because I'll show you over 100 grand from the this funnel, and again, not including the $4,800 group coaching up sale. Let's just go to April, because to go order magnitude, this will only convert in as $20 the front end. It will only convert at 3%, you know, something around there. Come on, when it's not pre-framed with the $3 offer, like when it's the front end or what? Yeah, is a different funnel that's $2, and this is the funnel, and I'll show you what it looks like online. There we go. So this is the $3 one here. So all it is is just a simple three-minute video, simple headline, a slow headline. This one little testimonial reel, two minutes of just variety of testimonials. Oh. Just ahead. So yeah, um, and then this like We're going back to really because everyone's attention is like pulled in different directions This is like what's converting well now because you see the numbers just initial this is cool traffic. isn't warm traffic Um, so it's insane. That's everything we're buying. So we are now just playing around with the order bump so 38 of bought the order bump which was 19 we brought it down to 17. So we're having better conversions when it's 17 And then these conversions are not bad So we're happy with this even though the average order value kind of sucks when you Sort of look at it But knowing that we have a $500 thing and a $4,800 thing that we sell them within 30 days that customers Average order value blended will be a lot higher So if I just have a different idea and it I know i'm interrupting I'm going for 80d rain.\n01:20:59 - Tina Marie (profitdriversinc.com)\nI will I've been trying I'm to hold it for a long time, like a whole 60 seconds.\n01:21:03 - Maria Gudelis (Maria Gudelis)\nIt's a really long time for my brain.\n01:21:05 - Tina Marie (profitdriversinc.com)\nUm, I am annoying because this is, I'm a five-year-old in a lot of ways. I am like the kid on the playground that goes, do you want to be my friend? And like, do you want to come play with me? Um, I've never met anybody like you.\n01:21:27 - Maria Gudelis (Maria Gudelis)\nYeah. Yeah.\n01:21:29 - Tina Marie (profitdriversinc.com)\nI want to play with you.\n01:21:31 - Maria Gudelis (Maria Gudelis)\nLike, what if we created something together and combined our skills and knowledge and expertise?\n01:21:36 - Tina Marie (profitdriversinc.com)\nYeah. I don't know this thing because this wants to be worth out of me. It doesn't matter if it's a parallel and it doesn't matter if they're very similar.\n01:21:44 - Maria Gudelis (Maria Gudelis)\ndon't believe in their competing because I think that the people that would be drawn to my individual energy are not the same that would be drawn to our combined energy.\n01:21:52 - Tina Marie (profitdriversinc.com)\nAnd even if they are, also, I just don't believe in competition. I don't believe that it's harmful.\n01:21:58 - Maria Gudelis (Maria Gudelis)\nI believe in abundance.\n01:21:59 - Tina Marie (profitdriversinc.com)\nI believe that. the more effort we put in, the more magic we make, the more magic we use to do things in the world. But what if we just combined things and created something together, we could split the work, it could be a partnership. I don't know you. That's not appropriate.\n01:22:17 - Maria Gudelis (Maria Gudelis)\nThat's not wise business.\n01:22:18 - Tina Marie (profitdriversinc.com)\nBut I just feel something very kismet, very sadistic about this. I'm getting very emotional. I really get frustrated at that. But what if you just sit and just think about that? mean, I've got another hour that we can come back, well, half an hour because I respect your time, and we've gone over.\n01:22:49 - Maria Gudelis (Maria Gudelis)\ntook about 10 minutes making my tea and get my book, so don't worry. We'll just do another hour. the answer straight up is, yeah, I would like to seriously consider that because I think it would be fun, first of all.\n01:23:00 - Tina Marie (profitdriversinc.com)\nI need fun and I need more conversations Maria and I need more women. I don't not have them. It's just not enough. Like I am trying to really fill myself up but also I'm trying to fill up other women too. Yeah. the more that you talk the more I'm just like, I, I bore you already.\n01:23:19 - Maria Gudelis (Maria Gudelis)\nI love you already.\n01:23:21 - Tina Marie (profitdriversinc.com)\nAnd I'm just okay.\n01:23:24 - Maria Gudelis (Maria Gudelis)\nWell, just real quick, just to kind of like close one. No, no, no, it's okay. So, so you can see from this, like the average hour, this is the one that starts at $20. This one only has a 2.73% conversion rate. So, but the average car value is 104. Like we have that dialed in. But this one, once we can dial it in because it's only been working for a week now. Like this is just the last two days. you can see that we've already dialed in like like the order bump is 27%. We're like a little bit higher. But but still like it's a crazy bananas conversion.\n01:24:00 - Tina Marie (profitdriversinc.com)\nlike 32%.\n01:24:01 - Maria Gudelis (Maria Gudelis)\nYeah, you know, but but because the convergence so much higher, the cost per purchase on Facebook is 15 bucks. So we're breaking even the first two days, we actually made bunch of money, but I think warm traffic was there. And that's why a lot of them were buying all these upsells, downsells. But it was crazy. But anyway, to make a long story short, yeah, I think whatever the thing is that we create together, we create we charge three bucks, make a $17 order bump, and then just figure out, you know, what, what the, you know, other things we sell them to make it profitable.\n01:24:37 - Tina Marie (profitdriversinc.com)\nI love that. And the other thing is that you're already showing up, you're doing the video, you're talking. The thing that I'm lacking most is the conversations in my life. And is that I don't want to sound arrogant because I actually get very cringy about this. But I can't tell you how many people were like, you should write a book, you should have a podcast, you should be on video, people need more.\n01:25:00 - Maria Gudelis (Maria Gudelis)\nfor you.\n01:25:00 - Tina Marie (profitdriversinc.com)\nI could listen to you read the phone book. It's the weirdest thing.\n01:25:04 - Maria Gudelis (Maria Gudelis)\nI don't know.\n01:25:05 - Tina Marie (profitdriversinc.com)\nget people are drawn to me. But I in it. But I get fed from them. It's not a I gotta give everything to the world. Yeah, I need that. I can't pour from an empty cup and I'm doing a lot of pouring. And I need to be filled up. But I get filled up by serving. And I think that your personality plus your brains plus your work plus your skills would be amazing. And I think I could match you and I bet you're not matched very often.\n01:25:35 - Maria Gudelis (Maria Gudelis)\nNo. Yeah, yeah, I think I think the match was and he sort of had heart condition. So we aren't able to do a lot of stuff with us. Seven years was Carlos Navarro. He was the guy that's the chief technology officer he was for Nobel Networks. He was one of the original guys there.\n01:25:52 - Tina Marie (profitdriversinc.com)\nAnd you may have heard his name before, but he's brilliant tech or known him and friends with them. But I haven't seen him for\n01:26:00 - Maria Gudelis (Maria Gudelis)\nExactly, yeah, he went he they almost recruited me, but I didn't want to move to South Korea The emotional intelligence software that we created about more than 12 years ago and Google's Eric Schmidt chairman of Google invested in it We sold that off to a Korean company that is now using it in hospitals for dementia patients And he became the CTO and moved to Korea and that was about five seven years ago because they wanted to recruit me too But I said no, I can't leave my family my parents and stuff But he didn't have serious heart issues, so he's really just Moved away from from being public the last year went back in health and he now is a little bit more in public, but yeah, he Yeah, so anyway, but yeah, that's only one match with but on that note, you're right I do have 430 call though now, but yeah, you have the link right just book again with me and yes We'll go You\n","contentPreview":"00:00:03 - Maria Gudelis (Maria Gudelis)\nHello, hello. Hello, hello.\n00:00:15 - Tina Marie (profitdriversinc.com)\nI can't hear you.\n00:00:18 - Maria Gudelis (Maria Gudelis)\nI can.\n00:00:19 - Tina Mari...","processedAt":"2025-05-04T03:40:52.552Z"}