{"fileName":"Done Transcript for Thinking Big profits.txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Thinking Big profits.txt","type":"transcript","priority":"medium","content":"00:00:00 - Chandelle Hay\nI'm pretty quick hearing, he knows. How's your week going? What's going on? I don't think I actually sent you over log in information for BBD.\n00:00:13 - Tina Marie (profitdriversinc.com)\nNope.\n00:00:14 - Chandelle Hay\nHere, I'll send it to you right now. So that you're getting his ads. I know. But you so I'm sure you've noticed and I'm sure you know this strategy. Anyway, he's basically picked a different piece of the program and created an opt in for you. Right.\n00:00:31 - Tina Marie (profitdriversinc.com)\nLike, oh, that's actually what I've done.\n00:00:33 - Chandelle Hay\nExactly. then I just wanted you to see how he's got it laid out inside of the membership section because it's cool. And it's easy. Where? How can I find log in to you? Okay. I'm so like has anything else come up for you then in the law because we went to the shooting range this weekend a couple We went Saturday and we went Monday. Nice. What's a holiday there, right?\n00:01:04 - Tina Marie (profitdriversinc.com)\nYeah. Hold on. I'm pretty sure I have your phone number, but I can just send it to messenger. But hold on, me stand out. You do have it. Let me.\n00:01:22 - Chandelle Hay\nYou want me to put this into chat for you?\n00:01:26 - Tina Marie (profitdriversinc.com)\nWould you mind emailing it?\n00:01:29 - Chandelle Hay\nI'll do it right now. Hi Jay.\n00:01:34 - Tina Marie (profitdriversinc.com)\nHello. This is me and the three girls and the text messages. Look at our targets. Here, maybe you can, I don't know, you can't really see.\n00:01:47 - Chandelle Hay\nthat's so fun. Are you good at shooting?\n00:01:50 - Tina Marie (profitdriversinc.com)\nI mean, yeah, but it. Every gun is different. Some of the sites, like one of them, I think the site is really off. And then it like the nine millimeters, they have way more kick in it. So like I have to really focus on holding my wrist strong. But I've got a rifle and that thing is so smooth and they're zero cake and the accuracy. And my kids are a little scary because they're like, pop, pop, pop, pop out. It's a semi automatic. But nine millers, they have, they have kick. And they weren't scared. They didn't flinch at all. And I just like, it took me forever to be able to be used to that. And like, they weren't intimidated. Like, you have to start by chambering around. And or if there was a, I have a bread and nine millimeter and it keeps what's the word jamming. And it's kind of intimidating. Like the first time you do it and you have to like drop the clip and open it up and like hope it doesn't blow up in your face.\n00:02:58 - Chandelle Hay\nAnd I've never\n00:03:00 - Tina Marie (profitdriversinc.com)\nThey were yeah, they were amazing. I have I have two three pistols and a rifle and we have bows which I've taken them all bow shooting before And they want to go out again. So anyway, we had fun. So I didn't get much work done. That's okay. Today's Wednesday But I have been working with chat GPT and foro is amazing. I love watching it go memory updated and And how it's updating across the chats Because I have one that's around the book and one that's around my TikTok marketing strategy and Sometimes I'm just like I don't really know where to put this. So I'm like remind me that I Want to include and I'll tell a little story. Yeah, and so Then I said when I need you to remind me all the things that I told you to remind me I want you to give me an outline. Let's try a sample of that and it spits out all the things I told it I want to remember but it will also suggest where that content should be inserted.\n00:04:06 - Chandelle Hay\nReally?\n00:04:07 - Tina Marie (profitdriversinc.com)\nAnd it will tell me my different foundational principles where that story relates to and sometimes it relates to different things so it's really been amazing. Yeah so I've also been looking at TikTok marketing strategies for a year really but I'm really starting to dial into it and the more that I study stuff the more I realize that and we all know this but that old is new and new is old like that's the whole reason why my stuff works is because it's timeless foundational principles. Yeah so the people on you know the influencers are like well people are really wanting long copy now and long videos and the platforms are going into long content. It's because shiny is over. Yeah. Realized that 60 second clips are frying their brains and they want more content and they can't get connected and they finally just got sick of the dope.\n00:05:15 - Chandelle Hay\nYeah. It's so flashy.\n00:05:17 - Jason Orban\nIt just flips flops airflops all the time.\n00:05:20 - Tina Marie (profitdriversinc.com)\ndoes but what doesn't flip flop is there is always an undercurrent of stability in the foundational principles which is I've never changed how I talk. I've never changed what I say and it's always been attractive to enough of an audience to have a happy, healthy business. So you can get surges of revenue from trends and tapping into the algorithms but if that's an overwhelming, consuming type of thing which often for parents who don't have a lot of time and having to learn the trends takes its own amount of time. and just showing up consistently and doing the thing that you do is going to be right. But anyway, so creating content, organizing it, using chat to get that out and then studying the marketing campaigns and watching Jay post things and going do it. You have great hooks and you have great offers, but I just feel like it is so subtle compared to what the great I don't think you're you're posting has looks nearly as powerful as what you do. You guys are amazing in the results that you get. You're amazing to work with. And I just don't think it stands out from the noise very well. think that if you create or graphics for those posts instead of doing the like the background colors. Yeah, just you know, had some graphics to rotate throughout. I'm sure you would probably like making. I'm Jay, but we've probably outsourced them really easily. But I just feel like there's just so much noise for organic social content. If you're not doing a boosted post, and even if you are, it really needs to be more attention grabbing. Like the words are that they're not highlighted, you know, for the ADHD type that is like just scroll, scroll, it doesn't evoke emotion, like reading something that's bulleted on that word that you want to see that you care about, right? Whether it's restaurants or salons, that's a word that I need to slow my scroll if it's about that. Or if it's, you know, the remind me what it is, the review thing, the like power tools, for instance.\n00:07:54 - Chandelle Hay\nYeah.\n00:07:58 - Tina Marie (profitdriversinc.com)\nRight. Right. Right. But so the other thing about loyalty and rewards is it's not it doesn't evoke enough of a clear idea as to what the power and the benefit is what your power is is the virality is that the word of the way that it works right it is a it's kind of a dopamine machine it's like go do this and this happens yeah versus here's a card with the code here's a punch card right there's no comparison to what you built versus what they automatically think of a loyalty rewards cards it's like my it's my friend Meyer card you know yeah which you know okay whatever basically just means I get to in store discount but you overcharge me anyway so it means nothing it means I have to play the thing but what you guys have created is powerful it's it's getting in front of it's your people getting you in front of other people where they're at and using technology in such a way that it's hyperactive. And hyperactive loyalty rewards, just that word right there might change the way that they feel because we have an attachment to that word. It immediately evokes a sense of like, I feel hyperactive.\n00:09:27 - Chandelle Hay\nI hear that like, what's hyperactive? I know what that is. That's got one kid in school that always got in trouble.\n00:09:33 - Tina Marie (profitdriversinc.com)\nGot how I feel after I have my caffeine. You know what I mean? Like it evokes something out of the norm. Hyperactive by definition is not normal. Yeah. by themselves are normal. So I'm just thinking like, I just feel like everything that you guys do is so low key in terms of presenting, but it is not low key in terms of\n00:10:00 - Chandelle Hay\nterms of what results you get. Yeah, but you know we were just talking about that this morning. We've got tons of videos of people saying like this has changed my life. Like you guys are amazing.\n00:10:12 - Tina Marie (profitdriversinc.com)\nThis is like so like a little video clip of those going all those moments.\n00:10:19 - Jason Orban\nYeah, that's what we were talking about this morning.\n00:10:21 - Chandelle Hay\nWe need to do stuff like that. And so I've been starting to learn more things like that as well. Yeah.\n00:10:28 - Tina Marie (profitdriversinc.com)\nYeah.\n00:10:29 - Chandelle Hay\nAnd then I think like the stickiness, the stickiness of you know a business starting a program like a loyalty rewards program. It's sticky. It's not going to go. It's not something that people are going to take away. I think really focusing on that too is a really big.\n00:10:45 - Tina Marie (profitdriversinc.com)\nYou should do it for coaches and consultants because so many times. I spit out my gum. Hold on. Sorry. Um, because you know I remember contest domination and all the other ones like it.\n00:10:58 - Chandelle Hay\nAnd they are crazy, but they're. hard to set up.\n00:11:01 - Tina Marie (profitdriversinc.com)\nThey're frustrating to set up and most people don't want to do it. And I am very technically inclined. I edit PHP pages and I still hate setting those things up. you know, API keys are easier to set up. They're more into it now. And that's usually part of something that has to happen, right? Is you have to go and you set up multiple API keys for the different types of things where you're trying to capture them as an email dress or or as a Facebook follower. So like you've got all the API keys for all the different platforms that you have to set for contesting. If you have a service where it's connecting to all of their platforms and maybe you walk them through what it's like to go get the API and you show them really well. I don't know if you need it for your thing or if you had a service where they could just pass you through LastPass or something secure on account or something like that. the thing is that coaches and consultants Oftentimes are really good at what they do and if what they do is not marketing or building websites or running apps and they being in the business know how many snakes they're on the business are. And a lot of times they just don't run business well so they don't have a lot of wiggle room in their profits if there's anything that you could call profits it's all you know pretty much break even for a lot of them. If you can show them hey this is the thing that you can plug into like I know you have an existing fan base or you wouldn't have a business. So this plugs into your existing fan base and lets your fans go give something fun away to their friends for you that helps me grow my business and here's a reward for you. It's like that right yeah so but in that particular that that. opens up a whole new ball game, especially of people who are already working online who already have some familiarity. So the friction points versus salons and restaurants, there's a lot of people, salon owners that have no clue how to use anything technical. They're like, yeah, I have an account I've never logged in. I've had an account for five years. I logged in once, you know, things like that. And I know, and restaurant stores are probably even less, except for there's that one oddball that's a techie that somehow also got into food. You know, whereas coaches and consultants probably got their start online because that's where they discovered they could even do it, and it became possible. So the pools should be much bigger of people who are, they should be less customer service in that stuff. You know what I mean? Anyway, and and I I would be a customer and that's kind of how I go off of a lot of things. There's a lot of things I'm not the ideal customer for but a beginning coach and and I even hate I never think of myself as a coach I think of myself as a consultant but I get called coach a lot whatever it's a it's a most of that is because I need to control the language and the branding. I need to like I would never have a sales team. I wouldn't say never I finally met a female sales team because the energy and the representation and knowing that you're not selling something I'm not promising. There's a lot of opportunity when it comes to marketing to misrepresent a brand and to sell somebody and sell the provider. Into fulfilling something they don't want to fulfill. Yes anxiety. So Marketing is a big deal. And if you have a tool Especially that allows the existing community and fan base to Go feed the community and fan base, but be rewarded for it That's powerful those things exist, but they're not marketed I can't even remember the last time I saw one of the contests things going And Like the contest things for what like though kind of like the viral up viral type that yeah, yes And if they're being promoted they're not being promoted well and not to the average You know six figure barely making six figure under seven figure could be multiple six figures They're not getting marketed to that stuff Yeah, because there's no conversation about it anytime I bring it up to any of my clients. They're like, oh yeah, I think I've heard of that. Like, there is no high level of awareness. You look at how Gene Schwartz talks about marketing and markets level of awareness, there's none, which means that's largely untapped still. I used the first one like 12 years ago, and I almost never see it still. I see I have a few people who are asking me for it.\n00:16:34 - Jason Orban\nYeah, so I've been saying that we'll get that done. Yeah, I've got to do that.\n00:16:45 - Tina Marie (profitdriversinc.com)\nSo you guys are like financially you're hitting your what you need, right? month you just want to grow or are you not hitting what you need?\n00:16:56 - Chandelle Hay\nWe're not. It's like it's Honestly, stressful, the way that it is right now, we never know what's coming in, right? it's, it's super dodgy, like full transparency this week, we need to bring in like enough money to cover our bills, like that's where we're at. There's no buffer.\n00:17:22 - Tina Marie (profitdriversinc.com)\nOkay, so you definitely have to get tighter on marketing. So what is the, what is the offer, Jay, that you have had taken the most?\n00:17:34 - Jason Orban\nWhen we do a, when we do a discount on our Power Tools bundle for 11, 11, that's probably where most people have taken us up on things. We up the price of our Loyalty Rewards 997, but haven't had anybody buy in the last like month and a half, two months, that one specifically, they've been buying a couple People have been buying power tools or signing up for our monthly like the $150 a month, which is not bad. It's just not fast. Um, and then yeah, probably when we do the lifetime things for about a thousand bucks, then people jump on that.\n00:18:21 - Tina Marie (profitdriversinc.com)\nUm, how does customer service work is any of it?\n00:18:26 - Jason Orban\nUm, not too bad. Like it can be there's periods, definitely where we go through, um, things being a little more, um, more busy with, um, supporting everyone, but I do a Tuesday and Thursday support call for an hour, hour and a half each day. And, um, people get a lot of questions answered there.\n00:18:53 - Tina Marie (profitdriversinc.com)\nAnd do you like that?\n00:18:55 - Jason Orban\nThat's okay with you. Yeah, that's fine. That's cut down that, that our or every couple of days is not a big deal, hour and a half, sometimes it goes to like two hours, but that's better than having four hours of meetings a day with everybody wanting to talk about things on their own.\n00:19:12 - Tina Marie (profitdriversinc.com)\nThe thing that I am noticing is that everybody's got their hands in your pockets. Everybody's got subscription, you know, and the credit card percentages are going up crazy. People getting nickel and dimes to death. So it doesn't matter how valuable something is, they have to take into account what they can afford to come out on a monthly basis. So if you have a subscription-based model, to me, wherever you can find it to be profitable and balance that minimal attrition rate, where they're staying, the thing that you would have to do is to continue to resell them, and that's anything that you do. if you want to mitigate refunds and then cancellations.\n00:20:07 - Jason Orban\nYeah, we haven't been too bad with cancellations and refunds like last month. We had a couple, but it was like weird weird weird thing. There was a lady from December who bought something and decided that she hadn't used it so she wanted to refund. And we're like, okay.\n00:20:24 - Tina Marie (profitdriversinc.com)\nIf you don't wear your shoes, you get to get a refund.\n00:20:27 - Jason Orban\nRight. And you know what I mean?\n00:20:29 - Chandelle Hay\nNo, I know.\n00:20:29 - Jason Orban\nIt was, it was, um, but, um, then we had, then we had somebody who purchased it. And then I was having tech issues jumping on a call with them. And then they were like, I want to refund. And I was like, I was like two minutes late for the call. Okay, have your, have your damn refund. Um, because other than that, like it's rather than that.\n00:20:52 - Tina Marie (profitdriversinc.com)\nThat's it. That's, that's, that's. how many active subscribers do you have?\n00:20:56 - Jason Orban\nUm, let's take a look right now. Right now we've got about seven thousand. Recurring coming in from subscriptions $7,000 not 7,000 subscriptions I was like wait because I said how many people and I was like, oh, know it's about $7,000 month recurring. I got to go to subscriptions and see How many subscribers we actually have Will it just give me a list of all the subscribers?\n00:21:24 - Chandelle Hay\nStripe is really hard to pull reporting out. I know that I've looked and I've actually I have some months I keep a spreadsheet and every single day I mark down Like the reoccurring payments so that we can see our cash flow as well throughout the month I haven't done that for this month though Because it tells me that Um, let's see here to do You But I one question I wanted to ask was like let's just say you had whatever. 50 people paying $100 a month.\n00:22:04 - Jason Orban\nIt says we have 53 subscribers.\n00:22:07 - Tina Marie (profitdriversinc.com)\nNice. 50 subscribers paying between $69 and $150 a month. Okay. That's good. Because what it means is you obviously have a viable offer.\n00:22:21 - Chandelle Hay\nWe do.\n00:22:22 - Jason Orban\nOh, yeah. No, for sure.\n00:22:24 - Tina Marie (profitdriversinc.com)\nWe do.\n00:22:26 - Jason Orban\nIt's just, yeah, definitely getting it out there and getting in front of people more. So we've been doing more, doing more workshops, talking about stuff. We're doing the launch lab because I, because I know there's people who buy the LTD stuff, but we can't have a sustainable business off of selling those, those things for those lifetime deal for things because then they buy once and then they're like, thanks.\n00:22:48 - Chandelle Hay\nyou later. Unless we're in front of more people and convert more people into that model.\n00:22:56 - Jason Orban\nof people don't want a monthly payment. Like that has come. Yeah.\n00:23:01 - Tina Marie (profitdriversinc.com)\nWell, with the service, a lot of people will never use it. Like, um, yeah, what's his name? Josh Bartlett. What does he have? Thrive cart. How many people have to have have a cart, but never use it?\n00:23:14 - Jason Orban\nBecause I've got so many people who purchased from us and never know aren't using it. Yeah, you know, that's something to think about.\n00:23:23 - Tina Marie (profitdriversinc.com)\nThere's two things.\n00:23:24 - Chandelle Hay\nWhat were you going to ask? Well, I wanted to ask like, let's just say you added another 100 people paying monthly, right? So then let's just say of 150 people paying monthly for power tools. That's $30,000 month right there. Would you then maybe have a daily support call? One hour a day where people can just maybe it's different times. You got people in the in the in Australia and whatever. Maybe you need to do like act so that you're not doing more one-on-one tax support. Like,\n00:24:00 - Jason Orban\nThat would be the way I could see you could scale that and being able to have we would have we would definitely have a couple people helping us out with tech support to answer questions and just like kind of like support live chat.\n00:24:16 - Tina Marie (profitdriversinc.com)\nWe would actually let that happen and hire that person.\n00:24:20 - Jason Orban\nYeah, we would hire that person and have that person rolling just answer questions and they could be on call 24 seven or not 27 but you know between business hours answering questions. I've got a you know one of my masterminds I've got a there's a guy who does that he has a lady or someone out of Jamaica that just sits on zoom all day and answers questions.\n00:24:42 - Tina Marie (profitdriversinc.com)\nLook at my cup.\n00:24:43 - Chandelle Hay\nCan you see it.\n00:24:46 - Tina Marie (profitdriversinc.com)\nIt's from a friend and a past client I've had that lives in Jamaica and she sent me these earrings. sent me some paprika and spices and chocolate. You said you make it up like.\n00:25:01 - Jason Orban\nI feel like we've added about 10 subscribers, 10 or 12 subscribers in the last month.\n00:25:10 - Chandelle Hay\nYeah, and I've been running ads and they seem to be bringing in good quality leads. I also think like another thing that we talked about this morning is that so Jason's time is a lot of demos like he's doing a lot of sales calls demo type things, but we're actually not following up with those people. So unless they buy that day, they're just put onto our list and then they get like all the same emails that everybody else gets. So today I'm going to go through his calendar and come up with like a list of all the people he's given demos to and we're going to look at like how many of those bought right away and then we're going to create like a pipeline that those people have put into when they're like I need to go talk to my team and I'll get back to you. We're not following up. like we're not.\n00:26:01 - Tina Marie (profitdriversinc.com)\nWhat do you want? Okay, so let's come up with this simplest system that we know is also the most leveraged. So in person is most leveraged because you can kind of like talk to people and sell them and persuade them on the personality, answer the questions, but it's not the most leverage in terms of time, but you like it. So what if for one month you did a live demo on a schedule every day of the week, except like a particular day, like maybe five, five days a week or four days a week or something like that. Maybe one day it's a couple times and then there's also a live replay. So anybody who wants instant access can get it and you end up picking whichever one is your best demo that ends up getting switched out. So if today you have a better demo than your last best one, you update that. So they're really is actual live, hardly anybody's doing this in any time, but nobody's doing it in here. So they have access to a real person where they can ask real questions. And like Shando, you could be available on chat support where they could talk to you. And so they could have a breakout room where you can ask questions. And Jay could just stay, you know, going on or could ask questions live, depending on what type of questions some people don't necessarily, you know, want to ask everything in front of everybody.\n00:27:31 - Chandelle Hay\nThat's the thing that we're finding, right?\n00:27:34 - Tina Marie (profitdriversinc.com)\nYou're doing it live every single day. And you can stream like the first few minutes to Facebook, to TikTok, to Instagram, to YouTube. But the only way they get to stay is if they opt in, the stream stops. And the stream needs to stop right at a point where you're like, and this is the actual power tool where they can get enough to start salivating and go wait, wait,\n00:28:00 - Chandelle Hay\nWait, wait, wait. What's next? Yeah.\n00:28:03 - Tina Marie (profitdriversinc.com)\nAnd then you're like, um, if you want to see the rest of us, just send, you know, opt in here or click this link or whatever. And that link is a webinar, opt in page where they can immediately get access, but they do have to put in their email address. And, um, you know, make it one of those that validates an email address immediately. So you're need a powerful follow-up sequence. And I prefer to do, and of course it does create friction, but you, when you're looking for a subscriber, you need to qualify the lead. Otherwise, you're, you know, you're going to have higher refund rates, cancellations, things like that. So you want to qualify them. So some friction in the beginning means more lubrication in the end. So you ask a survey question, you know, what, whatever the things are you need to know, which is what's your what are you making, what are your problems, but obviously really efficient and you don't want to ask too many questions. And you also wanted to have single step, which means the form submits and captures everything that they've done, even if it's incomplete, you get an incomplete form, because some information is better than none. So if they answered the first two questions, but didn't answer the next seven, you still know something about what they need and something about them where you can submit them and go okay, you said you have this issue, here's why this solution works for you. You said you have this issue, and I've already done the algorithms and the calculating to know that if this of these seven things I asked are your issue, if you have this one, this one is the most important, so I'm going to give you this information and tell you that it will also address this, this, this, this. So there's some logic that has to get built out, but it can get built out really quickly quickly with chat GBT and your experience. You are already know what most people have issues with when it comes to, you know, either as building a website, is it tracking? Is it being able to build a sales page or get the sales page to connect with the CRM? Like there's different components that people struggle with and knowing kind of what secondary categories and tertiary categories. So let me talk to you mostly about this but remind you that this and this is getting taken care of. But you want to do it succinctly because people don't have large attention spans and you want to show them how easy it is and how you're going to make it easy every step of the way by some great training that is clearly labeled. Like this is where you go for this. And this is how long it's going to take you and you'll be up and running an X amount of time that up and running an X amount of time is a hook that has sold me, but it's hardly ever used, hardly ever used. I'm telling people how fast they can get to the thing that has been holding them back. And speaking to them about the fact that they haven't been doing what they know they're supposed to do in their business, because they didn't have the system is going to hit them like a ton of bricks because, like, you know it you have not been marketing the way you know you want to and you know you wouldn't be in this situation.\n00:31:41 - Chandelle Hay\nIf you were marketing the way you're supposed to, right?\n00:31:43 - Tina Marie (profitdriversinc.com)\nYeah. So if somebody came in and said, I'm going to kick in the and I'm going get you to do that one thing and by you know in two weeks from now, you're going to have a solid marketing campaign up and running the one you know you should have had like eight months ago, you're going my money.\n00:32:00 - Jason Orban\nI've had a bunch of conversations like that, that's, and that's, and that's where people have been asking me to put together the coaching program to talk, to coach them through getting their clients in high level. And that's, and that's, and that's a big thing of reason why we're launching the launch lab there. I follow up with a few people today. They're excited. They're excited to join a couple people. There's still people starting out. So one guy's like, I'm just waiting for deposit to come in, whatever, you know, there are people that they're struggling. They need money. You know, so they want to join and they want to get in. They want to start selling the stuff that we have. They bought some of our stuff, but they still need the motivation and the kick and the to get going. So there's a lot of people who are in that situation where they bought tools from us. spent $500 to $1,000 already, but they still haven't done anything.\n00:32:54 - Chandelle Hay\nThey can't, they don't, they just, they're, but it's not, it's not even if they can.\n00:33:00 - Jason Orban\nI'd sell, they're just not selling or they're not, they're not getting out and talking to people. not making That's why we're starting this whole that's why we started the whole launch lab thing And that's where I need to create a better video about what that talking about that specific thing because I would I just sat on another one I sat in another group that I that I know a guy that I know they just did a prospecting in sales one Almost everybody in there exact same thing to like I've had this for so long. don't know how to sell it I don't know what to say to people That kind of thing and Chan's been doing a really good job in the last week here to just reaching out low to local more local businesses And she's yeah, got four or five conversations on it go talking with local businesses about that I like that's for sure where like I got off my call yesterday and Amelia was like mom You are so good at sales calls She's like I instantly smile what because I can just turn it on and it's because I did care for so long Right but I\n00:34:00 - Chandelle Hay\nI think one thing that I wanted to ask for your feedback, Tina, around is we didn't launch the launch lab. That's a separate subscription and that and the idea behind that too is to give us somewhere to go.\n00:34:13 - Jason Orban\nGive us somewhere to go after somebody buys that lifetime deal after they buy a bunch of power tools or whatever some of our stuff where do they go next because they're not selling it. So I need to get them to the next like where they're actually selling it because we have a licensing model with it where the more they sell, we're giving a solid discount on it to go ahead and sell it. But every time they go and sell a new business on it, we make more money too, right?\n00:34:38 - Tina Marie (profitdriversinc.com)\nMy brain is not going to be able to process what you're saying until I write with the question.\n00:34:44 - Chandelle Hay\nSo here's where we're at though as far as pricing now. There's lots of different options for pricing and now we're adding a whole other new thing that is another subscription. And I'm trying to wrap my head around what is the clearest way Like, so lots of people do, they just sign up and they go and buy Jason's tools without even a conversation, Tina. People will just go and buy it. So I'm wondering if what part of that should be a part of Power Tools, the sales, should we be, should we combine the sales training and the running an agency and all that with this product and raise the price? Do we have an upsell when somebody purchases Power Tools say, now, right now you can join launch lab for a discounted rate as a part of Power Tools. So I think we need to do that right away. But then also, I, I message with a lot of people and I get them excited, then they get a demo and then they, then they're gone. We need to follow up with those people, but then I also wonder about the people that are full, should there be like, like a lifetime.\n00:36:04 - Tina Marie (profitdriversinc.com)\nI don't like lifetime.\n00:36:05 - Chandelle Hay\nI don't, I don't like lifetime or like yearly, like a yearly payment yearly is that me answer the question because there there was a lot in there. Yeah, it is.\n00:36:15 - Tina Marie (profitdriversinc.com)\nFirst of all, first of all, I think that you should split test how the things go because I think you have an evergreen offer. And that means dialing taking the time to dial it in. But knowing that you're going to continue to have to split test, you know, either quarterly or every six months or so, because the market buying behavior changes. But for sure, I think it should be an immediate upsell. And I wonder if your demo isn't shooting you in the foot by offering it to people and overwhelming them with technical stuff when maybe they weren't ready for it. So do you just offer it to everybody or is it they ask for it? Like, how does the demo happen? And how and how technical is it?\n00:37:00 - Chandelle Hay\nSo normally, they just send, they land on our Power Tools sales page and there's a chat widget there, and then they'll ask a question, which is, I could probably find all the, like, the top questions that are asked, right?\n00:37:17 - Tina Marie (profitdriversinc.com)\nI have a call in at 1130, I forgot about.\n00:37:20 - Chandelle Hay\nOkay. And so then they ask a question, then we answer those questions, and then it normally leads to them asking if they can book a call, a demo. And then Jason, Jason does all I've never done any of those calls.\n00:37:37 - Jason Orban\nThey're technical people who are jumping on there, and I don't get into the really, really technical stuff. We go through the, we go through the more of the user interface, how this works kind of thing. We don't get into like, here's all the workflows, and here's all this thing, and here's all that kind of thing. It's like, here's how you use it, here's how you sell it. And here's how you could use because lots of times they have, they might have a different industry they want to use. So we discussed that and we chat about how they can do that. generally leave really happy with it, they just like, they all have basically teams. I've got like three people who are like, I'm having meeting with my team tomorrow, and we're going to chat and then we'll go see what we want to do.\n00:38:22 - Tina Marie (profitdriversinc.com)\nChantel said that you give people demos and then they disappear.\n00:38:26 - Chandelle Hay\nWhat do you mean? Well, a lot of them, it's busy, right? Jay will carry on with the day.\n00:38:34 - Jason Orban\nAnd then don't, there's- I wouldn't, again, so a lot is perspective or subjective. So there's a few, yeah, there's a few that we go have that conversation and walk them through things. Like the ones that typically aren't that haven't signed up after a demo is they own restaurants. and they're trying to determine what is the best way for them to go with their restaurant and they are they have a few hang-ups typically when I talk to agencies and show them it they're like this is awesome like I can sell this to my clients no problem I can get them using it right the ones where I've had the that they kind of drop off and we they don't kind of follow up or buy I have been just restaurants themselves where they're like I own a restaurant and they've got like a group of guys or there's like three people on the call and they're trying to figure out a loyalty system they can integrate the problem that they have and probably the most loyalty programs have is they don't integrate directly with their point of sale system because lot of is locked down so so so yeah then they're just like damn it other one we can right maybe you shouldn't be targeted in them at the moment while you know we're not we're not targeting them they're just coming in through high level because there's lots of people using high level who are in there so they see our stuff they reach out we're posting a lot in the groups and we are we do get inquiries from that.\n00:40:15 - Tina Marie (profitdriversinc.com)\nSo maybe we can just like maybe you guys just don't think about them too much for a month so maybe you have like a 30-day sprint where you're really focused on building out a marketing campaign as though it were your clients, tree, big studios, whatever you're doing right now as though it was your client you would make the graphics you would have strong call to actions you would have the USP right you would say this is why to buy from this this is your hook like all those things that you know that have to do with getting attention capturing attention justifying the cost, all those things like and it's being done in a visually powerful way with a powerful follow-up sequence, all the things that you would do for another client because you have to or they don't keep paying you, right? You're amazing at getting them new customers. You need to employ those things. But if you're doing it for 30 days, a leverage starting maybe next week, I'm showing up every day to do a live demo Q&A and you can get a replay if you want to but if you want to show up live, we're answering your questions and how you can implement this today, how you can get your first sale this week, how you can start to get your investment back this week. Now you have to be really careful about claims because the FTC, I don't know if you can reach into Canada, I don't know how that works and if you make sales through America and I don't know what your country has for what Canada has for compliance, in claims, and things like that. But just use the language of can, might people have whatever, what's possible, not probable of that type of thing, or just these are the actual results that you can prove, person like you did this, did this, this, whatever. But I think it's just getting in people's faces for 30 days on every platform, repurposing on every platform with a very strong call to action, very strong U.S. peak as lots of people are doing high level stuff, but you definitely have very unique stuff.\n00:42:44 - Jason Orban\nAnd that you're really focusing on the fact that there are a lot of ADD people out there. they said it the other day, she, her and her husband, went through our five day challenge that we did, or 21 day challenge back in March, and they loved it. What? What they said they're doing and she like she like this. They're working on building out their high level system What they want to do and their product they put this this is what she said. We're doing what you guys told us and productizing our system For an each and I think that's was a good.\n00:43:18 - Tina Marie (profitdriversinc.com)\nI haven't thought of it that way, but I mean, that's what we've been doing Yes, that's what I wanted to do with high level and I don't have the time on the team for it But that's the opportunity that it gives by having snapshots where you can build for what you do and just in sorry You have one snapshot.\n00:43:35 - Chandelle Hay\nYou now have a product.\n00:43:37 - Tina Marie (profitdriversinc.com)\nYeah, you know, and you now have an affiliate offer with high level Plus a snapshot, you know, and then ongoing service or I'll create a new snapshot every quarter for you instead of every month, right? Yeah, outsource the upwork like there can be a whole system of in your launch thing Yeah, it's crazy like there's so much so it should be an immediate upsell and it should be bang bang bang here is the opportunity and if you just do this like you want to bullet point the minimum effort that they have to make if you will just do x the odds are that you're going to make a sale within x period if you you know post to instagram every day and you're telling why this thing is so good and we'll tell you how to tell it why like in a non-ducy way just you were telling your neighbor dude this lawn mower is amazing it does this this this this this you highlight all the features all the functions plus i only got it for this price like this is what we do this is a human this is like i'm gonna tell my neighbor about this thing right so just make sure the neighbor actually cares about like he he he doesn't have escrow turf because he doesn't want to hear about your lawn mower you know but\n00:45:00 - Jason Orban\nYeah.\n00:45:01 - Chandelle Hay\nSo, and then do you think all of those sales tools and scripts and pitch decks and sales training, it's okay to have that inside of a different program?\n00:45:13 - Tina Marie (profitdriversinc.com)\nUm, what do you mean?\n00:45:17 - Chandelle Hay\nyou've got launch lab and that's what all of that is going to be, right? it's office hours are today 12, bring what you've got a proposal you need to make will give you a template for that. You're writing social media.\n00:45:30 - Tina Marie (profitdriversinc.com)\nWe'll give you an outline for that.\n00:45:31 - Chandelle Hay\nWe'll give you everything you need yourself. Yeah, that is okay in a separate program or should it be a part of power tools?\n00:45:40 - Jason Orban\nNo, no, no, no, I'm trying to combine too much everybody going into the store that wants to buy a blast.\n00:45:47 - Chandelle Hay\nDoes everybody want to pair it with the skirt?\n00:45:50 - Tina Marie (profitdriversinc.com)\nRight.\n00:45:51 - Chandelle Hay\nOkay. Some people do.\n00:45:52 - Tina Marie (profitdriversinc.com)\nOkay. I want to pair it with the pair of shoes or purse.\n00:45:56 - Chandelle Hay\nNo, but some people do. Okay. I just feel like I'm so stuck.\n00:46:00 - Tina Marie (profitdriversinc.com)\non that one detail. Okay, why? Why do you think because that was going to come up and other things?\n00:46:07 - Chandelle Hay\nI just think trying to create a marketing plan around all these different things is getting it's not because they're all related.\n00:46:17 - Tina Marie (profitdriversinc.com)\nSo all that you want to do is you want to show how it's linear or almost like a like a flow chart and you should create a flow chart, Jay, this would be perfect because a business is a marketing ecosystem. People like you have this core product like high level is a core product that works for restaurant owners that works for social media influencers that works for salon owners and all that other stuff, right? So they can come in from all these different places. And on top of that, so you've got email list management, you have email list helps. you've got just the functionality of being able to catch or any more address. But then you also need the functionality of segmenting if you take this action. If you open my emails, I want you in my opens. If you came in on this, you only open emails about this topic, I want to segment you and tag you with this. So there's a tagging function. Then there's, can you print some of the information from the form onto a dynamic web page that says, Hey, first name, your order information is this. Here's your login. Like there's all these function and features people don't even realize are there that important, right? So you've got the technical people in your ecosystem. You've got the novice users in your ecosystem. But what you know about all of them is they need to make money. They need to take money. They need to manage and own as much of their everything that they can't write their list, their web page, their websites. If they can have it all in house for getting about the fact that high level is Frankenstein code. that's whatever. It's still under one login roof, right?\n00:48:05 - Chandelle Hay\nAnd I mean, it's crazy.\n00:48:07 - Tina Marie (profitdriversinc.com)\nIt's growing so quickly. And then the fact that they have snapshots where they can be fed in and maybe you be a snapshot curator. Maybe you don't just build them. Maybe you go curate and white label other people's snapshots that are for certain stuff. Maybe they can white label and curate other snapshots. Like, this is brand new. That's one thing that high level has done that nobody else has done, which is these snapshots, basically, insertable, fundable, ClickFunnels might have done it. I never heard of it. I didn't get in their world. But the thing is that high level people are hyperactive marketers. They smoke ClickFunnels people, which is probably why they're trying to see them like dumbasses. Go slap a kid through high level in the same year.\n00:48:59 - Chandelle Hay\nGood job.\n00:49:00 - Tina Marie (profitdriversinc.com)\noh poor guy uh yeah that's that's not how i and then just the affiliate model itself for high level like i like it's it's insane and so Jason when he first built that first snapshot he was like give people the shovel sell that we're selling the shovel but selling the shovel and i'm like okay yeah they don't know how to sell the shovel so now we're like we need to teach them how to sell the shovel yeah i gotta wrap up in like three minutes so i've got a four minutes beforehand but yes you should do the multiple offers and you should see how people respond to them they'll behave differently learn what you can learn about them sell the shovel but you don't need them this is what people need to learn they need to start to learn how to evaluate things better so what people generally are focused on is i got to make a million dollars by the end of the year or i have 10,000 this year no the first thing that you need to do is get your money back back from this current investment. So you're bleeding a little bit less. The fastest way to make this be free for you is to go sell it to one or two people.\n00:50:09 - Chandelle Hay\ncan do it.\n00:50:10 - Tina Marie (profitdriversinc.com)\nYou need to calm yourself down a little bit because 10x is easier than 2x, right? So if you go sell two, your very first two customers are going to be the hardest ones to sell. After you sell two, you've got some experience under your belt, then you go and you sell more. So look, I just want you to go get your first sell. I don't want to talk about anything else except your first sell, if, and this is a self-selecting survey, where do you follow this? Do you need this investment to be returned to you ASAP? Are financial distress? Okay, if you're not in financial distress and you're at least paycheck to paycheck, know, living across, but then here's what your focus should be. It should be, what is the most optimal offer that you can get out to get out of the rut that you're in right now? out, that doesn't create time, energy, overwhelm that so that you'll be able to maintain it. Okay, if you're profitable and you're looking to optimize or just capitalize on an additional type of offer opportunity, whatever, then, you know, you're not at the bottom of Maslow's hierarchy over here starving, I can talk to you about self actualization.\n00:51:24 - Chandelle Hay\nYeah, that's right.\n00:51:26 - Tina Marie (profitdriversinc.com)\nThat's right. That doesn't get talked about out of marketing, but in every market, that's what you have, you have somebody at the bottom who is just trying to buy, and you have somebody at the top like, I got everything, but I got more in me.\n00:51:39 - Chandelle Hay\nSo what else can I do? Right, right. That's a really good way to put it.\n00:51:45 - Jason Orban\nOh, Tina. So, okay.\n00:51:48 - Tina Marie (profitdriversinc.com)\nSo having said that, I just need to know if Jay thinks it was worth showing up to talk to me.\n00:51:54 - Jason Orban\nabsolutely. I just, yeah, like, I've been sitting here listening and I just hold a guy on $250 for 2k. Talk to you with another person for $1,500. Dave said he's good to go for $1,697. Nice.\n00:52:13 - Tina Marie (profitdriversinc.com)\nOr he wants to look, well, is what we do, right?\n00:52:18 - Chandelle Hay\nAnd I said this morning, like, this is what we need to do this week.\n00:52:21 - Jason Orban\nWe need to sell like . He just asked if he can have until June 3rd to get the special on five licenses.\n00:52:27 - Chandelle Hay\nBecause I told him if he signed up before the end of the month, then I'd give him five licenses instead of three. Yeah.\n00:52:33 - Tina Marie (profitdriversinc.com)\nOkay. Okay. So give him like a timer at like midnight.\n00:52:37 - Jason Orban\nSo here's what I want to see. I would love to see. And then somebody else just signed up for our fall today, too.\n00:52:44 - Tina Marie (profitdriversinc.com)\nBam. Two fifth. So okay. You guys should come up with a marketing action plan, like very clear offers.\n00:52:52 - Chandelle Hay\nGet on the same page. Shandale, stop being scared.\n00:52:54 - Tina Marie (profitdriversinc.com)\nOkay. Trust Jay, when it comes to the offers and Jay, she needs you. to actually document and commit to the plan, whatever it is, and to be clear on it so that you guys can be on the same page and that she know how to support you because I know that that dynamic between the two of you and I probably am a hybrid of both of you.\n00:53:19 - Jason Orban\nJune 3rd is Monday, yeah.\n00:53:21 - Tina Marie (profitdriversinc.com)\nSo when I'm operating from where Shendell is, I can't move if I don't know what I need to know and I cannot move at all if the one I'm working with and my partner, if I have uncertainty and and no clarity about are you showing up? Are you doing this thing? Is it all taken care of? And you can't tell me yes, you have to tell me how and like visually my brain works. Yes, if you don't tell me how because historically anybody that just will say yes and not show me how, doesn't actually have a plan, means they're full of , means that you know. Oh, next week is going to be the same. So I'm just telling you, like, if you want her to stop bugging you. Because I'm also Jay. In the like, I'm doing these things. Get off me. I got it.\n00:54:18 - Chandelle Hay\nLet's go more the lawn. Like, I'll just go look for the lawn and wash the car and pull weeds instead for the day, right?\n00:54:25 - Tina Marie (profitdriversinc.com)\nLike, I'll just check out. And I don't want to. I want to kill this thing. So I would love if I could pick your guys's brains and I can wait until next week. But I mean, COVID just destroyed people like so many things have been done. And I've just been taking care of them and I just want to take care of them. Some people just can't. I have no problem being able to make money, but I have to make money at a whole new level that I ever have before. So what was a very great life for me now when I'm giving in the way is like, it's okay, but I need it's time to accelerate. right? And so I am in new territory. I've never had to grow at a specific pace. You know, I've always like, I can make almost $200,000 working less than 10 hours a week, easily. But now I need to make, you know, quadruple that so that I can just take care of people dying of cancer, Oh, Tina, being homes. You know, like I people do all that they can, but right now that's just not enough for a lot of people. So I've got to come up with a marketing engine and I can make money. I can make money in my sleep. I just don't have the system. I can do it for everybody else. I am doing it for me, but I draw energy and clarity from other people's brains and that affirmation. And I need that energy to be supercharged. And when I'm supercharged, I fly. But the situation for some Some people right now are such that I can't help fast enough. And so I need to get my together, but I'm also being mom and a single mom. And I'm about to launch my third child out of the nest. that's a lot of getting them graduated, getting them money for getting on the job, getting them in college, making sure that they're also having all that experience of transitioning, having the freedom, taking the road trips, all of that.\n00:56:25 - Chandelle Hay\nThat's a lot of stuff.\n00:56:27 - Tina Marie (profitdriversinc.com)\nSo any help that I get from power brains that no marketing, but especially YouTube, because you know the value of what I teach, so you can kind of feed that back to me and go, Tina, on this, this and this. Because my biggest thing is focus fast enough and effective enough to, I got to get these people taken care of.\n00:56:51 - Chandelle Hay\nWell, do you want to jump on to your next call and then let me know if you want to meet again tomorrow and talk about your stuff, we can do that. or if you want to just meet with me on Friday, we could jam and just come up with one thing you're going to enter the universe here with and get it moving.\n00:57:13 - Tina Marie (profitdriversinc.com)\nSo Friday, I'm going to the temple and tomorrow I have, hold on a second because this is one weird week in that I prioritize some personal things that will do the filling up on my cup.\n00:57:29 - Chandelle Hay\nSo tomorrow. Which is good, that's good.\n00:57:31 - Tina Marie (profitdriversinc.com)\nAnd tomorrow my dad is graduating.\n00:57:34 - Chandelle Hay\nOkay, so then next week. But in the meantime, any ideas like send it?\n00:57:40 - Tina Marie (profitdriversinc.com)\nLike any thoughts, I need to send it. We can do the audio thing because that was really helpful to me. I got to jump off. And also, Jay, I know you're super busy but you think differently and any kind of feedback. Like if you do, if audio messages are too much for you or whatever. But maybe a call, but I would really be grateful for, because even the technical implementation. I will go.\n00:58:09 - Jason Orban\nI love you guys. Yeah.\n00:58:12 - Chandelle Hay\nyou don't need to just do us together.\n00:58:14 - Tina Marie (profitdriversinc.com)\nLike you can call me. know I did that.\n00:58:16 - Chandelle Hay\nYou can call me. Like even just start a chat with Jay up just you and Jay, because you're right. He will have completely different insights and ideas than I do.\n00:58:25 - Tina Marie (profitdriversinc.com)\nI want to hug you and speak to that. Nah. I love you guys so much. going to go.\n00:58:31 - Jason Orban\nI feel bad. I'm late. So I get to go. I'll talk to you soon.\n00:58:34 - Chandelle Hay\nAll right. Have an amazing rest.\n","contentPreview":"00:00:00 - Chandelle Hay\nI'm pretty quick hearing, he knows. How's your week going? What's going on? I don't think I actually sent you over log in information for BBD.\n00:00:13 - Tina Marie (profitdri...","processedAt":"2025-05-04T03:40:52.560Z"}