{"fileName":"Done Transcript for Patrick.txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Patrick.txt","type":"transcript","priority":"medium","content":"00:00:02 - Patrick Shahverdian (3)\nHey, yeah, I can hear you.\n00:00:04 - Tina Marie (profitdriversinc.com)\nHow was vacation?\n00:00:05 - Patrick Shahverdian (3)\nIt was good. Just got home really late last night. But other than that, it was fun.\n00:00:13 - Tina Marie (profitdriversinc.com)\nI had a good time. Yeah. Was it like a family thing or you just like hanging out?\n00:00:18 - Patrick Shahverdian (3)\nNice. Nice.\n00:00:21 - Tina Marie (profitdriversinc.com)\nDo you feel? Well, you probably feel too tired to be refreshed, but. Yeah. Do you feel refreshed at all?\n00:00:30 - Patrick Shahverdian (3)\nYeah. Because my friends like, we like to really chill out. So we weren't doing too many activities.\n00:00:38 - Tina Marie (profitdriversinc.com)\nNice.\n00:00:40 - Patrick Shahverdian (3)\nWe had a lot of time to relax and stuff. So I didn't think I needed a vacation. But after I came back, was like, yeah, needed that.\n00:00:49 - Tina Marie (profitdriversinc.com)\nIt's funny sometimes how you don't know what you need until you get it.\n00:00:53 - Patrick Shahverdian (3)\nAnd then you're like, oh, It's like sometimes getting a massage and like the masseuse gets in there. like, I did not know that. I heard that bad and then exactly you did that and I was like, oh, I think I needed that.\n00:01:07 - Tina Marie (profitdriversinc.com)\nThat's good though. I'm glad that you got it and I'm glad you got that perspective and hopefully you'll remember both that it was useful but also that you weren't aware of how much you needed it. So in the future just kind of think about your time and your energy and maybe there are other things that are day to day like you can't have a vacation all the time but like maybe there are other kinds of things that you could do with your time and your energy that would be helpful that you didn't really know would be like that impactful.\n00:01:42 - Patrick Shahverdian (3)\nYou know what I mean?\n00:01:43 - Tina Marie (profitdriversinc.com)\nYeah. So you've been gone a while so I have no idea if you've thought about any of the conversations we've been talking about like it's been a while a couple weeks since we've chatted. Any, any thoughts where you were gone or just preparing for the call today?\n00:02:10 - Patrick Shahverdian (3)\nUm, probably, but I don't really remember the last meeting.\n00:02:17 - Tina Marie (profitdriversinc.com)\nYeah.\n00:02:18 - Patrick Shahverdian (3)\nknow most of it was with Lorenz and, you know, how he structures his team and everything like that. But I mean, some good news is, you know, I was gone for a week and I would still check my computer and stuff, but I'm proud of the team because it's all the work that they were doing and, you know, how they were handling everything and, you know, obviously I wasn't there working full time, but it looks like they were able to hold things down, which makes me comfortable knowing that they were working and able to kind of handle the caselope without me being there. Um, so that was good to see that's that's awesome.\n00:03:03 - Tina Marie (profitdriversinc.com)\nActually, so let me go because I was looking at the numbers for one. Um, which one is. Okay, July so for. So what I was finding interesting. And this month is definitely going to be skewed a little bit because you're out. Hold on a second. I'm still reviewing it. Um, so first of all, let's just kind of recap. Well, I'm taking it. I lost my notes. I don't have too many windows, but I need a few of them to be able to do this. So some of the things that we had talked about was just. Um, the leadership that you were already working on and employing in your team, things like noticing that. at Patsy needed a little bit more clarity and direction and like do this and you don't need to be asked to do it just you know here's your job here's what we expect and and get that done which probably went into you know how things went when you were gone and then I never really I don't know but I haven't memorized who you have I feel like it's Elsie I'm Cynthia Elsie and Cynthia yeah wait did I say Patsy what did I say yeah Patsy sorry I meant Cynthia oh my gosh I don't know what there's some names it just makes up in my head but I did know the difference sorry um although I don't have bases for either one of them so that that kind of happens but Patsy's are in Take Lady and Cynthia is yours and she's been bounced around a few people I remember um anyway so just kind of thinking about That those leadership roles, thinking about the kind of person that you are for your team, that you can be a safe space, which means that you actually have the ability to ask of your team things that other people couldn't. And I don't mean, you know, exceeding boundaries or anything, but meaning that they wouldn't get the same kind of results that you would because you're a safe person, because you'll ask and rather than make somebody feel afraid to mess up or do something wrong or get in trouble, they'll be like, oh, yeah, I totally could do that. And they feel empowered to be able to try to do their best job, because when people are afraid of making mistakes, they don't actually do their best at all. They just do just enough to get bias so that they don't cause problems, which is actually counterproductive, because they end up not, you know, giving their all, but it makes them feel a little bit safer to stay safe. smaller if that makes sense.\n00:06:02 - Patrick Shahverdian (3)\nRight.\n00:06:03 - Tina Marie (profitdriversinc.com)\nBut because you have an energy that is not that is like you are intentionally looking out for how they feel and not wanting to overwhelm or intimidate or scare them off or make them feel bad, you can ask for say, you know, let's just just for example what you did with Cynthia say these are the things that I need you to do and then have compliance and have a work on it. So one of the things to try to look for is what are the other things that might be able to improve a little bit in terms of have follow up maybe with cases and making making calls in a timely manner, making sure that the cases that have the greatest potential for higher attorney fees are handled, or if one is at risk for whatever reason of sub-out or drop-out, well, not sub-out, but yeah, sub-out, not drop-out. That's being prioritized so that we don't lose the case, things like that. So that's one thing. I'm thinking I forgot what I was going to ask you. I should have wrote that down. Oh, oh proud. Okay, so we're looking at stats. me just provide some real quick. And I'm going to share my screen and don't think I'm sharing anything I'm not supposed to, and then I'll just get yelled at if I am just kidding because Mark doesn't yell, but not me anyway. Does Mark yell?\n00:07:48 - Patrick Shahverdian (3)\nNever.\n00:07:51 - Tina Marie (profitdriversinc.com)\nThat sounds not right. I mean, I can see him having it, especially the conversations we had in the beginning. I think he told me about having a temper and I think I yelled at him a few times and said stop it. So, but I don't know how he is now. Anyway, okay, so I'm looking at cases this year and obviously I know that the thing to keep in mind is that you, your cases are throttled. You get a lot of Mark's cases. they're not just your own and everything hasn't been opened up to you like it has to the other attorneys. So, this is not apples to apples by any means. But I still think that it's impressive in the resolutions. So, in June, Tyler had 19, Samantha had 21, and you had 21. And to me, and I could be wrong about this, but that's kind of a good indicator. So, there was this, but it's not enough data, right? So, Look how small this one. There's only three for the month so far compared to 13 and seven and I almost don't even want to compare Tyler. I'd rather compare just Samantha. And then Lauren's isn't even on the board for this month. So You know what resolutions mean, like, is that Is it isn't that when you are paid out? Which one is the one that's your paid out? Which one is the one that it's done done?\n00:09:30 - Patrick Shahverdian (3)\nDone done is money and attorney's fees.\n00:09:34 - Tina Marie (profitdriversinc.com)\nYeah, but there's And then there's cases settled. Yes, and that's which one I'm trying to figure out cases closed or resolution.\n00:09:44 - Patrick Shahverdian (3)\nThat's one of these two. Okay, because whichever Okay, yeah, cases closed would mean money and And then resolution is like any sort of settlement.\n00:09:58 - Tina Marie (profitdriversinc.com)\nRight, so that that's what I was looking at. And that's the thing, this is what you guys have the most control over, not when you get paid, right?\n00:10:05 - Patrick Shahverdian (3)\nHow much do I have for resolutions?\n00:10:08 - Tina Marie (profitdriversinc.com)\nFor this month?\n00:10:10 - Patrick Shahverdian (3)\nYeah.\n00:10:11 - Tina Marie (profitdriversinc.com)\nThree.\n00:10:12 - Patrick Shahverdian (3)\nYeah, that's not accurate.\n00:10:14 - Tina Marie (profitdriversinc.com)\nOkay, and that's the other thing, this is a new report. So I don't know if you remember, I was looking at it and saying I didn't know if I want to show it yet.\n00:10:21 - Patrick Shahverdian (3)\nYeah, my list is 10, so.\n00:10:24 - Tina Marie (profitdriversinc.com)\nOkay, and what about last month?\n00:10:27 - Patrick Shahverdian (3)\nSo I can compare. Last month was 1, 2, 5, 6, 7, 9, 2, 14, 15, 16, 18. 18? And those were all my cases, were any mark crossovers.\n00:10:45 - Tina Marie (profitdriversinc.com)\nOkay, and then let's compare cases closed, so paid, is I want to see what these numbers are and then all.\n00:10:55 - Patrick Shahverdian (3)\nSo last month I had 1, 2, 5, 6, 7, 8, 9.\n00:11:00 - Tina Marie (profitdriversinc.com)\nnine, ten, eleven, twelve, thirteen, fourteen, Okay. And the month before. One, two, three, four, five, six, eight. Okay. Oh, what did I click on? I'm gonna do that. Okay, so then I need to send a note off just a second. Mark.\n00:12:00 - Patrick Shahverdian (3)\nYou Okay.\n00:12:50 - Tina Marie (profitdriversinc.com)\nAll right, I sent that off. Hopefully we can get that figured out. Oh, let's see. Policy limit. Okay, I'm not going to look at this anymore right now, whoops, because I want to make sure that it's accurate. So we'll dig into that. That report's only actually few days old, a few days, a few weeks old, and it usually takes us a few iterations, actually, let me go, let's see, reports, oh, that's why report reports. Let's see matters closed, we'll just type in matters, matters by team, or by principal attorney active matters, and I want that, I want that much by team. Let's see if I can edit this. No filter. I. Attorney. No, not as fun to be. Owner. So would the attorney be the owner?\n00:14:29 - Patrick Shahverdian (3)\nProbably. Yeah, that would be accurate. Sometimes it'll change and the owner will be the old attorney, but I don't have too many of those.\n00:14:38 - Tina Marie (profitdriversinc.com)\nOkay, so we'll just say. See if that will. Well. Save and run. And then. right. right. right. All right.\n00:15:21 - Patrick Shahverdian (3)\nThat means we take our fee and hold like a certain amount in a trust account until I'll hold in trust.\n00:15:29 - Tina Marie (profitdriversinc.com)\nOkay, let's see but there's 141. So does that sound right? 141 records that you think that you've gone through? Let's see if I can create a status. I do want already. All right. So part of this process, though, is learning how to get better reports so that we can have, first of all, accurate data and then, well, accurate data that matters and really review it so that you can know exactly where you stand and also how you're ranking within the team. So since I don't have something reliable, how about you tell me what your team did while you were gone is as much detail as possible because that will also help me with the reporting stuff and then also help us with next questions and what we're going to work on.\n00:16:46 - Patrick Shahverdian (3)\nYou said how they did when were gone. would have to be choked.\n00:17:00 - Tina Marie (profitdriversinc.com)\nOkay, let's just do this. Let's kind of take inventory of last week. So we'll look at how many new cases were there. How many got settled. Just any, any issues, any calls, if there was any disbursements that happened. Yeah.\n00:17:23 - Patrick Shahverdian (3)\nOkay, let me see. We got one, two, four, five new cases last week. We did two settlements last week. Okay. Okay. Okay. Okay. Okay. Okay. And then for fees, we got two as well.\n00:18:11 - Tina Marie (profitdriversinc.com)\nSo what percentage of. So you're going, your max is 40% right for attorney fees. Yeah. What, what, what were each of those two cases?\n00:18:25 - Patrick Shahverdian (3)\n40%.\n00:18:26 - Tina Marie (profitdriversinc.com)\nOh, okay.\n00:18:29 - Patrick Shahverdian (3)\nYeah. One of them was a big, big case or fee was 68,000.\n00:18:37 - Tina Marie (profitdriversinc.com)\nAnd who handled that conversation?\n00:18:40 - Patrick Shahverdian (3)\nI did that one. Oh, you did that.\n00:18:43 - Tina Marie (profitdriversinc.com)\nYeah. Well, good job. Okay. So you handled the conversation about distributions, not disbursements.\n00:18:54 - Patrick Shahverdian (3)\nYeah. Actually, for all my cases, I do once it gets to like closing it out, getting the district. patient sign, I do all that.\n00:19:02 - Tina Marie (profitdriversinc.com)\nOkay, for all the cases, so what I'm trying to dig into is when you came back and you said your team did really well, how do you measure that? How do you quantify that? Like, what did you look at and go? That's they did that well.\n00:19:25 - Patrick Shahverdian (3)\nI noticed I got multiple emails on certain cases where we were waiting one medical bill in order for me to send a demand and they would let me know that it came in and that it's ready to be demanded. The new cases that come in, I know that's all mostly LC, reaching out to the clients, setting them up with treatment. That was getting done. I can see that certain things that were coming in, Cynthia was saving them in the case files, know, notating how much the chiropractor. it was, we use this internal thing on Lidify, it's called Chatter. That's where they kind of let me know, you know, this on updates on cases. We had one case, it was like a weird sub out, it's one of Mark's cases, I guess the guy had another firm for like a while, and then he signed on with us. But I wasn't there to, you know, handle that, and Cynthia was able to send all the documents, the case file, so that got handled. And I would see the notifications on slide, like a call would come in, and you know, I'll see what, you know, take it. So I keep eye on those things, which lets me know that, you know, if they're not really on top of things that they'll either be slow to respond, or they won't take the call. Um, so that lets me know that, you know, they were on top of everything. Um, was sending me requests for authorized treatment for certain clients, um, is important because we need to make sure that, you know, the policy limits are adequate enough to authorize certain treatment, for example, Um, so she was asking me, you know, she was sending me emails and saying, can you please, you know, authorize X for this client?\n00:21:34 - Tina Marie (profitdriversinc.com)\nUm, and you, you know, you were on vacation. You responded to all of that?\n00:21:39 - Patrick Shahverdian (3)\nYeah. Yeah. had my computer out there. So, um, when I had time, I would go through and see what, you know, what was urgent and respond to those.\n00:21:48 - Tina Marie (profitdriversinc.com)\nI think your average response time was during that time.\n00:21:51 - Patrick Shahverdian (3)\nI was pretty slow because we're three hours behind over there. So. I was working like. I was. eight PM our time.\n00:22:02 - Tina Marie (profitdriversinc.com)\nSo you were so they never waited longer than a day. Yeah, that's awesome. I mean, you're you're so that kind of speaks to the leadership skills too. And now I know that it comes with the territory that stuff still has to get handled and has to be done timely.\n00:22:19 - Patrick Shahverdian (3)\nBut that doesn't mean everybody does their job. You know that, right? Yeah, I know.\n00:22:23 - Tina Marie (profitdriversinc.com)\nSo one of the things that that probably had a huge impact on the fact that your team was staying on top of it was that you were also staying on top of it, even when on vacation. So that's really important. And you gave them a very clear signal that work matters and that we will we will get things done. And so even while not being physically present, although are you guys all remote? Who's in the office?\n00:22:50 - Patrick Shahverdian (3)\nUm, they're both in the office every now and then I'll see what we'll come home. Um, that's for the most part. She's she's in the office.\n00:22:59 - Tina Marie (profitdriversinc.com)\nRight. So that's great. Now, if you were to go and look for things that maybe weren't handled well, first of all, did it occur to you to do that? Did you think about doing that? Did you do that? Look to see if anything slipped while you were on it.\n00:23:20 - Patrick Shahverdian (3)\nYeah, because what happens is on like, at some point we'll get like our clients policy limits or the other, you know, full parties policy limits. And I noticed like on two cases, like, because we get a lot of documents from this and team, it's like a lot. And I already told the team, like, I have like a CD, so I'll double check to make sure certain things get notated. And naturally like things, even when I'm there, like, I'll see we'll get to it, but for me, like knowing the policy limits is like one of the key parts of the case, because it's so easy to like authorize an injection. or we don't know what the limits are and it can get really bad, so I just like to know and it's just like a piece of mine for everybody, even Mark, when he's looking through the case to know, it's like our baseline for how the case is going to go. So I just noticed like we would get a declaration page which shows policy limits and then just wasn't notated in the file. So there were a few cases where I went and I did that myself, which I do when I'm in the office anyways. But other than that, nothing where I was like, hey, like keep an eye on this, can't make this mistake again type of thing. I just honestly felt like I was just another week.\n00:24:45 - Tina Marie (profitdriversinc.com)\nYeah, so that kind of stuff happens anyway, right?\n00:24:48 - Patrick Shahverdian (3)\nIs that what you're saying? it gets done, but like I'm just like when I see those like two letters PL, which means policy limits like I'm just like really quick on it just because I don't want to miss it.\n00:25:00 - Tina Marie (profitdriversinc.com)\nAnd you've communicated that I'm sure you have to them that that that's the thing that like that has to be on every single case.\n00:25:07 - Patrick Shahverdian (3)\nYeah.\n00:25:10 - Tina Marie (profitdriversinc.com)\nSo how is that received? you feel like? I mean, this is the job and nobody's perfect all the time. Right. There's got to be a margin of error. But what we can do, what we can work on is focus on the big rocks. So what. What are the things that matter the most knowing what the policy limits are definitely right up there.\n00:25:36 - Patrick Shahverdian (3)\nRight.\n00:25:36 - Tina Marie (profitdriversinc.com)\nSo if something else slips, that's maybe less important. And I don't even know what that would be. But, but let's say that there are non-negotiable like these always need to get done. matter what. Don't everyone see this. There's not a threat implied that there are anything. It's just that this is non-negotiable. Make sure this happens on every case. Do not finish or no. until you've checked yourself, are the policy limits notated, that type of thing. Have you had a conversation to that degree? Now, I can sound very kind of like hostile forcehole. So I'm not talking about with my energy, right? I'm talking about with that kind of clarity and emphasis on this has to be done every time.\n00:26:26 - Patrick Shahverdian (3)\nYeah, that's one of them. Because even they know like, if we don't know what type of insurance we're dealing with because Elsie sets up the treatment. So once she goes to do that, she'll naturally have a tendency to look and see how much room we have money-wise, you know, for treatment. Now there are times where we know the other party's insurance or our insurance has like a lot of money, then it's not as important to figure out everybody's coverage because if it's like half a million, like, there's... definitely plenty of money, so we don't need to know exactly how much everybody has right now, because the case probably won't go that far. But on cases where she's going to set up treatment a week or two has gone by and we don't have any insurance yet, then it's like they know to make sure we figure out or else if you're authorizing treatment without any insurance because there may not even be any insurance. That's when that gets like expedited, so they'll figure out how much money we have to work with. That's one. Another one is client calls when we get a new case, not to let it like more than one day go by without any client contact. I'm trying to think of other non-negotiables. like if a client's like kind of threatening to sub out like any type of like text or anything like that to call them right away or well sometimes I'll call right away just to kind of calm the client down because if you know say we get that text and no one reached out then it's you know pretty bad mistake so that's another one. Certain things like if we have a $15,000 limit never authorized more than one MRI because we don't have the money to. The teams are pretty good at that. I would say those are like the main like none of those triple things it's just like basic case management setups.\n00:28:56 - Tina Marie (profitdriversinc.com)\nSo I know that you're not in the place where you get incentive yet. And I know that the team doesn't have an incentive plan, but right now Samantha has her own, Lorenz has his own. I did talk to Mark about trying to standardize that. That's kind of a long process. It's an ongoing conversation about modifying that anyway. But in the meantime, these are the types of things that would be generating incentive pay for you, which would then give you something to reward them with. So do you have any sets, kind of review periods with your team or just like one-on-one conversations and meetings about performance and any issues they might have and what kind of support they need as a structured set type of conversation?\n00:29:58 - Patrick Shahverdian (3)\nWe have our weekly meetings. But other than that, like anything one on one haven't really done yet. Cynthia will come in like every now and then and just, you know, to me, make sure that she's doing a good job. And then with Elsie, I haven't had a one on one with her yet. I think she's only been with us almost not even six months yet. But like on the big cases where I know like it was a pain to settle that one or get it done or like a really big one, I make sure like on our settlement channel, you know, to put their names in there too, just to make sure that they feel like they're a part of it because it's so easy for the attorney to take credit on the cases where in reality, like the team is the one who's doing a majority of the grant work that helped. I'll just get the case done. I know Cynthia appreciates that a lot. I'll see's a little bit more.\n00:31:06 - Tina Marie (profitdriversinc.com)\nThe appreciates just being given credit for that work? Yeah.\n00:31:11 - Patrick Shahverdian (3)\nLawrence told me that when she did come to my team. So that's been good. So I keep those things in mind. if I know there was one case, almost half a million settlement, Cynthia helped get these records that the insurance really wanted to see before they would throw out an offer and she got that done really quickly. So when we settled the case, I made sure to put her name in there too, and how she helped contribute to the case. That's like not money stuff incentive, but yeah, I know that if I was on her end, you know, I would appreciate my work being noted, you know, that way, when they come to work, it's not like, well, I'm doing all this work and the attorneys. Taking all the credit for it. They get more pay to me Because at the end of the day like I feel like everybody thinks about those type of things I want my team to know like Just because I have a degree doesn't mean like I'm on a different pedestal Now sometimes I'll request records if I really need it Just to show them that like we're all on the same They level like no one's better than anybody And I feel like those type of things when I'm gone. It's like they do their best job when I'm not there out of respect Because of the way that you know I treat them overall Ask you a question though Do Cynthia doesn't do I have any kind of college degree? I don't know to be honest or elsey I'm not sure either one does the one thing to keep in mind is\n00:33:00 - Tina Marie (profitdriversinc.com)\non a human being level and on a showing up to work level, know, that part is equal, but the investment that you made to get to your job is not.\n00:33:12 - Patrick Shahverdian (3)\nRight.\n00:33:13 - Tina Marie (profitdriversinc.com)\nof school, so that kind of time, and then also the money that goes into school, whether you paid it out of pocket or however it got funded, that's a lot of money. Yeah. that, you'll never get that time back. You invested that to be here, whereas somebody else just applied for our job. So even if they got experience on the job somewhere else, they were still getting paid for that.\n00:33:41 - Patrick Shahverdian (3)\nYou don't get paid to go to school.\n00:33:43 - Tina Marie (profitdriversinc.com)\nRight. that is one thing to keep in mind when it comes to it is that you're not all equal in the workforce when it comes to that because you've paid a price that they didn't pay. So, your return is, the other thing is they are not accountable when things go wrong, you have the liability they don't. And part of the compensation is your risk and your liability for the work that's getting done. And that's a real thing. Now the odds that something is going to go so bad that you're going to, that it's going to ever actually cost you is probably pretty low because you're managing things well. But there is real risk involved in practicing law. And they don't have that risk, they don't bear that risk. And they didn't make the investment of all that time and all that money. So it is important and I want you just to kind of stash that away in case it ever comes up. And at least just ponder it like what does that mean and how would that show up when you do get incentive and I think that that is something that you should take into account. This isn't about being better than anyone else or how you show up right now. So for example, you know, when I do my work, I've had people try to figure out how long something takes me and want to pay me an hourly rates. And I work faster than five, sometimes 10 people, depending on who it is. I, but the reason I can do that is because I've acquired a lot of skill in my practice. I've put in hours and hours and hours of work and study and repetitions to make me really good at it. I have top-of-the-line equipment all the time, all the time. I say on top of it all the time. So when somebody's paying me and I don't even do hourly work anymore, but when somebody's paying me, they're getting access to all of that. All of those scales, all that experience, the money that I spent on the technology. And so they're trying to compare me, sometimes they would, this is historical, try to compare me to somebody else or what they think is industry standard. I'm like, son, I'm not industry standard. Look at the results, that's obvious. But it's the same kind of math, right? People want to do and think that they're doing the equation and that this is what it's like in a job. We're all a team and we're all equal, but not all teams are equal. So let's say you've got the captain of the varsity team and he steps down to play with the second string and they're not all equal. The skill level is not equal, the hours probably are not equal. So it's just important. I just want you to make sure that you keep that in mind. there's a way to use that information. and not understanding without, you know, it's not a power trip or lording over. I just want to make sure that you don't undermine yourself or discount what you have brought to the table and also the burden that you bear that is invisible because liability nobody's thinking about it. You might think about it from time to time. They're probably not thinking like if this goes wrong, you know, I might lose job at Patrick could be sued. You know what I mean?\n00:37:33 - Patrick Shahverdian (3)\nYeah.\n00:37:33 - Tina Marie (profitdriversinc.com)\nAnyway, I know it was a long whole monologue thing. I just want to talk about these things as we're kind of going into how you're structuring and leaning. Okay, so client calls now. Okay, so I think that it would be a good idea for you to set up and they can be very short, but monthly one-on-ones with individual member. So with right, your current team is just LC and Cynthia. So with each of them, and it should have a specific agenda of things that need to be covered for sure, all the non-negotiables should be covered, things that you've noticed. Hey, Cynthia, great job. a single one of your people went more than a day without being contacted when you were here, right? Any kind of threats to sub out, you handled it immediately. You never authorized more than one MRI when somebody had a $15,000 any of those things. So first of all, they know how much you're paying attention to what they're doing, and they're getting credit for not just, hey, good job, but very specific, good job, right? Did you play sports?\n00:38:52 - Patrick Shahverdian (3)\ndon't remember if you told me that or not. Yeah, I played a waterfall and I swam in high school.\n00:38:59 - Tina Marie (profitdriversinc.com)\nThat's right. I remember I remembered it was water. I forgot about the polo, but yeah, so anyway, just really specifics about about what they're doing and what they're doing really well and maybe especially because if let's say they're not doing one thing really well, when you bring that out, no, it does not feel good. likes that and but but it still has to be said. You can soften the blow instead of just by saying, hey, you need to fix this because this isn't happening and this is this is crucial. Soften the blow, but you have been amazing at this and you've been amazing at this and you've been amazing at that and so keep doing this job also and not but right because everybody ignores everything after the blood but also let's work on improving this and then when the incentive time comes around, you have specific things that you can. pay your incentive on. So it can be these types of things. There'll probably be some other things you want to break down. Basically, anything that is a lever or a switch, you know, in the business that makes a significant impact that you can track, that you can measure for sure, all of those things that you just mentioned. There may be a little bit more detail and nuance to it. Maybe it's the reporting. Maybe it's the communication. I don't know, but these are the things that we want to look at. And so then if you have a meeting with them each month and you're letting them know, hey, I've looked at all of this stuff and really you're like, I'm so impressed. You did this. You did this. You did this. You did this. You did this. that is amazing. I did notice this. I would love to work on this. Is there any way I can support you in doing better here? And then you be quiet and see what they feel like. And generally, especially if you really have people that want to do well and care about how you feel about it. You'll either maybe get the actually I know that I kind of been dropping the ball and I could do better and just okay will you do better and then again you be quiet. Not just hey I know you can do better but very specifically an accountability question will you do better and if they say they're gonna say yes nobody's gonna say no and sometimes they may say try I'll try and then you can rephrase it and say I didn't ask you if you try I asked you well you do better and if they say well you know I'll try it okay so if you can't commit to doing better is there a reason why you can't commit to doing better is it is that is that hard for you do you need some training in that area is it you know what I mean like Is that an opportunity to either maybe shift that task to somebody else or strengthen them, give them training? But if you see something wrong and they can't say, I 100% can do better and I'm going to do better, then you want to figure out and drill down a little bit more. OK, why not? And how can we make that better? But I think that with the goals that you have for just killing it, really, and the team that you have and the way that you're leading, just so back to leverage, right? Just by picking one particular thing to work on, which would be reviews over a very specific set of topics, which I would love to see. So do you feel like you have enough time to set this up by next Monday when we all meet together?\n00:42:53 - Patrick Shahverdian (3)\nA set of incentive things that I would like to see?\n00:42:57 - Tina Marie (profitdriversinc.com)\nIt could be incentive. But basically, it's like, what it... What are the criteria that you want to review with each of your team monthly that eventually will be how you can, and you can modify this so this can be rough draft. But what I would like is, yeah, that structure, these are the things that matter most, so I'm going to review it with my team. But also when incentive time comes around, it would make sense that the things that matter most impact incentive. So you don't have to figure out how you would structure it and how you would weigh it and what you would pay. But what are the topics that you would review with each person, and this should be like five to ten elements that you have. And you can rank them right. Here's our five critical and five non-negotiables, and here's our five, know, this is not as important, but this definitely impacts the quality of results type of thing. You think you could have a rough draft that by Monday? Yeah. Yeah. Okay. rough draft. I love the new part to that. Awesome. Awesome. I was thinking about then, you know, let the team know that starting next month and maybe, and maybe it'll be the end of the month so maybe like end of August so you've got time to put this together. And, but then I was thinking maybe we don't want to tell them and tell that you've put something together for sure to let them know what you're going to be measuring, rather than it being like a sucker punch. Hey, I'm looking at this, which it should not be right because they should be very aware of what their duties are. There's a magical thing that happens when people know that they're being scrutinized a little bit more as they perform well, especially if they feel like it's not a negative thing, like someone's paying attention, but they're not, you know, looking for ways to screw up. And you can tell them when they're doing it, like, Hey, I'm going to be looking at these things. And I know that Elsie, you're awesome at this stuff and Cynthia, you're awesome at this stuff. And but I really want to know how to celebrate your wins and really look at where you're shining. But also look for opportunities for improvement and see if there's any kind of training maybe that we can have, because that's the whole point of it, right? We're not trying to ensnare anyone and catch them in a trap. We are trying to help everybody be better and also make sure that we're looking at what we can appreciate in what they're doing. Make sense?\n00:45:56 - Patrick Shahverdian (3)\nYeah.\n00:45:58 - Tina Marie (profitdriversinc.com)\nOkay. What do you think about that? how do you feel? I mean, I basically just kind of said, you should do this.\n00:46:08 - Patrick Shahverdian (3)\nAnd I want to know what your thoughts are on it. I think it would be good. I know for Cynthia, it would be good for her to hear that she's doing good because like sometimes we'll just like talk about a case like in my office or whatever. And then before she leaves, she's always like, am I doing good? Like, just want to make sure I'm doing good. So I know she likes to feed back. And then with LC, I mean, we can test it out and see how she likes it. I think it would be good like review every month because like, let's say we set the standard today. Everybody, you know, all the boxes and then like month two, two and a half, things start to like naturally fall off again, which is normal. So it'd be like a good thing that they know like every month. I'm gonna, you know, ask about You know, X, Y, Z Whereas right now it's kind of like we already talked about it and it's up to them how long they want to continue to Work on those things So I might be good to have like a Set date every time, you know once a month that I'm gonna ask them about You know those five to ten key things I'm definitely opening to trying it because They'll also give me an opportunity to know that, you know, we go over this every month.\n00:47:42 - Tina Marie (profitdriversinc.com)\nSo there's no reason for it to Not get done So I do think it's a good idea So couple of things I thought about why you're talking And I know that you're still kind I'm now Elsie's only six months around, Cynthia has been moved around, so really to get a good kind of gauge of things, I would like you to commit to it for a minimum of six months, are you willing to do that?\n00:48:14 - Patrick Shahverdian (3)\nYeah.\n00:48:16 - Tina Marie (profitdriversinc.com)\nOkay, and then the other thing is what I would like you to do, especially so that they feel that this is opening the lines of communication and kind of reinforcing that the fact that this is a safe space is, is there anything, when you, at the end of it, ask them, okay, is there anything that I can do better for you? Do you feel like there's a system or process that needs some improvement? Do you have recommendations about how we can better operate? So it starts with the wins, what they're doing good, a little bit of a coaching session on anything that can be improved, and then we shift the focus off of them, and what can you what can I improve? And then we take it back to the processes. now we're ending on it. It's not a personal note, and then you can just end completely on. Again, you've done an amazing job at these things. Good job, looking forward, you know, to the next one, keep up the good work, that kind of thing so that you can kind of purposely direct the energy almost like conduct, like a music conductor. Right? You purposely starting in a specific spot and ending on a specific note so that it has the the best positive income and doesn't have like any kind of negative impact on the day. Even if there's a coaching session, you kind of take the heat off with making, putting some attention on you and just the business in general. Yeah. Okay. So you have your weekly standup meetings. What is the format of those or what you didn't call them standup, but you We can team meetings. What is the format of that?\n00:50:04 - Patrick Shahverdian (3)\nTypically, if I have something that I want to like an urgent thing, I'll usually bring that up first. But most of the time, we kind of just, you know, they have any concerns about certain cases or like a question, I'll just ask them like on any specific cases you guys want to go over. Um, you know, anything that, because if it's like really urgent, obviously we talk about it like right then and there, like else you just message me or come into my office. So the meetings are more things like that come up, but they're not like super urgent. For example, I'm trying to think of an example. Like there was one, there were like denying liabilities, like a word for word to spew. So LC asked me, know, how should we, you know, approach this case? And they know, I tell her, you know, how I would do it. And then for Cynthia, typically, you know, Oscar, are there doctors that are giving you issues on, you know, record requests, are they taken too long? That way I can, you know, reach out personally and try to get it done faster. Sometimes we'll change like how we do things in those meetings. For example, like, I don't know if you know what the health insurance liens are, but Cynthia typically handled those and a few meetings ago. So typically what they'll do is they'll send a form for us to fill out. But I realized when I would do it, I would just call a number. and give them the info that they wanted over the phone and it was much quicker so like in the meeting I was you know advice and they're like hey I tried this because it served responsibly to get those in I was like you know let's try just every time we get one of those requests just call them and give them the info instead of you know filling out the paper faxing him back so in the meetings like if you want to change something how we do things you know we'll go over that in the meetings and then just like general questions like you know are you guys overwhelmed like I always ask Elsie because I know she takes like 90 percent of the phone calls I'll ask her like are you overwhelmed like are you able to are you handling everything do you need me to you know take a few calls this week to you if we get a lot of cases obviously she's gonna make a lot of calls so I Ask her if she needs any help. Typically she's she's able to handle everything. But yeah, let's typically have the meetings go.\n00:53:13 - Tina Marie (profitdriversinc.com)\nAnd are they scheduled regularly?\n00:53:18 - Patrick Shahverdian (3)\nNo, there's no set date to just kind of just I'll just let them know like are you all available for meeting like at 3pm on a certain day or something. But I don't have like a set date yet.\n00:53:31 - Tina Marie (profitdriversinc.com)\nSo do you for sure have them every week?\n00:53:35 - Patrick Shahverdian (3)\nI mean, we've missed a few weeks like sporadically. But I always talk to them like in the office like they'll talk to us in our office. Cynthia too. But I should probably have like a set date every week to do them.\n00:53:54 - Tina Marie (profitdriversinc.com)\nSo you learn this in the military, right? there is real power in structure because no way. to expect, you can anticipate it, which means you can be better prepared for it, right?\n00:54:06 - Patrick Shahverdian (3)\nYeah.\n00:54:07 - Tina Marie (profitdriversinc.com)\nAnd generally, when we're better prepared for something, the outcome is better. So my recommendation would be to go ahead and schedule that as ideal of the time as you can, where it is a set time every week, and then, you know, if somebody gets hung up on a call or whatever, then you modify it if need be, but do everything you can not to modify it. And at worst case scenario, you know, everybody stands by if they can for a little bit, or more importantly, what should happen because the only only way that that's not controllable is if there's an inbound call that took a really long time, but even still call control skills can kind of probably help with that. So, like, one of their things would be don't make a call, you know, 30 minutes or so, or don't take a call, 15 minutes or so. before the meeting so that nobody gets stuck on a call, make sure that we can show up and be prepared. then the meeting can have a similar structure to the reviews, not necessarily the same stuff, but a very specific structure. One thing I would recommend is start with the winds. It always kind of helps the mood and the energy, especially if everybody knows that's where we're starting. We're not going to dive right into stress. We're going to say, hey, because I know you're watching your team anyway, right? Hey, you did this good. You did this good. So Cynthia can now start getting her weekly kudos and you could say, Cynthia, you're killing that at this, this, this, you're doing a great job. Thank you. Even if you have to get into the issues, eventually where it comes up like, oh, also I'd like you to work on this type of thing. It started off with the wind and you can end with, you know, again, here's how I can support you kind of thing, which is something you're already doing. So start with the wind. and then you could either get two concerns or questions or the urgent thing. You might kind of play around with that a little bit and find out how that works because here's the thing, you're at the meeting, it's going to get handled. Where it falls in the meeting isn't as important to anything other than the energy of the meeting. So you kind of want to put it where where I like, again, energy sandwiches. I think we talked about these a little bit. I don't remember if we did or not. Good things, bad things, then good things, sandwich. So that's something to think about. And just because it's urgent doesn't necessarily mean it's bad and it may be top of mine and they want to get to the issue quickly. and when still, they don't have to be long winded. want to keep everything as 16th as possible because nobody loves just having meetings. for the sake of meanings. So get in, celebrate the wins, get those kudos, you can do urgent thing, or the concerns or questions, and maybe a concerns or questions specifically for Cynthia, and then concerns and questions specifically for Elsie, and then is there anything that I can do to support you, and then just wrap it up and have a set time. So 20 minutes, 15, 20 minutes, probably is all you need, maybe even less depending on how complicated it is, and also if your team is doing a great job of communicating all week long as the issues arise, you don't want to save it for the meaning. Your business doesn't work that way. So they really should be able to be pretty short. The biggest thing is those urgent things if it's on a planned schedule, right? Because you can definitely have have a we needed meeting to get on the same page. right now and so forth, and that wouldn't be the same thing. The structure would be different. That would just be simply a resolution call, right? But this call, if there's an urgent thing that gets brought to the call, then probably it's already been discussed and you're just, you know, getting to the nitty-gritty of it, and basically getting clarity. So those types of conversations, if and so that dialogue back and forth verbally is what allows for that clarity to happen. So other than that, 15, 20 minutes really should wrap it up, and then they know, especially Cynthia, because I think that she really needs that feedback and she really needs that interaction, especially from what I learned about Lorenz, and she really needs that encouragement. That can be a great time for her to do it, but she also seems to respond well to coaching, especially the way that you're doing. doing it so that gives her everything that she needs and now we start compounding that happening every week and then monthly they get one-on-ones it's a little bit more detailed about specific stats we look at this six months from now I and I don't know when you're gonna hit that incentive period where you guys really get to just kind of blow things up but I think your trajectory is gonna be amazing I think that that consistency and that structure based on what you told me about how you've already applied some structure and accountability but also just support I think I think that you'll probably have some pretty stellar results that you'll notice yeah I'm open to that and everybody else has like structured days I just it's weird like sometimes I'll notice like the beginning of the week is kind of slow\n01:00:01 - Patrick Shahverdian (3)\nSo, I'm like, I don't want to do my meeting on like a Monday and everything happens and then we have to wait till Monday to like have another meeting. But I'm thinking like Thursday would be good because we have our firm meetings out Wednesdays.\n01:00:18 - Tina Marie (profitdriversinc.com)\nAnd you can also have like a Monday morning email that you send out to everyone if you want to that maybe you dropped it on Sunday night and it's just maybe kind of stayed at the union. Hey, this is where we're at. These are our priorities. We'll have our meeting on Thursday and it could just what you could do is take. So let's say you use like an AI recorder or something or use a record and then and put it in the eyes so you can get some notes, have somebody taking notes. Somebody needs to take notes for sure. Otherwise, it's kind of pointless because you want to be able to track the conversations and you want to track the results because if you don't have data, you're not tracking anything, you're giving it to. human error, which there's going to be human error anyway, but it kind of diminishes the power of those conversations when you're not really tracking what's happening from them. So, somebody taking notes really well or use a recorder, and I can show you how to give it to an AI so they can summarize for you, something like that if you want. If you're nerdy, I'm sure you figure it out yourself. So, but I would recommend doing that. And then you can take those notes, instead of sending them out after the call on Thursday or after meeting because you're in person. Monday, hey, here's a recap of our meeting notes. you know, anything that might have happened between Thursday and Sunday night or Monday morning whenever you send it, you can say, here's a quick little update on a specific case or issue or whatever. And just go team go and we'll, we'll meet on Thursday, let me know if there's anything urgent and then you deal with the urgent things as they come up, but those three structure points. So we're talking about monthly one-on-ones, weekly scheduled meetings, Monday, kind of recap of the call and just additional support, clarity, prioritization, that kind of thing. If you have then something that comes up urgent, just tell them. If something comes up urgent, into my office, let's have a call, let's do whatever, let's meet and get it worked out so that it gets moved and processed and it's not weighing heavily on you or anything like that. And if everything else is being managed well and optimized, you should have the freedom to be able to deal with those types of fires and really give it focused energy so that you can handle it. So additional meetings are totally okay. If you want them, if you need them, but the structure and the committed time just kind of helps everybody say alert and focused and accountable with them, you know? Yep. Okay, so let me know how it goes. It's always a plan to start with it. The reality is everybody's a little different, the teams are different, the feedback is different, but what we do want to do is at least give it a chance to work because week to week, everybody's going through different things, feeling different things, different things happen, that type of thing. So if we could commit to this weekly schedule for at least three months, try to be as committed and consistent as possible. If you're just like, it's really networking, this is a problem, this is not the best way to do it, then let's change it up. the odds are that the structure is definitely going to be more beneficial than not.\n01:03:51 - Patrick Shahverdian (3)\nYeah, I agree.\n01:03:53 - Tina Marie (profitdriversinc.com)\nOkay. I hope you're so glad that you're having these conversations. You didn't answer. just left. Well, you're back and I just bombarded you with a lot of things. But what I would like to know is, and maybe give you some time to think about it, is come back and let me know and you can send me an email. I'd rather not wait until the next one on one. But how you felt about this call, and I think that that's something I need to do. So I'll send you notes about what we talked about and what we're going to work on. But then I would love some feedback from you like, okay, this was useful. This isn't really what I'm looking for. That type of thing so that I can structure this for your best benefit as well. Okay. All right. Do you have any questions?\n01:04:54 - Patrick Shahverdian (3)\nI don't. excited to go back to the office tomorrow and close out the month strong.\n01:05:00 - Tina Marie (profitdriversinc.com)\nYeah, I think you're going to do amazing. I'm oh, it's so weird to get emotional about dumb things sometimes. It's not dumb. I like seeing winners win, but I like seeing good people win, especially. And I think that you're on a great track. I think that it's you've got some amazing qualities on a personal level, on a professional level. And I'm really excited to see your career evolve with Sweet Law, because I think that you've got some special qualities that are really good.\n01:05:34 - Patrick Shahverdian (3)\nWell, thank you. I appreciate that. Like I said, I enjoy the meetings because I'm the type of person that'll just pull my head on work and not really talk about certain things. it's good to kind of have you as somebody I can balance ideas off or someone to tell me, know, you should try this because I'm always open to that.\n01:05:55 - Tina Marie (profitdriversinc.com)\nI would love to be the sounding board too, because I'm sure that you have ideas like that. I know your brain is working, you're just really quiet about it, because you're one of those that like, don't talk about it, about it, you just give about it. sometimes like, you know, that's the general rule for the general population, right? But you always have like your internal people that you should and could kind of talk about and riff with. And I know you've been like the lone wolf, but I'll tell you like, I'm 47, I'm about to be 48. I was always the very lone wolf independent, I can do better by myself, whatever. But I'm learning that as you, the bigger you grow and the more you increase your stewardship, right, the bigger teams are, or the more that you have maybe leadership roles in other parts of life, whether it be parenting or coaching or heading up some type of organization or whatever starting your or whatever to do. Being able to tap into other people's strengths, having conversations, peer-to-peer, mentor-to-mentor, or peer-to-mentor that students to mentor, my brain, it's Monday, anyway, but, but getting in the practice of not talking about all things to all people, not being like, I'm gonna, I'm gonna, I'm gonna, that drives me nuts, too.\n01:07:25 - Patrick Shahverdian (3)\nYeah.\n01:07:27 - Tina Marie (profitdriversinc.com)\nBut really, you just kind of like, I'm trying to figure out the best word to use, but just contemplating, but kind of co-consomplating, know what I mean, riffing back and forth about what you have stewardship over with somebody that has some kind of understanding about it, and it doesn't necessarily need to be the same type of industry, but leadership to leadership, right? Management to management could be law-to-law, that type of thing. So, just because you're still young and bringing these things in and you'll find that there's just a handful, like you'll be lucky if you get even five of those type of people that you can really, really, really be open with throughout your life. But when you find them, talk about what's in your head because the feedback that you'll get will be very different when you're not just listening but when you're really actively participating and sharing what you think and what even you might feel about some stuff. So anyway, that's just my encouragement to not hold back, not to change how you are quiet, had down things like that. But in small moments, just kind of engage a little bit more at a higher level from time to time and only with specific people so that you can really develop your own leadership at a higher level, because I think that, like I said, I think that you've got innate leadership qualities and that whole iron sharpened iron kind of thing. It's there something to it.\n01:09:15 - Patrick Shahverdian (3)\nYeah.\n01:09:16 - Tina Marie (profitdriversinc.com)\nOkay.\n01:09:19 - Patrick Shahverdian (3)\nwould you say sorry as a thankfully, Mark, you know, has you as a tool to help all of us and Yeah, really appreciate it.\n01:09:30 - Tina Marie (profitdriversinc.com)\nI'm glad to do it. I really enjoy it. So anyway, I won't take any more of any more of your time any calm down Another call. Anyway, I hope you have a great day. I'm glad you're back from vacation. I look forward to your report I will send you this email. Maybe not until tomorrow because I have some things. I want to add to it But it but it will be there and then we'll follow up next week Sounds good. All right, you have a great week. Thank you. You too. Thanks. Bye\n","contentPreview":"00:00:02 - Patrick Shahverdian (3)\nHey, yeah, I can hear you.\n00:00:04 - Tina Marie (profitdriversinc.com)\nHow was vacation?\n00:00:05 - Patrick Shahverdian (3)\nIt was good. Just got home really late l...","processedAt":"2025-05-04T03:40:52.564Z"}