{"fileName":"Done Transcript for Chona, Mark, Tina(1).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Chona, Mark, Tina(1).txt","type":"transcript","priority":"medium","content":"00:00:10 - Tina Marie (profitdriversinc.com)\nAre you guys here together? Can you hear me? Hello?\n00:00:56 - mark sweet\nYou Hey.\n00:01:01 - Tina Marie (profitdriversinc.com)\nHi, I can hear you guys. I'll hear you. Do I have both of you?\n00:01:06 - mark sweet\nNo, I'm going to do a round then. Hold on, absolutely my mouth.\n00:01:13 - Tina Marie (profitdriversinc.com)\nI'm going see you too. I'm going brush my teeth and I feel like I missed something and it's driving me nuts. I'm tired. Hey.\n00:01:42 - mark sweet\nIs this a home office or office office? No, it's not. The office is the one usually see it with the window where you can see the airplanes.\n00:01:54 - Tina Marie (profitdriversinc.com)\nYeah, well, we're hardly ever on video, so I don't know. Now we've got Chona. Oh, no audio yet. Water. Oh, there. Something. Hi. I am so excited to meet you in person. Well, Zoom person, you know, this person. You're so pretty. I mean, I mean, you're gorgeous.\n00:02:26 - Chona Sweet\nOh, thank you. It's probably a good idea.\n00:02:36 - Tina Marie (profitdriversinc.com)\nI've got like three tablets, three laptops, one desktop, you know.\n00:02:43 - Chona Sweet\nOh, I was drinking a crap.\n00:02:54 - Tina Marie (profitdriversinc.com)\nWell, I thought that the this would be the fastest way to kind of figure out what, because you've talked about what Chona's doing a little bit Mark and like how there's some income potential there and then Chona you're just getting your head wrapped around showing up being the schedule and then also Mark has a different kind of brain those those business brain people it can be a lot so it's a good thing it's just not you know like trying to get on the same page with everybody we all think differently and very intensely so mark if you would pretend I don't know anything about anything and give me just the real like third-grade version of what you see the potential is then we can start the conversation from there yeah so there's\n00:04:00 - mark sweet\nthree income streams.\n00:04:02 - Tina Marie (profitdriversinc.com)\nOkay.\n00:04:04 - mark sweet\nThe first one is what I would consider traditional medical practice.\n00:04:09 - Tina Marie (profitdriversinc.com)\nOkay.\n00:04:10 - mark sweet\nSo the doctor, his name is Dr. E, just so we're all kind of on the same page. Okay. Dr. E's primary practice is traditional healthcare pain management.\n00:04:23 - Tina Marie (profitdriversinc.com)\nThank you.\n00:04:24 - mark sweet\nSo he is the pain management provider of multiple facilities and clinics. what I mean by facilities is hospitals, including health insurance. So he primarily bills health insurance, gets reimbursed from health insurance, and that's where he's paying employees from.\n00:04:47 - Tina Marie (profitdriversinc.com)\nOkay.\n00:04:48 - mark sweet\nThat'll make sense.\n00:04:50 - Tina Marie (profitdriversinc.com)\nSort of. is my problem with trying to take notes and listen at the same time.\n00:04:54 - mark sweet\nSo I'm just going to listen and let the AI note taker do its job. So most people who are professional, being doctors or nurse practitioners, those are the people seeing the patients, get paid on a per visit payment.\n00:05:08 - Tina Marie (profitdriversinc.com)\nOkay.\n00:05:09 - mark sweet\nSo you get paid X amount per person that you visit, more people you see, more money you make.\n00:05:16 - Tina Marie (profitdriversinc.com)\nRight.\n00:05:18 - mark sweet\nSo that is in the hospital, some of it's in clinic settings, some of that is telehealth follow-ups.\n00:05:23 - Tina Marie (profitdriversinc.com)\nOkay.\n00:05:25 - mark sweet\nYep. Now I'm ready to get paid the same across the board, no matter what that is. Okay. So when you generally want to go to places, we're going to see more patients, because if you're driving around and only seeing two patients at each place, you're kind of losing time on money. So let's say one facility, a 17 new people to see and one has two. Right. advertise a 17. So that's the main traditional practice. Okay. Second part is the personal injury practice. Okay. So that's most similar to what Fuji does, from kind of what you know, the difference is Dr. E. he doesn't just do consultations. He does procedures and surgery.\n00:06:06 - Tina Marie (profitdriversinc.com)\nOkay.\n00:06:07 - mark sweet\nSo he works with a wide variety of lawyers and other doctors. So we're used to seeing maybe 10 or 15 lawyers that food you might work with, Dr. D for hours 50 of them. Some good, some bad, some in the middle. Okay. And so part of running Chona on is the medical records for a traditional practice versus PI practice. Well, they necessarily shouldn't be this way are different. Okay. Here's what I mean by that. Good enough is good enough a lot of the time for traditional practice. So we're noticing and seeing a lot of dictation service from Dr. D, where it's just dragon dictation and writing the notes. Okay. But there's a lot of typos and misspellings and some other things because it's not perfect. Which the general gist is there. Okay. In personal injury, that causes problems when you get into litigation or further on, because it looks like you're doing what you need to do. And so bringing on Chona is a couple of things. One, being able to see more personal injury patients. Two, having someone who actually can write records and reports that make sense, which is part of what I've been working with her on. There's lot of things that would get complicated and we can jump into those later. Very, very simple right now.\n00:07:29 - Tina Marie (profitdriversinc.com)\nYes, thank you.\n00:07:31 - mark sweet\nNow Chona can do some basic procedures as an NP, like trigger points and couple of good things.\n00:07:40 - Tina Marie (profitdriversinc.com)\nBut... Hi, sorry, my daughter's leaving for the night.\n00:07:46 - mark sweet\nBut she can't do things like surgery. She can assist, but she can't do the surgery itself, because she's not the doctor. So the payment structure is a little bit different in that now, legally speaking, she can only get paid for the person she sees. cannot get paid a percentage.\n00:08:02 - Tina Marie (profitdriversinc.com)\nOkay, legally formal, yes.\n00:08:05 - mark sweet\nSo we worked out a version of that that makes a lot of sense for her. And I'm assuming hypothetically speaking, hypothetically speaking, there might be a 50 50 split on consultations. So similar to like what Fuji does now where it's 400 500 visit. So split between Chona and Dr.\n00:08:27 - Chona Sweet\nE.\n00:08:28 - mark sweet\nAnd then 20% of whatever the procedure values are. Now procedure values tend to be much more significant, usually running anywhere between 4,000 up to 50,000 plus per procedure.\n00:08:43 - Tina Marie (profitdriversinc.com)\nAnd why would he be interested in sharing that? Because Chona would be the one who is in these patients and people that I know. And how are you getting around the legalities of that? are you creating some other kind of that kind of person, company, whatever.\n00:09:03 - mark sweet\nSo it's a little C and thing. follow our taxes separately, like everything to keep separate.\n00:09:10 - Tina Marie (profitdriversinc.com)\nYeah.\n00:09:11 - mark sweet\nSo I get no personal benefit out of doing this. I just get a happy wife.\n00:09:15 - Tina Marie (profitdriversinc.com)\nSo I get some personal benefit. That's not what I mean.\n00:09:18 - mark sweet\nLike, I think referrals, maybe, for example, Christian, honey, I think that's what people that I know. Because again, I know that Sean is going to do a good job. And, you know, a lot of issues are the same things like these pain doctors get really busy and don't do as good of a job.\n00:09:35 - Tina Marie (profitdriversinc.com)\nI get that. That's helpful because it's a little more onto it. But when you said technically, she can only get paid per procedure and can't really get a referral fee. How are you structuring that?\n00:09:50 - mark sweet\nYou know, there's a lot of marketing costs involved in what she does. And so more than sure, Dr. would be very happy to pay a marketing fee to help her continue to grow. I wrote for a pipeline.\n00:10:01 - Tina Marie (profitdriversinc.com)\nGot it. Got it. Um, valid and creative. Well done. So, okay.\n00:10:12 - mark sweet\nUm, then there's number three because that's number two.\n00:10:16 - Tina Marie (profitdriversinc.com)\nThank you.\n00:10:17 - mark sweet\nIt's okay. Um, and number two, number two or semison. Chona does not need doctor supervision in multiple other states. California is one of the few that she has to be under doctor supervision. So, you know, when you go to the doctor, usually see a PA or an NP, like most of the time. Um, in Washington state, she does not need to be supervised by a doctor. There are. What about Oregon? Sorry.\n00:10:46 - Chona Sweet\nabout Oregon?\n00:10:48 - Tina Marie (profitdriversinc.com)\nI don't think you need to an organ either.\n00:10:50 - mark sweet\nAnyway, sorry.\n00:10:51 - Chona Sweet\nCarry on.\n00:10:52 - mark sweet\nUm, but in Washington state, there's two doctors who have tried to use some of the telemed pain docs that we've worked with before. I'm just going to use footage of the exam. and they weren't thrilled with like some of the reports and just again when the pain dogs get really busy things then you get to sloppy. Yeah. And so because I'm I'm just literally friends with these people they'd be more than happy to send you know about 10 to 20 patients a week to try not just to do consults. She would not need to split any fee because she'd be off on her own without any doctors provision. That's what I like do procedures she can't do anything else obviously.\n00:11:26 - Chona Sweet\nI can do trigger points.\n00:11:29 - mark sweet\nYou're not flying up to see how to do it right away. It doesn't make sense.\n00:11:32 - Chona Sweet\nYeah.\n00:11:34 - mark sweet\nBecause we'd have to find a surgery center or an office and it comes with its own liability and everything else.\n00:11:39 - Tina Marie (profitdriversinc.com)\nmean but what if there's a good song skiing?\n00:11:44 - mark sweet\nYou would have to find rent out medical spaces expensive.\n00:11:48 - Tina Marie (profitdriversinc.com)\nOkay.\n00:11:49 - mark sweet\nJeez. Whatever.\n00:11:51 - Tina Marie (profitdriversinc.com)\nI'm not saying that it couldn't happen in the future but for the short cut. No, no, no. I mean you know I'm joking obviously.\n00:11:58 - Chona Sweet\nBut these are options. I mean again if she gets busy No, up there to go up there twice a week to go and do procedures that she can earn more for than.\n00:12:04 - mark sweet\nYeah, it does make sense. The issue is trigger points only pay about 800 each, and she's going to about 450 for a console and trigger points take out as much if not more time.\n00:12:14 - Tina Marie (profitdriversinc.com)\nNice click and do you and I know the answer to this, but I'm going to ask it anyway, have a spreadsheet with all of the income earning opportunities and that makes some basic calculations on what can happen. Then roughly how long each of those procedures or types of income opportunities take to fulfill so that you can figure out roughly what the earning potential is.\n00:12:40 - mark sweet\nIn my head, because there's the same limitation that kind of Fuji has, she can really only see about 400 patients in a month, more than that you start paying for that.\n00:12:50 - Tina Marie (profitdriversinc.com)\nRight.\n00:12:51 - mark sweet\nso, part of the benefit with being under the doctor in California is the doctor's going to be signing their reports and records so it allows her to have a little bit more flexibility and to make It's kind of like cheating, I guess, to be able to see more people, not really cheating, but...\n00:13:06 - Tina Marie (profitdriversinc.com)\nOr you could see 400 people and try to get them to come back for other like follow-ups and whatnot.\n00:13:12 - mark sweet\nMore procedures and things. problem on the legal side is this, because the limits are what they are, there are times where you just, even though they may need that procedure, there's not enough money to get that to actually happen.\n00:13:25 - Tina Marie (profitdriversinc.com)\nBut it's 400 in a month, right?\n00:13:28 - Chona Sweet\nIt's not just 400 you've ever seen per person.\n00:13:31 - mark sweet\nPer month.\n00:13:32 - Tina Marie (profitdriversinc.com)\nPer month, okay. month, yes. So then, how have we covered all the income-earning things?\n00:13:40 - mark sweet\nI felt like we did. Those are the three for her. The only other one for me is essentially what we've talked about with Dan is building out a better software, a better way to do this. With Sime, I report writing that could get away with a lot of the issues that we're seeing like Dr. E and somebody's being Dr.\n00:13:57 - Tina Marie (profitdriversinc.com)\nSuffer from. I think that this Steph, me working with Chona is actually probably going to help expedite that. I'll see things that in a different way. So then Chona, let me get to know you a little bit. And now the one thing that I that stood out to me that I was that I'm kind of holding on to is that this is a fulfillment kind of thing like that you didn't really necessarily want before, but do which is like having something of your own, having purpose, not just work, you know, but like something that you're proud of, something that you that you do. But what else could you succinctly kind of summarize what was the catalyst for starting this, what were the things that were happening inside of you that made you say, I'm ready. I want to do that. is because you still obviously have some overwhelm and so not being sure about things, but obviously have enough faith and Mark and in yourself to want to proceed with this. kind of help me figure out like imagine and be there with you when you're like, okay, I am ready and I'm all in.\n00:15:23 - Chona Sweet\nWhat was that I think, I'm not sure if Mark mentioned JP, honey. That's so we recently completed more of a kind of individual coaching type service and we it basically helped me I think that'll put it me into myself that I didn't know is there or has always been there but I I just, it's just wake that, you know, passion up again from me. I feel like I've always been passionate and with my career and then life happens. I think I think after my dad passed in 2020, I lost that passion and then, you know, there's some psychological depression with that brief. And, you know, after that coaching, I just have this renewed passion, you know, within myself. And it's like perfect time, you know, when I say it's like just how it happens. Yeah, the coaching finish. And then would you say, mean, a few weeks before I finish, Mark has been talking to Dr. E. So, and then Dr. E again recommended or ask Mark, do you think Jonah would want to? I don't know if I know, you know, the background. I know Dr. E from my previous work. He's a fellow. He's a doctor in training way back in 20 I don't know, 17 2016 no 2014 2015 so he's fellow and I'm a nurse practitioner, but that's how we met with Dr. E at Theodore Sinai And then I introduced him to mark because he the moment he graduated he wanted to hire me That's one of the NPS that I'm not sure. don't want to work too hard And then I introduced him to mark and they clicked cuz they're both you know have that business mentality and Ever since he's been asking me and I said no no no no I don't do this I'm I have an employee mindset I don't think I have no clue anything about business or anything like that. And then finally, I think it's just that, you know, that timing with my personal coach and then Mark talking to him and I didn't even realize that I'll have a second or I have another job at this time. This is not part of the plan. What you mean another job? I mean not another job, I mean a different job, I mean leaving my previous job because this is a new job for me, so.\n00:18:34 - Tina Marie (profitdriversinc.com)\nOkay. What were you doing before? Like were you?\n00:18:38 - Chona Sweet\nI'm still an I'm a nurse practitioner but more of an internist in a psych hospital.\n00:18:44 - Tina Marie (profitdriversinc.com)\nOh, okay.\n00:18:46 - mark sweet\nWasn't the last what you're in, you're in a half?\n00:18:49 - Chona Sweet\nYeah, the last year and a half, like I started part time with them in late 2022 while I was at UCI doing pain management and then I become time of last year of February. Then I've been doing that. Um, but prior to that, I've been doing pain management since 2013. Since I've become a nurse practitioner in 2013. I've been doing pain management. then I said, I don't want to do pain management anymore. I want something different, more challenging. And it definitely challenged me. biggest population is very challenging, but someone has to, you know, take care of those patients. Again, mental health is the taboo, still even on the medical fields, but in no one needs to help those patients. you know, it's definitely challenging. and then this opportunity arrived and then on the timing of the personal coaching, I said, you know what, not? Well, why can I see that person that can make more that I didn't even realize I can? Obviously, obviously with Mark, I guess. push gentle push like you can do this you believe in what i can do so that helps so what parts of it um excite you the most um the autonomy has always been there that's why i became an arch practitioner that's why i went back to you know getting my master's and doctors like i wanted to be a economist like that that's the driving factor and just in context i left UCI even though i'm paying good money i mean okay money i don't think i feel that they're paying me too much because they're not utilizing my full of potential and i don't like that that's why i left that job and that's why i went to the internist position which even though i'm very autonomous it's a very it's scary you know you have to always I'm back with this patient's mark is always kind of worried that I would come one time I came home with a scratch in my face like the patient do that just like no it's either you know it's a high stress environment but so you and money I mean if you're asking about that the income potential is there 100 percent I mean I'm gonna lie it's not if that's not it but it's more I think the autonomy and the fulfillment of utilizing to my fullest potential trumps the money because if it's really money that I'm talking about like UCI would have been perfect yeah I was just gonna say that doesn't make any sense that money would be even in the top because if you left because they're paying you too much and not using you then your perceived value is more important to you like I think so right Hans because remember how I would always complain that I feel like I'm um, what's that term used? I'm a glorified babysitter. babysitter.\n00:22:09 - mark sweet\nYou're helping the residents at UCI because, you know, they're doing doctors and they don't know what they don't know. And while you enjoy teaching, it was just kind of a, you were there just to make sure they didn't screw up something.\n00:22:22 - Tina Marie (profitdriversinc.com)\nYeah, so money's definitely not your main driver.\n00:22:26 - Chona Sweet\nYou, you want to serve a purpose.\n00:22:28 - Tina Marie (profitdriversinc.com)\nOh, you might like it, but if she made that decision, money can't be the main driver.\n00:22:35 - Chona Sweet\nIt might be closed, but it can't it's definitely, there's that component of the incompotential of making what two doctors can make in a year. It's definitely there, you know, like I'm gonna lie. But if you tell me that I will be working as what I do at UCI and be a glorified assistant and not utilizing my potential, I will not be happy.\n00:23:04 - Tina Marie (profitdriversinc.com)\nEven if I make that much money. So I'm just gonna delineate the difference between making a lot of money and earning a lot of money. So earning a lot of money is important to you. Making a lot of money is not as much. Right. The difference is just it's slight but it's important. Mark, are you laughing about?\n00:23:26 - mark sweet\nI don't know, like it's nice things. I do.\n00:23:29 - Tina Marie (profitdriversinc.com)\nAnd that's okay. But it's still that it's not the same. When you tie how you get the money, that matters.\n00:23:38 - Chona Sweet\nRight. That's that's what I'm saying. That's right for me to even say I felt that I'm getting paid. I'm getting I'm paying they're overpaying yet you said because they're not doing what I'm supposed to do. I feel like that's a good feeling.\n00:23:54 - Tina Marie (profitdriversinc.com)\nI mean if your husband gives you all the things you you are that because you married him.\n00:24:00 - mark sweet\nSo No, we're not.\n00:24:02 - Chona Sweet\nNo, we're not.\n00:24:02 - Tina Marie (profitdriversinc.com)\nNo, we're to see you open this kind of words. Okay.\n00:24:06 - mark sweet\nHey, she should make double what she's been making before. The other thing too is, when I tell Med Park, it's more and more robust. It does allow us more flexibility, but from a location standpoint, as well as, you know, a time standpoint. So if we want to travel or one of the other things for kids or whatever else, it gives us more options in terms of working time. And so it's not just a single income leader, know, anything else, trying to instill earn her income and what have you while being able from home or being able to work from wherever we are.\n00:24:40 - Tina Marie (profitdriversinc.com)\nOkay.\n00:24:40 - Chona Sweet\nSo freedom. Yes, I like that.\n00:24:43 - mark sweet\nYeah. So all these things kind of come together. And the timing was good.\n00:24:46 - Chona Sweet\nDr. He's been trying to recruit her for years because he doesn't have to train her.\n00:24:50 - mark sweet\nAnd, you know, he's like, make, he's definitely more business focused, but it's kind of raining.\n00:24:55 - Chona Sweet\nHe's all over the place. Oh my gosh. He is.\n00:24:58 - mark sweet\nBecause he just takes on every project.\n00:25:00 - Chona Sweet\nwhich is okay but you know he needs people who can do what they need to do and so it's a great learning opportunity and she's going to have more opportunity than she would if she joined you know like any other paint tops that it would work like this procedure I've never done this before but doing procedures which I am very much this is what I'm saying like utilizing to my fullest potential although California we I still need it in collaboration with a physician but this is just the first time after 11 years of the nurse practitioner so first time I'm doing a procedure which is you know it's great it's amazing you like learning yeah yes I do I do and yeah all right so now I understand the why and the what a little bit and now we got to kind of figure out the how that works with chona so the thing and I was talking to you about this last week chona\n00:26:00 - Tina Marie (profitdriversinc.com)\nthe mind is that the beginning is always the hardest, but what I can tell you and hopefully Mark can testify to is that when we really break it down and look at everything, what we're doing is we're going to be looking for leverage and optimization. So what that looks like is for example, you know, seeing more patients in one location, but there's going to be so many things that you're doing that from communication, travel, how certain locations operate, how you plan your day as well as how you start your day. Mark used to start it by checking his phone every first thing in the morning and get stressed out about something that went wrong or whatever, just immediately like it pumps cortisol into our bodies that that's stress of like there's something to do and I'm just like, can you just not look at your phone for a little bit and see how that goes and started working Dolce and there were some improvement. It's like the little things. It's not just the person doing business is the most important part of the business. So we'll talk about a lot of different things and it will start with a lot of questions. So the first step is you've got to get your head wrapped around everything and then you've got to be able to communicate to me enough so that I can get my around everything and so then we can start working together. So it is slow and kind of tedious and overwhelming in the beginning which is why I said you can also feel free to just vent send messages and just kind of vent because even in that venting I'll learn some things I'll learn about you know what's happening and the faster the more we communicate in the beginning the faster I'll be able to get to something useful for you. My standard It is I just talked to people once a week. Although I do tell them hey, you can reach out to me. Nobody does So it takes a long time.\n00:28:06 - mark sweet\nthink you run in photo stuff.\n00:28:08 - Tina Marie (profitdriversinc.com)\nI know I know thank you so much I love that doggy. I do take doggy payments Yeah, so You know something was just on your mind and you like this happened and I don't know where to put it I don't want to hold on to it You can tell anybody or you can tell me like I said you can just leave me like a voice You know you have an eye called to right Audio messengers are so great because then it does the dictation and I can just read it if I can't listen at the moment And so I will encourage you share as much as you feel like sharing Because the sooner I get all of that the faster will get there Um because I don't even know What questions to ask right now other than mark The fastest way is to get something that we can all look at so we can on same page, right, which is where, what are the offices, what are the opportunities, what are the procedures, what are the all the things. And it seems very tedious and Mark doesn't like tedious, but we can do another group call and I can extract it and I can create the spreadsheet myself. That's totally fine. But and that process actually works really well for me, Mark, because then I'm getting it firsthand and when I'm putting stuff in this spreadsheet, then I wrap my head around it. So what we could do is just schedule a couple more of these calls until I got my head wrapped around all of the opportunities to even start to formulate the questions. And you know how it goes and Mark can explain this to you is the more that we look at, the more we talk about the more that we see, the more the questions formulate, the more you just don't even know what you don't know. So it's a lot of asking questions and then it's just kind of a rough. It's not really fancy and it's not shiny and it's not exciting, but it gets some results and hopefully it'll help you be peaceful sooner rather than later.\n00:30:14 - Chona Sweet\nYeah, I feel like everything is up in there. I'm getting used to the flow of the number one, the main traditional, that's what Ricky's He's going to put me because he's really all over the place. He's spread him to the food and he's about to take on a really large contract.\n00:30:38 - mark sweet\nHe's not always going to fulfill it.\n00:30:41 - Chona Sweet\nSo she puts her in Long Beach, which is probably busiest hospital, I would say. Sorry. like my mind no no I have to initiate a lot so like what I feel like I am he doesn't have any plan for me whatsoever I I told him is it okay with you you know being respectful I will shadow this NP you know because I want to know how they do it because the office manager which is Mark's Mary I don't know if you know her but the office manager would tell me don't do how doctor eat that because he does it may definitely you do it the right way so I have to shadow everyone else because I need to know the right way more efficient way so that's what I did yesterday he didn't tell me I have to tell him like I'm doing this is that okay with you sure that's why everything I said sure so I can see myself as my goal knowing what I'm where I am now is I wanted to make sure that the Long Beach Memorial, it will be, I will have, I want to have my roots basically there. Rather than running around, he wants to have a lot of patience, right? don't have that many right now. That's where I wanted to be. If we can get 30 patients a day at Long Beach, that would be nice. Right now, like yesterday, it's less than 20. not a lot. And I just paid per patient. So.\n00:32:27 - mark sweet\nSo she gets between 20 to 30 a patient. So the goals between 30 to 50 patients. And there's not a limit on the number of patients she can see in the traditional sense.\n00:32:39 - Tina Marie (profitdriversinc.com)\nYeah. So that, all of that is really helpful. And I like that it's going to serve you really well that you recognize his shortcomings and aren't adopting that. Like that, that autonomy, of course, you would want it because you already see how you could do something better or improve.\n00:33:01 - Chona Sweet\nI already made a suggestion on how to increase, and he's like, oh yeah, we didn't do that, like, okay, this is gonna be a process. I feel like whatever I make decide, as long as it's obviously politically okay, he will say yes, so I have to make sure that we set up dark roots at Long Beach Tomorrow, so that we can see at least 30 a day, that's a goal.\n00:33:31 - Tina Marie (profitdriversinc.com)\nAnd Mark, how fast can you help, like you said, you know, lots of people.\n00:33:35 - mark sweet\nI'm holding that back until their systems and reports and processes are right because you get only really one chance at it, right?\n00:33:43 - Tina Marie (profitdriversinc.com)\nRight, your reputation.\n00:33:45 - mark sweet\nHundreds of other opportunities plus my own personal reputation side into it. So the good news is he already has some PI patients coming in again from what he's doing before. So trying to cut her teeth on those, she doesn't get the same payout. She'll get like more of the traditional payout, but at least. she can cut her teeth, get under control, get the report writing right, figure out how to actually do a better job making sure patients show up because that's a huge issue for this doctor's office. Now on insurance, they're not showing up, it's actually better for him from an insurance perspective because he's paid a flat rate per month.\n00:34:20 - Chona Sweet\nI don't think about the procedure though.\n00:34:23 - mark sweet\nNo, no, no, no, procedure will get a little more, but like if a patient doesn't show up to the office on the insurance side for him, he's happier, quite frankly. On the PI side, the personal injury side, that means you're not making any money, any wasted time.\n00:34:39 - Tina Marie (profitdriversinc.com)\nSo there's that follow up automation thing that we need to set up.\n00:34:46 - Chona Sweet\nSo okay, he's not very, he's not good, his system is not good. He's hiring more people. There's a lot of non-PI patients that come that they can't get through the phone. So whatever the second income that Mark is saying with the lead, I will have to also drive that and making sure that I am calling, that you're going to have a procedure in this day and make sure you come.\n00:35:19 - Tina Marie (profitdriversinc.com)\nIn the interim, would it make any sense to do what Fuji is doing and have an offshore kind of team that just does those calls? Because the automations will work better because we can do the text, email call, follow up and it should be cost effective. Plus, we can do all the tracking. But in the interim, without risking your reputation, Mark, and without tona having to be the one to call everybody because that is not the best use of your brain and your time.\n00:35:51 - mark sweet\nFor the problem, we've used Dr.\n00:35:54 - Tina Marie (profitdriversinc.com)\nE before in the past.\n00:35:55 - mark sweet\nNow, some these have been problems, which tona will be writing them and maybe in. They're okay. It took us multiple months to get signed bills and reports back from him to the point where like a lawyer sued him over and he called me to like to try to get him out of it because he opened for coaching and getting his stuff organized and set out because super busy like I not not yet he's he's going to take over the role mode still.\n00:36:23 - Chona Sweet\nYeah, that he's in that mood. They keep would care about what everyone say or he doesn't have any ego.\n00:36:29 - mark sweet\nHe's very nice person.\n00:36:31 - Chona Sweet\nHe just wants to get paid. just wants money.\n00:36:33 - Tina Marie (profitdriversinc.com)\nChaos doesn't take over the world.\n00:36:35 - mark sweet\nChaos blows up the world. And the VA thing, we're getting more and more negative feedback from whether it's Fuji or other people who are using it that they really don't like the VA who doesn't know what's going on and a large accent issue. It's a great idea in theory, but I think is you're trying to scale it unless you have the right VA is a balance and issues. So because the volume for P is low. I'm going to believe we're in do everything yourself first so you know how to do it also. Oh, yeah. But until then long term that is not the solution I've shown on calling and setting up that's not the solution.\n00:37:11 - Tina Marie (profitdriversinc.com)\nThe answer is I do it. We do it. You do it. It's the way to go. It's what I do too. Okay, so do we have other ideas for how to get more more people per day without someone having to call everybody or is that just that's what has to happen right now.\n00:37:32 - mark sweet\nSo right now in my mind is get her feet under her for at least the next like 30 days.\n00:37:39 - Tina Marie (profitdriversinc.com)\nRight.\n00:37:39 - mark sweet\nYeah. Get in your sway. Get in going. Right now she's on prescription running power because everything has to get approved. Like you have to get what's it called for the hospital again?\n00:37:50 - Chona Sweet\nThere's a for any doctor to anyone that can there's a process called getting a privilege in the hospital. So it's more thorough, not just background checks, just more deeper kind of employment, I guess, background checks that they do and it takes a while. So now it's been over a month now from Long Beach, so that will take a while. I'm hoping this month it will be done. Is that what you're saying here?\n00:38:23 - mark sweet\nYeah, so again, we can't even really get a lot of stuff started till she's got some of these basic things.\n00:38:28 - Tina Marie (profitdriversinc.com)\nWell, that's what I was trying to figure out is like, what's the timeline? So if we spend the next, let's say roughly four weeks meeting, if you're willing to come at least for the next couple mark, because yes. So then we can spend like the next couple calls really kind of extracting the the plan, all the the income opportunities, and I'll put it in a dashboard that will make sense. So we can do some calculations and forecasting for some. potential there. And then Chona can give us that insight about what it's like on the inside, how long these things take, how efficient this process is, how inefficient this process is, and really just kind of take inventory and stock of the operation side of it. And then what we do Chona is just kind of, you know, merge and optimize operations with the financial opportunities together. And where we've got the simplest process to get the most amount of money where those two intersect, that's the most leveraged income. So again, it's a lot of gathering, but gathering from from different aspects. So getting marks kind of planned, your information, feed on the ground, and I'll put it together and organize. And then while you're getting your, you know, why you're just getting used to doing it, and we'll be gathering the data that will then help us to create this strategic plan of Okay. Here's what we do for the next 60, 90 days. Then we do that thing, right? we're observing it as it happens, kind of tracking what's happening as we're doing it. Is it going according to plan? What else are we learning, implementing and inserting that data into what we're tracking? And just, it's an iterative process. So we start with gathering information, sort it, make a plan, and wash runs repeat constantly.\n00:40:27 - Chona Sweet\nSo as of right now, I know that I will be my native Friday. Since I don't have the privilege in the hospital yet, I would do clinics and telemedicine. So that's where I'm at right now on the traditional, on the number one, the main job, basic breath, the main job. The second job mark is holding that back until I'm ready. In the meantime, what I'm doing with that is I'm attending Choice Hall and hopefully where we can be a member soon so I can have access to their ideal note system that way I can incorporate that soon. In the meantime, Marcus is helping me. I show him my notes of the lead, the PI patient, and he tells me this is good, this is not good. And I'm in collaboration with Dr. E to make that better. But all of these, I'm going to have to drive it. It's too busy. Dr. E still busy with this. And the third one, Washington, I have yet to submit the application for what we call reciprocity. Since I'm with that, I have to, I'm licensed in California. I don't have to take the test. I just need to apply. So that's what's going on.\n00:41:45 - mark sweet\nQuestion or question of question of question of yet. If we don't do that soon or you have to have Dr. E. Vouch that you have for an active practice in California either he doesn't need to be involved with the reciprocity of Washington, like I just need to apply.\n00:42:00 - Chona Sweet\nand it will take a month at least to get that.\n00:42:04 - mark sweet\nWe're seeing like three months usually in the doctors.\n00:42:07 - Chona Sweet\nOh, Well, the doctors are probably different than the board of nursing. So I don't know, but it will be the board of nursing. But I feel like the Washington one would be the highest potential for income because I don't have to split that with him, with anyone. So I'm excited with that part. I thought she thinks.\n00:42:30 - mark sweet\nWell, maybe again, you don't to split it. So her, yes, but volume is going to be the question in the problem. Right. So if there's more volume and more procedures in California, she would make more from the California and Dr. E. Yeah, despite having a split because it all just comes down to volume. And I don't have a lot of volume in Washington.\n00:42:49 - Tina Marie (profitdriversinc.com)\nI know a couple people, but it takes time to spread. Right. And everybody being, you know, having the same type of thought about it. we create the spreadsheet that I'm talking about, Shona, and having all of that, it's going to make all of that easier because we're going to be looking at it mathematically with just really simple numbers, and it's almost kind of polarizing when you see the different opportunities and the things that happen. So it's not so much like that.\n00:43:20 - mark sweet\nThis too is we would still want her to do some of the traditional because it just makes everything else look more legit. Take Fuji, for example, I know keep going back to him I follow it, but he's got the Q and E work, not only makes him money but makes it look more legitimate because Q and E is generally defensive minded. So it makes him look like he's more fair and balanced. If she's doing also mostly health insurance and working through hospitals, it makes it look like she's primarily a primary trader.\n00:43:49 - Chona Sweet\nOkay, like how Dr. E said it when he was the post and he was asked like this is the same thing I do with my other patients. It's the standard of care. Which is where I want to be. don't want anyone do anything illegal. Dr. E and I are very much in labor. We're not going to do anything, whether the lawyer says we have to do this.\n00:44:11 - Tina Marie (profitdriversinc.com)\nWe have to stand on our medical beliefs and what is the standard of practice that's where we're at. Good and I mean, it's not philosophy that ever comes up in Sweet Law, but one of my just kind of like principles is have an unimpeachable character, meaning that you do the same thing everywhere you go, no matter what. I will punch an old man in church if he's invading in space and they're like, I don't care. that's not a good example, but it kind of means that even when I'm in the house of God, if somebody is doing something that makes me uncomfortable, I'm going to handle it the same way. Right. you act the same all the time, you treat your patients the same with integrity, obviously honoring the Hippocratic oath and just being there. to do good, then nothing really holds up unless you're just being taxed crazily for some reason.\n00:45:07 - Chona Sweet\nSo however much and organized Dr. E.S. his patients love him. Like he is a good doctor. Like he goes beyond like sometimes the patient is scheduled for example for epidural injections and they don't need trigger point. Trigger point is another payment. He'll waive that. That's the kind of person he is. And I'm actually, I saw it before when he's in training. I know he's a good person, but seeing it now for him 10 years later, it feels good to be working with that kind of person.\n00:45:42 - Tina Marie (profitdriversinc.com)\nI love that. All right, now I'm getting a whole kind of picture. And of course, just mark over there being a nice guy with nice people and nice sweet wife.\n00:45:51 - Chona Sweet\nI do like and she's cute.\n00:45:57 - mark sweet\nI'm super excited. And so are MPs and people who run businesses too, so you know, yeah, I do I do have friends.\n00:46:04 - Chona Sweet\nI can I see them their growth and Although I don't want it to say I mean, yes, I see them I get jealous, but I I accepted early on that that's not the path I chose, but now I can say hey I can do this too, okay Yeah, well even in my world I'm in business and I've made people millions and millions and millions and there are female counterparts that I've made way More money than me, but I've had more time with my kids and I coached soccer and I've done all kinds of other things And that was my priority and I picked them up from school.\n00:46:38 - Tina Marie (profitdriversinc.com)\nI got them up I made them breakfast I went to school three or four times because somebody forgot a notebook lunch or this thought the other and that was my Priority that was what I wanted to do so every night I got that twins, but you pick you pick what you want and there's different seasons in life So you're in a new season and it's fun and exciting and Mark's got people to help you out and you've got people to help you out and you're, you're gonna do awesome. I'm Yeah, I'm so grateful.\n00:47:05 - Chona Sweet\nLike I told him. I'm so thankful again. I feel tired today. But again, after I talk to you, I feel re-energized.\n00:47:14 - Tina Marie (profitdriversinc.com)\nI was, I was dragging. I was like, I'm going to pass out. As soon as this call is over, I was ready to fall asleep. So like, Yay, thanks for that mark, too.\n00:47:28 - mark sweet\nYeah, I mean, look, this should be good. There's a lot of options here. You know, like to have multiple fasts, not just one. I like it. Flexibility is large.\n00:47:39 - Tina Marie (profitdriversinc.com)\nstill want to see the doggy thing happen one day, the doggy food and doggy health.\n00:47:45 - mark sweet\nI know it has to make money first and be a proven concept and you're not ready. It will happen. This is something that I care a lot about. So, you know, it's about me like when I'm focused, general contestants, but like when I focus on something, it will happen. It doesn't matter how difficult it is.\n00:47:59 - Chona Sweet\nIt happens. It's not a matter of if it's when.\n00:48:03 - Tina Marie (profitdriversinc.com)\nYes, I love that tenacity. Okay, well, I don't have any more questions, but I don't know what I don't know, so I don't know if there's something I should ask that I didn't ask. I feel like this was a good start, but anybody have anything else to bring up?\n00:48:21 - Chona Sweet\nNo. I really know my role.\n00:48:23 - Tina Marie (profitdriversinc.com)\nYou want me to get the operations on my end so I can input it. I just want you to get your footing. I just want you to do what you're already doing, which is noticing what's working well, what's not working well, and get comfortable and then relay that information and that process back. And I want you to not overthink it. Okay, that will really stress you out a lot. I just really just show up, do your best, and know that you're going to make an impact for him, which is going to make an impact for the patient, and you're also going to be able to earn money that makes you feel good because you will know when you earn.\n00:49:00 - Chona Sweet\nit.\n00:49:00 - Tina Marie (profitdriversinc.com)\nRight, and just enjoy the process as much as you can. Shoot schedule. So you're gonna have to have evenings for the foreseeable future, is that right?\n00:49:14 - Chona Sweet\nI think, I think for right now, that's what I'm seeing.\n00:49:19 - mark sweet\nSo, would you rather try to do a morning or no?\n00:49:22 - Chona Sweet\nI think the moment, like I was telling Tina, the moment I know the assigned patients to me, if I, I think once I get the hospital work done, and then I would know my schedule, like I would know how, because it's just right now, it's still up in there.\n00:49:40 - Tina Marie (profitdriversinc.com)\nYou're the only person in the world, I would be the selectable for, but I'm going to be the selectable them.\n00:49:44 - mark sweet\ngoing to the to the selectable I'm going the selectable them.\n00:49:48 - Chona Sweet\ndon't have any, like, what I'm saying is, I feel like you have like a midday even in the clinic, there's a lunch break, but I'm saying that if I have you, two, then I can push back the hospital. What I'm saying is I can go after. Like, again, the only one with the scheduling is the clinic. If they scheduled patients for me during this time, time frame, so that would be it. But the hospital, I have no time there. I would go when I can. If I go early, some doctors go at five a.m. a.m. the patient. Like, like, I don't want to do that. mean, I'm not going to wake up the patient.\n00:50:29 - Tina Marie (profitdriversinc.com)\nAnd so right now you are at the hospital every day.\n00:50:31 - Chona Sweet\nNo, not right now. still don't have access. I don't know the moment that I get that. I'm I'm assuming. I mean, I'm not. I'm hoping it will be soon because I I did the process in less than a day.\n00:50:48 - mark sweet\nMark knows and everything. Yeah, it's just we're just waiting for approval.\n00:50:52 - Chona Sweet\nWe're just waiting.\n00:50:53 - Tina Marie (profitdriversinc.com)\nIt's just waiting at this point. Well, do you want to schedule a week to week for right now, then? If that's okay. Yeah, let's do that. So next week, I have my girls for the weekend, so I like to keep Fridays open. And the week after that, I'm traveling, but we're not going to talk about the week after that yet. So how about next week, Thursday evening?\n00:51:13 - Chona Sweet\nthat work? Yeah, that's okay. Are you okay there?\n00:51:20 - mark sweet\nI just have something from four to five, but that's it.\n00:51:28 - Tina Marie (profitdriversinc.com)\nWe don't know.\n00:51:29 - mark sweet\nYou have to come in the evening anyway, right?\n00:51:33 - Chona Sweet\nLike after that, Shona? Yeah, I'm, I'm the director say evening, if that's okay with you.\n00:51:40 - Tina Marie (profitdriversinc.com)\nLike, yeah, so like six or like what time?\n00:51:43 - mark sweet\nI think six, it's just mark that I don't know what time mark is okay. Yeah.\n00:51:50 - Tina Marie (profitdriversinc.com)\nOkay, well, we said, so I'm assuming that you're not available until evening.\n00:51:55 - Chona Sweet\nWhen are you first available and like you have time, you'd be ready for tab a call. I think. I Thursday, I should be available, again, because I don't know my schedule yet, I should be available after five.\n00:52:11 - Tina Marie (profitdriversinc.com)\nIt's what I must, you know.\n00:52:12 - Chona Sweet\nOkay, I'm just assuming office hours because I like today.\n00:52:19 - Tina Marie (profitdriversinc.com)\nOkay, so let's shoot for six o'clock and if we need to adjust it, we'll adjust it.\n00:52:24 - Chona Sweet\nOkay.\n00:52:28 - Tina Marie (profitdriversinc.com)\nOkay, so it will be the same line and we'll plan on meeting at six and I'll send the calendar invite and then next week we will talk about the following week. Okay. And so next week, Mark, whatever you need to have access to or be looking at to be able to feed me information about income opportunities, specifically, like, is actual data as possible.\n00:53:00 - mark sweet\nI know it's more theoretical unfortunately.\n00:53:02 - Tina Marie (profitdriversinc.com)\nOkay, that's fine too. Whatever we have to start with, but my point is that if you can just have yourself either mentally ready, if you have to be at a computer, just whatever, that be able to have that type of conversation will be really useful.\n00:53:16 - mark sweet\nLook at your word response, Fred.\n00:53:17 - Tina Marie (profitdriversinc.com)\nShe just has the general numbers, but who can kind of them? That's an better start. Okay, I am so excited.\n00:53:24 - Chona Sweet\nTrona, do you have any questions? No.\n00:53:27 - mark sweet\nDid she hear dogs?\n00:53:28 - Chona Sweet\nShe has dogs.\n00:53:29 - Tina Marie (profitdriversinc.com)\nWait, what? They are not here. They are feeding with fluffy dogs. I have a poussaint. She's a poodle and a bee shan and I have a havinese boy. And the poodle has purple and blue hair dye right now because my daughter loves to be ticker to the beach and her hair was just flowing and the little kids are just like, oh it's a rainbow puppy. We love dogs. And we have birds in a bearded dragon also, so what I was a dad And the bearded dragon he's like this big and he loves to just hang out on shoulders and do you see He's I feed it with life In pics, uh, well he gets freeze dried mealworms. He loves blueberries. He loves kale Oh, Sometimes we will get him live prickets. Yeah, that's my daughter. I like lizards in the wild They're very adorable in the wild. Yes I don't think he should be in a cage. Anyway, I don't like cage down Tina is a big fan of the dog food idea Yeah, um dogs. Okay. I'm not going to cry.\n00:54:45 - Chona Sweet\nSo we're gonna talk about something else Yeah, yeah, I'm excited for this.\n00:54:51 - mark sweet\nI'm for showing.\n00:54:51 - Chona Sweet\nI'm excited for you know the future I feel like there's dr. A like we're gonna start slow, but then there's a part of me that I'm good I'm ready to go like, you know, like, but then he I think it's in my head and I kind of verbalize it, but we'll take it slow, and it's like, okay.\n00:55:12 - Tina Marie (profitdriversinc.com)\nI don't always don't take anything slow.\n00:55:14 - Chona Sweet\nThey go.\n00:55:16 - mark sweet\nIt's the idea of slow, but it's not crap. This happens and now we're, yeah, we're.\n00:55:21 - Chona Sweet\nYeah, the moment that he have at least 6,000 new ones coming in this October, they're already trickling in. So we'll see how that goes.\n00:55:30 - mark sweet\nnew patient's starting in two weeks. Yeah. What? It's like 10 plus people before then.\n00:55:36 - Chona Sweet\nWell, let's say, and not all of them are paying patients to collect chronic pain. So let's say at least, I don't know, 30% are on chronic, have chronic pain. But basically any one of them that have pain issue, they can't, they will come to us. So, there's that, there's that new thing too that I will, my name. It will be one of the top again, because I'm paying, I'm going to to push out a lot of narcotics, so there's that too. I'm not thrilled, but I'm comfortable if that makes sense, because it's my speciality, but yeah, it's just what it is.\n00:56:18 - Tina Marie (profitdriversinc.com)\nThat's good.\n00:56:19 - Chona Sweet\nBuckle up, lady.\n00:56:22 - Tina Marie (profitdriversinc.com)\nOh my gosh. All right, well, I am looking forward to it. And I think just a little bit, I've been able to talk to you. I can tell that you are made of some exceptional stuff, and that you're about to be tried in the fire. yeah, but my favorite thing about it is it feels amazing to know what you're made of, but you can talk about what you're made of all day long, and you can feel it inside of yourself. Until you get tested, you don't really know. And the tests are painful, but they come with a level of conviction that nobody can shake. Nobody can make you feel less than when you've done. and the really hard work. And so I'm excited for you to feel a whole new kind of level of who you are and what you're made of.\n00:57:08 - Chona Sweet\nRight. Thank you.\n00:57:10 - Tina Marie (profitdriversinc.com)\nYeah. The eyebrows mark.\n00:57:15 - mark sweet\nIt's going to dirty.\n00:57:16 - Tina Marie (profitdriversinc.com)\nOh yeah.\n00:57:17 - mark sweet\nI was trying to prepare that, you know, it's not a straight line.\n00:57:21 - Tina Marie (profitdriversinc.com)\nNo, it's not. It's not. But I think that you're you get that too. I think you realize that life is chaotic anyway.\n00:57:29 - mark sweet\nYeah.\n00:57:32 - Tina Marie (profitdriversinc.com)\nShe's very to you and you've got all these items.\n00:57:35 - mark sweet\nSo let's go get a little. Believe me. She can tell you stories where I wake up and I'm just like, we're gonna do this. That's literally not a joke.\n00:57:45 - Chona Sweet\nI will send you what I'm planning of our way guys.\n00:57:48 - Tina Marie (profitdriversinc.com)\nI only have it an hour a week and it pops up every now and then but I can just imagine.\n00:57:58 - Chona Sweet\nYou'll see his idea. that it started because our friend is, we sent a video to him for his birthday. And the question is, what's the question on what's still a plan?\n00:58:12 - mark sweet\nMoney is no object. What are we doing next time we hang out?\n00:58:17 - Chona Sweet\nThat's the question for his birthday. Are you going to send a video to her?\n00:58:23 - mark sweet\nOr the video and the chat GPT?\n00:58:28 - Tina Marie (profitdriversinc.com)\nOh yes, okay, that's just perfect.\n00:58:33 - mark sweet\nYeah, it's a little ridiculous, but yes.\n00:58:37 - Chona Sweet\nAnd then now apparently it's happening.\n00:58:41 - mark sweet\nIt might have happened. We'll see. But you know, most things start off as a joke and then you like get into it.\n00:58:47 - Tina Marie (profitdriversinc.com)\nYeah.\n00:58:52 - Chona Sweet\nI don't know how. I'm then with Mark.\n00:58:56 - mark sweet\nI don't. I don't need more.\n00:59:01 - Tina Marie (profitdriversinc.com)\ntell me how much you need to pack where we're going okay your practice that rolling with it perfect this is gonna be awesome all right well enjoy the video oh we will end on that note because I can't wait to go watch now all right you guys have an amazing weekend Jonah I will talk to you next Thursday but feel free you've got my number that you can text me messages and I will be happy to hear from you okay I will get a picture I'll give pictures of when they were babies and there's only one left because he killed the other one did you watch it was it like Game of Thrones style no but the way that he killed her was kind of because it was a mating thing no it is a game of throwing stuff I never watched that show but I can imagine yeah you know it's okay\n01:00:00 - Chona Sweet\nOh my gosh. We're not in space.\n01:00:03 - Tina Marie (profitdriversinc.com)\nMy dog has eaten the chicken. She's eaten squirrels and birds and everything else.\n01:00:08 - mark sweet\nShe might have dug up the lizard. I can't tell you that. You don't know at this point. Okay, I will watch the video.\n01:00:16 - Tina Marie (profitdriversinc.com)\nMark, I will talk to you Monday. Shona will talk to you Thursday unless I hear from you before then. Have a great weekend.\n01:00:30 - Chona Sweet\nYou\n","contentPreview":"00:00:10 - Tina Marie (profitdriversinc.com)\nAre you guys here together? Can you hear me? Hello?\n00:00:56 - mark sweet\nYou Hey.\n00:01:01 - Tina Marie (profitdriversinc.com)\nHi, I can hear you guys. I'...","processedAt":"2025-05-04T03:40:52.616Z"}