{"fileName":"Done Transcript for Profit Fairies(2).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Profit Fairies(2).txt","type":"transcript","priority":"medium","content":"00:00:12 - Tina Marie (profitdriversinc.com)\nI feel like I haven't seen you in forever.\n00:00:15 - Samantha Caplan (3)\nI haven't seen you since we saw each other in person. Which was only a few weeks ago, but it does feel like it was a very long time.\n00:00:25 - Tina Marie (profitdriversinc.com)\nYeah, I was over a month ago, or right around a month ago.\n00:00:29 - Samantha Caplan (3)\nRight around a month ago.\n00:00:30 - Tina Marie (profitdriversinc.com)\nThat's too long. That's just too long.\n00:00:33 - Samantha Caplan (3)\nDid you see the screen shot by you?\n00:00:38 - Tina Marie (profitdriversinc.com)\nI have not since six, and I am so tired. Hold on. Let's see, let's see. And then second one.\n00:01:00 - Samantha Caplan (3)\nSo all of my profit is gone because ads, but what I am noticing is the conversion rate is solid. So it's just about traffic and eyeballs.\n00:01:19 - Tina Marie (profitdriversinc.com)\nSo I was thinking because I have my most, the one that gets favorited the most is I have an AI border call chasing a butterfly. And I wonder, you know, should I set up an ad campaign, but if I did what platform on because for Etsy ads, you only get charged for actual visits to your page or on conversions, either way, I know whatever I ended up reading, I'm like, well, it cannot hurt me to max out ads. So I have as much available to spend every day as they'll allow. But, so when you talk about running ads, you're just talking about just ads or doing any other kind of ads.\n00:02:08 - Samantha Caplan (3)\nWhat was that about? Somebody farted. One of the dogs that I have both, they're both like right here. I have Milo under my desk and I have Bruce chewing on a unicorn to my left and somebody farted bad.\n00:02:24 - Tina Marie (profitdriversinc.com)\nthe point where I was like, how far it's our nasty.\n00:02:28 - Samantha Caplan (3)\nI'm talking about at the ads, I have only turned on at the ads and interestingly, a blue healer puppy t-shirt is the one that gets, like, I have not had a lot of success with being like, oh, okay, people are favoriting this, maybe that means they'll buy it. But lately, this one is being bought a lot, I'll show you.\n00:02:51 - Tina Marie (profitdriversinc.com)\nAnd so many have bought the border collie shirt that two different people have bought the border collie shirt.\n00:02:56 - Samantha Caplan (3)\nOkay.\n00:02:57 - Tina Marie (profitdriversinc.com)\nThere's a correlation for that for me.\n00:02:59 - Samantha Caplan (3)\nYeah. Can you see this one? This one has sold one, two, Okay, it got three sales and then up. So that was the spike. But it also got a bunch of favorites.\n00:03:17 - Tina Marie (profitdriversinc.com)\nI was like, oh, that's interesting. Oh, no, wait, I think, hold on a minute. I think, because I just got a message that a meeting got started that was not supposed to be until 11 my time, unless I got it wrong.\n00:03:38 - Samantha Caplan (3)\nHey, that's not necessary. Stop. Do you need to go?\n00:03:46 - Tina Marie (profitdriversinc.com)\nIt's the thing for my mission, and I really want to do that, but I really want to talk to you, and that's important to me. Hold on a second. Yeah, it does say 10 o'clock. But we were on the phone yesterday so I can't go back and check it.\n00:04:07 - Samantha Caplan (3)\nUm, I can also talk this evening.\n00:04:11 - Tina Marie (profitdriversinc.com)\nI don't have anything after I'm talking to her, um, whatever would work. I really want to talk to you.\n00:04:20 - Samantha Caplan (3)\nI have. I was supposed to go on a walk with my dad in an hour. And then I'm around. So do you want me to just ping you when I get home?\n00:04:31 - Tina Marie (profitdriversinc.com)\nThat would be amazing.\n00:04:33 - Samantha Caplan (3)\nOkay.\n00:04:33 - Tina Marie (profitdriversinc.com)\nI'll just ping you as soon as I get home.\n00:04:35 - Samantha Caplan (3)\nOkay. Okay.\n00:04:39 - Tina Marie (profitdriversinc.com)\nIt's like I've missed you so much and I was so tired to do too. And I'm like, I don't have the energy for this. But I'm like, I know that when stuff starts to go away, it can just go away.\n00:04:50 - Samantha Caplan (3)\nAnd I don't want that happening. This has been going away. Go do your call. will just call you and I get back from my block of my dad. Okay.\n","contentPreview":"00:00:12 - Tina Marie (profitdriversinc.com)\nI feel like I haven't seen you in forever.\n00:00:15 - Samantha Caplan (3)\nI haven't seen you since we saw each other in person. Which was only a few weeks ...","processedAt":"2025-05-04T03:40:52.562Z"}