{"fileName":"Done Transcript for D&D Co & Profit Drivers - Weekly Review(14).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for D&D Co & Profit Drivers - Weekly Review(14).txt","type":"transcript","priority":"medium","content":"00:00:00 - Tina Marie (profitdriversinc.com)\nHello. What's that?\n00:00:04 - Dan’s iPhone (danddcompany.com)\nI said, what's up?\n00:00:06 - Tina Marie (profitdriversinc.com)\nWhat's up? My kids always say, this guy. I'm like, it's a good thing. Who were you on with that?\n00:00:21 - Dan’s iPhone (danddcompany.com)\nYou said Epusion Soft? Oh, well. was like, all right, we're all going to do this other thing because then I told Tina I wasn't ready at noon, but I got canceled at 11.50. I switched to this other thing. I had to do this other thing for follower flowy. It's almost funny. I have, who told me, anyway, there's this company member was looking for, processing in a birthday ring. So I found that company, and they're like, oh yeah, we're the gateway, but, but, authorizes the processor. was like, whatever. I don't care.\n00:00:58 - Tina Marie (profitdriversinc.com)\nCan I do this with you?\n00:01:00 - Dan’s iPhone (danddcompany.com)\nSo, yeah, so the, and then you were like, are they going to set up an authorizer comp for you? I did all the stuff with them, and then I gave the Nicholas and Maxine access to the background and deposit of that company, and they were looking at the APIs or whatever, and they're like, hey, there's nothing in here to look at whether a recurring payment has succeeded or failed, and like, we need to see that so that we can then update it in the desktop software, be like, hey, you're, you know, recurring payment sale, but whatever, right? So, we go around and around, I've had the worst time with support people for weeks on end. So, we go around and around with them, and I'm like, guys, you're not, you're not getting it. I jumped in, I was like, hey, then I texted the dude, I'm like, hey, bro. the answers your guys are giving us they're just they're not answers and so he's like oh let me get someone else on it so you get someone else on it and then they send over the api docs for authorized.net and then like you got to use the authorized.net API it's like okay I I guess that could be true right it's your gonna process it but it's really exists and authorized and then they're communicating to you and then your computer with me and it's like okay I go great I need access to the authorized account oh we sent that to you no you didn't look like I never got it we bring the guy's like oh I got to make a request that took a day and then the next day whatever I'm texting again I'm like hey what's the deal it's like oh we sent it to you no no you didn't the first time you didn't this time because again we sent it to Denise at the indie company oh okay Why? Whatever. Yeah, exactly.\n00:03:02 - Tina Marie (profitdriversinc.com)\nHow did that?\n00:03:03 - Dan’s iPhone (danddcompany.com)\nBecause she's the other owner, I guess.\n00:03:06 - Tina Marie (profitdriversinc.com)\ndon't know. I get that in the light.\n00:03:08 - Dan’s iPhone (danddcompany.com)\nYeah, exactly. Yeah. You've never spoken to her. It's never been used in any of these communications for your shirt. So I just spent like that. They canceled that meeting. like, all right, I'm going go sell this on. Good grief. It took forever. like, we're going to send you a pin coat for this. We're going send you a pin coat for that. But I got it set up and I sent it to Maxine and make a list. So now they should be able to. Prove that we can use this damn thing for follower flowing. So all is not lost. Meanwhile, I think Bobby may or may or may not have coded. So you had to cancel me with the last minute.\n00:03:47 - Tina Marie (profitdriversinc.com)\nThat's .\n00:03:49 - Dan’s iPhone (danddcompany.com)\nIt sounds cobbity. Right.\n00:03:52 - Tina Marie (profitdriversinc.com)\nRight. I have spent a lot of time doing the minutiae this week also. Oh, I told you I got hit by a car, right?\n00:04:03 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:04:04 - Tina Marie (profitdriversinc.com)\nSo how did you do that? Um, I think, yeah, it's just, it's just extra work. I mean, cause everybody, everybody is fine. I think I've had like massive hit pain, but that totally could be other things. Cause me, but just all the things, and then my daughter was going on a trip this weekend and her, her car has been making a really bad sound in her dick head. My told her at first it was no problem. And then all of a sudden he heard it again and he's like, that's terrible. Why are you driving on it? so stupid. Well, whatever. So he's like, you can't do that. You can't go on this trip and she was depressed. And so of course that consumed a lot of my time. Like I got to go into problem solving mode, but she's smart. She was right. It was a wheel bearings. We found a place to fix it and got it fixed fast. Like it's just a whole bunch of, and then getting my computer set up to do the mission work that I'm on and minutia minutia minutia and smoke in the. the air. I'm not a fan of that, Dan. But I've also in all this other stuff been working with Opus Clips like all these different tools, checking out some stuff I really am trying to get to build out my own type of product, funnel, whatever. But Opus Clips does a really, really good eclipse of logical, actual clips, right? But it also scores it by engagement and well, so not just engagement, but like how engaging it is, I should say, the value of it. And I don't know how good it is. So here's where I'm like, is this my ego or being struck by AI or you know, taking into account what. what people do actually say. Every time I get a review from AI, it's like Tina gave excellent coaching. This was excellent. This is like a 99 out of 100 and I'm like, I don't know how to take that. So I really don't know how to gauge it if it's good or not. But I think it's something, so I don't know if that's useful to you and anything else that you're doing and anybody else that you're doing.\n00:06:23 - Dan’s iPhone (danddcompany.com)\nWe tried it for Wilper and Jamie hated the results. So there you go. There's the flip side. I don't know if she articulated the exact reasons, but who knows?\n00:06:43 - Tina Marie (profitdriversinc.com)\nMaybe it didn't like, maybe it didn't score. Anyway, and my argument was how do you know? Right.\n00:06:53 - Dan’s iPhone (danddcompany.com)\nYou don't really know. No. It doesn't know. Right. You know what the The objective is the theory that you would take those and put them on and step in and reals or whatever stories and reals. Or maybe even just an end like straight up to their Instagram post and then you want what to happen, right? So that's how you know whether it's good or not. You watch it and you watch it in place tells me nothing.\n00:07:23 - Tina Marie (profitdriversinc.com)\nRight. Yeah, so then, um, looking into your funnel kit you use funnel kit, right? Do you hear that sound?\n00:07:34 - Dan’s iPhone (danddcompany.com)\nNo.\n00:07:36 - Tina Marie (profitdriversinc.com)\nThere was a baby duck in my daughter's room.\n00:07:38 - Dan’s iPhone (danddcompany.com)\nOh, yeah.\n00:07:40 - Tina Marie (profitdriversinc.com)\nHe's gone. I did not know ducks sound like that.\n00:07:44 - Dan’s iPhone (danddcompany.com)\nAnyway, you said, I'm sorry.\n00:07:46 - Tina Marie (profitdriversinc.com)\nYou do use funnel kit.\n00:07:49 - Dan’s iPhone (danddcompany.com)\nOh, yeah.\n00:07:51 - Tina Marie (profitdriversinc.com)\nAnd because so I'm thinking I want to use thinkific holy crap. I opened it up. I was just checking it out and it's like, what do you want to do? your course about. So I went to chat GPT, I might give me a paragraph about what my course is about. And then think if it created chapters, module headers, like it pre populated everything, including a sales page off of a paragraph. Like in seconds, it was insane.\n00:08:22 - Dan’s iPhone (danddcompany.com)\nLittle there.\n00:08:23 - Tina Marie (profitdriversinc.com)\nOh, yeah, but the whole thing for me is like the blank page resolution, right, is you like, obviously, I will not obviously, but you know, I'm sure there are people that would use it, but I'm not going to use it as is. But just the where do you start kind of thing? And especially with the 80D people that are like, that's their biggest issue. Man, that was crazy. So funnel kit with that. And then I found this app called Pavley, which is like, are you use that?\n00:08:58 - Dan’s iPhone (danddcompany.com)\nDo you like it?\n00:08:59 - Tina Marie (profitdriversinc.com)\nYears ago, yeah. Well, it's got really good reviews now, so I'm interested in that, but anyway, just playing with different stacks and so a little bit of new learning in case that ever comes up and be relevant. I still like the problem-solving and you're the nerdiest one that I talked to, so if there are things that we can find that are useful in the conversations, good. But I'm super excited to hear about, well, excited, whatever. Anyway, looking forward to hearing about your delving into GA4 this week and how that has progressed, hopefully.\n00:09:39 - Dan’s iPhone (danddcompany.com)\nSo I finished one and a half. I'll finish the other half today and it's so next up is GTM. So I'll see what they're doing in GTM. So in essence, at the end of this, you're supposed to have everything built. Well, Mind already built so now I'm just really going through to like did I miss anything so far? So I could think I could yeah, so I'm halfway through this one. I'll finish it. I finished it today. Very long and then I think You might have a note that's right. That's a good ol' letter, darling. So yeah, darn good thing. Well, I guess I'm done. guess I guess I would be done with the cave. this then yeah yeah so yeah tag managers next that goes tag manager gds um and then and how to like and then setting up like journeys so i can the only thing that i'll be missing is this gt himself so it'll be like well depth plus i'm on site by revenge i think that's that's where the real meat and potatoes is going to be for me is um adding stuff to gt because obviously i have gt himself that i'm already tracking all the new commerce events i'm already tracking the full events i mean i thought about i don't know and it's loyal or like naming it's like super long there's a good change of it it's a name but i don't even know that there's nothing through come on so that it's like gt gds and then it's like okay now do a journey which you can do on the gt himself then it goes into more complicated gpm yeah I don't know why they changed it to looker I'm not calling it that by refused yeah it makes no sense okay sorry didn't want to disrupt you I wanted to make sure I was following now yeah so then that gets me through I mean that's like the entire two levels looks like I never actually scrolled this hard on the thing I was gonna say one page one and then I guess like behavioral past like entry exit all the way through basically the lifetime of the customer or like specific their they've up to you yeah so it could new to find the journey so it is it's like a version that you just said No, it's like, um, check out journey, right? So you're like, okay, I, what happened, but you can have, so you could have like different entry points, right? So it could be like, from the button on the home page to the sales page to the channel page, to the whenever, or you can just start the journey on, hits the sales page, sales page, and then he does the eyes on the journey, which are like basically page level journeys, where it's on that page, you'd say, okay, and it's all eyes, impressions, it's like not eyes, you know, know you told me this, and I was trying to remember what it was, too.\n00:13:48 - Tina Marie (profitdriversinc.com)\nYeah.\n00:13:49 - Dan’s iPhone (danddcompany.com)\nImpression. Yeah.\n00:13:50 - Tina Marie (profitdriversinc.com)\nI can't remember.\n00:13:51 - Dan’s iPhone (danddcompany.com)\nProbably. Impression's introduced, impressive, investigated, initiated, precious is just the page level. Loading introduced would be seeing the author, potentially, or seeing the object, depending on what page you're looking at, interested as you saying, hey, they are interested if they do, that's like, that would be like a compounding or like a, know, like compounded action of, hey, they saw this thing and they stayed there for 10 seconds. So I know they like read it or whatever. And then investigated would be whatever else, right? So it's, they show to show you what to do, but it's that you're looking at different things depending on the goal of page, right? So he said something interesting in the last thing, how like, we've used the home page as like, let me say, it's like home page felt that way, that landing pages, that the home page is basically\n00:15:00 - Tina Marie (profitdriversinc.com)\njust should be redirected as the primary landing page or something like that.\n00:15:04 - Dan’s iPhone (danddcompany.com)\nso he does. There's other stuff he called there called POD. It's like, that's how you measure behaviors, right? So the journeys are measuring behaviors, not necessarily so the behavior of scrolling, the behavior of pausing, the behavior of clicking the button. And then you're taking actions based on the behaviors and the story, like we call it all the story. What the user is doing is a story. So then he's like, you use POD to measure behavior, so when you're looking at a page, you're like, what's the purpose of the page, right? it's POD, the homepage, the homepage is basically like a directory. Excuse me. And meaning that it's just paths to somewhere else. So it's a path to the sales page. It's a path to learn about us. It's a path to that data. So it's stuff like that.\n00:16:16 - Tina Marie (profitdriversinc.com)\nOkay, I'll pass. So what does POD mean?\n00:16:20 - Dan’s iPhone (danddcompany.com)\nyou know? The often could be opt in. The offer could be click the spot and offer could be an offer. It's like because the offers are like the ask. What are you asking them to do on this page?\n00:16:49 - Tina Marie (profitdriversinc.com)\nYeah. Okay. So, just so that I have it in perspective. What when do you think you'd get to the point where you might want to meet with when and just riff?\n00:17:08 - Dan’s iPhone (danddcompany.com)\nSo I got to get through the GTM thing because I think the GTM is where I'm going to be like do We have a bunch of it but it's like It's been looking at the outline of It's It might actually be the new the morning man, it's technically made like variables for keys so it might be three or four courses But some of these are like super short. They're like And they have it but I have a feeling the GTM. The GTM one looks long, but then the second GTM one looks short And he said something else that I didn't I don't even remember what it's called, but he was talking about like there's this in other advanced It's the thing that you can do with injecting data into Google Analytics 4. And to me, it sounded like that's where, that's where I would inject new customers. But I have to clarify that. But it definitely, and he's like, not everyone will use this. I'm like, mm-hmm, that means that's probably it. And there is no way for GA4 to know what's in the customer. So you would definitely have to know. But could you inject that as an event? I'm not sure. I'm way bigger than you Oh, what's in there? The metric guys, I was asking them, how do you know? What are you using that tells you that? Because whatever they're using is correct. And it's in WOOM. So I'm like, tell me what that is. So then I can use it. Probably. Well, they're probably probably back in just never looking at what know with this.\n00:19:06 - Tina Marie (profitdriversinc.com)\nOkay, um, how's Frank doing?\n00:19:12 - Dan’s iPhone (danddcompany.com)\nSo we met with Frank right early on Wednesday.\n00:19:16 - Tina Marie (profitdriversinc.com)\nIt's 6 a.m. Ew.\n00:19:19 - Dan’s iPhone (danddcompany.com)\nUh, I don't Frank was the only one on camera. It's just funny. We'll be able to turn him again. Frank is very nice. Frank is very professional.\n00:19:30 - Tina Marie (profitdriversinc.com)\nFrank is very knowledgeable.\n00:19:32 - Dan’s iPhone (danddcompany.com)\nIs Frank very Frank? He's a little verbose. They got him going on like security and he just went off. He was just talking. was kind of funny because they were like, what security plug-in can be used to secure WordPress? And he's like, none. They none of them are good. They're all go do it. They none of them are good. He's like, I could tell you that I'm not going to, but he's like, I could rattle off. the names of plugins that if you're a dead but knows what they're doing, you wouldn't touch those plugins in a potential poll. So I was like, interesting, he's like, plus, they just got into the nerd bits of it. was like, you're you're talking about the application layer of protection. That's not going to help you. This is how you secure WordPress site. He's like, up, up, up. And they like to explain it really quick, but he's sent over some stuff. He's like, this is all you need to do. You don't need WordPress. You don't need all these other things. They don't work. They just slow your site down and they don't really set the purpose. I was like, oh, interesting. But now besides that, besides what you went off on a tangent, definitely knows the stuff and just laid out like this plan that I was like, okay, and it's like the future, legitimately, like he's saying, hey, this is how you set up git repos. This is how you manage a multi-set. a WordPress development, I'll say agency, right? Because that's to who runs agency, like, at the next level. , I've never heard of other people doing it. But when he started saying it, I was like, oh, you can do that. You can use Git like that. You can really? OK. And then the then he was like, all right, this is I'm going to have a question for two weeks, or your March and March in the next two weeks. Set up this Git stuff like this, set up this like that, go into the theme code and do this. I mean, his big thing was like, these are not big problems. What I'm seeing right now is not big problems. Are there big problems hiding somewhere else? Maybe, maybe not. We're going to find out what he's like, we're going to knock these things out as they come up. So he's like, do this stuff and then build the wolf recite on version 2.0. which is already done, which I wasn't sure about it. So I didn't say it on the call, but I'm like, I think that's already done. So those guys are gonna go set up all the other Git stuff. They, now with what he showed them, like they can catch the theme and then push it into the staging environment where Wolfor is. So they'll be able to do that. So they'll be able to go in and like fix the couple, two, things, practice the 11. Maybe fix all 11 things. And then when Frank comes back, he's got access to all that stuff. So he's like, I'll review it when I come back. And then he's also like set up a Git work. So there's two projects, theme and plug-in. And he's like, I think we could put more stuff in the theme like this. And these are the reasons why. it's like, I'm out and hot to me. Eric is like, has a man crush because he's like dude.\n00:22:56 - Tina Marie (profitdriversinc.com)\nOh my God. He's so great.\n00:22:57 - Dan’s iPhone (danddcompany.com)\nNot a Canadian one year. Yeah, the other two dudes love him too. They're like, oh my god, this guy's so great, like he knows it. But he really knows his , like, and I'm listening to it going, wow, he's legitimately setting us up to be full blown scalable on the back end. That's all I heard. I was like, oh, OK, got it. And then he started pointing. He pointed out another thing, which I need to be to buy it. So he was like, have you heard of Pat Flynn?\n00:23:28 - Tina Marie (profitdriversinc.com)\nI'm like, I know Pat Flynn.\n00:23:29 - Dan’s iPhone (danddcompany.com)\nI know what I'm do. He goes, go look at Pat Flynn's site. It's built on this thing called rock theme. It's like rock themes built by so-and-so. Rock theme, or it's not called rock theme. It's called rock bass. I think it's called rock bass. Something like that, I don't remember. Anyway, rock theme, rock bass, whatever it is. He's like, go look at that theme. And he's like, that guy built STI on that theme. And then now he's these come to go to die for creators. But what he recognized is like what you guys are talking about doing is on like a whole other level. And I said, oh, right. And he's like, so I just want to see if I got this straight. Like, you're not, you're not going now in like designing websites for people. I said, Nope, this is it like the blocks of the blocks of the blocks will have layouts that to die. And then they give us their design system. But my argument is that you are too caught up with the website. You're too caught up in all this stuff. And like, we're going to give them all these things that they should have, plus all the support. And he was like, this is, I want to point he's like, you guys are going to make a ton of money. He's like, this is going to make a ton of money. And maybe not, he's like, so you're going to go after like, YouTube creators, Instagram creator. I'm not necessarily going after anyone, but we are definitely going out to podcasts and then lo and rock bass of whatever it's called. One of their examples is that there are themes for processors. The problem of course is it's just the theme. Right at the end of the day, you're buying the game and then you have to have someone build it and someone maintain it. It's like, we're getting rid of that. It's no more Bible theme. So that's the second theme he's turned me on to. That's very similar to what we're doing from the theme perspective. But theirs doesn't do like landing pages and all that stuff, which is just stuff that I know makes a difference. Oh, and then Mercer actually had something and was like, well, here we go. He was showing how, like, all our landing pages said LP. he's like, oh, yeah, my thank you pages always had T Y as the director. I was like, oh, my God, why have I never done I do L.P. I do these other ones. I should do T.Y. sure, yeah, you could segment your it could be L.P.T.Y, right? So it's always has used landing pages for your thank you and then just add another T.Y. So it could be T.Y. And whatever, you can have a descriptive room for the so you could see it in Google and alerts and be like, Oh, it's my 30 day challenge. Thank you, you know, I'm this other thing.\n00:26:31 - Tina Marie (profitdriversinc.com)\nI was like, why have I never thought about that?\n00:26:34 - Dan’s iPhone (danddcompany.com)\nHe does this little trick where he just creates a variable called reference. So he just calls it question mark or question mark are equals. And he uses that for navigation elements. So he builds two maps, which I do do, but you can never really tell which means which and you're not supposed to use in trying to use your hands. So he's Like, no, you just pull it, ref, navel, ref, na be. Was like, oh, you sneaky, oh, yeah, that's how you do it. Cause then you can start to look at, okay, the journey from the footer, is there a footer journey? Does it work at all? was compared to the journey from the primary CTA button on the homepage, which is ref, you know, one, or whatever, we'll say, oh, okay, that's interesting. So, and I can definitely see with his stuff how the analytics layer of what, again, the basis can offer, which basis can offer, because basis controls everything. So yeah, are you gonna have a T Y page? Yup, that's the only way you're gonna get them, right? They're always gonna exist like that. So then the container and all the stuff becomes reusable. Then he has to go like what he's teaching people is, he's teaching age. So every time they walk into a project, it's like you're starting over in a lot of respects. But here it would just be this duplicatable thing that we just go over and over and again. So you build something for Joe, let's say, and maybe you have a, maybe you have a GPM container, then you have another container that's the podcasting container. So you launch your primary container and then you meld in the podcasting container into that. And that's how you launch a GPM bird, a podcast client. And then all the events are there, and then you're just plugging in, I mean, you're gonna have to plug into URLs, you can do all the changes that don't mean. You might have to plug in and maybe if you have these descriptive things, maybe you don't do them. So, yeah, see you in the matrix.\n00:28:57 - Tina Marie (profitdriversinc.com)\nSo did you say he's going on vacation for two weeks?\n00:29:02 - Dan’s iPhone (danddcompany.com)\nFrank is yeah, okay, so he met with us right before he left and he's like here's what you're going to do And then we're I'm gonna come back in two weeks. like you have all this one two weeks and then he was like Early as he's like I want the wolf or so launched He's like by October at the latest it's not sooner and It will definitely be sooner and he's like and then on the heels of that build the first podcast like and that he's like that He's gonna be down by no no later than November Has anyone else besides you Try to drive a due date of let's get this done by this time No, because something that's created not not like an internal task as a part\n00:30:00 - Tina Marie (profitdriversinc.com)\nYou know, like, like I've heard Eric say, but I really feel like it's been in response to Bobby, like, when would this be done?\n00:30:07 - Dan’s iPhone (danddcompany.com)\nBut not somebody who's like a driver of a department been not in not for dead because it's been outside, right? So Norio. Yeah, Norio does. Norio's like, Hey, this is the deadline for like, he building this software, right? Which is done now, and it's released. So he finished the perfect wedding timeline software, and it's it's with Abish, I can do Jay and they're banging on it right now, and they're climbing issues and things that they would change or ever. Right? there's a running task list of stuff that's getting compiled in some tomorrow. So Norio would set internal deadlines for code, but no one out, right? they were and they were for him. So no, it was no one like. I think the only right I think the only good thing about it is the fact that he was he he won thousand percent and get it like oh god this dude completely gets the vision he's showing me other sites that are very similar to it right so the you know the the vision of go the sort of the vision of basis of being like this WordPress has to it it grows from you have this theme in plugin I mean they are literally base the base of basis are those two things without those which has been the problem this entire time like this code isn't ready now all of a sudden you have someone that comes in and goes oh You're trying to do this and it gives me two examples and I'm like, yes, that is exactly what I'm trying to do and they're both block based and The difference is that our blocks are different But everything else about it is the same, right? So he's like you need a relief. mean, this was him talking. He's like you need a Commercial remedy releaseable thing like this needs to be treated as if you were selling it to the public. I'm yes Exactly, right. He's like, okay, great. Yeah, that's what we're gonna do Sounds great And then he's like I'll code some if you want me to code old code. You don't want me to code. I won't code He's like, I'd like to code because I think it'll be faster and those guys you're like, no, you can code So and then I think here's the interesting thing is that Even though the code the code just doesn't work right, right? So it's not that like the idea was bad. It's not the execution, right? My whole thing on the online execution, it's failing on execution, which was Munir. And so now Frank's coming in going, yeah, no, I can fix that. I'm not going to fix it. I can print it into this thing where you guys are maintaining this code. was your code. And it's your repository, right? So which is not what we were getting with Munir at all. But Munir, it was like, we were just getting, well, not when we were getting, we just got, here's the code. And then those guys are like, how are we going to maintain this like that? We don't. So it was a problem. I didn't first see really because I wasn't really thinking of those terms because I'm thinking about just be the damn things that work for me. And now this is going to be all of that and more because then he was like, when you start showing and talking about how to use get to maintain, and how to use get on a site that's already built. I was like, whoa, wait, what? you can do what and I go and then light bulbs are going off in my head and I'm like oh okay so he's like yeah someone takes them a site not a problem you get you've got a rollback because you're gonna do this oh oh okay I never okay yeah no I've never heard of this never heard of any all the agency owners I've ever known all nothing I've never seen anybody talk like this and but he's he's we're buying his experience right and then here's where the universe comes into that this is I'll send you the pic so that quote book that I have I'll send you the quote and the quote from this week is about basically buying access to people to leverage the knowledge that they already got before you and I'm like this is literally what just happened I like I just struck the old with this dude Grant and I had to like go through when we were to get there, but the interesting thing about it is, I know if you remember this, Norio's like, dude, when your code's great, which he never says, the problem is so we have great code, just a bad partner, although he's never meant to be a partner. Now you've got this other guy that's like sort of this mentor that is bringing even more to the table, he's not just fixing the code, he's bringing in a whole system for maintaining it and moving forward and making it scalable, I'm like, okay, this is like, this is like the best of both worlds, and I don't think it'll take that long to do it all, because Abishay and DJ don't have anything else to work on, because we just finished all the other ninja updates like a month ago, so it's like, okay, I'll hit up right now as Frank being on the vacation and he's European, as he pointed out, we don't work else somewhere else, you know, we're well aware, Frank.\n00:36:04 - Tina Marie (profitdriversinc.com)\nYeah, I'm probably happier, too.\n00:36:07 - Dan’s iPhone (danddcompany.com)\nYeah. And so Eric is like revitalized. Abishakar, so Norio's not involved, which is fine, but this guy made an interesting point. He was like, do you have someone that can review the code? He's like, if I'm checking today and Eric are writing the code, you can't commit your code until someone else looks at it. I was like, oh, that's interesting. So I go, yeah, we do. Norio. All right. I want to implement a code review system. And he sent over this whole email. I can see nobody sent over a post meeting and was like, God damn. And it was like, this is how it's going to work. And I read that was like, oh, so this is the system that you hire a new coder down the road and bring them in. They just come into this system. They can never commit code, and therefore your code can never get corrupted, which is what's happening with the gear, we think, but we don't really know. So we'll see, we'll see, sounds great, whatever your quote was, I don't remember what it was, but it's the same concept as multipliers.\n00:37:24 - Tina Marie (profitdriversinc.com)\nAnd just basically leveraging the knowledge and skill around you, but also the additional layer then is leveraging them as a leader and a driver. So not just their skill, but not just their knowledge, but then also making them a leader in their realm. And again, setting due dates and saying, this is what I want you to accomplish while I'm gone on vacation, like that's leader type effort.\n00:38:00 - Dan’s iPhone (danddcompany.com)\nYeah. And he's not sticking around. mean, might, but he's available too. And it wasn't expensive. The real boom was me finding him in the first place. Yeah. So, but I'm, I'm good at that.\n00:38:18 - Tina Marie (profitdriversinc.com)\nI'm good at You are.\n00:38:19 - Dan’s iPhone (danddcompany.com)\nYeah. So I'm like, okay. And then I realized, you know, the exact same thing is happening with this. The following were flowy dudes, right? Found those dudes. And I was like, okay, and they're really good coders. then as I was setting that stuff up for them today, I was like, man, I can talk. And of course, this is my psychic mess or whatever kicking in. But I was like, I just have this vision. I'm like, those guys are going to be around forever. Because the people that are good that I work with, they always stick around forever. So like, oh, that's going to happen with them. They're going to, they're going to get it. taste of what's going on. And then they're going to want to stick around because it's just the vibe.\n00:39:07 - Tina Marie (profitdriversinc.com)\nYeah. I agree. That's my experience too. And that's you for sure. I've watched that. But it'll be interesting to see how it happens. And also just the fact that he sees its potential while he's not being a jaded person though. It's easy for somebody to go to make so much money with this. But he has something to ground him to give him a more realistic perspective of what exists in the marketplace as well as how the marketplace has evolved. What it takes to evolve in the market.\n00:39:51 - Dan’s iPhone (danddcompany.com)\nYou when he said that, it was completely aside. It was like in the middle of a sentence. He wasn't pointing it out. But... You know hearing you say that it's also like what he didn't do. I haven't thought about this What? While he pointed out like oh look at this thing and look at this thing And then he talked about like hosting like you got to make sure you have the right house So he's like I want to check out your host He didn't know who they were and he's like I have these guys and they're good for these reasons He's like you need a relationship with your house. We're and I go Derek was like dude. We got that We are so dialed in with this company. He's like alright, cool So I'm gonna go check him out. gonna figure out some stuff and he said already sent that over But what he never said was Hey, there's already somebody doing this Right, so he's never seen it which and I'm right Yep, but the reason you never seen is because it This is what it takes But he also he got it because he was like you got to have the right host for this like, yes, you do. Yeah, I I think eventually, and it's like, did they know what you're doing? I'm like, they do. But I'm gonna bring them up to speed for sure when it's closer.\n00:41:13 - Tina Marie (profitdriversinc.com)\nBut yeah, I'm excited to see, I mean, you know, that whole coach is really excited. But yeah. Okay, so we were talking about, hold on a second. And so I don't know if we actually ever did do it. I don't remember doing it. I remember talking about it. So end of cutie review, the market share was talking about goals for the end of the year. That was for ninja. I guess we're kind of getting them for basis now, basically. Where are you at with woofer.\n00:41:58 - Dan’s iPhone (danddcompany.com)\nI just, it's so funny to back. That was the site, right, he gets it. All right, that's the site we're gonna get back on. And I did love that he was like, we just gotta do it. You know, yup. It's like, even if it's ugly, even if it's kind of broken, that's how we're gonna get to make it not ugly and not broken. So I'm like, all right, I just want this sales page to go live. I probably really want my life. Um, so I still want to get it live. Nobody works on that site. Nobody, not me, nobody just runs. Yeah. So it's like, there's no skin off my nose in any way. The only issue right now is that we are kind of dealing with this brain tree issue with them now, sort of. But like, I was on the call, they're done. Well, we were on the call on Monday. I listened to into a couple of Joe's podcasts I'm walking to work a lot. I listened to two of his podcasts. One was Don Canell, who is this YouTuber who's got like three million subscribers. So he says some interesting stuff, right? And the thing that I took away from it was, I mean, I've always believed that YouTube can be like this sort of the B channel, right? It's like you're wasting your time on Instagram and all that stuff, right? Like, yeah, that's like this influencer play, whatever. But getting inside of Jamie's thing, I was like, damn dude, like all your leads are coming from YouTube, all of them, like 80, 20. And it's free. Those are free. But it's not free because you put up content, right? So he was talking about how he has 15 year old videos that still it's like that is sick. So it's like, all right, design your content so that it's evergreen or as evergreen as possible. And then make good, and he was like, make good content, put it out there, and then don't get caught up in the reels and the stories and whatever. Like, this is like your content library's YouTube. Make that sort of the cornerstone of your of your stuff. was like, okay, that makes sense. So then I started thinking about Wolfer and I was like, okay, I think we mapped out like a few videos for all men steps. I'm like, Jamie should make like a nine steps video or make it, maybe make it a series. are the nine steps to put in your wedding. And then in those nine steps, there's three sub videos, right? On the budget, you have like a potential video for every budget range that we track. So we track 25,000. So I brought this up on the call and then I was like, I think there's other things you could do that are forever like things, right? So what are the, and I always preface it with like, I don't know about winning, but I've seen them in the questions. I want to be safe. I'm going to restically. I'm going to princessy. So you can take the popular feelings and I know some are trendy, but some aren't, right? Some are classics, are beach, never goes away. Beach is beach. is go like, whatever. Her response was, in essence.\n00:45:55 - Tina Marie (profitdriversinc.com)\nThat's a lot of work.\n00:45:56 - Dan’s iPhone (danddcompany.com)\nI was like, Oh,\n00:46:00 - Tina Marie (profitdriversinc.com)\nMy God, she just she's done.\n00:46:03 - Dan’s iPhone (danddcompany.com)\nShe's tapped out. He just doesn't want to work. So I'm like, this is never going to work, right? The only way it works. It's never going to work. It's never going to work. So I'm like, it's only going to be what it is. I've now got this software. All I need to do is get them to give me this domain and train domains with the get that domain, launch the software. That'll make like a couple thousand bucks a month. Then I can start to figure out like how to sell that to more brides outside of theirs, through my seating planner, angle, whatever. They get none of that money. That's it. It's like, and then switch them to 600 bucks a month on basis all the day. And then Heather is like, I got to eventually switch into basis. It's never going to make enough money for me to stay. around and like the capacity of like oh yeah let's all meet on the phone once a week. But when our software is done it's being tested so it could probably launch in September. So it's like okay well then we kick those other guys to the curb and having Jamie just like hey yeah we're working with a different vendor. I said and then we run that in the background and then it's not a huge focus but it starts making money on day one and then it's like oh okay I can just poke around in the background because I don't have to ask anyone.\n00:47:38 - Tina Marie (profitdriversinc.com)\nHey can I generate a each of this?\n00:47:40 - Dan’s iPhone (danddcompany.com)\nRight. Hey can I put google in looks for on this and make it do that to me. And then switch them to bases because that's it you should be on it like it is sort of running your whole business. And then I told Heather I'm like you should just treat it like Like an annuity and if you want to pay Bobby to do your Same page meetings on the side. I'm sure you'd take the money to get you got done on the phone to guys for an hour every three months But it's going nowhere. It's going approximately nowhere Yeah, and the big reason is that Heather up right the whole Because it's Jamie's brand Like at the end of the day wolf or in code Heather owns nothing of that I'm you're building someone else's brand like that was a mistake and Then Heather wants to go do this venues YouTube thing and I was like that's I mean I get it, but no Not a good idea Plus I'm like why even why like you're just inviting her vitriol like go into a totally separate area like just whatever. Also, you've now proven that this area is not very profitable. Yeah, um, and a generation tax hit them up yesterday. Their customers hate them. Generation tax workers hate them? Oh, yeah, they hate them. And they're getting, they got like bombarded for, I don't know, couldn't have been coordinated, but they just got a slew of bad reviews from customers and then they reached out to all the wedding planners that can usually be reviewed for us. And the wedding planners are doing it, and it's totally against the law. They're like soliciting reviews from non-customers and to juice up their Google reviews. they sent an email to Heather and was like, hey, can you guys go and read more of the new files? And I was like, oh, so there's to make it renew was not the reasons we thought. Like there's probably, there's little, little trouble in fact good old GT.\n00:50:11 - Tina Marie (profitdriversinc.com)\nGT, oh, oh, minute. OK, so Wolf for then is basically going to be, well, so it kind of almost sounds like It's going to be reset you. OK, so a partner that you don't talk to a lot that may or may not make money.\n00:50:34 - Dan’s iPhone (danddcompany.com)\nBut not a partner at all. OK, on to the basis. Yeah, so then why would you go in and get them more leads if you're not a partner on getting paid for it? I'm not.\n00:50:46 - Tina Marie (profitdriversinc.com)\nIt won't be. OK, because you did say you won't hand it if I go put Google Analytics on it or go to the software.\n00:50:54 - Dan’s iPhone (danddcompany.com)\nYeah, that's for perfect wedding time on which I own.\n00:50:58 - Tina Marie (profitdriversinc.com)\nOK, got it. Because they'll both of those parts were kind of meshed together, okay? It's its own business, right?\n00:51:12 - Dan’s iPhone (danddcompany.com)\nIt's Dan's business, or no, it will be, yeah So I just got to get Jamie to relinquish that domain, right? which I mean she may or may not do it now. What's funny is I don't know if you remember this, but The psychic that I went to said there's a woman that I can't trust and it's gonna happen this fall and to make sure that That you can't trust her and just make sure that you do things So they're like ununarguable Legally when I was like, yeah, no worries, and I didn't know what she was talking about, but then I realized two days ago. Oh, she's talking about Jamie this, which means not trustworthy. No, not at all.\n00:52:06 - Tina Marie (profitdriversinc.com)\nHe's, I don't like to talk about the other interesting thing. word I imagine is snake, just like slippery.\n00:52:14 - Dan’s iPhone (danddcompany.com)\nJust, yeah, just and then deluding, right?\n00:52:18 - Tina Marie (profitdriversinc.com)\ndeluding or something else. serving on obtuse and yes. All of those, which just makes.\n00:52:25 - Dan’s iPhone (danddcompany.com)\nNow what I thought was interesting was, she told me that at the time and then in the, in the in between was when I figured out, oh, I have something that she wants.\n00:52:36 - Tina Marie (profitdriversinc.com)\nYou just don't know what that was.\n00:52:38 - Dan’s iPhone (danddcompany.com)\nI was thinking about it, but I forgot the domain.\n00:52:42 - Tina Marie (profitdriversinc.com)\nLovely. Oh, yeah.\n00:52:44 - Dan’s iPhone (danddcompany.com)\nSo she doesn't know I have that. So, and the psychic, I didn't, I didn't, I didn't add it, but I didn't. Now, like, oh, that's my chip. That's my chip to get in with her. Okay, you should go get I can also see her not doing it.\n00:53:04 - Tina Marie (profitdriversinc.com)\nYeah, I could see here. What's up? You should also go get hello lovely humans.com because that's not open, but that's how she greets them just in case she happens to be clever enough.\n00:53:16 - Dan’s iPhone (danddcompany.com)\nGrown.\n00:53:17 - Tina Marie (profitdriversinc.com)\nI mean, I need to buy.\n00:53:19 - Dan’s iPhone (danddcompany.com)\nI've done by another gentleman.\n00:53:20 - Tina Marie (profitdriversinc.com)\nSo I'm gonna go to go down to him by that too.\n00:53:22 - Dan’s iPhone (danddcompany.com)\nYes.\n00:53:23 - Tina Marie (profitdriversinc.com)\nHello, lovely humans and greetings, lovely humans, whatever, like if you get every tangent of it, every everything that's what's attached. What's the word?\n00:53:34 - Dan’s iPhone (danddcompany.com)\nVery.\n00:53:35 - Tina Marie (profitdriversinc.com)\nNo, but that too adjacent. Like lovely human adjacent hello, whatever, but but yeah, variants with variables. Yeah. Also. You can get perfect wedding timeline app dot com or dot app also.\n00:54:28 - Dan’s iPhone (danddcompany.com)\nI don't know that the name matters, right? They don't have that. There hasn't been that much brand established.\n00:54:35 - Tina Marie (profitdriversinc.com)\nwhat I'm saying though is if you did that you could you could just dominate with keywords and start to just tell you it's going to be pointless for you to use it because I'm going to dominate it anyway but I'll trade you.\n00:54:49 - Dan’s iPhone (danddcompany.com)\nYeah or I just be like oh we're changing the name. Yeah right that could be the play is like oh yeah.\n00:54:57 - Tina Marie (profitdriversinc.com)\npeaceful wedding timeline.\n00:55:00 - Dan’s iPhone (danddcompany.com)\nRight, it could be all kinds of things.\n00:55:02 - Tina Marie (profitdriversinc.com)\nTotally. wedding. Yeah, anyway, just brainstorm all of those different things for this offer a peaceful wedding planner. I wonder if that's, thank you. Nope, it's not peaceful wedding planner. Dude, that's a domain. Whether it's for the wedding planner or the app or whatever, that domain. Somebody's just nice that. Because that's the thing, right? That they, the people were saying that they wanted the most is they wanted to have peace. Yeah, they didn't want to be stressed out. Yeah.\n00:55:50 - Dan’s iPhone (danddcompany.com)\nOr if they wanted to be relaxed, not relaxed. wanted to be stressed. wasn't the words that they wanted It wasn't dressed as not the worthy of opposite. They were even like the outcome, not the whatever.\n00:56:10 - Tina Marie (profitdriversinc.com)\nWinning planar.com is also available. It's probably that's probably taken. Yeah, but anyway. Anyway, there's a lot of different things too. She really doesn't have anything. You can definitely get that going. Plus with having do you know I figured out for the first time why Prince started going by the artist formerly known as Prince? Yeah. Yeah. For 10 years and then it went out and that's why he started going by Prince again.\n00:56:59 - Dan’s iPhone (danddcompany.com)\nI was like, holy crap. That was.\n00:57:00 - Tina Marie (profitdriversinc.com)\nbrilliant and yeah he's dead yeah he was ahead of the curve on all that stuff well but he was teaching people he was trying to teach people so like yeah and i'm a mid-level conspiracy theorist like i just there's certain stuff that's just i mean evil is evil and it exists and it definitely likes to be sneaky and you know there's that i don't think everything is a conspiracy and there's just some crazy things that people think but yeah killing people who tell you how to take your power from people that make their living off of using power over others like the music industry you know how we would think like that definitely you know anyway okay so now is there a timeline for jody in terms of like getting his side on there the new theme Okay, so just try to do they shut down the brain tree account like a week ago. So we lost that. What? Why?\n00:58:17 - Dan’s iPhone (danddcompany.com)\nSo brain tree, we're having like, we have to get off a brain tree. Period. Like it's, we just came and stay on there anymore. So let's get all the sites off and look. Oh, it's everything except another single one. Like, no way to be able to get off of there. But that there knock on wood is not happening there. Somehow, some way our server is like going to be on some sort of hackers or whatever. I don't know what, but they, they are directly accessing the API keys. So it's not us. It's either in the plug-in or it's somehow an exposure of the. plug-in? It's got to be. It's got to be exposed in the plug-in panel. The plug-in developers and for entry have zero interest in fixing this or figuring out what's going on. And they keep blaming us. They keep saying, oh no, it's you. like, no, dude, it's not us. There's nothing in WooCommerce. They are hitting you directly when they're running 4,000, 40,000 verifications on stolen credit cards. And then they're like, you guys are bumping up front. I'm like, it's not us. They are not going through the site. So then that happened. And the thing is, when they're doing these verification attacks, I guess, you'd call them or whatever, we don't know. So there's no activity on the site. Therefore, how would we know? There's nothing going through WooCommerce at all. user, no zero, And Braintree isn't like, hey, P.S. It's two-fold. All right, you guys a little- little concerned about a verification every second. Like, aren't shouldn't you be picking up on this as odd for yourselves? Like, not us? Nope, apparently not. And there's no notification like, oh, there's a bunch of happening on your account. So all that happens is they hit us up and go, we suspend- we suspend your account for fraudulent activity.\n01:00:28 - Tina Marie (profitdriversinc.com)\nWhat are you talking about?\n01:00:29 - Dan’s iPhone (danddcompany.com)\nThen we go in and go, yeah, we go in and go, and then they're like, no, it's not us. And then the plug-in developers know it's not us.\n01:00:39 - Tina Marie (profitdriversinc.com)\nI'm like, oh my god, it is you.\n01:00:42 - Dan’s iPhone (danddcompany.com)\nSo they shut down Jody's account and they're like, it's too risky. Okay. And then they held all the money. They're gonna hold it for 180 days. And then they shut down another account. And every account's gonna get like, every account. So one of them is strong nerds now and we have, I you not. It's been at least two weeks. It's a joke at this point. We cannot log into the account, right? And we have a ticket going with them and we're like, hey, I can't log in. And they're like, okay, well, you've got IP restrictions. like, okay, that sounds great. But we didn't turn those on. Well, we can't help you. Ab-a-shek, the user ab-a-shek, has access. He has to log in. has to log in. getting this error. I it's a verification error. It's not like wrong password, it's something else. We literally go around and around with them. like, oh yeah, now we can't help you. We need, we need Dan to program.gov. After then go back in, set up Google to use pro go again. Email them. Okay, can you get do whatever held you need to do for out of the shack. Meanwhile, this is literally taking place over at least two weeks. Today, they write back. Okay, Abhishek, I sent your password reset, you should be able to reset your password. like, dude, we do not have a pet like, we cannot log into the account. We have the password. We have everything. It doesn't work. And Abhishek, who is very nice, sent this email to me, like, I do not understand why you cannot understand the problem. Just throw insane. And then I'm trying to get into another account. And they're like, are you trying to access this account? like, no, I'm trying to access this one. Oh, that's it. Oh, I'm like, I still can't get in. And so I'm getting the same exact error, like invalid, something or other. guys, you clearly have something turned on. It's not letting us get in. But now, with you, you got to choose us.\n01:03:04 - Tina Marie (profitdriversinc.com)\nHow the corporate and corporate is, just.\n01:03:06 - Dan’s iPhone (danddcompany.com)\nOh, it's like, yeah, outsourced support.\n01:03:09 - Tina Marie (profitdriversinc.com)\nLike, don't know what they're doing. Yeah.\n01:03:12 - Dan’s iPhone (danddcompany.com)\nSo I hooked up Jodi to a new payment gateway, and I'm waiting to see if it works. I'm like, waiting to see if it gets hacked. at this point, I'm like, it's right. But I'm like, I don't know what's gonna happen.\n01:03:24 - Tina Marie (profitdriversinc.com)\nUm, so another 71, any updates on it at all?\n01:03:34 - Dan’s iPhone (danddcompany.com)\nUh, as far as I'm just. Just anything else last week? Oh, yeah. No, just same old thing. Well, like, we had like an air quote, like dip in sales, but there's still a lot. Um, but we think that was related to. There's still no real score release. Like, there was this weird deadline that we didn't have bad sales. But then, like, on the call on Monday, right, so last week sales, I'm like, I don't know, it was like a July 4th hangover, but they were like off, but not till now. Then Sunday was like 40 sales, by 8 a.m. Monday, it was 20 sales, I'm like, this is clear, we're just not in normal world, and we're not going to be until 2020, so they're come 25, and that's just the reality. Okay, and so, just, and then, today's meeting was supposed to be about launching the two products, but that got pushed to next Thursday, but those should go live, like, during this peak season, and when does that end? Uh, basically November is what we were looking at by.\n01:05:05 - Tina Marie (profitdriversinc.com)\nI'm just holding off until you get a little more in through the Google Analytics stuff.\n01:05:12 - Dan’s iPhone (danddcompany.com)\nOkay, so like yesterday to give an example, 53 new subscriptions.\n01:05:16 - Tina Marie (profitdriversinc.com)\nWow.\n01:05:18 - Dan’s iPhone (danddcompany.com)\nNo, I'm a reason.\n01:05:22 - Tina Marie (profitdriversinc.com)\nHow many new customers?\n01:05:26 - Dan’s iPhone (danddcompany.com)\n20 yesterday, and then 28 on Monday, 28 on Monday, well, okay, and up somewhere on point.\n01:05:48 - Tina Marie (profitdriversinc.com)\nThe average is 31.\n01:05:53 - Dan’s iPhone (danddcompany.com)\n31 new subscriptions, yeah, so the new so the new customer numbers, 21. The new subscription numbers, the way to grow the business is new customers. That's my whole goal.\n01:06:13 - Tina Marie (profitdriversinc.com)\nRight, so definitely priority focused on really having the best understanding that we can have of all the data so we figure out what's possible in terms of that increase.\n01:06:36 - Dan’s iPhone (danddcompany.com)\nAnd then my other argument to these guys in the term, they keep confusing it. But when I say like, hey, our peak is 49 year, whatever, 40, 60, 40, Every time I say it, they're like, well, we're at 46 right now. No. You guys are adding another send me one image together. And I get that because that is the true number of extra subscribers right now I don't count these another 71 hanger-ons at all So the number I'm talking about is when we log into metric and look at just Ninja That number is gonna go to 4060 and then we're done right now. It's a 37 18 So it's got you know 400 300 We're 140 or so to go which should be another 55 days.\n01:07:32 - Tina Marie (profitdriversinc.com)\nAnd what is that number again?\n01:07:35 - Dan’s iPhone (danddcompany.com)\nSo it's total active subscribers that is possible based on the current metrics That's okay. Yeah, that's our glass ceiling as it were and Again, what I told them is that we're gonna go over it because we're gonna have to set sort of sales cycle into late October Right, so we could go over it But once we get there and then it's gonna then how or around that forever, right? Until something breaks or something changes.\n01:08:08 - Tina Marie (profitdriversinc.com)\nIt's to be interesting. So in terms of just kind of basis, plotting it out through the end of the year, and potentially also having the team conversation of where Eric's going, I feel like that just fluctuates so much, what are you, any thoughts about that? Any specific kind of getting clearer?\n01:08:38 - Dan’s iPhone (danddcompany.com)\nWell, I got sort of screwed by Jeff. So we brought in the old bookkeeper Stacy. Stacy Kay. So Stacy Kay is like, hey, I'm doing the books. going to be done. then I hit her up on sometime last week. And I'm like, hey, are you done? He goes, yeah. Except then I went and looked at 2022, and she's like, dude, it's a total show. Like, I don't know who had worked on this, they did not know QuickBooks. And now she has to go do 2022. And I think Jeff talks to me today and said she's doing 2021. So the reality is, and this is what I'm saying, yeah, I'm doing 2021. How bad are these? Wow. Granted, I don't know how to look at QuickBooks from that purview, or that sort of language, remember? So she's going to go do those, but that's holding up my entire conversation with the founders, dudes, because they're like, dude, your books are a show. Let us know when they're better. That guy's on vacation all month of July. And I thought when I, I thought these other years were good. So I thought when Stacy got back to me, I would just hit up my contact over at founders, like what reports do you want me to run? Again, like which ones do you need to see and now I can't do that. I can't I'm trying to wait till she's down and she said You know what she said, but it was not It was not soon not like super soon That's us I mean But it wasn't gonna be a fast thing anyway, and it's I know but that 1000% Influences the conversations that I can't have conversations Yeah around this idea that I don't know that this idea is we're like I need for these guys to come out. Yeah Tell me. Yeah. Yeah, is oh, yeah.\n01:10:43 - Tina Marie (profitdriversinc.com)\nWe see the path.\n01:10:44 - Dan’s iPhone (danddcompany.com)\nis ten acts like right everything looks good And I think that is what they're gonna say. just me. I just don't I Don't believe it. I'm not gonna believe until I hear it And yeah Yeah\n01:11:00 - Tina Marie (profitdriversinc.com)\nOkay. Oh, so, but the question was about basis and just kind of teen airing things like that.\n01:11:09 - Dan’s iPhone (danddcompany.com)\nRight. So it's like the conversation I wanted to have with those guys by the end of the year was, Hey, I'm selling ninja.\n01:11:17 - Tina Marie (profitdriversinc.com)\nOkay. Now I see the correlation.\n01:11:20 - Dan’s iPhone (danddcompany.com)\nGot it. Got it. but like I literally think about it every day, every day. I'm like, Oh God, I really wish, like just listening to Eric, like with Frank or whatever, how much he's into it. And I was like, I guess that's not your skill set. But this, you know, you have to go through this thing to get to this outcome. And I'm like, okay, that's why I saw and listen to him. I go, Oh, okay. I'm thinking in the context of basis. Like, Oh, okay. So this is now going to set that up so that you could have this back and to maintain the sites. Pop up. Okay. We've got teamwork and Abishik and Vijay, I'm then like Bobby's interestingly, even though he and I have not had this conversation. I told you this on Monday, he was like, we need, we need to like start looking at customer servers for basis. And I was like, yeah, we do. Uh, can I tell you this? No. Oh, so this is what was so crazy.\n01:12:22 - Tina Marie (profitdriversinc.com)\nSo the second psychic, I told you about her.\n01:12:26 - Dan’s iPhone (danddcompany.com)\nI was on the horn with her, she said that my aunt was coming through. That was like the operator of the phone. And she's like, she just keeps talking about customer service. She wants you to know that you need to focus on customer service. And I was like, Oh, And I was like, yeah, that makes sense. And she's like, it's really important. She thinks it's really important. And I'm like, all right, I was talking to Abish, I could do J like they've been working on stuff. blend. And they're like, we need to sort of nail down, like, what is the process of bup-p-bud? It's like, it's a customer service thing. And I was like, I can't believe you just said that. it's like, why? I'm like, well, I'm about to blow your mind. And I told them, and he's like, are you serious? And I'm 100% serious. So according to my aunt, you're right. We should be focusing on customer service. And then lo and behold, Frank is basically in this customer service zone, like, oh, yeah, that is a part of the customer service they don't see. But it's like, okay, interesting.\n01:13:36 - Tina Marie (profitdriversinc.com)\nSo when Bobby was bringing that up, was he talking about from a technical aspect?\n01:13:41 - Dan’s iPhone (danddcompany.com)\nYeah. So like, the process we're using desk, the process for what stuff are we not? So what happened was, and it was just, it's because there wasn't process in place. wish I could VJ did a bunch of work for Glenn that they shouldn't have done without charging Glenn. And I was like, no, you shouldn't charge him for that. Because Glenn, Glenn, you know, they're Glenn's dumb. so he was like, oh, can you just take this and use it as the basis for this other thing? Because we're going to launch this new offer with an influencer, little bit of translation. Can you build a whole new funnel? Which is what it was like, I, when they showed me, I was like, yeah, dude, no, no, it's not bad.\n01:14:26 - Tina Marie (profitdriversinc.com)\nYeah, there's no just use this for that.\n01:14:29 - Dan’s iPhone (danddcompany.com)\nLike, yeah, I know I say legos a lot, but it's like you're building a new building with the legos. So they spent 10 hours building, making this little change for Glenn. was like, no, you should have totally charged him for that. And it was beyond even the most basic things. They had to go in the lead flowy. I was like, yeah, no, you shouldn't have done that. But whatever, it's too late now. So we need to map that stuff out.\n01:14:57 - Tina Marie (profitdriversinc.com)\nYeah, you need to scope of support. document yeah totally and it's like it's supposed to be we have definitely talked about this past but we've never really had we have like Isaac Isaac just sends in website updates we have dealer he just sends in like simple little things and then you have Glenn who's like building a new funnel for my new offer he's he's doing like a new offer a week it's hilarious I don't think any of them are working though it was an app maybe it wasn't it wasn't scribe I feel like it was something else I guess it could have been scribe it was SOP's let me go back to that hold on basically yeah it's an AI S.O.P. Creator. So I think it just records what you do and then does that. But if you guys just got on a call and basically said here's all the things that we can do, here's the things that we want to, if we do this, here's the limits to it, this is what we would use, this is how we would track it, this is how we would build it like all of that and that gets recorded and transcripted, whether you just run that transcription through chat dbt or anything or even like opus. So there's clips internally for the team to go to or fathom, fathom will have the same thing because it tracks clips. But yeah, so that you could get it documented and then just go verify that it got captured correctly and that you're happy with what was captured. Then, you know, you've got something that people can refer to You know, if they go ask a question, do we do this or whatever? be like, did you check the document? Because we've already talked about it. Because that's one of the biggest issues is stupid stuff that's already been answered. You answered the same question multiple times, so you don't have to do that. But also, so there's just clarity for that moving forward. And especially if you're going to use basis, start selling it and just expanding it in any kind of way, then getting those processes documented as thoroughly as possible. It's always one of the worst things. Like, it just doesn't happen because it's so tedious. But with AI stuff right now, there's no reason not to do that. And the value of it should prevent a lot of rework, which I know you hate. Yeah, stupid questions and, you know, having things to be built. And it also makes it easy for, like, customer contracts and scope of stuff. support, right? Here's what you get. Here's what you don't get. Here's what you'll be charged. But using AI to just join a conversation and basically pull most of that stuff out. And then you go look at it and go, oh yeah, but we're missing this. And no, actually, here's the caveat to this particular thing. I just, anyway, that's something I think that you should incorporate as well.\n01:18:25 - Dan’s iPhone (danddcompany.com)\nYeah, and I mean, they just, the problem is that, like, they, and this is, like, sort of, obviously could be, Jay, probably actually did know better, but they're not going to push back. They're just like, oh, you know, they're entering a page. So it was really Bobby not understanding like, oh, didn't, this isn't like an update, right? Like he's asking for a funnel. Uh, and they just took it at face value and then started communicating with them, but it really should have been like more. from, hey, this isn't, what's included, granted, we covered this years. What's included is like basics and updates. That's it. That's what's included, landing page design included, not alone, having this.\n01:19:13 - Tina Marie (profitdriversinc.com)\nThis was like, create a new product and do this and what's on phone. then the other thing would be like, if they don't push back and they don't want to push back, so either the document empowers them to push back and say, here's the order page, if you want to go get this, right, you have to put in a request or something, but a chain of command, maybe that they go, okay, so and so just ask for this through a support ticket. How do I respond? Which that type of thing should be, here's a canned response for you ordered something outside of the scope. Here is the order page for all the cart stuff. If you have a custom request, here's the custom request form, which gets submitted to somebody who's got the authority and the knowledge and the pricing to put that together, which I already know you have a price list. then they go and reference that if it's not on the price list, it's not on the menu, the answer is no, that type of thing.\n01:20:09 - Dan’s iPhone (danddcompany.com)\nYeah, and there is like the custom, right? It's like, well, custom is, yeah, it has to be quoted. And then it would be like, basic funnel, and then you'd sort of define what the basis funnel is, and have the price on it, landing page, and every price. Because even if it's like, even if it's one of our, and when all this stuff works, which again, I really believe it's going to work, and thanks to the man, it's like the funnel would be already, it would be a funnel that is canned in essence, right? it's like, okay, would all the work that they did, like building a page was because we're not on the right setup. So it wouldn't have been 10 hours, but it still would have been a funnel. then you want that funnel to be, in my view, 40% profitable. So it's like, whatever the price is, then we're increasing to 40%.\n01:21:00 - Tina Marie (profitdriversinc.com)\nPeriod. And then you could like even have a calculator to, or have those pre-calculated, I guess, would mean.\n01:21:08 - Dan’s iPhone (danddcompany.com)\nOr, yeah, like you're saying, like, hey, whenever you come up with quote, then put 40% quote. Yeah. Or maybe more.\n01:21:14 - Tina Marie (profitdriversinc.com)\nSo what I will do to help kind of move this conversation forward is go ahead and use my Fathom Notes AI, make a little summary, send it off to you and Bobby and just be like, hey, Bobby, Dan said that you were thinking about this. We talked about a little bit, here's just kind of some thoughts I had to add to the mix. The next thing that we need to do is have a due date for creating the process first iteration, or maybe this would be a second iteration, because we kind of have a support desk, whatever. basically, just to make sure that it's getting captured as a task or a rock, and that it's moving according to the process that we have for keeping track of stuff and keeping it, you know, keeping. I it's definitely a ways off, but totally. I mean, even if it's like earmarked as a Q1 goal or something like that, I just, it's just, we know how easy it is for stuff to kind of fall off the radar. We think it, but then something else comes up and so like, you know, not working.\n01:22:26 - Dan’s iPhone (danddcompany.com)\nAnd then all of a sudden we forget every other. Oh, I mean, you should say that. No. No. Mercer had a thing.\n01:22:34 - Tina Marie (profitdriversinc.com)\nwas like, son of a . Wait a minute. To tell you when the car's not working? Yes.\n01:22:40 - Dan’s iPhone (danddcompany.com)\nAnd I was like, what? Sorry. And it's, and it's not like a third party thing. It's, it's an event. So he had a thing. I was like, I didn't know what you think you couldn't do it. You can't do it now.\n01:22:51 - Tina Marie (profitdriversinc.com)\nOkay.\n01:22:53 - Dan’s iPhone (danddcompany.com)\nYou can essentially listen for an error on a sales page. And then if you are dashboard is. up in a way that you're seeing whatever, so they had set it up for someone, could they switched parts off? Here it was. And they're like, our sales tanked, and they had no idea. And that's another one of his things, like, hey, if you're not tracking this, no. was something great, you don't even know where to look. So they had set up this thing where I think it was actually an infusion, so I'll check out. But when the error code appears and whatever that did is, right? They just were listening for that dip. Hey, that dip shows up. That means an error fired. And sure enough, this one error was happening over and over again when they figured it out. Oh, it's discovered cards weren't working on the checkout.\n01:23:41 - Tina Marie (profitdriversinc.com)\nIt's like, what?\n01:23:43 - Dan’s iPhone (danddcompany.com)\nYeah. And I was like, but that is the solution. So there's, there's, thank you for saying it by the way. That's like the perfect example of like a total nugget I got from by watching all of it, right? had I not watched every damn video. I wouldn't have seen that one. Because it was just some random thing he threw out. It wasn't like a focus at all.\n01:24:03 - Tina Marie (profitdriversinc.com)\nI was like, oh, what? that is why when there's a good book, even if I've gotten a great nugget that I can use, if it's pretty well written or pretty intelligent, I'll go ahead and read the whole book, because those nuggets, you don't know how to get to them unless you've actually read the whole thing. Right. Also, a lot of times, those are the nuggets that make the whole thing worth it, holy crap. Because if you, now I know it wasn't available until GA4, right, but if it had happened again, the amount of time that it cost you money and the amount of money that it cost you, this, I mean, would have paid for it many times over to have had the solution. And yeah, so that's awesome. But anyway, things like that pull us off track and then we get back to the things that are really like the framework and foundation stuff that needs to be done, but they got neglected because we're in fire, I'll be mowed and putting out the fires. yeah, so anyway, but helps that, but not everything. I think we're, I think we're doing a really good job of it, but sometimes there are probably other things that should be in there that aren't.\n01:25:22 - Dan’s iPhone (danddcompany.com)\nYeah, and it's like, what's funny is one of the sites parts was broken and nobody knew I'm told. And it's like twofold because we don't have any of this Mercer eyes on the journey tracking crap. So it's like, you don't even know where to look. And then if, if, if, if this stuff had been set up, there would have been some early warning, which makes me wonder, can you send and go look this up? Can you send an email based off of something really, really big.\n01:25:57 - Tina Marie (profitdriversinc.com)\nThere's gotta be, even if it's a zap, there's gotta be. But what I love, though, is that I feel like, and we've talked about it at the beginning of the year, but this year is really about refinement and optimization and clarity, it's just, it's like this whole year was a giant knob and the dial and we just keep dialing in, dialing in, dialing in, um, which is good and necessary. All of that, and I spent an hour and a half.\n01:26:33 - Dan’s iPhone (danddcompany.com)\nHow does that happen?\n01:26:34 - Tina Marie (profitdriversinc.com)\nI know.\n01:26:35 - Dan’s iPhone (danddcompany.com)\nI know.\n01:26:37 - Tina Marie (profitdriversinc.com)\nProbably should go. Okay, well, take care of yourself. You're doing good. Yeah.\n01:26:43 - Dan’s iPhone (danddcompany.com)\nSounds good. am. Yeah. I'm going get it because that was the first thing that I was going to ask you about, and it was because of the the mark conversation.\n01:26:58 - Tina Marie (profitdriversinc.com)\nUm, but I didn't ask. about it and I should just pay more attention to those thoughts and act on their own. I'm usually good at acting on them but sometimes I think no it's why that wasn't that big of a deal but anyway if I'm thinking about it and you're thinking about it then you definitely should do it.\n01:27:16 - Dan’s iPhone (danddcompany.com)\nYeah I was and I was well then I moved our cleaners to today so it kind of which works way better for me because I'm like three days is a weird day I always do calls so the cleanest first day was today then I forgot I booked a dentist appointment months ago so I like crap I gotta go to the dentist but it was perfect so I'm like this day is already blown because it's Thursday and that meeting got canceled so I won't get anything done today other than calls and organizes and doing random stuff. Now Wednesdays are totally free never gonna have the cleaners again and then I was doing the breathing at the end of the day on Wednesdays like in the office by myself because no one ever goes in on Wednesdays. All right. Restructure.\n01:28:04 - Tina Marie (profitdriversinc.com)\nOh, next ones that you're going to do breathing?\n01:28:06 - Dan’s iPhone (danddcompany.com)\nI'll probably do it before then. I would do it right now, but I'm afraid someone will come home and they'll 1000% interrupt me.\n01:28:16 - Tina Marie (profitdriversinc.com)\nYeah.\n01:28:18 - Dan’s iPhone (danddcompany.com)\nAre you going to commit to doing it weekly? Yeah, I just want to do it weekly and then finish it up and then I'll probably just go right through it again. And then the other thing is, I don't think I told you this, but like the medium channel of her girl. Like she channels somebody. That's the other thing that she does. Like she channels this person or this whatever. I don't know what you call it. Molly was like, so she sent me some recordings and I listened to it and like her voice changes and stuff. And this is weird. Molly's like, just keep listening to them. And she's like, I'm trying to write an update. weirdest things are going to start happening to you.\" I was like, really? And I go, what is that all about? And she said, I've been in front of her when she does it. She's like, all I can tell you is that like, it's like, she becomes a different person. Her eyes change. I was like, mmm, You don't about that. But I'm listening.\n01:29:23 - Tina Marie (profitdriversinc.com)\nguess I'll listen. Yeah. There's, uh, there's stuff I want to share with you, but I forgot I supposed to talk to my sister after this call.\n01:29:31 - Dan’s iPhone (danddcompany.com)\nNo, no, no. I gotta, I gotta answer this call, do this.\n01:29:34 - Tina Marie (profitdriversinc.com)\ndo your breathing.\n","contentPreview":"00:00:00 - Tina Marie (profitdriversinc.com)\nHello. What's that?\n00:00:04 - Dan’s iPhone (danddcompany.com)\nI said, what's up?\n00:00:06 - Tina Marie (profitdriversinc.com)\nWhat's up? My kids always sa...","processedAt":"2025-05-04T03:40:52.609Z"}