{"fileName":"Done Transcript for D&D Co & Profit Drivers - Weekly Review(4).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for D&D Co & Profit Drivers - Weekly Review(4).txt","type":"transcript","priority":"medium","content":"00:00:07 - Tina Marie (profitdriversinc.com)\nHello, how are you?\n00:00:12 - Dan Ryan (3)\nCleaners day and up on the poetry of my various furry friends.\n00:00:17 - Tina Marie (profitdriversinc.com)\nI like it.\n00:00:21 - Dan Ryan (3)\nDoing calls, doing meetings, look out.\n00:00:26 - Tina Marie (profitdriversinc.com)\nIt's good, it's good. I got a full night's sleep and groceries just got delivered. My older daughter took my younger daughter to seminary and she's making dinner tonight. And there's a flipping spider on my ceiling. Hopefully I must go with this. A comment? I don't want to get it. I don't like spiders. But I am the only spider killer. I guess you get to live for a while. I don't feel like dealing with it.\n00:00:59 - Dan Ryan (3)\nI don't want to live.\n00:01:04 - Tina Marie (profitdriversinc.com)\nIt's, it's no spiders. Anyway, what, uh, was it a work call you had just now?\n00:01:12 - Dan Ryan (3)\nTwo, then I, uh, talked to developers at, uh, SOD at nine, and then I just had a meeting with Circle, because I was like, you know what, I'm going to look at these other community platforms, and I'm officially sold on Circle, Tina. It is.\n00:01:30 - Tina Marie (profitdriversinc.com)\nReally? Yeah. Taylor, well, to agree with you.\n00:01:35 - Dan Ryan (3)\nUh, okay. Uh, probably not for the reasons. I'm sure Taylor really didn't evaluate it and just copy Brandon Burshaw or something. Uh, I'm like talking to the guy like, okay, what if I want to send a, you know, I didn't, I was like, I have a CRM and what if I want to send people over from my CRM? So they're going to opt in. through this lead thing, and that's where I'm going to send them emails, and that's where I'm going to make offers and pitch ship and, right, because they don't really have massive email or whatever. mean, yeah, I don't think they even have it. And I go, and then I want to get them over and I want to tag them with the three things that I'm collecting in the form. He's like, yep, API, don't use apps. I go, okay, great, that could be that. And then I was like, all right, let's say I want to have a free level, and then I want to have different paid tiers. So let's have paid tier one is like a group coaching thing, or whatever, or, or it's one on one coaching, or let's say I want to do a cohort. So there's like a six week cohort. He's like, let me show you, opens up all these sites. He's like, you can do everything you just said. was like, God damn, really? It's like, okay, how do I generate the payment? it's like the payments here. You can make it. a month to month. So you can make it a full page, you can make it a month to month. You've got a link at the end. Okay, so I have that link. So if I'm on a sales call, for example, I can downsell to the page, that payment plan is ID up, and you just send in this link, I know it's in the link through the fee around, I go, okay, what if I want to, what if I want to take, I got this is further down the I go, if I want to take activity from, from circle and update my record in my CRM. So using mom as an example, I met with him and I talked about Ninja and mom. Not so much because I thought I would use it for Ninja, but he literally, the reason I said Brendan Bouchard is because he showed me Brendan's thing. So what they're releasing right now is a headless API, that you can take circle components and put it inside. Buddy balls, basically. So when he opened up Brendan's side, And was like, that's body boss. And he's like, it is? And he's yep. But he's like, well, that's what Brent. And he's like, I don't know who he's doing it for him. But he's like, they're doing it. So see, they had circles just iframed inside body boss, which looked good, as a matter of fact. And but now you can take components, like the feed component, and then have that in there. And your users are in body boss, but you're using circle. And I was like, he's like, so you don't have to pay millions of dollars to develop these widgets, because you can use ours. I'm like, oh, that's dope. I didn't know you could do that. He's like, it's not out. It's coming out like two weeks. He's like, you're just showing me because it sounds like you would get it. I definitely get it. So then Brendan's got someone doing it for him.\n00:04:47 - Tina Marie (profitdriversinc.com)\nlike, I'm pretty sure I can find out who did that.\n00:04:50 - Dan Ryan (3)\nAnd then go talk to them. So yeah, I'm like, man, this is high levels. They're never going to catch up. of this. Schools never going to catch up to this. Like, these guys are way, way further ahead.\n00:05:05 - Tina Marie (profitdriversinc.com)\nYeah, but I went and just got that snapshot yesterday.\n00:05:09 - Dan Ryan (3)\nThat's okay, because I do still think like you could do the sales calls.\n00:05:13 - Tina Marie (profitdriversinc.com)\nWait, you got what's natural? Community one that you showed me.\n00:05:18 - Dan Ryan (3)\nI think that can work. I do think that can work still, but for mom, because mom to me is going to be extremely complicated. So it's going to have, it's going to have all the things that I just said. You want a free tier, then you want a paid tier, then you want a government tier, then you want a dedicated error for fan flow users, then you want a dedicated area for people that are in. But we're, I don't know if this is going to be the name, but we have this continuous release strategy. So it'd be like, hey, no, you're going to pay to be in the continuous release strategy cohort. One, which starts in January, two starts in February 3 starts in March, and in that group, you are releasing a song every 8 to 12 weeks with whoever's in that 20-person cohort, whatever. So those would all need to be separate paid tiers and separate private groups. And I'm like, yeah, so at that level, I love them, right? I don't know. have no idea.\n00:06:26 - Tina Marie (profitdriversinc.com)\nI think you leave it out with the communities, because if you can't do that, then that would be a deal breaker for me too, because I want multiple tiers. And one thing that Circle can do that I don't know if you came across it, but it gives you stats of who's logged in and what information they've consumed.\n00:06:48 - Dan Ryan (3)\nYeah, you have to actually build some of that, he showed me that. Yeah. Interesting. The other thing that they have that is perfect for mom is spotify interest. I was like, oh, that's dope, and then they do mp3s, which we need, which high level doesn't support. So I was like, okay, but it's also like, you could do this headless thing and put it inside of high level. I was like, oh, that would be interesting. So you can still use high level and then just have circle inside of high level and he showed me another version of that. And it was just like the E card and he was saying, yeah, if you owe off, he kind of lost me. It was not super off on oh off, but he's like, imagine you just owe off your high level log in that you give them. It's the exact same log in for circles and they log in high level, they log in circle, they just don't know. It's like, yeah, that would be great. So yeah, but I'm not totally sold, but I was like, oh. of this headless API is super interesting.\n00:08:04 - Tina Marie (profitdriversinc.com)\nWhat is a headless API?\n00:08:08 - Dan Ryan (3)\nI mean, it's like you're not you're not using the wrapper, right? So you're not using the container of it of circle. So you're using the compound, you're getting access to the components. You can do with WordPress too. So it's like, it's super lightweight. There's not a lot of other code. It's just a thing. It's fairly new. I hadn't really ever heard. I'd heard of it for WordPress. I had not heard of it for like one of these standalone softwares that was surprisingly said that I was like, oh, okay. I did not see that coming.\n00:08:54 - Tina Marie (profitdriversinc.com)\nInteresting. Maybe. Oh,\n00:09:00 - Dan Ryan (3)\nBut I'm looking at it more for, because we've been talking to these dudes grooved for the bands. So then I was like, I don't like those guys. And there's no way they're going to catch up to any of these people's school. You know, whether it's school or circle or it might be networks. But these guys are starting out and they're not even called Pepsi Sprite. They're nothing. They're like Fanta. They're never going to. But they're trying to target just musicians. that's sort of the value problem. But tech wise, they're texting.\n00:09:43 - Tina Marie (profitdriversinc.com)\nWho's texting?\n00:09:45 - Dan Ryan (3)\nThey're called groups.\n00:09:50 - Tina Marie (profitdriversinc.com)\nI was like, wait, what is the group?\n00:09:53 - Dan Ryan (3)\nOkay, never run. Yeah, but it's the, it's those, I mean, props. It's those TikTok influencers. They're like, they got so much reach on TikTok. now they're like, oh, we do communities for all audiences. And they've gotten some of the biggest TikTokers to be on the platform. And they're, they're using that to attract other people. But the problem is the software itself stinks because it's a bunch of TikTokers developing software. Like, yeah, it's not good. It's not going to go well long term.\n00:10:29 - Tina Marie (profitdriversinc.com)\nI think the, um, man, it's always so complex. There's so many things that have to be measured. So like the speed of implementation. So school is super fast to implement. That's really, to me, the only draw about it. There's a lot of drawbacks, including analytics, you have to pay for every community, um, they don't integrate, the communities don't integrate with each other really well, where you could do that with like circle. I think Circle is pretty quick to integrate, but also has a lot of complex features that you could do and it doesn't have a native app, but it does have an app. So that's good. You don't know if it has a magic link, which I think is really good for people that don't want to use the app and just want to be able to go straight to their content without having to log in and remember a password because a lot of people don't use password managers and they don't have an efficient login process. Yeah. But what I'm looking at in this high level community is it is convoluted. That was my issue with high level to begin with is that it's convoluted. It's there's. It's not pointing click. You know what I mean? It's not intuitive. And then same with Buddy Boss was the same thing.\n00:11:51 - Dan Ryan (3)\nSo yeah, Buddy Boss is not intuitive at all.\n00:11:54 - Tina Marie (profitdriversinc.com)\nno, you've got to have somebody who knows exactly what they're doing. And that is.\n00:12:00 - Dan Ryan (3)\nNot super easy to come by thing Yeah, what you need is like well, I mean, I think you got right the snapshot for high level is gonna have Hey do this or it's gonna build a bunching for you You would need something like that force you would need something like that for circle too But there's no snapshots right it's gonna be Build and you'd need someone that like he took me in a community that was clearly a coach and then doing individual coaching so like You would have like a damn thing so when I log into circle as like Let's say I'm like so I'm your high ticket level right so it's like you log in I'm high ticket I get access to everything like the courses or all the logs for me, but then I also have a dedicated damn coaching in the area they call it a coaching, but it's not literally the coaching area. And then inside that you could have Dan, Mark, blah, blah, blah, but Mark can't see Dan and Dan can't see Mark. So all I see under coaching is Dan. And then it's a dedicated stream of Dan and Tina. I was like that's interesting not be group.\n00:13:23 - Tina Marie (profitdriversinc.com)\nHe goes, yeah.\n00:13:25 - Dan Ryan (3)\nOkay, I didn't see I didn't see that coming. I can say in the video, I asked him to send me the recording.\n00:13:33 - Tina Marie (profitdriversinc.com)\nIt's all it's interesting. So what are your priorities for the membership for mom?\n00:13:45 - Dan Ryan (3)\nSo I've already proven I can generate a lead for under two dollars. And then they I think like 80% of them opted to join the Facebook group. But now I'm like, okay, I can just force and I can ask them if they want to join the community, if they assent, yes, and I can automatically go create the record in wherever I can do it in high level, I can do it in a circle. So then I go automatically create that record. So I'm not just putting in everyone, I'm putting in all the people that say yes, and then I'm tagging them as whatever, yes. And then the people that say no, I'm tagging them as no to invite them later. And then you would deliver potentially deliver the thing through the group and through email. So they're opting in, think I did two of the things I did, royalty release checklist and I did, no, I'm sorry, did a royalties checklist and then a release checklist. So they could get the thing in the group, or they could get the thing in the email either way. then ultimately they're for each, now we're going to Fletcher, if each thing is actually tied to a course, then you could sell them the course and deliver the course inside wherever, wherever that can be used. Then you have a free community that's just a bunch of people that are in the independent music space. And then I'm tagging them based on the first things that they tell me and then you'd enrich that, we let them enrich that through their profile, right? So the only thing I really ask them on the way in is what are you? And they're either a producer, engineer, an artist, a band, where those options are. So you would immediately be able to identify someone who's a band, come on up on that, possibly genre, and then you'd give them the ability to, hey, this is my Spotify thing. Because part of me has been mutilating, I forget who did this back in the day. I think it might have been Justin or somebody else. But... it was like in the community, they would go juice people's Facebook posts, right? just put up this ad, can you guys go like it? And then a bunch of people would just go like the ad and back at that time, that was an indicator to push the ad further for Facebook. So it was like the community was participating in juicing other things within the community. So my version of it is like, you earn credits. So you can, if you do it, you get a credit. And then you can then, once you have that credit, that credit can be spent when it's time to promote your song. It's like, okay, you have 10 credits, so you can now get 10 clicks. Something like that. So when someone released this song, it's Spotify. It's like, hey, my song's out, Ghost Treatment. That's the signal to Spotify. People are interacting, it's Ghost Treatment, whatever else, whatever the things are. So, or you don't do that. It's just that. community is supporting, right? I came and released this out, and one go go support it.\n00:17:09 - Tina Marie (profitdriversinc.com)\nYeah, um, I don't know. They're so whatever. So, the circle has like gamification features in there. I think you're what you were talking about that they do actually.\n00:17:28 - Dan Ryan (3)\nBut they have, they have a bad game and stuff, but it's not game. It's not game. It's your, you decide. So you can build an automation in the background that hands out badges and stuff. It's not, it's not like built in. It's your user. So you could be like, completed the cohort completed the course that he showed me that those are these options. Automations that you build. There's nothing made of. That's like, oh yeah, we automatically have this game of occasion component. Hmm. Yeah.\n00:18:10 - Tina Marie (profitdriversinc.com)\nWell, but and I don't know all the different ways that you could do it, but the idea that you have where the community supports each other with those credits for like listening to songs, downloading songs, whatever. I don't know. But I don't know that I heard the answer for like, like, if you were going to rank, first of all, if you were going to list the features that you want and then rank them, but I guess it doesn't matter if you found a solution that does everything that you want, but in the search for things, if you hadn't found everything, I would be curious to know what were the things that you had been looking for.\n00:18:56 - Dan Ryan (3)\nSo, was it my list?\n00:18:58 - Tina Marie (profitdriversinc.com)\nit was Marx.\n00:19:00 - Dan Ryan (3)\nSo, Mark was always shooting down this or the other so like the last thing he sent was oh MP3 and then not sport it was like do beyond having a dream and like yeah, we do That's kind of a deal breaker for a music community because everyone's dealing in mp3 or mp4 so there's no music no music in bed and and then Circle also just happen on Spotify. was like oh, that's even better But not or not because when you're when you're in the pre-production phase Imagine you're in a group that's producing it while I'm working on a producing a song to be released You can only have mp3s of that while you're saying okay. Here's the first mix. It's gonna be an mp3 It's not it's not publicly available. You could put it on SoundCloud, but you probably don't want to It did have a SoundCloud integration too, which I was like god damn really but So yeah, Mark, it was that and it was he doesn't like when you put a video in, he wanted like a full full video post, I love Facebook and school doesn't do that, high level doesn't do that. So that was more of like just a UI sort of thing. School doesn't do it and high level is copying school, so therefore they don't do it. Circle doesn't. Mighty networks did it. Then as far as like, then there was just having the different, the pride of any sort of paywall, right, so I don't know school has a paywall. So having the free thing and then a paywall.\n00:20:53 - Tina Marie (profitdriversinc.com)\nSo yeah, I think I like this. It's one or the other. You can either have a free group or a paid group, but you cannot have two tiers.\n00:21:00 - Dan Ryan (3)\nOh, see, school, you can have like nine, you can have unlimited tears. You mean circle? Um, circle, yeah. Um, and then the main thing he doesn't like about high level is it's built around courses, as opposed to being courses is part of it. So it's not really community, it's courses plus community, and he wants community first, there might never be courses, right? So what if, especially if you're dealing with just a band, a band is never going to have a course ever. Right. So he's like, we tried to, he's actually building community and more on that, um, trying to see how it goes. But that was the main sticking point is that it's like, uh, he's like, no, that doesn't fit for a band. What is a band teaching someone?\n00:21:55 - Tina Marie (profitdriversinc.com)\nIt's like, no, you're right.\n00:21:57 - Dan Ryan (3)\nBut I was like, we could use this for mom. He could put our core like it totally fits for forces first teaching first community second, but the this scenario is completely flip-flop. It's community first forces second. like, okay, then it makes sense. I mean, I guess that's probably the best way to look at it is that. Yeah, it's it's it's need community forward, not forces forward. So I like I went through this dude.\n00:22:33 - Tina Marie (profitdriversinc.com)\nI took him through like ninja explain what ninja was.-hmm.\n00:22:37 - Dan Ryan (3)\nit was like the ninja falls apart with our MCQ product. He's like, yeah, no. like, you're you'd never be like, he's like, I'm not saying you can't you have developers probably could. But he's like, then that's when he showed me Brandon Bouchard's thing and I said, was like, that's buddy boss. I was like, oh, okay, that's kind of interesting. So we could head this. BPS circle into because I think buddy bosses community stuff stinks It's like oh This could be better And then we can do the stuff like you know, we log them into our MCQ software from within buddy boss They don't know that they left.\n00:23:18 - Tina Marie (profitdriversinc.com)\nHe's like, oh, never gonna be able to do that Yeah, For me and and and also why which I know you think is proactive avoidance, but for me, it's really it's it's tactical learning Because it's hard for me to comprehend the user experience without having the user experience and Trying to create a list of what are the features that matter most like I can think of some things for me The course is the most important thing but community is really important as well because Because if I can leverage the conversation of other people in the community to kind of create almost like a gravitational pull towards the content, because there's also other people there. but but then you don't even know until you've done it does that work or not, you know, yeah, and so it's all theoretical. And it's just, it's just thoughts upon thoughts upon thoughts until you do it and experience it. And that's the biggest thing is that I, um, whatever, I think if the list of the main things are there, then whatever else trade offs that you make, like, we know nothing's going to be perfect. But as long as the main features that you need are there and they're solid, then, you know, you don't have to move. But if you do move. I don't know, it's a whole nother thing. It's so hard just trying to build on something.\n00:25:07 - Dan Ryan (3)\nAnd also for you, you're like going top down. You might never get down, right? if you're currently at high ticket.\n00:25:15 - Tina Marie (profitdriversinc.com)\nExplain what you mean down.\n00:25:17 - Dan Ryan (3)\nRight, so the opposite would be free low ticket, mid ticket, high ticket, right? And you're at high ticket. So community is really more for the free, right?\n00:25:28 - Tina Marie (profitdriversinc.com)\nThat's where the community still is going Agreed.\n00:25:31 - Dan Ryan (3)\nSo if you had me and Mark and someone's in Quasimodo or whatever that guy's name is, like, if they were all...\n00:25:36 - Tina Marie (profitdriversinc.com)\nOh, wait, wait, who's Quasimodo? I don't know, but the doctor. Oh, Boogie. Boogie.\n00:25:44 - Dan Ryan (3)\nSo if like me and Mark, right? If you're trying clients, we're in a community.\n00:25:50 - Tina Marie (profitdriversinc.com)\nWe're not going to go in the community.\n00:25:53 - Dan Ryan (3)\nNo. No, I might go in there, I might go in there because there's something there for me, right? Right. You're like, hey, log in. I need you to log in and watch this video. Like we're going to talk about this next week. Yeah, I'm going to be in there for that. And so there, but there might be some discussion. I could see Mark, you know, Mark loves to talk, right? And me too, right? I might comment back to someone, right, in that context. we're not going to get in this back and forth discussion.\n00:26:21 - Tina Marie (profitdriversinc.com)\nNo, I wouldn't even have my high level clients would never be there. Because first of all, I'm not giving somebody access to all my people, right? And be like, hey, guess what? These are all the people for you to try to coach or something like that. I'm not really afraid of it. It's just kind of the thing that I have embedded in my mind because of the texture. But also, it's super high touch. Like why would I downgrade our interaction?\n00:26:45 - Dan Ryan (3)\nWell, I'm not saying it's to downgrade.\n00:26:47 - Tina Marie (profitdriversinc.com)\nSo my point was that you have those people.\n00:26:50 - Dan Ryan (3)\nAnd yeah, you could be like, hey, the stuff's here. And I would go do this thing, right? And then when you go down to the next level, and what is the next level? The next level is like course buyers. Even them, even them, whoever they are, it's not going to be super cheap, but it's still going to be whatever. And a lot of what your stuff teaches them is antithetical to wasting time in the community, right? It'd be like, you need to be in your business. So I don't see you ever going down to this tier where there's like, just community, right? Like, like, what's exactly what's going to happen to my mom? Mom's going to start. We're going to try and turn free people into customers.\n00:27:35 - Tina Marie (profitdriversinc.com)\nYou're not. No, I am. I am. And here's why, because it's more of a kind of give back type of thing. It's not about the logical approach to getting high level clients, although it does happen because I'm that person. And I've seen other people do it where they go buy the free thing, really high level people and just go like, oh, they know what they're talking about. But then they circumvent it. They don't go by the course or do anything else like that. They're like, hey, how do I hire you, that type of thing. But for me, it's the long term play, right? It's the ascension. It might take two, three, four, five years for somebody to get to, they become a high level client, but I've been teaching them the whole time. And it's also more of instead of having a blog where it's just one-sided and or instead of sending out emails, it's just a content home. It's a content medium source, and that, for me, is more about energy. It just feels like, right? It's not different. Email would work just as well. A blog could work just as well, Facebook just as well. It's just a preference of psychologically what it feels like to put it inside of something called a community. You know what I mean? Yeah. But then are you going to go like live once a week, teeny hours, like, so I'm not doing it by myself. I'm going to do this with Maria.\n00:29:10 - Dan Ryan (3)\nShe loves this. This is what I saw in one of groups like, so one of the groups that he showed me was for Alcatraz North, and I might have been with him, to be honest, and that I could see like, you know, their calendar or whatever, what I was going to get. Yeah. So I imagine they are doing that. They're saying, hey, get in on this on a time block freebie. And then, you know, then they're in the community and you go from there.\n00:29:39 - Tina Marie (profitdriversinc.com)\nYeah. Um, exactly that we, and I've been talking about it with her because, so she bounces all over the place.\n00:29:47 - Dan Ryan (3)\nThat's her biggest issue.\n00:29:48 - Tina Marie (profitdriversinc.com)\nI hardly noticed that about her. And my biggest issue is I don't want to be on video. I don't want to do all these things, but they're really good at drawing in people fast because you can connect. Now, I don't, it's not that I mind being on video so much, it's just, I don't want to talk to myself or talk to a camera. It's just so weird. And it's so, I'll have human conversations all day long. So I want to have somebody to talk to and do it with, and I want somebody else's brain that I can access frequently. And so, anyway, if we do it with, she needs all the conversation, wants to have all the conversations. And she does marketing, I do business operations, all the mental stuff. So it's a really good blend. And that's been a huge other part of reason why I haven't done this because I'm like, I don't want to do it by myself. I've never wanted to do it by myself. I do enjoy the community. do enjoy people. love teaching, answering questions. don't even mind having live conversations, but, and this is one of the other reasons why I wanted to be so inexpensive. said, I hate showing up. So I did group coaching where people paid a lot of money, but even they didn't show up the calls. Part of it was because I gave them so much work and and so much stuff to do that they didn't need to show up on the call. They knew what to do and they were doing it. So I need to vog you because somebody needs to show up and have questions. Somebody needs to show up and want to talk, otherwise there's no point in having the call. And it's just, you know, depressing to show up and be like, there's nobody here. Like, what am I doing?\n00:31:32 - Dan Ryan (3)\nYou know what I mean?\n00:31:32 - Tina Marie (profitdriversinc.com)\nSo if it's lower priced, you can have much more volume, but then it's also, if I'm doing a long-term strategy, I could be teaching hundreds or thousands of people how to, and I don't really care. But I write if I can help, then I'll help. And it's not like Glenn, I want to be in everybody's homes. I don't really care.\n00:31:52 - Dan Ryan (3)\nBut if I can help you, I want to help you.\n00:31:53 - Tina Marie (profitdriversinc.com)\nHe doesn't, but yes. But, um, so, you know, and the special actually this thing that I've been doing like spent all Saturday shooting videos, whatever, just just teaching this stuff. But if I can teach people the fundamentals, and it takes them a few years, but they become, you know, more sovereign, more independent, more self-reliant, all these things, then I'm really happy about it. And in the course of it, for sure, somebody's going to be like, hey, go hire this girl, whatever, because that's how my business has been from the beginning. Somebody said, hey, go hire her, or they saw post or whatever. So the secondary consequence will be somehow, even if I don't have a funnel built specifically for it, though I will, higher level clients will come. And I don't want a lot of them, I can't have a lot of them because it's a high level interaction for me, high level like, um, yeah, person type of thing. So anyway, I just want to be able to have enough of the simple thing, things that the people want and to fulfill them and but some of my brain goes into gamification and all these other things which do get better retention and engagement but I have to start from the beginning with just getting the content filled and all that stuff. For you though because there's so many complex things and because your angle is so tactical like for me I just need people to consume the stuff and then go do it. Yeah the other factor for me people who and created people are different beasts though like you really have to you have to make it tiny little pieces of actionable actionable actionable pieces that they go and do or there's no value for them because if they don't do it they're not publishing their content they're not making money they're not succeeding then they're not going to keep paying you and That's really important.\n00:34:02 - Dan Ryan (3)\nAnyway, sorry to go ahead. Yeah, no, the other factor that is in my mind is I'm looking at fan flow in mom strictly from an acquisition perspective. So I'm like, I need to think about, so when I sell this, what do I want to be selling people, right? So I look at, I'm like, okay, circle might be the right thing, because I can just say it's built on circle. So you don't, you don't write, oh yeah, here you go. And the same thing could happen with high level, right? So that was what my original thing was like, oh, it's built on high level. It's all in fan flow. But if their community thing is not going to cut it, then I can go, oh yeah, you're buying our white labels as here and you're buying our circle community here, not a Facebook community. So it's like, they're both assets, as opposed to, because my original plan was, hey, I'm going to build it in buddy boss, which I could still do with the buddy ball circle at this API, I I don't know. I think I would need to do it for that. So then I can remove that because that, to me, and I have the same thought in mind with another 71, like, that's sort of like, oh, yeah, no, you can't just take this over, right? I can't tell you how often the body of a sight breaks, right?\n00:35:19 - Tina Marie (profitdriversinc.com)\nLike the woo integration or whatever.\n00:35:22 - Dan Ryan (3)\nIf you remove, if I can remove some of that, which I can never remove from Ninja, like, we're too far into it. Actually, I guess I could think about it. If we've migrated all the subscriptions to Stripe, which could be done, you could, in theory, sell someone through woo, then populate them into a circle. I just don't know if I want do that. And it will never work without an Instagram. But for mom, I'm like, okay, I want these to be sellable assets that I can just hand over and not. Oh, yeah, no, you're gonna need some WordPress developers to maintain this community. it's not fun. I just want to be able to walk away. So that is a factor that is totally good in my mind when I'm looking at like, so I'm doing very much what you were just talking about earlier. It's like, I'm looking at like, I'm trying to look at the construction, like, how do I want this constructed for these like, what does Mark want features wise? What does Dan want acquisition wise? Those are sort of the two factors. Yeah, I have, I don't care what the functionality is from a community this aspect because I don't even go to the community that I own.\n00:36:37 - Tina Marie (profitdriversinc.com)\nRight.\n00:36:39 - Dan Ryan (3)\nAnd I won't go in this one.\n00:36:41 - Tina Marie (profitdriversinc.com)\nI do think I did like circle. There was something I didn't like about it that it didn't do, but I don't remember.\n00:36:54 - Dan Ryan (3)\nnot really an LRM at all, which I didn't think it was, but it definitely is not.\n00:37:00 - Tina Marie (profitdriversinc.com)\nL. R.\n00:37:01 - Dan Ryan (3)\nM. Learning relationship manager, right? So I don't know. We didn't really get into like building the course, but I think it's, I don't, I didn't see anything that was like learned dash or like, or like what it's, it's community forward. So it's community with courses, whereas I think school and high level because I was taking school is flippity flopped. It's courses with community, but I would say is the big difference. I can't even ask him that. He's my, he's my content, Jacob.\n00:37:39 - Tina Marie (profitdriversinc.com)\nYeah. um, that I'm trying to remember, but I feel like being giffic had a community that went with that as well.\n00:37:51 - Dan Ryan (3)\nYeah, I don't like them.\n00:37:57 - Tina Marie (profitdriversinc.com)\nI like you. Yeah. Well, uh, no, didn't like this one. Hmm. so yeah, just like if you could get a bullet point list just for clarity, right? So that you're just going off of the list of functionality features and ask Mark, what does he want, but also why do you want it and rank it like? And I also think that it's preemptive of any kind of issues that you probably will have with them down the road, which is, Oh, I don't like this. And I want to move or I want this or I want that kind of thing and just in that discussion be like, okay, so we can't have everything that we want, no matter what, we cannot make wave a magic wand. What are the most important things that need to happen? And really the feature should be as a request of what are the things that need to happen for the people we sell to, for our artists.\n00:39:01 - Dan Ryan (3)\nYeah, there's, yeah, for sure. Mark definitely is like, I've always imagined a lot of my bro.\n00:39:07 - Tina Marie (profitdriversinc.com)\nYeah, that would be cool, if.\n00:39:09 - Dan Ryan (3)\nYep. I'm like, dude, now, like, what, it's, you're going to give them what they need, right? They don't need that, so what do we need, not what would be cool? Right. Because he's always like, oh, yeah, if we could build the button, we could build them at it. Like, I mean, I still don't think he totally understands it like, you know, we would be nowhere right now. We weren't white, we didn't buy that over. If we had to build an app that did all the core function there, we'd be, we'd be nowhere though. In the, in the seven months we've been doing this, we'd be absolutely nowhere.\n00:39:50 - Tina Marie (profitdriversinc.com)\nYes.\n00:39:51 - Dan Ryan (3)\nRight. it's, you're, one of your favorites, it's like, we have to leverage these things, but you have to leverage them intelligently. That's our ties too. Sorry, what do you need right the intelligence comes in?\n00:40:04 - Tina Marie (profitdriversinc.com)\nWhat do you mean? Yes, that is going to be the the name that I decided that I'm going to use I love Dexter loves my freedom systems He's always like thought I should build around that and I think that I will but I think that might be like a free content source Later, whatever, but I'm gonna call it leverage systems because Leverage is first of all lots of people talking about it now, which is good Not necessarily in terms of like systems, but it's just a word because when you go to the site, right? You see the word I wanted to be a word that people are thinking of often They need to be thinking about it often and outside of business or People who are having that conversation. It's not something that comes up for the average person Period the average person is not leveraging anything not optimizing not leveraging and not system demonetizing. But those things are the path to freedom and less trust, no matter what you're talking about. House management, know, meal planning, health management, it doesn't matter what it is. It's getting the most out of the least. And those are the those are the ways to get it. But for Mark, one one like, so I have three questions that you could ask him that probably should be things that you repeat constantly. Every time he or Sean or anybody else starts to veer off tracks so that you can veer it like so you can get it back on track. For your artists, well, it's kind of four things. What are the most important things that need to happen for your artists? First one, why isn't that happening for them right now? You could talk about all the behaviors, right? But what isn't happening for them right now? Why is it not happening? And then how does your solution? make it happen for them. How does it change that? So there's, number one, that makes sure that you build the solution correctly and simply, but it also gives you all the selling points that you need because, um, and that kind of goes into like Jean Schwartz's level of awareness, right? So, is somebody coming to you that has no idea about what should happen for them? Or why? I just, I like creating music. That's all I know, right? And somebody else knows that it's because I don't know how to publish music often or I don't have a label or whatever. Like, so there's different levels of awareness all the way through. part of your path should be being able to ascend people from level zero to level. I think there's like eight levels of awareness seven, something like that. Yeah. But also known. at what level do the greatest amount of conversion happen? And at that level, what do they need to hear? But basically, what is the message for every level so that they get to the next level next level until they become a customer? And then making sure that whatever you have promised is what you can fulfill. So, I mean, that's all obvious, but a lot of times we don't approach it with that type of specificity. And I think that it would help the guys be able to do their parts best if they could think about it like that.\n00:43:45 - Dan Ryan (3)\nYeah, they don't think about it like that they think. I know. Especially Mark. Like Mark's just thinking.\n00:43:51 - Tina Marie (profitdriversinc.com)\nit's just an existential conversation, Sean. Tina? Yeah, exactly.\n00:43:58 - Dan Ryan (3)\nSo that's, I mean, that's where they They have these things and then they, I mean, this is a good thing about Mark now is like he has these things and he then he'll filter them through me and he'll go, I want to do this and I go, okay, and then ask some qualifying questions and go, okay, let me think about that one. me think about that. For example, yesterday, literally email text me, he goes, Dan, if you, if you had a hundred million dollars, and you needed to 10x, 10x it in five years, what type of business would you build? And I said, why would I want a hundred million dollars? And then he's like, oh, no, you have to, you have to use a hundred million dollars. I go, okay, no, I don't, I don't want a hundred million dollars. But I said, okay, well, so then you're, you're saying, how would I build a billion dollar company, right? I said, market's the same. It's the same point as an idea money execution, but now what you're telling me is money is not the problem. Money's taking care for real, like it totally didn't do. Okay, then that then execution, don't it up. Period. You've got a hundred million dollars you're responsible for. So then that leaves you an idea. So you're asking me what is a billion dollar idea that I could come up with and then scale 10x in five years. And then I went to the good old buddy chat GPT and started doing some research and I showed him. No company has done that in the last decade. That's a current billion dollar company. They did it in six. They did it in 12. The only one that actually did it was Instagram, which is an acquisition. And they did it in two years. And it was like, like, dude, you're talking about a sparkly unicorn among the unicorns. And then when I did this analysis, I said, if you look at these companies. Then the and look at the models the model would be a subscription based business Because you can alex that all a our honor right now ten eight, but I'm like What subscription based business would you would what I build like I don't know I? Don't know, but you could you'd have to figure it out. You know, can now go backwards from there and then I said I wouldn't I'm not interested in this. I'm not interested in these shekels Oh DC shackles right to me. It's like a prison.\n00:46:35 - Tina Marie (profitdriversinc.com)\nWhy would I take DC money? Oh, V.\n00:46:38 - Dan Ryan (3)\nC. thought you said Whatever it is I want what I want to do is This is the other thing about the community for this is I want to build a community and then crowds equity crowds I'm through the community community. So equity crowd fund this new way of being an independent musician from independent musicians, but then they're equity crowd funding into the label or whatever it is, whatever this upper level of mom is, it's more than a label. It's this label that has courses and software, and it has distribution money, and it has buying this idea of buying catalogs and revitalizing them, and then it has a label, and label services app side to it. So you have this multi faceted business that has six or seven revenue streams, but they're all related to one thing. It's like, well, that's what we should do. But you have to go build that community and we can build that community for $1 or $2 per person at a time, then go raise $1 million. Then you know, hey, if I had a million dollars and I plugged you into this, like, yeah, you give me a hundred million dollars and I'm plugging it into what, like, you'd have to go figure out that idea and then you cannot screw it up because you're responsible for a hundred million dollars. Like, it's ludicrous, to be totally honest, like, it's completely ludicrous. Why would you need to spend, and then I pointed out, okay, look at these, it was like 11 companies. Now, point out the one that spent a hundred million dollars. You can't because they didn't from, like, and then also I go, whoever this hundred million dollars, tell me the companies on this list that they have money invested in. I'll bet it's not because they've never done this. So they're asking you for an outcome that, hey, doesn't really exist just because you have a hundred million dollars, doesn't mean it's going to work. So it would all rest on the idea and I was like, yeah, no, dude, I'm not\n00:49:05 - Tina Marie (profitdriversinc.com)\nIt's that he's focused on a hundred million.\n00:49:08 - Dan Ryan (3)\nThat's exactly that's exactly like whatever percentage he and his mind who thinks he would get of a billion. I'm like dude that is such a again it's the grand slam bottom of the night. It's so it's so him.\n00:49:26 - Tina Marie (profitdriversinc.com)\nThe priority is the dollar sign without any parameters. No without any without any parameters right. So I mean you can make a lot of money selling your body.\n00:49:41 - Dan Ryan (3)\nYou can make a lot of money doing a lot of different things right.\n00:49:44 - Tina Marie (profitdriversinc.com)\nI have never even seen that last night. I just keep hearing it all time and I I only know a little bit. I'm extra tells me I'm naive a lot but I'll stay that way. That's okay. I mean, I've never thought of myself this night, but then a little bit sometimes, maybe anyway. But yeah, it's anyway, and that's where the questions come in all the time, and that it might be good for you to just have a few taint of questions stuck in your head that you always ask, like, at what cost and what's the trade off? Although, I think that what cost is something that you do bring up, but I don't think necessarily to all the people you talk with, because you're just like, you're being stupid.\n00:50:35 - Dan Ryan (3)\nI'm not even entertaining it, right? So I'm like, I'm focused on how do we get this MVP? How do we get this MVP done?\n00:50:43 - Tina Marie (profitdriversinc.com)\nMy point is, I think your life would be so much easier with just a few questions thrown out that just kind of stop people's brains from going down the track, which is they can't not, well, they can, they can ignore the question, but if you say okay we're not continuing the conversation until you answer the question at what cost because what they'll want to do is redirect and they'll ignore the question and they'll carry on which is a waste of time and energy. We're like okay well I'm gonna go do something else let me know when you want to answer the question at what cost you know what's the trade.\n00:51:18 - Dan Ryan (3)\nYeah yeah so here's the thing is that I think unfortunately this is it's like it's it's like a required thing with him because he is like this sales guy right he's sort of determined that before so he loves to go to meetings he says he doesn't but he loves it he loves to he loves to network right he like he was just backstage at like he was hanging out with the lead singer of God smack the other day they will like went to some show and that he was back backstage at some other show the other night and and then he you know I I know he just got off a call where about a hundred million came up and so he wants to jump all over it. So with that there's good and bad right so that that's a bad but I don't want to tell him like dude stop having these conversations because he should be doing it that is what he's good at that is his role and more often than not he there is a benefit from it right so when he was backstage at that first show now he reconnected with someone and that guy's got 300 bands and the guy's like I want to bring every one of my bands on evangelize what yeah and then he met the lead he reconnected with the lead singer of this band seven dust he was like kind of big in the 90s and they're like dude how do we get on fan flow so they're coming on and that that that's that was the connect it was their manager it was like I'll get there. demo, but I've got 300 other bands. And then he now he's going to meet with, I think this is through God's Mac dude, he's going to meet with Dottree and, uh, can't remember their name, this other breaking Benjamin. So like those guys might be start using fan flow. So it's like, okay. And the, all these meetings are in the context of music business. It's just that sometimes they're these loopy, this one. I was like, okay, you know what? He's, he's two for three this last week on these meetings. And like, all right, I guess, I guess it's an acceptable sort of form. I was actually telling Eric the day, like, we're so close. I feel like we need to be in the same room again. Like I did when I went out there before. And I was like, it's almost like we need to do a hackathon and like just, Let's be in the same room. there's just all this little crap floating around. And it's like, I feel like we just need to go to Boston and go there for like five days and just be like, in these five days, we're gonna get all this done. It's gonna get all cleaned up. So that all we're waiting for is Spotify approval and everything else is done. Like that's the only piece that's outside of our control, which it is, and then we could have everything else ready for the MDP. I mean, based on the meetings I had today, those guys are gonna build those two things. We've set to make sure the second piece, I'm not 100% sure, and I have to get a free trial there. So if I get a free trial, tell them to issue it on Monday, and then those guys will go figure that out. And then everything else should be done probably within this month, maybe in October. So I was like, I mean, we could go there in like October. We don't want to go there in November until then. And just bang it all out. It's like, okay, here's the hit list. Strong order sandwiches.\n00:55:05 - Tina Marie (profitdriversinc.com)\nLet's go.\n00:55:08 - Dan Ryan (3)\nAnd then be ready for like one Spotify, instead of the approval, and then we can start selling this thing.\n00:55:18 - Tina Marie (profitdriversinc.com)\nYeah. I just realized the time, I need to go. I'm just gonna have to ask next week.\n00:55:27 - Dan Ryan (3)\nOkay.\n00:55:29 - Tina Marie (profitdriversinc.com)\nWell, anyway, it's good. It's good. I feel like there's, I don't know, dialing in a little bit more. I could probably tuck your ear off for about another two hours, asking you questions about stuff that you're working on. Also, we'll not talk, but just ask both the things. Cause that does both the things. So wait, next week, I'm traveling, but not until Friday, I have my call. Yeah. I will bother you next week. I mean, help, I mean, be Tina. No. Enjoy your. perch time and your puppies. Oh wait, when does Abel and go to school?\n00:56:05 - Dan Ryan (3)\nDoes she go to school next week? Oh, Saturday. This Saturday? Yeah, we're gonna fly up here and Saturday. It's so whack. Like, so we fly up and Saturday again. And then this time we're gonna stay over because Abel's like, I guess she could stay over.\n00:56:21 - Tina Marie (profitdriversinc.com)\nguess she wants us to stay over.\n00:56:24 - Dan Ryan (3)\nSo then Denise is like, are we staying over? go, yeah, I got over time. We're staying over. Um, we're gonna fly up, drive, find out again. And then they sent a notification yesterday, this is the school, with like parents or drop off people, whatever it was. You have 15 minutes to move them in. I'm like, And then like, you have a 15 minute window, you have to leave, leave at the end of the 15. You cannot hang around. And your car needs to be out in that 15 minutes of the next group. I'm like, that's bizarre. That is bizarre. You have to move everything in in 15 minutes, not everything, the bulk of the stuff. you can reconnect with your student later and figure out what's missing or what's thing you're staying over.\n00:57:12 - Tina Marie (profitdriversinc.com)\nYeah, that's wild.\n00:57:15 - Dan Ryan (3)\nWe're going to go move her in for 15 minutes and then leave and then and then reconnect with her around dinner, I guess.\n00:57:22 - Tina Marie (profitdriversinc.com)\nWell, I'm glad you're saying that because that sounds like a lot of anxiety for a lot of kids. It's and family.\n00:57:30 - Dan Ryan (3)\ndon't remember what mine was like, but I don't remember there being a time limit.\n00:57:34 - Tina Marie (profitdriversinc.com)\nYeah, that's wild. All right, well, good luck dad and family this weekend and I will talk to you on Monday.\n00:57:45 - Dan Ryan (3)\nAll right,\n","contentPreview":"00:00:07 - Tina Marie (profitdriversinc.com)\nHello, how are you?\n00:00:12 - Dan Ryan (3)\nCleaners day and up on the poetry of my various furry friends.\n00:00:17 - Tina Marie (profitdriversinc.com)\nI l...","processedAt":"2025-05-04T03:40:52.602Z"}