{"fileName":"Done Transcript for Basis Integration_Sweet Law(9).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Basis Integration_Sweet Law(9).txt","type":"transcript","priority":"medium","content":"00:00:00 - mark sweet\nthat's okay interesting how people are deciding just yeah it's okay it's legal so the guy wasn't close to the kid so you shouldn't get anything it's like or last year that we've been talking do you feel like that could have come up at any point yeah normal stuff I can handle just yeah so are you able to practice law in Oregon no okay just checking because if and when you ever are then I can return referrals hopefully I mean I don't really want to hope that I know somebody in an accident but Smith applied to wave into it it's just easier for her to do that so I'll just wait on that yeah any that we had started something actually we go open my notes I just met Do you love him?\n00:01:03 - Tina Marie (profitdriversinc.com)\nYes. So much. Yeah. Uh, yes. The fact that he's like, do you want to meet her? I was like, yes. And she's just, yeah. Yeah. I've been smiling the whole time.\n00:01:17 - mark sweet\nYou're the best. They're great people. So, and you're going help them a lot because they're really smart people, they also are really good at following directions.\n00:01:26 - Tina Marie (profitdriversinc.com)\nThat's great. And also, food use, like, I'm really good at telling people, uh, doctored truth, meaning, like, if he was asked about whether he hit his goals or not, like, you know, dancing around the truth, basically, to make it look like he did.\n00:01:45 - mark sweet\nGot it.\n00:01:47 - Tina Marie (profitdriversinc.com)\nYes. So anyway, I'm excited about it. Barely scratched the surface. The beginning always takes so long, they get to know each other and know what's going on with that's good. Okay. So. Wait, are you giving me the weekly? What you call it? Where are they at? was looking at valiant valiant was showing up good. Yeah, they were better at the beginning of the month and towards the end I mean, that's kind of like helpful cousin that normally will the last several months even really slow in the beginning And so that kind of helps off stuff it. Hold on. Let me get these Hello, Dan I'm like five meetings deep and like so This is like I'm sweating from so many meetings. Okay, I'm not even moving I'm like good. Great. let's let's talk about leads and anything down related and then we can let you go.\n00:02:55 - Dan Ryan (danddcompany.com)\nHow's that? Oh, no, no, it's I'm in meeting mode.\n00:02:59 - Tina Marie (profitdriversinc.com)\nSo let's rock and roll This is why they're on Mondays. Yes, this is true. Okay, well, let's do that anyway. Oh, I'm at my desk. I'm getting the little pie and actually see things the right way.\n00:03:12 - mark sweet\nYou know, good way to get a negative review removed. I'm So can Washington people and we have an client who will respond and his only phone number is a business that they have to go find him.\n00:03:30 - Dan Ryan (danddcompany.com)\ndon't really. You asked people to go. Does he say anything mean or.\n00:03:36 - mark sweet\nIt's just one star. So it looks really bad. And there's only one review. So I'm asking teams to get people to leave reviews to kind of water it down. Well, my problem is what he says is factually inaccurate, but the attorney client privilege doesn't allow me to respond in a way that would make sense.\n00:03:59 - Dan Ryan (danddcompany.com)\nYeah, you got to get. You got to get people to go, like, so if you're logged in, like, I can go right now and say, like, remove this review because it's harassment and bullying, right? So, and they'll remove it.\n00:04:16 - mark sweet\nOkay. likely to see it removed.\n00:04:20 - Dan Ryan (danddcompany.com)\nYeah, I'll do right now.\n00:04:22 - mark sweet\nThank you.\n00:04:26 - Tina Marie (profitdriversinc.com)\nSo, um, why I don't know if I should just dive right into this. Yeah, let's, let's talk about other things first. Where the heck are my notes? Okay. Um, valiant. Any ability to talk to him and find out what's he doing?\n00:04:44 - mark sweet\nYeah, we're trying to set a time. He just puts you with the two kids.\n00:04:49 - Dan Ryan (danddcompany.com)\nYeah.\n00:04:56 - Tina Marie (profitdriversinc.com)\nYeah. Okay, um, what is the blue steel?\n00:05:15 - mark sweet\nThat's quantified. That's what we got from each unit. But that can't scale, unfortunately. So they added a little bit more volume, but not much.\n00:05:31 - Tina Marie (profitdriversinc.com)\nWe asked that questions more until I just memorize it. That's it. Is it me or is phobe picking up a little?\n00:05:45 - mark sweet\nNo, they're picking up a little bit because I got on their pretty hard. And then we took money away from Washington. So that might be part of reason why we've been more than money in other areas.\n00:06:08 - Tina Marie (profitdriversinc.com)\nYou and Missouri, you gave me that.\n00:06:12 - mark sweet\nThe two Missouri cases.\n00:06:14 - Tina Marie (profitdriversinc.com)\nYeah.\n00:06:20 - mark sweet\nOne, I think was Walker, I'm just going to share.\n00:06:23 - Tina Marie (profitdriversinc.com)\nOkay. Okay.\n00:06:35 - mark sweet\nYeah, one was Walker, the other one was.\n00:06:42 - Tina Marie (profitdriversinc.com)\nOh, here, Missouri. Wait a minute. Reports and takes my source. I see Missouri six Walker for. What is this period in June?\n00:07:00 - mark sweet\nBoth the walker cases.\n00:07:02 - Tina Marie (profitdriversinc.com)\nYeah. Um, so this is intake, not retainers. Okay. So hold on a second. Do I have retainers by source by state matters. That's it. Matters by state. Source status. New Mexico. Okay. Okay. me use screen. Go through this stuff. Share screen. Okay.\n00:07:39 - mark sweet\nTeaming tiny bit off. That's why I also send the email because there's. Or. Now it's not a one. That's still where they signed it, but hasn't been converted yet. Okay. So there's always like a little bit of a lot of.\n00:07:56 - Tina Marie (profitdriversinc.com)\nYeah, I, because I was just thinking about that, like how, you know, and. terms of like reporting for the Monday meeting because we have this dashboard to dig in when a question arises but it's still not the succinct summary that you give us and also the thing that I like about that is I know that you've gone in and you've looked at it and kind of, you know, taking it in like this is where we're at with it. So we've got the intakes by source and state, matters by source and state. So if I click on Missouri, oh, wait, that's not what it just did. That is so weird. There were six and it said, maybe I just, maybe I clicked on, okay, that's what I did. I clicked on the Mexico. Never mind. Okay, so it's not crazy. Okay, so this works good. Oh, and I can, hold on just right clicking or just clicking on it and hovering it. this. Tell me Walker. All right, so the report is working well that way and takes by source and state and takes by source and state. Why do we have this twice?\n00:09:14 - mark sweet\nThe left looks like it's more like source. And one of them right looks like it's just flipped by a state. Do you know what mean?\n00:09:23 - Tina Marie (profitdriversinc.com)\nOh, yeah, yeah, Okay, state, case source. Okay, so it's just a different view. So that's good. That's still helpful and takes status. So one thing I was looking at though is this intake turned down a source by reason. We were trying to get rid of other, but for the month of June already, and I actually don't know how many intakes there were, but there were 60 others turned on details. Government case only wanted to file these reports spam. Spam should not be others.\n00:09:56 - mark sweet\nSpam should be spam.\n00:10:00 - Tina Marie (profitdriversinc.com)\nOkay, it definitely should be its own turn down reason. Um, referral.\n00:10:07 - mark sweet\nSo those are the protected.\n00:10:11 - Tina Marie (profitdriversinc.com)\nHey, what?\n00:10:12 - mark sweet\nNo one wanted it.\n00:10:17 - Tina Marie (profitdriversinc.com)\nUm, like your team didn't want it.\n00:10:19 - mark sweet\nWe didn't want it. Jeff didn't want it.\n00:10:22 - Dan Ryan (danddcompany.com)\nRight.\n00:10:25 - Tina Marie (profitdriversinc.com)\nSo that, okay. Okay. Um, so we do we want to make that no one wants this case? Do we feel like 60 other is okay or should we be doing this a little bit?\n00:10:39 - mark sweet\nmean, there are, it's actually pretty small percentage.\n00:10:42 - Tina Marie (profitdriversinc.com)\nThat's what I'm asking. Yeah, because I don't, I don't really know. I said go F yourself. yeah.\n00:10:52 - Dan Ryan (danddcompany.com)\nOh, yeah.\n00:10:54 - mark sweet\nYou might want to add a text at the stop because that one is from the wall.\n00:11:00 - Tina Marie (profitdriversinc.com)\nOkay. So, who does that?\n00:11:03 - mark sweet\nWho, like? Can you add it? And then we'll just make sure that Patsy knows. And then teaches the staff, then re-teaches the staff like two weeks. Don't forget.\n00:11:13 - Tina Marie (profitdriversinc.com)\nOkay. So what I'm asking though is how do we make that an action item that gets done? Right now. Okay. So let me go. Okay. Okay. So we're going to. Create a turned on reason.\n00:11:32 - mark sweet\nPC texted to stop and. I'm just going to text it. Because I don't want to be too long.\n00:11:39 - Tina Marie (profitdriversinc.com)\nOkay. Um.\n00:11:51 - mark sweet\nThere's a good example of other. Which one?\n00:11:56 - Tina Marie (profitdriversinc.com)\nI'll just go through. Okay. Okay. I'm Down more.\n00:12:06 - mark sweet\nSo there you go. Uh, not an accident when it was a small clean shipper, but you want to pull your out.\n00:12:15 - Tina Marie (profitdriversinc.com)\nUh, this one, not a car accident. Oh, there needed a sense.\n00:12:24 - mark sweet\nThat's a good.\n00:12:27 - Tina Marie (profitdriversinc.com)\nOkay. Um, so. Okay, fake lead, fake lead. Twice, but thinking in terms of. What do we want to track? What do we need to track? What's important to track, especially in terms of vendors. Duplicates and fake leads.\n00:12:51 - mark sweet\nSo those usually get sent back because there's bad phone, so they should be using bad phone. And there's a spam sales. And there's a wrong location.\n00:13:12 - Tina Marie (profitdriversinc.com)\nIn terms of turn down reason. So are some of these should have been marked differently? Yep. Okay. So that's a coaching issue.\n00:13:23 - mark sweet\nYep.\n00:13:25 - Tina Marie (profitdriversinc.com)\nAnd will you be coaching them?\n00:13:29 - mark sweet\nYep.\n00:13:33 - Tina Marie (profitdriversinc.com)\nIs this what we're here for Mark? Yep. Happy Monday. Okay. Let's see. Go back. Oh, there we go. Okay. So. We were looking at adding. Other things to this report. I'm probably done here and I'll go back to my notes and see the status of that Josh was busy or something Dan He turned a bunch of stuff in there.\n00:14:12 - Dan Ryan (danddcompany.com)\nI asked Mark. I don't know if you were on there. I asked Mark on the close date thing So Stacy is sending Josh Mark's response and we'll let us know resolution date. He definitely didn't Think that was he definitely didn't consider that one. I know that So if resolution date works, then he'll swap it out with he created closed date So he'll just price swap that out in the Automation that he made and then he'll use that for that report. So then That part will be done and then Stacy literally just texted me that He just emailed her and he's gonna forward me the email. He's working Mark, you're doing a new dashboard. right. I have to read this. really long. I'll let you guys know. A lot of questions.\n00:15:20 - mark sweet\nwas like, not right now.\n00:15:22 - Dan Ryan (danddcompany.com)\nToo many questions. Yeah. was like, for right now.\n00:15:27 - Tina Marie (profitdriversinc.com)\nThere's a. report. It says recent records.\n00:15:30 - Dan Ryan (danddcompany.com)\nDad. D D matters.\n00:15:32 - Tina Marie (profitdriversinc.com)\nThat's it.\n00:15:33 - Dan Ryan (danddcompany.com)\nThat's it.\n00:15:34 - Tina Marie (profitdriversinc.com)\nThat's it.\n00:15:34 - Dan Ryan (danddcompany.com)\nit. It is.\n00:15:35 - Tina Marie (profitdriversinc.com)\nIt's I think D and D company. So yeah. I know. But what's funny is one says dad. D D matters. one says Dan. D D matters.\n00:15:46 - Dan Ryan (danddcompany.com)\nI don't know. Yeah.\n00:15:48 - Tina Marie (profitdriversinc.com)\nAs of June 24th. So they if I'm and takes by date. The. Let So. We'll be here at eilies again. Okay. Okay. Okay, so wait, just so you can see this, S4s, DAD, DD matters and DD intake. So we're looking at the intake one, converted intakes by dates, and a record count equals last month. Okay, record count eight, but that can't be right because converted would be retained, right?\n00:16:38 - mark sweet\nConverted or retained, but unless they're a drop for some of them, right?\n00:16:44 - Tina Marie (profitdriversinc.com)\nAnd we didn't get 844 retainers in May.\n00:16:48 - mark sweet\nAnd that would be sweet.\n00:16:50 - Dan Ryan (danddcompany.com)\nRight. No, it would not.\n00:16:52 - Tina Marie (profitdriversinc.com)\nThat would just come.\n00:16:54 - mark sweet\nGo back up. Or that's the intake. number. That's gotta be the intake number.\n00:17:02 - Tina Marie (profitdriversinc.com)\nYeah, because the conversion rate is 0.1%, but there's no number for it.\n00:17:07 - mark sweet\nI totally believe we got 840 like actual leads.\n00:17:12 - Tina Marie (profitdriversinc.com)\nYeah. Yeah, yeah, yeah. So the issue is that this isn't labeled correctly for one, two, the conversion rate, there's no number. So that's not really helpful, but now let's go down a little bit, convert it intake by state. There's no, let's see, number, record count 644, so that would have to be leads. And yeah, so this is not, okay, percentage. We're getting there, but this is not good by itself. It's not labeled correctly leads versus like intake leads versus retainers. That's those are the labels we need. And there needs to actually be numbers for the retainers. Yeah, so. If you can just get back with them on that degree. And let's look at the other one just in case it was a different report. Dad, did he met her? Oh, whoa. Case is closed. Close date. We'll go last month. Oh, it was already refreshing. Oh, nice. Two learns. Team Patrick. Oh, it's team Sam, like the smallest one. Oh, because it's cute. This is closed, not just, that'll be interesting to watch this.\n00:19:06 - Dan Ryan (danddcompany.com)\nYeah, I don't think that one's right, though, because that's the one that I just sent them, but he used, he used something, same principle. We're like, Oh, tweet this, tweet them.\n00:19:16 - Tina Marie (profitdriversinc.com)\nRight. Okay.\n00:19:18 - Dan Ryan (danddcompany.com)\nOh, yeah, there you go.\n00:19:22 - Tina Marie (profitdriversinc.com)\nOkay. This is going to be fun to start with that.\n00:19:26 - Dan Ryan (danddcompany.com)\nbig boy dashboards now.\n00:19:31 - Tina Marie (profitdriversinc.com)\nDropouts and subs by team, average fee by team. It's your litigator, right? No, no, no, there's the newbie. Oh, yeah, in Arizona. Well, how many cases has he had, though, and has he done them on his own?\n00:19:49 - mark sweet\nHe started to do the more in his own, but he has a lot of my cases.\n00:19:53 - Tina Marie (profitdriversinc.com)\nOkay. So they were just big by because they were yours. Yeah. Okay. So this is interesting. Any thoughts about this at all in terms of accuracy in terms of questions like just what do you think when you see this?\n00:20:17 - mark sweet\nThis is just this one.\n00:20:19 - Tina Marie (profitdriversinc.com)\nNo, this is me. You want to see it. Let's see it for the year. Yeah, equals this year. I like that.\n00:20:30 - mark sweet\nAutomatically read questions. Yes, looks like I want to do it.\n00:20:35 - Tina Marie (profitdriversinc.com)\nYeah. The snapshot snook a big difference. Thank God.\n00:20:44 - Dan Ryan (danddcompany.com)\nLook at teamwork is amazing.\n00:20:47 - Tina Marie (profitdriversinc.com)\nI know, right? That dude is crushing by 10 cases. Yeah. Man, Sam just ahead of the pack on cases closed by team. Like across the board. or more dropped out and subbed out, but she's also taking really frustrating. I would like to see this as a percentage, though, rather than a number, because that is more important.\n00:21:14 - mark sweet\nYou know, about is worse than drop. usually means there's more of an intake issue.\n00:21:22 - Tina Marie (profitdriversinc.com)\nOkay, so this one, what was it called?\n00:21:26 - Dan Ryan (danddcompany.com)\nDD? Drop means they left you, right? No, subbed means they left you.\n00:21:31 - mark sweet\nNo, drop means we drop the case.\n00:21:34 - Dan Ryan (danddcompany.com)\nSubbed means they fired us. Right. And you drop it because of an intake issue, meaning it was a bad intake, that you shouldn't ever take it in the first place.\n00:21:44 - mark sweet\nProbably clients sometimes lies to us. find out there's no insurance.\n00:21:49 - Dan Ryan (danddcompany.com)\nWe just don't treat it all.\n00:21:51 - mark sweet\nSo it's usually why we end up dropping it. Subbed is we didn't like you.\n00:21:58 - Dan Ryan (danddcompany.com)\nfound a new attorney.\n00:22:00 - Tina Marie (profitdriversinc.com)\nyeah so dropped out's okay set that is bad i mean dropped is kind of no fault for the most part yeah yeah just most of these so 12 for the year for samantha five for the year for the rans five for the year for tyler but can we find on this same report how many retainers they took so if we can't find it in this report i know we can in the next one so let me go the little fly now just go back to the dd dan intake um let's see oh this isn't one by attorneys that's my state so um cases closed by team and talk about how many they took though gross archery Effective 40% by case type, what is that? How many percent on this thing? Although I don't we don't really use case type, so I don't So this was what we're trying to get at the percentage of like max policy limit.\n00:23:28 - mark sweet\nThe average shoot by case type, what types of cases are the best ones for us to take?\n00:23:34 - Tina Marie (profitdriversinc.com)\nYeah, this is awesome. But one of the things that we did want to do was try to see policy limits, and I was wondering if that was what this is supposed to be.\n00:23:47 - Dan Ryan (danddcompany.com)\nThat's gotta be it.\n00:23:50 - Tina Marie (profitdriversinc.com)\nSo we need, okay, that's by case type, but we need it by attorney. Effective by source, effective by source, gross attorney fee by source, average by state, like effective percentage by team. So, yeah, over the year, I don't know how many they took. So, okay. Also, don't it. don't like. It's 1% effective. We need clearer labels. I'm going to get some total cases of total matters.\n00:25:05 - mark sweet\nstarted to get into it.\n00:25:07 - Tina Marie (profitdriversinc.com)\nIt does looks like something went wrong.\n00:25:09 - mark sweet\nThen you'll put your request as your sales for admin for help.\n00:25:12 - Tina Marie (profitdriversinc.com)\nHuh?\n00:25:13 - mark sweet\nSo when I go into the effect of 40% and just click on it.\n00:25:20 - Tina Marie (profitdriversinc.com)\nAny of it.\n00:25:21 - mark sweet\nOkay. Yeah. I can't really put something wrong.\n00:25:27 - Tina Marie (profitdriversinc.com)\nI got that. Maybe. This report. Click on it that way.\n00:25:40 - Dan Ryan (danddcompany.com)\nNope.\n00:25:40 - Tina Marie (profitdriversinc.com)\nwas just 10.\n00:25:42 - mark sweet\nSo maybe I don't have permission for it or something.\n00:25:46 - Tina Marie (profitdriversinc.com)\nWell, that would be weird. But could be possible.\n00:25:51 - Dan Ryan (danddcompany.com)\nYeah. These are definitely not released in the wild.\n00:25:55 - mark sweet\nYou just send them to me. Yeah.\n00:25:58 - Tina Marie (profitdriversinc.com)\nWell, but this is his letify account.\n00:26:00 - Dan Ryan (danddcompany.com)\nHe should have access. to everything. And Josh is getting paid so he doesn't want the client to see how it works. now you've ruined that team. This poor guy.\n00:26:10 - Tina Marie (profitdriversinc.com)\nprobably years of burning.\n00:26:12 - Dan Ryan (danddcompany.com)\nHe's burning. This is not possible.\n00:26:16 - mark sweet\nWe're getting 40%. That's interesting.\n00:26:19 - Dan Ryan (danddcompany.com)\nYeah, exactly.\n00:26:22 - mark sweet\nOkay, so I don't think there's a problem with obviously, but I can't That's what it is.\n00:26:38 - Tina Marie (profitdriversinc.com)\nOkay, so it's still pretty cool. love that we're really getting into the stuff that we've been wanting to know and just look at the visual. There's no comparison to you. Getting the numbers and writing them down in text and then seeing a chart like this. to see the contrast across things. There's just no comparison.\n00:27:05 - Dan Ryan (danddcompany.com)\nWell, that's my question, right? So if you scroll up and look at that 40% and Lorenz is 50-50, literally, or he's actually probably 62-58.\n00:27:16 - Tina Marie (profitdriversinc.com)\nOh, look, I nailed it.\n00:27:17 - Dan Ryan (danddcompany.com)\nwant one more thing. Crazy, yeah. I look at that and go, what does that mean? This is question for you, Mark. What does that mean, and is it a problem?\n00:27:31 - Tina Marie (profitdriversinc.com)\nNo, because he's actually hitting, so this is less than 40%. This is 40%. So more often than not, he's hitting 40%, whereas Samantha, 74 of them, she did not get the 40% and go away. 39, she got the full 40%.\n00:27:51 - Dan Ryan (danddcompany.com)\nThen it would be, if you can go move the needle with coachable person Lorenz and figure out how to... to further increase his number, right? My argument is gonna be, it can be done through systems. If you can understand what makes this member happen, then you can optimize to improve the improvement.\n00:28:15 - Tina Marie (profitdriversinc.com)\nThen can that be sort of distributed to the team, saying, hey, is the way we do this now. And it has nothing to do with people. It's like, hey, this is the process.\n00:28:26 - mark sweet\nRight. There's one issue which I have to bring up. If we've settled the case, well, there's two things. If we settled the case in under 90 days, it's a third. It's not 40% by our contract. Interesting. there's some contracts that have to get clients assigned without a third flag.\n00:28:48 - Dan Ryan (danddcompany.com)\nSo. Is that denoted anywhere in Lidifier now? Nope. Okay. Okay.\n00:28:55 - mark sweet\nThat definitely means more, but we don't put it in.\n00:28:58 - Dan Ryan (danddcompany.com)\nRight. So, back to presses.\n00:29:06 - mark sweet\nBut basically, anything that's not a third or 40% is probably a problem.\n00:29:13 - Dan Ryan (danddcompany.com)\nYeah.\n00:29:15 - Tina Marie (profitdriversinc.com)\nSo we need to find a way where a case that has been incentivized to sign by the one third is marked so that we can start tracking that immediately.\n00:29:30 - Dan Ryan (danddcompany.com)\nYeah, like what percentage of cases are even that?\n00:29:32 - Tina Marie (profitdriversinc.com)\nAnd also, are people using that tactic prematurely? Are they costing you money?\n00:29:40 - mark sweet\nNo, they have to get your first.\n00:29:44 - Tina Marie (profitdriversinc.com)\nOkay, that's good to know.\n00:29:46 - mark sweet\nAnd look, look, I'll do it. I don't think I've ever said no. I've said no to when they want like 25%. I don't think I've said no.\n00:29:56 - Tina Marie (profitdriversinc.com)\nHow often do you feel like you do that?\n00:30:00 - mark sweet\nNo. And once you're twice week, maybe eight cases a month. Yeah, and then minors as well by law, we can't charge more than 25%.\n00:30:14 - Tina Marie (profitdriversinc.com)\nAnd how often does that happen?\n00:30:16 - mark sweet\nWe try to avoid taking minors whenever we can. That's maybe two cases a month.\n00:30:31 - Tina Marie (profitdriversinc.com)\nOkay, so that still doesn't change this, that there, there are tactics and operations inside of these numbers because this is, this is for the whole year. Let's just look at last year because we had most of this team all of last year. Okay, so 76 79. So. There's a little change there, but Samantha's still consistently getting under 40%. That's not quite like two thirds of the time, but close and then Tyler, that's pretty big. So that was an entire year last year.\n00:31:24 - mark sweet\nSo if you go into and you look at, hey, if it's a weird percentage, you're going to know they had to reduce that.\n00:31:32 - Tina Marie (profitdriversinc.com)\nYou're going to know they had what?\n00:31:34 - mark sweet\nTo reduce down their percentage. like go back into it for details. For which one?\n00:31:40 - Tina Marie (profitdriversinc.com)\nAny of them. Okay.\n00:31:42 - mark sweet\nJust look at Tyler. Or I guess the sub 40% for yeah. Okay. Just click it. Okay. Okay. That's not what I was looking at. The ones that are not 40%.\n00:32:04 - Tina Marie (profitdriversinc.com)\nOh, okay.\n00:32:09 - mark sweet\nSo like a 20.12%, yeah, we clearly reduced down our food. 28.4% clearly reduced down our food.\n00:32:21 - Tina Marie (profitdriversinc.com)\nOkay, so.\n00:32:23 - mark sweet\nThat's the average effect. So it's detailed real, bottom. Okay, so see, like the first matter on pedestrians, 33 and a third, that could have been just because that was all we could do on it, but like one right above the 26%. Yeah, we clearly dropped down our food.\n00:32:48 - Tina Marie (profitdriversinc.com)\nAnd so is that sending 100% we should have done? And you did it to keep the business like. It was.\n00:32:59 - mark sweet\nCan you click on that file? I'll tell you exactly why. Because it was a monocomp and that was what the judge ordered us.\n00:33:16 - Tina Marie (profitdriversinc.com)\nOkay. And anything else? What is this?\n00:33:25 - mark sweet\nI don't know. That's what I do. Okay. Shh. I'm taking one. Okay, I'm not sure how to fix this issue. There's two distributions ones for the $10,000 med pay. And of that, we've got the 3,333. Of the 250,000, about 83,333. So if you scroll up. You can see there's two resolutions. So once for 10 and once for 250. the total that we got was 93,000. So we've got the third. But I don't know what the system is only showing 3,333.\n00:35:00 - Tina Marie (profitdriversinc.com)\nOh, okay.\n00:35:01 - mark sweet\nAgainst 260.\n00:35:08 - Tina Marie (profitdriversinc.com)\nSo, why?\n00:35:12 - mark sweet\nBecause gross attorneys, he's shown three thousand three three. Someone put that in. Cool.\n00:35:19 - Tina Marie (profitdriversinc.com)\nSo coaching.\n00:35:23 - mark sweet\nYeah, I guess is more.\n00:35:28 - Tina Marie (profitdriversinc.com)\nThat's what I'm asking like that's the whole point of digging deep into this stuff is clarity and and just looking at what what should be coached and but also if there's confusion, what is the impact of the confusion. Is it significant? Is it just because we're looking at the report and that's the only thing that's confusing or.\n00:35:52 - mark sweet\nThe confusion came from because they're different times. if you scroll way down, I don't even have to do access to work shows when updating the quick books. And so. So for QuickBooks, the 333 and the 85 or whatever it is, is at different times. So see, QuickBooks currently is 823, I'm honored if that was the issue.\n00:36:15 - Tina Marie (profitdriversinc.com)\nOK. And I wonder, too, how this report is being captured, is it by, it's not by resolution? Because there were two different resolutions, No, it had the gross word operating.\n00:36:30 - mark sweet\nwe got paid because the only way that you can pull it is from the gross attorney fee. And you can see the effective percentage.\n00:36:36 - Tina Marie (profitdriversinc.com)\nOK.\n00:36:39 - mark sweet\nBecause that's not the resolution, but gross amount. Well, add it together to the gross amount.\n00:36:47 - Tina Marie (profitdriversinc.com)\nSo is there anything that needs to be fixed because we see this?\n00:36:53 - mark sweet\nThat's the main question, or move along. I need to talk with Michelle to see if there's some reason why we're doing it differently. And there may be a valid reason. I just don't know what it is.\n00:37:03 - Tina Marie (profitdriversinc.com)\nUm, so I want to make sure I capture this as something that we can follow up with. Um, to show about. It's the most succinct way to write it down.\n00:37:19 - mark sweet\nUh, attorneys be.\n00:37:26 - Tina Marie (profitdriversinc.com)\nWell. Um, based on the reports. In percent. Sure. point. Ex percent. right. Go back here. Okay. So then this is. For last year and we were. I'm at this. Okay, Nick is the living dealer. Patrick's the new one on Arizona.\n00:38:08 - Dan Ryan (danddcompany.com)\nOkay.\n00:38:10 - Tina Marie (profitdriversinc.com)\nThis is Timorens average, okay. But so that's interesting that her average gross attorney fee is 17k. But she hits 40% less often than Lorenz. How do these correlate?\n00:38:36 - mark sweet\nI would look a lot more on the average fee by team than anything else.\n00:38:40 - Tina Marie (profitdriversinc.com)\nOkay.\n00:38:43 - Dan Ryan (danddcompany.com)\nWell, yeah, and the expected 40 is dirty right now. It's not real, because if these other ones that Mark highlighted earlier are in there, there's no way they're getting filtered out. Right. we first have to figure out how to filter them out. Whereas this one is probably not dirty.\n00:39:06 - Tina Marie (profitdriversinc.com)\nWell, that's what I was saying. maybe we should look into it a little bit and see. If anything. Oh, and it does.\n00:39:17 - mark sweet\nWait a minute.\n00:39:20 - Tina Marie (profitdriversinc.com)\nHow so that calculates this in here. Also just interesting. Some of those eternity. How much eternity. How much of those eternity. And the reason I'm really interesting.\n00:39:42 - mark sweet\nlittle bit better is because. I mean, I showed you what they're getting out of the case. they're The rinses and hanks should be higher generally speaking because they're working in states with higher limit.\n00:39:56 - Tina Marie (profitdriversinc.com)\nOh.\n00:39:58 - mark sweet\nUntil January then. Corning goes and matches roughly the same as everyone else.\n00:40:03 - Tina Marie (profitdriversinc.com)\nSo this is interesting too. want to go look at somebody else, but that the types of incidents where you hit 40 percent versus it's not.\n00:40:15 - mark sweet\nDon't it's it's in this moment. It's not OK, just because the vast, vast, vast majority of work, this is our driver past. OK, I completely get why you look at that because that will be what I look at too. But in our case, it's just going to to be way off because based on those, we should take lots and lots and lots of and falls where the reality is we don't want to do that.\n00:40:40 - Tina Marie (profitdriversinc.com)\nGot you. Good to know. OK, so let's just take a look at runs here. Um, one record. Okay. Okay, it's just a new way to look at information. I'm just kind of processing it. Um, is there anything, so let's just take a look at these reports a little bit more and just kind of look at it as an, and evaluate it as a report. What, uh, do we, what else do we want to kind of look into?\n00:41:52 - Dan Ryan (danddcompany.com)\nLike my brain is feeling overwhelmed now because I'm just like taking it. I like many that's a new.\n00:42:00 - Tina Marie (profitdriversinc.com)\ninteresting view so the doctor referrals to that seems weird that are less than 40 percent no that's not weird well it's like it's a you know it's sort of the lead quality in a way but maybe not also because the doctors only know they're going to get paid in full they sometimes goose their bell a little bit and i can't take that out on a client so i will i'll be reduced on my feet before you know that's the doctor who referred me at least reduced on their feet yeah so this is interesting considering the cost of monkey leads where's like where's walker oh yeah walkers looks good more than half just a little bit more than half you're interesting all these new ways to evaluate things And then average fee by source, but this has to be for the whole year and that can be for the whole year. is this period is for last year. I'm trying to figure out how to decipher this because I know we spend way more than this.\n00:43:32 - Dan Ryan (danddcompany.com)\nSo this is like the value of the source, average value of the fees by source.\n00:43:37 - Tina Marie (profitdriversinc.com)\nSorry. This is different. So with is this then per instance. The like the average across each incident.\n00:43:55 - Dan Ryan (danddcompany.com)\nNo, it's just that source. However many they have, right. So, Dragonhead won at 92,000 and then the average 92,000.\n00:44:04 - Tina Marie (profitdriversinc.com)\nOkay. Okay. Got it. This is interesting. So, let's look at Walker versus Monkey. That's pretty interesting. That's for all of last year. Monkey's double Walker.\n00:44:32 - Dan Ryan (danddcompany.com)\nYeah.\n00:44:34 - Tina Marie (profitdriversinc.com)\nMark.\n00:44:39 - Dan Ryan (danddcompany.com)\nRight.\n00:44:40 - mark sweet\nAll you can do is move it at this point. don't have any access.\n00:44:45 - Dan Ryan (danddcompany.com)\nyeah. They're ready. They're not ready for you.\n00:44:47 - Tina Marie (profitdriversinc.com)\nYeah. Well, let me click on things like I'll be your hands here. Human mouse. Yeah. What do you want to see? Okay.\n00:45:02 - mark sweet\nI just want to dig into those details.\n00:45:06 - Dan Ryan (danddcompany.com)\nThat's a thing.\n00:45:07 - Tina Marie (profitdriversinc.com)\ndon't know what you're looking for. You just start looking like, oh, but you start making me start beautiful minding. You're like, oh, wait a second. I can see Mark doing that. Okay, so dig into this.\n00:45:22 - mark sweet\nThis one is called.\n00:45:23 - Tina Marie (profitdriversinc.com)\nyou can is what I mean.\n00:45:27 - Dan Ryan (danddcompany.com)\nLog in is Lauren.\n00:45:28 - Tina Marie (profitdriversinc.com)\nYeah, duh.\n00:45:30 - Dan Ryan (danddcompany.com)\nSeriously.\n00:45:33 - Tina Marie (profitdriversinc.com)\nThat's exactly what you do.\n00:45:35 - mark sweet\nI am. I'm viewing it. This is ignoring.\n00:45:40 - Dan Ryan (danddcompany.com)\nGo over the crew.\n00:46:00 - mark sweet\nWhat happened? Kind of change your owner domain. See how that makes any difference.\n00:46:03 - Dan Ryan (danddcompany.com)\nYou do whatever you like.\n00:46:05 - Tina Marie (profitdriversinc.com)\nOkay.\n00:46:11 - mark sweet\nNope. Same issue.\n00:46:14 - Dan Ryan (danddcompany.com)\nThank you.\n00:46:16 - Tina Marie (profitdriversinc.com)\nWell, that was like.\n00:46:18 - mark sweet\na few minutes. I need to make sure that we get one thing covered because it's directly talking. The HQ intake thing. sent a quick email about it. I didn't want to forget about it. They're getting a lot of leads. We're saying no to a bunch of those leads, but then it's stopping. Where normally we would refer those out.\n00:46:49 - Tina Marie (profitdriversinc.com)\nWhen your internal intake does it, it gets referred out. But when HQ intake does it, it doesn't get referred out. They just stop. get no money out of them. Okay. So, they're not referring out.\n00:47:02 - mark sweet\nRight.\n00:47:06 - Dan Ryan (danddcompany.com)\nWhat, because they don't know or because they're.\n00:47:11 - mark sweet\nOh, they don't they wait.\n00:47:16 - Tina Marie (profitdriversinc.com)\nSo, they need to go to your intake team. So, your intake team can refer it out.\n00:47:21 - mark sweet\nCan we do that? That will be fine.\n00:47:26 - Dan Ryan (danddcompany.com)\nSo, they're on the phone with someone and they're like, oh, this isn't sweet law level, but it could be signed. Right.\n00:47:35 - mark sweet\ndon't call me today about a case that, you know, they hadn't treated in 60 days, like someone might want that.\n00:47:44 - Dan Ryan (danddcompany.com)\nOh, well, they don't do it or they don't know to do it. Like, could you go to Robert?\n00:47:50 - mark sweet\nThey're like, hey, dude, I give you 300 bucks for those. No, because I don't want to spend that kind of money on it because they need to work absolutely nothing.\n00:47:59 - Dan Ryan (danddcompany.com)\nWell, I mean, I was making.\n00:48:00 - mark sweet\nBut also, I don't really want people in referring cases, right?\n00:48:06 - Tina Marie (profitdriversinc.com)\nSo you somehow need that to then bloomerang back to the internal team. Yeah, that's not going to happen.\n00:48:20 - mark sweet\nOkay.\n00:48:21 - Dan Ryan (danddcompany.com)\nI mean, not the current, so I sent too many email. So, funnily enough. So I'm getting on the horn with the ads. Certainly got as on Thursday. I reached out to Robert and was like, Hey, bro, we got to get you off of a law ruler. And I was like, I've been in this industry forever. And so I could get you on a better system. He hasn't responded yet, but then Avery from. Certainly I emailed a bunch of stuff over the weekend. He wants to get on a call on Thursday. He's going to take me behind the scenes of some of their stuff because I was asking. A bunch more data questions than I think he likes. That he's like, oh, I'm happy to show you. I'm happy to take it behind the curtain. I'm like, all right. But he was saying today that HQ, he's like, dude, they need help because he's saying their sign-up rate is dropping. He's saying it was twice as good six months ago. And I go, well, I know what their problem is. The problem is they have a system. And if we fix their system, then they'll do better. But if we also get them on leave flowy, then this ricochet idea or boomerang idea is completely doable. Because we would just give them a tag, and then it would send it back to your account. So I guess now more than ever, I need to get this dude to switch or get on the path to switching. Yeah, it would be rad. It would be great to be inside. They do a good job. But even I don't even like some of the stuff. Like I wish I knew. The last time they touched something right there up trying to reach so and so I'm like when when was this? Like is this is it three days ago? Is it was it this morning? can't you can't see that they send that Terrible spreadsheet like this is not good. No, it's a terrible spreadsheet. Yeah, it's not good enough and if they're trying he's saying they've scaled up But if they're scaled up and their results are getting that doesn't me they scaled up and their results are getting worse That's that's not good. No All right, so I might need you to if he doesn't respond to me, I'm gonna CC you like I And then you can you could be the heavy mark because he fears you You're the checkbook I'm just his path the greater income come on which I'm gonna eat HQ intake people? Yeah, they their setup is not cutting it.\n00:51:05 - Tina Marie (profitdriversinc.com)\nWho's the he?\n00:51:07 - Dan Ryan (danddcompany.com)\nRobert.\n00:51:08 - Tina Marie (profitdriversinc.com)\nRobert. Just for my brain when I hear that and like okay now I know what we're talking about.\n00:51:16 - mark sweet\nin the meantime do we want to start pulling more back? I mean how much is that costing you? That seems like maybe again it's here's why I'm having trouble answering that question. It's no guarantee that someone's going to take the case period. Right. And my average like your forophy of not big vaccines is pretty damn low.\n00:51:48 - Tina Marie (profitdriversinc.com)\nOkay, so we have to is it is it financially more sound for you to keep HQ intake knowing that you could lose um money for the referred out.\n00:52:00 - mark sweet\nor to not have them at all and just well it comes down to how well they're converting right if they're converting for us better than we're converting then you know the referrals are obviously a much more percentage of it right but so far it seems like their conversion rate is not just more from the harsh it's not it's nearly identical so why am i gonna pay extra money for the same thing right the difference is they work on the weekends better than we work on the weekends that's it so then maybe just use them on the weekends but the problem is once the leads with them the leaders put them right then you then you get into this situation of you can't have double calling but that is plausible for sure i mean that could be a tweak so like a large part of you wants to pull the quantified leads from them to us, but they are the ones that gave us that want to buy as a source and hesitant to do that.\n00:53:06 - Dan Ryan (danddcompany.com)\nAnd they're crushing it. conversion rate on those is crazy. So maybe that's because they want to keep, now they have two masters, right? So when they're getting monkey leads and they have one master, just you. They don't know . I think there's a little of that gone on so with quantifieds for sure that it's like oh yeah no you've got two masters and you're going to keep quantified happy and mark because they're both your clients.\n00:53:49 - mark sweet\nNow let's keep it going but it's just something to think about is there a better way for even if it's like a robber of hey any that you call me and reject like shoot me the email on it so at least I can work for it out to someone else.\n00:54:01 - Dan Ryan (danddcompany.com)\nYeah, let me think about if there's an easy way, like there's got to be, if I can think of a signal, we could for sure give them a form maybe, and then they just submit the form. Let me think about it, like, because that the next guys we gave them, I gave them, we created a form for them to use, and that's how they do stuff, if the bot doesn't get it. But with these guys, it could be like, hey, in this scenario, then go fill out this form, and maybe all they have to do is submit the email address, and then when that matches the record, we just switch a route inside a leaf flowy back to whatever. I'll see if that's a thing, I'll see if we can pull just that functionality would work. Or even send an email to leave flowy with the email address, that might not be enough. Let me think about it, one of those, one of those two.\n00:55:00 - mark sweet\nI think we're working. There's going to be a way that they can just send it back to us.\n00:55:04 - Dan Ryan (danddcompany.com)\nOr, yeah, well, not to you to like an automation. Yes.\n00:55:10 - mark sweet\nRight. Yeah. There's a referral portal within what if I, but not everyone's on it. So it would just need to go back to pats here and intake to refer out. We can just zap it with a, you know, rejected or for out as a title. And then it's tracking, we're tracking that.\n00:55:33 - Dan Ryan (danddcompany.com)\nRight.\n00:55:34 - mark sweet\nAs well. I mean, I don't want to downplay, but yeah, it ends up being, I think on average about 50 grand a month of referrals. No. So it's like, it's a significant amount.\n00:55:44 - Dan Ryan (danddcompany.com)\nYeah. Well, then you get that metric too.\n00:55:48 - Tina Marie (profitdriversinc.com)\nAnd then it's like, are they even Steven on both these things? Yes.\n00:55:52 - Dan Ryan (danddcompany.com)\nThen maybe you're like, okay, we're only ever going to leave the quantify. But right now you could be missing those with quantifies. what could be happening, right? quantify such a high conversion rate, would they not have a high conversion rate of referrals too? seems like mathematically that would be true. I'll figure out it's one of those two ways. I'll figure it out.\n00:56:19 - Tina Marie (profitdriversinc.com)\nThe great thing is the secondary effect of or just kind of what you call it, not effect consequence basically of expanding operations and trying these different things is that we're looking at it from a new perspective and that new perspective generally is more value because we understand it in a way that we didn't understand it before. Figure out how to measure and tracking if we weren't measuring and tracking before, which means that we can then figure out how to optimize things that we weren't optimizing before, which leads us to, you know, that greater of average business more from less. So, You know anyway keep doing this.\n00:57:02 - Dan Ryan (danddcompany.com)\nWell, yeah, you're right. That gets this. It's a scenario. was talking about like this problems. We solved the problem and then the problem solved. Now, it is a problem other people are having for us go solve it for them. But in solving our problem with Robert through Robert, it's going to make his business better and our business better.\n00:57:26 - mark sweet\nYes, unfortunately and unfortunately, but hopefully that.\n00:57:28 - Dan Ryan (danddcompany.com)\nYes, exactly. goes some more yin and yang. Well, yeah, then you become his investor mark.\n00:57:35 - Tina Marie (profitdriversinc.com)\nYou need a back.\n00:57:38 - Dan Ryan (danddcompany.com)\nTake a piece of that .\n00:57:40 - mark sweet\nLeverage that. We might.\n00:57:45 - Dan Ryan (danddcompany.com)\nI'm serious. I was joking, but I'm like, I wonder where he's really at, right? Like, what is going on over there? Because that ties into what you had said years ago, you know, somewhat tongue in cheek. You're like by the advertising. Well, I was actually talking to Salgo, and I said, he pointed this out, and I was like, oh, I haven't thought about that. He didn't say it like this, but he's like, have you guys basically solved the intake thing with these HQ people?\n00:58:15 - mark sweet\nAnd I was like, oh , yeah, I guess we have.\n00:58:18 - Dan Ryan (danddcompany.com)\nBecause for years I kept telling him, we don't have a lead gen problem. We have a retainer siding problem. Well, that problem no longer exists, really. So if the triad is firm, tech, intake, HQ, advertising agency, right, whatever, like leads, I would say leads, agency leads, then you're done though. So it's the proverbial owned the race courses, James Rinko would say, yeah. It's also like, like leveraged the race course, right? That was the other thing I was thinking, like, these ads certainly got some, like, they're, they're good. And it's like, if you can make them better, and then somehow let, like, leverage them and maybe leveraging them is like. You know, part of me was like, create, go create Arizona firm, right? When I read that the other day, I was like, oh, they just did it wrong. That was, I'm serious. That was their problem. They did it wrong. They didn't know the math, but the reality is nobody knows the math, right? So all the math is right here, like, look at it. Look at these dashboards. No one's building these. No one knows this stuff this intimately. And it's that that's how you can then go, hey, give me an investor, right? That's where I'm just going to make up. But it's like, that's where you go to Omar and say, hey, give me a bunch of money to invest in a law firm, where you go to, or you don't, you don't get an investor at all and you just go build this Arizona firm with. the bunch of non-lawyers and show them that they can get a piece of the back end if they're good at the thing that they're good at.\n01:00:08 - mark sweet\nWhich is generating the case, which everyone's gonna do and as we clearly know, is not the case.\n01:00:16 - Tina Marie (profitdriversinc.com)\nYeah, exactly.\n01:00:18 - Dan Ryan (danddcompany.com)\nSo you have to build, like if you can build that team, they're never gonna do it, right? So it's like, that's an opportunity that's there if you can get the right pieces on the board. Like, it's my whole thing, right? idea and money execution. Well, money, not a problem. It would be easy to get money from that. Idea, done. We just laid it out. Then it just comes down to execution, right? Those guys had idea and money and they filled an execution. They filled an execution because they had no idea what they were doing because they went and hired an agent. I loved the part where they hired a PR firm. Like, really, that's where you spend money. Yeah, good lord. Shoot me. But whatever. So don't hire a P. When we still need to figure out how to generate the leaves. Yeah, exactly.\n01:01:15 - mark sweet\nAnd sorry, not just how to generate the cost effect.\n01:01:18 - Dan Ryan (danddcompany.com)\nYes, and own it.\n01:01:20 - Tina Marie (profitdriversinc.com)\nYes. Well, and quality.\n01:01:23 - Dan Ryan (danddcompany.com)\nYeah.\n01:01:25 - Tina Marie (profitdriversinc.com)\nYeah. anyway, these new reports are awesome.\n01:01:29 - Dan Ryan (danddcompany.com)\nTell Josh he rocks and we'll keep him for a while. Anyway, yeah, it's going good.\n01:01:37 - Tina Marie (profitdriversinc.com)\nI think that's it for this week. It also, it's time and I don't know what you guys have, but I get to get going.\n01:01:44 - Dan Ryan (danddcompany.com)\nBut this is good.\n01:01:47 - Tina Marie (profitdriversinc.com)\nhave fun with that.\n01:01:49 - Dan Ryan (danddcompany.com)\nMark, is there anything? Dan, you can dip if you want to. Let's check on Mark.\n01:01:53 - Tina Marie (profitdriversinc.com)\nI will. I need a drink.\n01:01:54 - mark sweet\nI need a I need a drink.\n01:01:57 - Dan Ryan (danddcompany.com)\nneed\n01:02:00 - Tina Marie (profitdriversinc.com)\nHe like, oh my God, mid-sentence.\n01:02:02 - mark sweet\nYep, he was done. He was done. He I'm oh my God.\n01:02:07 - Tina Marie (profitdriversinc.com)\nOh my God, he's like, I pulled the click. I'm like, oh, That was too funny. so was there anything that we didn't bring up that you want to bring up?\n01:02:22 - mark sweet\nNo, I think that was everything. was trying to figure out how we would squeeze every single thing out of everything, just given how much we spend.\n01:02:32 - Tina Marie (profitdriversinc.com)\nYeah, so I think, though, that our ability to even ask the questions that lead to those answers are going to be greatly improved the more that we look at this type of stuff. That's the biggest thing, because usually the answer doesn't come until you ask the question. And a lot of times, we don't give enough, I can't think of the word that I want, but wait. sickly to what it takes to get to the right question. And it's a series of questions. And the series of answers like the real question, the real answer comes through just continuing to probe and get there. But the tools to improve our questions come through this dashboard that we've been building and making and took forever and that we told ourselves couldn't even happen in the first place because we spent a year and a half saying, let if I can't do it, like it's a whole process. But we are getting answers because we kept asking questions. So I think our ability to get there just, not only you got closer to it, but I think the pace at our ability to answer questions better and get to better questions is improving because of this. This structure and organization is going to lead to that. If you have a second question, Can we talk about setting up times with Patrick and Lorenz? Does it need to wait?\n01:04:07 - mark sweet\nNo, I would just email them direct. don't know what their schedule is looking like necessarily, especially while they're in Patrick. But I've told them that you're going to be your chance.\n01:04:16 - Tina Marie (profitdriversinc.com)\nOK, I don't have Patrick's information.\n01:04:20 - mark sweet\nI don't have. I don't have either one of their contact information. At your gets to law.com and more ends at speedlaw.com.\n01:04:26 - Tina Marie (profitdriversinc.com)\nSuper easy. OK, I can do that.\n01:04:29 - mark sweet\nAgain, as you can tell, I started the firm. didn't necessarily expect to have a lot of people. If it's no first name, no last name. Yeah. OK, yeah, it's only turned into an issue once.\n01:04:46 - Tina Marie (profitdriversinc.com)\nThat's funny, but that's it's OK because you actually don't want to have a ton of people. You just want to have a of money. OK, so I will do that. But is it OK with you? Because I would prefer to CC you on everything. Yeah, for a while. Okay and it's that way you're in the loop and um so what I wanted to do was talk to Patrick first just a one-on-one then Patrick and Lorenz then Lorenz then and just keep alternating that way but the individual follow-up will happen throughout the week regardless so there may be um group conversations where I'm like okay this is applicable to both of you and then it might just be I don't need to bother Lorenz with what Patrick's working on I don't need to bother Patrick with what Lorenz is working on that kind of thing so a few different conversation threads just because it's a few different people anyway but that's my plan of going in and then reporting to you I could report on this Monday call we could have a separate just it could be an email report and then we could have this Monday call for now and then depending on how it goes we know it's going be more important. Okay, sounds good. I think that's all that I have. So is there anything else that you needed?\n01:06:08 - mark sweet\nNo, I think those are the major things. So yeah, she's getting really moving.\n01:06:14 - Tina Marie (profitdriversinc.com)\nAnd I will follow up with Dr. B today because I'm just looking her up. Like she looks awesome.\n01:06:20 - mark sweet\nHopefully. Yeah, I'm gonna see her this afternoon.\n01:06:22 - Tina Marie (profitdriversinc.com)\nSo Oh, yeah, send that plug. I've got I've got lots of time today after 1.30. So and I've saved her contact. So I don't know if I get it. All right. You taking care of yourself?\n01:06:36 - mark sweet\nRight now I'm trying to figure out charity attacks issues. That does not answer my question, Mark.\n01:06:44 - Tina Marie (profitdriversinc.com)\nYes, it will make people laugh at her once I get it figured out. if you take care of yourself, you're it. mean,\n","contentPreview":"00:00:00 - mark sweet\nthat's okay interesting how people are deciding just yeah it's okay it's legal so the guy wasn't close to the kid so you shouldn't get anything it's like or last year that we've ...","processedAt":"2025-05-04T03:40:52.618Z"}