{"fileName":"Done Transcript for Maria & Tina🪄(1).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Maria & Tina🪄(1).txt","type":"transcript","priority":"medium","content":"00:02:00 - Tina Marie (profitdriversinc.com)\nYou Thank you. Hi, how are you?\n00:04:31 - Maria Gudelis (Maria Gudelis)\nHow are you?\n00:04:33 - Tina Marie (profitdriversinc.com)\nSleepy. I'm not fully awake yet. didn't eat yet. daughter took my, well, older daughter took my younger daughters to seminary. So got to sleep in a little bit, but I was up till two working. So. No, it's just the way my body works better like that. Yeah, but also I have a missionary training at nine o'clock. So, are we going to have to check? Sure. think I do. I do. So, anyway, what were we talking about yesterday?\n00:05:12 - Maria Gudelis (Maria Gudelis)\nOh, yeah, yeah, yeah, yeah. We were talking about mama bear marketing, um, talking about the, um, the Google Doc we have on there in the community and how to build the offers and all that stuff. then your boxers, just listened to and yeah, so I did have a fun night last night. Thank you. And, um, and then this morning, I actually was at my mom's for bit and then, but you know, I feel a little off-kilter and then after this call after I picked my dog up because I didn't do my Bible journaling or anything this morning because I just got off and went straight to artwork and then helping my mom. Um, but uh, yeah, so in the chat chat stuff, yeah, that's cool too. I remember Ravi doing that when I used to work for him a couple years ago. So, and yeah, that was cool. I think me and Karina were going to launch a AI thing for e-com for Shopify stuff. I know we were building a little bit of about two, but we never really launched it per se, except everyone still goes to the free version. But I get what you mean, like what would Maria say? Like, that is, it is powerful.\n00:06:17 - Tina Marie (profitdriversinc.com)\nUm, Yeah. Um, I was trying to figure out if I could figure out who I'm bear marketing was. Cause I remember there's this lady that's been around a long time also.\n00:06:30 - Maria Gudelis (Maria Gudelis)\nAnd her name is Barb Ling. Oh, Barb Ling. Yeah.\n00:06:34 - Tina Marie (profitdriversinc.com)\nShe goes by mama bear now.\n00:06:37 - Maria Gudelis (Maria Gudelis)\nSo, oh, I thought she used to be just barbelling marketing or something.\n00:06:42 - Tina Marie (profitdriversinc.com)\nYeah. might be, but she on Facebook now, she's mama bear B. Oh.\n00:06:49 - Maria Gudelis (Maria Gudelis)\nYeah, I'm a barbelling authority marketing coach. Yeah, she bought some stuff for me in the back of the day. And then she also, it was in the worry form of doing good offers. Like she's just a decent person, you know? that offers.\n00:07:06 - Tina Marie (profitdriversinc.com)\nI'm on her page and she doesn't say mama bear on her website but she just shows coffee. That's why I remember her. She's really in the coffee. That's right.\n00:07:20 - Maria Gudelis (Maria Gudelis)\nyeah, she says on apology baby blue word 23 plus year veteran marketer coffee appreciator moose wrangler and more virtual coach. yeah, she doesn't have mama bear anywhere here but you're right. Maybe she just recently really branded.\n00:07:35 - Tina Marie (profitdriversinc.com)\nOh, no, this is um, if you go to facebook.com slash mama bear entrepreneur. That's her.\n00:07:56 - Maria Gudelis (Maria Gudelis)\nOh, yeah, I would.\n00:07:59 - Tina Marie (profitdriversinc.com)\nYeah, and I think that that's That's her old profile that she switched over.\n00:08:04 - Maria Gudelis (Maria Gudelis)\nOh, Fred's. Oh, she can't use that because that's a personal page, not a business page.\n00:08:10 - Tina Marie (profitdriversinc.com)\nYeah. And I can't switch mine to a professional page, not, not business, but professional. It's not an option for me, which is weird.\n00:08:25 - Maria Gudelis (Maria Gudelis)\nAnyway, yeah. Yeah, I'm just shocked to see that it's not a page page. Did they take that functionality away? Because it used to be pretty easy that you could switch it over to a professional page.\n00:08:37 - Tina Marie (profitdriversinc.com)\nI don't know when I have more than 500 followers and half for a long time.\n00:08:43 - Maria Gudelis (Maria Gudelis)\nSo I don't know why I wouldn't be able to. But I mean, it's been years since I've had a client do that. But yeah, I'm going to try to get maybe there was a glitch. I always think something's not working that should work on Facebook. Then it's a glitch and go back next day and try.\n00:08:58 - Tina Marie (profitdriversinc.com)\nOh, any of it, I've been looking at it for months because. they have analytics now.\n00:09:01 - Maria Gudelis (Maria Gudelis)\nAnd it's not a business page, it's a newer thing. It's not, it's gone.\n00:09:07 - Tina Marie (profitdriversinc.com)\nAnyway, um, so I want to be paying attention to the time with my brain. I did want to share with you though, one thing that Dan sent me, I'll just put it in the notes. Um, it's okay, I bought it, and I would share it with you if you wanted it, but um, hold on a second, gonna find chat here. Really inexpensive, and I think the only thing I'd probably use it for would be maybe some quick um, graphic type creation. I haven't gone through everything yet. their sales page, showed that they have some automations for graphics, but a lot of variety. And they do have AI. I'm playing with it to see. I don't like to finish products. don't think it's quality enough to be representative me, but I do think this type of stuff is sometimes good for repurposing old things. And one of the tests that I wanted to run was kind of a side-by-side faceless type of campaign to see what can be done because there's a lot of faceless marketing. People don't care about knowing, liking, and trusting if it's not a huge investment. They care about, are you teaching me something useful? And I got, I don't know if I still have it, businessprofessor.ai, where I would basically repurpose the same content and just change the voice a little bit to not necessarily be about the mom's side and the personal details as much, but still the same. The value of the content. tactics, principles, things like that, because the duplication shouldn't be that difficult if I get low cost, you know, assistant. And then if I'm duplicating it, but under a different brand sufficiently, it shouldn't be anything that's penalized and it would be like diversifying, basically. But it's an experiment I want to run because the audiences are so much bigger than they were, even just a few years ago, even pre-COVID. And it keeps growing this world of, you know, people wanting to side hustle, things like that. was thinking about, you know, even when I was a kid, my mom did, Mary Kay, Tupperware, Avon, what else did she do? But there was, women were selling things. And then there was, you know, the candles and the melaleuca and the amway and all that type of stuff. So, but now they've got the internet. I just think that it's, and the statistics are there, but there's just so many people to get to who aren't internet marketers per se, who are maybe they sell at the farmers market on the weekend. they could be taught about profit margins and simple things like that. So anyway, kind of thinking about how to expand stuff. Instead of, I always feel like I get trapped in the high ticket world and high value and high level. I, there's only, like I said, there's only so much of that you can do anyway, because high level clients require high level performance and investment. And so, you know, there's only a few of that. Everything else needs to be leveraged. And I just realized, like, there's a lot of people who know almost nothing and just to be able to teach them. So, anyway, those thoughts. But, and then, okay, so we were talking about potentially starting something with both of us as a kind of like a baseline foundation and being able to. And I mean, even at the same time, parallel, while we're not working together, kind of duplicate some of that work. Like, we could create a school group or a high level community that's similar and just start piping people in and figuring out a very low level schedule like where once a week we show up and answer questions. And, but because high level has rocking, like, let's say you make a reference from your existing group that you're building into this group, that link would be a tracking link. So those people are tracked from day one. So if those people buy anything, no matter what they buy, you get the higher level commission. And because like I have Facebook followers, that would just come in and do things. And we can decide if we want to create it as a free group or, you know, maybe it's $20 a month and it's low cost. And we're going to show up and talk to each other anyway. But how scalable is that? How many people would want to come in? I'm thinking volume of people who have trusted enough to give a credit card for $20 and to make a commitment for $20 a month. I think that could add up pretty quickly. But then, as we're talking to them every week, figure out, okay, what are you guys interested, what are you responding to? Where does the conversation not where does it consistently go?\n00:15:02 - Maria Gudelis (Maria Gudelis)\nLet's offer that.\n00:15:04 - Tina Marie (profitdriversinc.com)\nLet's make a training. Okay, this training is going to be $200 and this is what we're going to do. And we don't even have to like we can go run ads separately to bring people into that training. But if we have a group full of people who have already paid $20 a month and half of them have said, I really need to know this. And you and I know it doesn't matter what they want to know, we're going to be able to teach it quickly, live probably. And then provide some really good resources which we can take to VAs. I've got a ton of them of different sorts, video graphics, PDFs, all the works where we can take the live content that we made and then go make some pretty visual supports for them. And then that becomes an evergreen product that already exists in the members area. like, hey, you have this problem. Here's all our testimonials, these people. we give this to them and and you can have it now and it does not have to be a live training and if then you know if something goes really well we can say we'll do the live training again in a few months whatever if people want live more because they can do Q&A then we charge more that's the thing but there's so many different topics we could just do that on repeat but then so the Maria Tina version is always going to be a little different than just Maria riffing all by herself and just Tina riffing all by herself but especially if we really kind of like if it's a marketing question I'm glad Maria go at it and I'll have a little bit pieces and if it's a business management operations kind of stuff then I'll go at it and you contribute when you have a little something to say you might have a lot to say but if we agree that we're going to kind of let the other one shine in a particular area but give the other space and go So, yeah, I actually have really something good to contribute I want to share so that we get a well-rounded thing, know, so we're not competing, but we are kind of compartmentalizing so that we can establish separate brands under one roof for our personal benefits while still serving the community really well. I think that that could work and just flow, especially because I'm not going to get offended that if you've got some great ideas, I'm going like, that's awesome, and I can have eyes.\n00:17:35 - Maria Gudelis (Maria Gudelis)\nYeah, yeah, yeah, I think that's, there's something there, yeah, I can't get my full hand around it of all the tracking, know, because I also don't want to fall down from it, you know.\n00:17:51 - Tina Marie (profitdriversinc.com)\nIt won't be hard, and we could ask Dan for it, but it won't be hard. It's really, all it is, is anybody that comes into us has to to be tracked once because the source tracking so they're either coming in from an ad that we did which we would be tracking where they're coming in from one of our personal links and we just need to make sure if we want credit for it right that each of those links are trackable so if you're you would just have one group or you could have multiple links and I would show you how to do it so that you know it and I could even set them up for you if you don't even want to touch it and just be like Maria this is it and we'll go do a test test like source right and make sure that they're tagged as came from Maria we'll just put Maria something like that right and then show you so then if that person makes a purchase we'll have to figure out how to how to do their reporting and the commission structure but for sure Dan would help with that and if he didn't do it for free I'd hire somebody to do it but high level does that really easily okay yeah that's one of the great benefits of it And if the community is in high level and the sales are in high level, it's all there. Yeah. So, yeah, it would actually be really not quite as simple as doing it without the tracking, but the tracking is not going to be difficult.\n00:19:17 - Maria Gudelis (Maria Gudelis)\nOkay. Well, that's cool. That's cool. So, and just on another note, when you brought up Designer, I shared screen real quick.\n00:19:27 - Tina Marie (profitdriversinc.com)\nI've been using it since 2016.\n00:19:29 - Maria Gudelis (Maria Gudelis)\nOh, yeah.\n00:19:31 - Tina Marie (profitdriversinc.com)\nLet me share screen right now.\n00:19:32 - Maria Gudelis (Maria Gudelis)\nSo, I don't, haven't used AI, AI, AI part. See that 2016, I created the e-commerce email promotions, like it's a product I used to sell, don't know, for like seven bucks, low ticket offer. that's really big. something's worth about it. Anyway, but yeah. and actually just the recent YouTube video that did really well, I made the product here, the 100 digital offers. So I made it obviously in chat should be T first and some of my own input. And then I used the template and just like put in my own graphic here of the screenshot. And then it's just super, super simple.\n00:20:20 - Tina Marie (profitdriversinc.com)\nIt's not as pretty as camera.\n00:20:22 - Maria Gudelis (Maria Gudelis)\nbut it did the job and I needed done like in about 10 minutes before I put it in the community. See, I bought, I haven't pinpointed it yet. Where is marketing master account? need to re send it to my school community. But anyway, so yeah, that's cool.\n00:20:36 - Tina Marie (profitdriversinc.com)\nI've done that. I want to share something with you too so you can see I need to feed it more data to this library.\n00:20:49 - Maria Gudelis (Maria Gudelis)\nBut what does Dan think? what we should be offering and all that stuff? he have any ideas input? Because sometimes I'm going to be honest, sometimes I get too confused. you know, when I start thinking about all the things, and maybe just because I'm not centered, because I haven't done my bible stuff here.\n00:21:07 - Tina Marie (profitdriversinc.com)\nMeditations are journaling this morning. I didn't ask him, but we could if you want to do, I think he is a massive Maria fan and Tina fan. So ask, ask, um, pretend you're a person that has a business question, fairly simple, um, about business operations or principles or strategies or even problem solving. Let's see how this AI does.\n00:21:42 - Maria Gudelis (Maria Gudelis)\nOh, um, how do I get traffic from YouTube marketing?\n00:21:49 - Tina Marie (profitdriversinc.com)\nI haven't, it will be my kind of content, like, um, just, just not marketing specific, like, um, what should I pay my stuff? hiring people, how should I choose what to work on? um, yeah, pretty much anything that's not marketing strategy specific.\n00:22:11 - Maria Gudelis (Maria Gudelis)\nHow could I get more productive in my business, family?\n00:22:40 - Tina Marie (profitdriversinc.com)\nI told you not to say, ah, would never say that.\n00:22:43 - Maria Gudelis (Maria Gudelis)\nLook at that. It affects hourly rate now for the game changer. yeah.\n00:23:12 - Tina Marie (profitdriversinc.com)\nNow, go make that magic.\n00:23:14 - Maria Gudelis (Maria Gudelis)\nYou got this.\n00:23:17 - Tina Marie (profitdriversinc.com)\nI mean, if for just being able to ask a question that that would give if somebody had never experienced that. Yeah, that we get them started. Anyway, so I haven't vetted all of my content yet, because you can only give it 10 files. So what I have to do, and I'm going to hire a VA to do this, is combine multiple transcripts into a single file, because it's not really, I don't know what the limit to the eyes of the files is, but I haven't anywhere near approached that. Okay, so just putting it into single files. And then I've also included the transcripts of testimonials from clients. Really long ones on YouTube that give details as to like what I can do for them. So anyway, yeah, just this. So I want to use this to when it's trained properly create short pieces of content for me based off of things I've already created and done. So if I want to pick a topic in any, I don't necessarily want to just use it as it comes out. For sure, I would edit some of these things all the time the struggle. No, that's no. Tell me your AI without telling me your AI that. But and take something, put some bones on it and go like, Oh, yeah, okay, well, tweet this, tweet this, even ask it a question because it's asking it from my library of vast library of information once I get all my calls in there and then be able to repurpose it according to okay well this is a Twitter post I wanted to and I know you can do threads on Twitter but if I wanted to make it shorter and make it like one line each so I can break it up into Instagram quotes and then go send it to a VA who plugs it into some images from you know really quickly there's like four and five dollar an hour VA is still that are good at Canva and I don't know if they're as fast as maybe eight or ten dollar VA's so that's an experiment I'm going to be playing with and I usually hire a couple people and just kind of try them against each other see what ends up being most profitable just because people are cheaper for our doesn't mean that they're cheaper for our. got it, got it. Yeah. So anyway, but yeah, um, what, what would help you get some clarity on the opportunity of what it would look like to do work together. Um, so that's, well, so that it's clear and then you can decide, do you want to put any mental energy into it or not.\n00:26:30 - Maria Gudelis (Maria Gudelis)\nUm, I think, I think just like, so we got the free community, right?\n00:26:36 - Tina Marie (profitdriversinc.com)\nIt can be free. It can be paid. It can be paid from, from the beginning, just low cost, like really low cost, but so that we know that we've got people who want to be there enough with their money, who have enough trust to pass over a credit card.\n00:26:54 - Maria Gudelis (Maria Gudelis)\nOkay, so it's almost like, uh, I kind of do this when I. Great offers for people who share screen. know you got to go like a little minutes. Share screen. It'd be sort of is one that I've done with us for I'm possible. So basically like customer journey map like like like these are different. So like you know step one was micro offer magic you know then or about social group and five so step one could be like a community five bucks month. Maybe we make it like one buck a month or five bucks a month or whatever ten bucks a month and then what in their customer journey what is it like what step to what's that offer there and like what are we thinking right like what so we can kind of yeah so so like and if I go I don't know who else I've done a few of these four. or community.\n00:28:03 - Tina Marie (profitdriversinc.com)\nSo I have a quick idea for that the first variation. think the first version is you come into the community and we both have free pieces of content that they can consume so that they can get familiar with us and just kind of have a place and we encourage just talking. So it's basically another version of an email list, kind of. We can communicate with them. But it's in a place where so high level has an app, I think. And it's like lead something, whatever. But it's mobile and they have magic links so that people can open some things right from their email and go straight to the paid member area. And I'm OK with using school and paying for that too, if they need me. for sure, we'd want to charge like $5 a month or something. The first level is, we're going to put in lots of our content, pre-existing content, and you have access to it, and then the second level could be also not very much, and it could be either, like for me, could be they get the profit time, energy maximizer, and maybe one of your products, that is a paid product, but low cost. In addition, we'll have weekly meetings and you can show up to it, and so we maybe put the recordings in the free group, but they don't get to ask questions unless they're in the paid group, or in the like the five dollar month group, they get recordings, and let's say $20 or $40 a month group, you can come in and ask questions and we will answer your questions. So, the lower level group is you get our content, not our time. The next level up is you get our content and our time. And the next level up could be something much more high level once we figure out and we start talking to people.\n00:30:07 - Maria Gudelis (Maria Gudelis)\nGood.\n00:30:09 - Tina Marie (profitdriversinc.com)\nelse are you going to go get 20 year veterans in business, women, know, that have been online veterans. It's not very, it's not easy to find.\n00:30:24 - Maria Gudelis (Maria Gudelis)\nNo, I know I'm going to have an analyze them and I probably should join their community.\n00:30:29 - Tina Marie (profitdriversinc.com)\nIf I go to school discovery.\n00:30:32 - Maria Gudelis (Maria Gudelis)\nThere's one woman that. I imagine in this grandma is making a lot and has all these people in that community. It's really right at the top of your digital growth community. It's number one for engagement and yeah, she's got. You know, you you you know, to build a daily pay customer base digitally.\n00:31:06 - Tina Marie (profitdriversinc.com)\nYeah. 39,000 members and what's the cost?\n00:31:10 - Maria Gudelis (Maria Gudelis)\nThis one might be her free group, let's see, proven six-figure.\n00:31:13 - Tina Marie (profitdriversinc.com)\nsays paid.\n00:31:15 - Maria Gudelis (Maria Gudelis)\nWhere? Right there. yeah, but here, because there's joint group, okay. So, yeah, what email did you use to purchase? Okay, so she's then selling it via sales page, okay. Only how people to pay the joint here, live weekly mentoring support, giving monthly networking events, zero of six-figure online is six months. That's her promise. She looks really good, actually. That's fine, I don't know her name is. Payment methods. Are you saying that?\n00:31:43 - Tina Marie (profitdriversinc.com)\nwhat's right there.\n00:31:44 - Maria Gudelis (Maria Gudelis)\nAre you early, 423? And she's new system IO, isn't it, she's system Ha ha. That's her name. And she has any love us?\n00:32:00 - Tina Marie (profitdriversinc.com)\nHow many do you have math real quick? 39, what was the note was 47? Yeah, so 39,000 times 47. That's 829,000 a month.\n00:32:15 - Maria Gudelis (Maria Gudelis)\nHoly crap.\n00:32:17 - Tina Marie (profitdriversinc.com)\nAnd it's more than that because it's almost 40,000.\n00:32:22 - Maria Gudelis (Maria Gudelis)\nSo road map to attract daily pay customers digitally, build an impactful email list, create a well-known brand and proven six figures in six months formula.\n00:32:36 - Tina Marie (profitdriversinc.com)\nSo my thing about wanting to do this stuff together is that both you and I have gone to the point where, and because we can still, like I said, have our separate stuff and feed it so that you're not risking building everything around me. And vice versa, not that I'm even worried about it, but that's just this smart thing to do because anything can happen, right? But the roadblocks that both of us will have, we'll get to them so much faster. We'll doing something together. And I mean, I'm all about leverage. To me, it would be so leverage because we have different skill sets, but we have very similar skill sets too. And one of them is so few people just show up and work all the time. And I don't mean all the time. don't actually work all the time, but I show up every day. I move the needle every day. lot of people, most people honestly, really don't do that. I've worked with tons of people. There's a lot of inconsistency, even with high-level performers, because they burn themselves out. so it cycles a burnout. I don't get burnt out. I don't let burnout happen to me. Because I nap. A lot. I can nap three times a day. I will nap three times day if that's what it takes. You feel good. I take time off. I take little trips like so and I don't work long hours, but yeah, I do show up consistently. I pay for help. I pay for good help. I train good. Most people pay for help. And then they don't train well. And so it's not useful. I'm not getting any help. I dig in and I get to thorough training quickly. Screen sharing, video sharing, then so we're doing it together. I'm showing you and then you tell, you show me that you can do it. And then you go be released to do the work. And we have constant communication and feedback. So like, some people, most people abdicate.\n00:34:41 - Maria Gudelis (Maria Gudelis)\nI delegate. Yeah.\n00:34:44 - Tina Marie (profitdriversinc.com)\nand they think that they're delegating, but they're abdicating anyway. And now your brain is always considering about marketing and offers. I hate starting there. also, you, yeah, I mean, you just love the part that I like.\n00:35:00 - Maria Gudelis (Maria Gudelis)\nto go about a lot.\n00:35:03 - Tina Marie (profitdriversinc.com)\nAnd I think where you have friction is clarity and should it be this or this and also anchoring because if you're trying something every month and that's your habit that I know that it's just your tendency to kind of bounce around. So what you would need support with is how does your spirit get the freedom to explore? Because obviously that's important to you. Without that sabotaging what you're already doing by distracting you too much. You get to play and get that outlet but you've got somebody helping you go okay. Now that you've played you have to make a decision. Do you keep playing there or can you bring something back to here because this is what you chose first or are you switching and if you're switching be real clear about why you're switching and make sure that it's aligning with your values because Sometimes we need permission to switch, and we give ourselves permission, right? Sometimes that's the thing to do too, but that logical conversation, I can have in my sleep. Yeah. You get really clear and really confident and peaceful, because that's the part that slows things down is trying to figure it out, you know, do what I want to do and don't I want to do it. And the usually it's a why, but sometimes that why is not very clear. And so the probing questions that have you get to that why, that's what I'm really gonna add.\n00:36:35 - Maria Gudelis (Maria Gudelis)\nOkay. Okay. I love based on what we just saw. I think we just have one community that's a little ticket, maybe start at $5 and bring it up to $47 and be like that girl. Like I think we just saw maybe a path.\n00:36:49 - Tina Marie (profitdriversinc.com)\nYeah.\n00:36:50 - Maria Gudelis (Maria Gudelis)\nSorry. Between the two of us like there's like, yeah, like people get so much value out of it.\n00:36:57 - Tina Marie (profitdriversinc.com)\nThat's what I was thinking something about too is just starting. really level and bringing it up and be like, okay, the price is increasing, the price is increasing until we get to kind of a place where the conversions drop and we keep increasing it. That way we can get numbers in because there's nothing like an empty group trying to talk to an empty group. And then we learn as we grow, but I think that that's the rocket fuel is getting the people to come in and tell us how we can serve them that were already attracted to us for whatever reason at a low level cost. And then we serve them really well and we can let them be grandfathered in or say, you get this price for this next year, but for this year, you know, but next year we're raising prices because in place and whatever, nobody, yeah, groceries don't get it locked in, rent rarely doesn't like occasionally, but most things in class. Yeah. got it. So I think the next steps would be to to kind of create like a very simple map like that, right? what the offer is and what the content would be. So like, I think if I have that profit time, energy maximizer to serve to the community, I feel like you think number one, I feel like I've brought a valuable contribution that earns whatever my low level portion of it is, right? And I'll keep bringing it. You bring something of yours. And but that's impactful that you know that they're going to go. Something is going to be they'll have an aha moment or something tactical that they can implement right away, but not your best stuff, right? And then we just put together an offer put together some graphics and images and start piping people in for $5 the first time for like, and Honestly, we'll see that the issue with school is that there's a few issues. First of all, people can very easily see how much you're making and how much money you have because of how many people are in your group and what your paid price is. Yeah, that's just one thing. Competitors, whatever. There's that. School does pipe people in, but you can only charge one price a month per group. So if you raise the price, you can't let one group. If you charge it through school, so what she did was she charged off-site and let them in for free or however it worked out, but because school only lets you charge one price per person. So if you say it's $5 for you guys, but it's $35 for you guys, you can't do that.\n00:39:58 - Maria Gudelis (Maria Gudelis)\nSchool, I'll let you do that.\n00:39:59 - Tina Marie (profitdriversinc.com)\nSo anyway... We would just have to figure out the tactical approach around that and she does it, which is charging the money off of school and then letting them into it.\n00:40:10 - Maria Gudelis (Maria Gudelis)\nSo, yeah, stuff to think about, yeah, all right, we'll have fun. Okay, you're going to your, your study?\n00:40:24 - Tina Marie (profitdriversinc.com)\nNo, I'm late, it's a missionary training, but they record it so I can still get it.\n","contentPreview":"00:02:00 - Tina Marie (profitdriversinc.com)\nYou Thank you. Hi, how are you?\n00:04:31 - Maria Gudelis (Maria Gudelis)\nHow are you?\n00:04:33 - Tina Marie (profitdriversinc.com)\nSleepy. I'm not fully aw...","processedAt":"2025-05-04T03:40:52.572Z"}