{"fileName":"Done Transcript for Basis Integration_Sweet Law(3).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Basis Integration_Sweet Law(3).txt","type":"transcript","priority":"medium","content":"00:00:03 - Tina Marie (profitdriversinc.com)\nCan you hear me? Yeah. So did you said to say hi?\n00:00:08 - mark sweet\nYeah, they are COVID. So he's having fun.\n00:00:11 - Tina Marie (profitdriversinc.com)\nThat's what he said.\n00:00:12 - mark sweet\nWell, everybody but him. For now, you know how that goes. We know where this is going.\n00:00:19 - Tina Marie (profitdriversinc.com)\nYes. He is awesome.\n00:00:23 - mark sweet\nYeah. Yeah.\n00:00:24 - Tina Marie (profitdriversinc.com)\nYeah. Thank you for that. If Dr. B is anything like that, then I would really love to do that. No, no, no.\n00:00:32 - mark sweet\nNo, I wish. But now.\n00:00:38 - Tina Marie (profitdriversinc.com)\nHi, Dan. Hey.\n00:00:41 - mark sweet\nHey. Okay. Before we jump into a bunch of stuff, I just want to get some clarification on a couple of things before I forget. Okay. This is more Dan related than anything else. Okay. Valiant, TRG, et cetera, et cetera leads. Those are now no longer going to HQ intake, right?\n00:00:59 - Dan’s iPhone (danddcompany.com)\nYes. And after they are no longer going there. Okay. Yeah, so only thing going there now are like. I can confirm this, but it's like 50% roughly of. One of five. And then, and then leads, and then leads when they're 96 hours old.\n00:01:24 - mark sweet\nOkay.\n00:01:25 - Dan’s iPhone (danddcompany.com)\nWhich we could turn off.\n00:01:27 - mark sweet\nYeah, the quantified there still getting the same content information we are. So we had the scene where we're both calling the same person again.\n00:01:35 - Dan’s iPhone (danddcompany.com)\nI don't know how that's happening. They're saying that. They're only sending them to us. So. Stend over like the most recent emails of those people because we'll have to trace. The zaps and the automations and see if there's something, something must be up somewhere. or quantifies some of us still sending them there, but they said they weren't. I mean, I saw her response and she said, she's only sending them to us.\n00:02:11 - mark sweet\nYeah, you know, SEC, Eric, too, we're just you.\n00:02:15 - Dan’s iPhone (danddcompany.com)\nYeah, yeah, yeah.\n00:02:18 - mark sweet\nIt's just, it's creating some friction and knowing that we're going to be pulling some leads. I don't want create more friction. Yeah. So if we have to just switch all quantified just to them, so be it.\n00:02:31 - Dan’s iPhone (danddcompany.com)\nSure.\n00:02:32 - mark sweet\nBut the quantified cost per lead is shockingly low, like solid. There's some issues we got with some clients who were like, oh, I thought I was doing something else and I don't want to move forward, but that just happens. But again, given the amount.\n00:02:53 - Dan’s iPhone (danddcompany.com)\nThey convert.\n00:02:55 - mark sweet\nThey convert and their cost per position is low. So now it's like doing also one. And now try the Utah thing again and with just them.\n00:03:06 - Dan’s iPhone (danddcompany.com)\nThat would be a good way to start.\n00:03:08 - mark sweet\nRight, because we already now have it where the Utah do this before that's just signing cases. Right. And that was their big issue.\n00:03:17 - Dan’s iPhone (danddcompany.com)\nRight.\n00:03:17 - Tina Marie (profitdriversinc.com)\nChocker.\n00:03:20 - Dan’s iPhone (danddcompany.com)\nThat's not cool. He can do it.\n00:03:21 - Tina Marie (profitdriversinc.com)\nI'm like, oh, really do.\n00:03:25 - Dan’s iPhone (danddcompany.com)\nReally? Come on.\n00:03:27 - mark sweet\nWell, yeah, so I might try to do that because I don't think it's going to cost me more than a couple of grand a month.\n00:03:34 - Dan’s iPhone (danddcompany.com)\nRight. And it can just sort of seed that pipeline at least get, right? Because the next thing is, how does that dude handle a case, right? unfortunately, you're not going to be able to see how he manages it. But here's the benefit. It's Salko's thing. So if it doesn't go bad, you know who's going to freak out. It doesn't go good.\n00:04:01 - mark sweet\nI mean, he'll lose his , which is perfect Because I'm wondering if we should just switch back and just have HQ intake just Oh, and then just do all quantify including Utah yeah, and that way there's not I mean, I don't they seem to do particularly well with those leaves.\n00:04:32 - Dan’s iPhone (danddcompany.com)\nI don't get it But that is Certainly the way it looks right.\n00:04:36 - mark sweet\nI'm sure if we dove into the map it would back it up Right.\n00:04:39 - Dan’s iPhone (danddcompany.com)\nI don't understand it, but it is what it is Right, and some things don't need to be fully understood I mean, that's that's a simple fix. mean then we don't even need to figure out what's wrong Yeah, we should do that Texting her grin Well, we're actually Stacy. I can't sit at air because I mean, we get lost, but I know he's not super busy, so.\n00:05:13 - Tina Marie (profitdriversinc.com)\nSo will HQN take be doing any other leads?\n00:05:18 - Dan’s iPhone (danddcompany.com)\nThey do the 96 hour old leads.\n00:05:24 - mark sweet\nAnd the Sunday leads?\n00:05:26 - Dan’s iPhone (danddcompany.com)\nYeah. Yeah. So, yeah, they still got leads.\n00:05:35 - Tina Marie (profitdriversinc.com)\nWhat's that volume?\n00:05:37 - mark sweet\nSunday?\n00:05:39 - Tina Marie (profitdriversinc.com)\nWell, and they're core.\n00:05:42 - Dan’s iPhone (danddcompany.com)\nThe 96. Yeah, the 96 has even been on a week. So it's hard to say. It used to be 72, but there's no point. We can't really go back and figure it out. So, we'd have to look at it going forward. forward and I don't know what it will be, but when they send over a report, if we look at when the 96 got turned on, I'll confirm with Eric, then it will be, you know, well, I guess, if we make this change today, so we'll have to use today as the date, or the date when Eric says, so hopefully it would technically be probably tomorrow. So if he makes up the today, tomorrow becomes quantifiable and 96, then, and Sunday, if we wait a week, pretty much whatever that number is next week is probably the number other than adding a Utah, which may or may not happen this week, but it'll be in the neighborhood. so who is the attorney for Utah?\n00:06:59 - mark sweet\nNo, it's his name. I don't know if I'm top of my head.\n00:07:02 - Dan’s iPhone (danddcompany.com)\nNot me either. Saka's buddy.\n00:07:06 - mark sweet\nYeah.\n00:07:07 - Dan’s iPhone (danddcompany.com)\nMachine comes up as So good name. Saka's buddy.\n00:07:13 - Tina Marie (profitdriversinc.com)\nBecause I don't. Oh, yeah, we did.\n00:07:16 - mark sweet\nOkay. So he started. I want to say it's Brad.\n00:07:20 - Tina Marie (profitdriversinc.com)\nThis.\n00:07:21 - Dan’s iPhone (danddcompany.com)\nOh, great.\n00:07:25 - Tina Marie (profitdriversinc.com)\nI forgot about that. Yeah. haven't talked about it, but I, you started in like December, right? Somewhere around there.\n00:07:34 - mark sweet\nYeah. was very bad.\n00:07:38 - Tina Marie (profitdriversinc.com)\nHow's it going now?\n00:07:39 - mark sweet\nLike, I don't see. We stopped because it was very, very, very bad.\n00:07:45 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:07:46 - Tina Marie (profitdriversinc.com)\nSo what's changed that we're going to be doing this now?\n00:07:50 - mark sweet\nOkay. Now he lets us sign for him. The issue before was he wasn't picking up. the phone, they weren't good on intake. They weren't good on intake.\n00:08:07 - Tina Marie (profitdriversinc.com)\nOkay.\n00:08:08 - mark sweet\nAnd so now we're able to walk around that issue, I guess, for lack of letter term, if we can just sign it up and if it drops it, it is what it is. The only sign like one or two cases, I haven't heard anything about how they're going. I'll be lucky if I break it even on those.\n00:08:28 - Tina Marie (profitdriversinc.com)\nThen what is the purpose of being there?\n00:08:32 - mark sweet\nBecause we spent 17,000 with Walker, quantified it significantly cheaper.\n00:08:39 - Tina Marie (profitdriversinc.com)\nOkay. So was break even, but now you think it could be profitable?\n00:08:46 - mark sweet\nIf we only sign, but you might be break even. Right. But here, we're like under two granted case.\n00:08:55 - Tina Marie (profitdriversinc.com)\nOkay.\n00:08:58 - mark sweet\nSo. If again, better.\n00:09:05 - Tina Marie (profitdriversinc.com)\nOkay. I'm looking at that. got to refresh this report. The Dan DD intake. Dashboard. Okay.\n00:09:24 - mark sweet\nHe goes to quantify or something. Smaller ones work. This is a way we can expand it more. He's back. Yeah.\n00:09:39 - Tina Marie (profitdriversinc.com)\nWhich one is quantified?\n00:09:40 - mark sweet\nIs that blue steel?\n00:09:46 - Tina Marie (profitdriversinc.com)\nAll right. Well, speaking of Actually, sorry, Mark, were you, did you discuss other things that you wanted to get to first?\n00:09:53 - mark sweet\nThat was kind of the main thing.\n00:09:58 - Tina Marie (profitdriversinc.com)\nOkay. So. Um, report updates. Dan, do we have any?\n00:10:05 - Dan’s iPhone (danddcompany.com)\nThat's a Stacy question. So she, she sent over the stuff that you sent. So probably not.\n00:10:12 - mark sweet\nmean, so she sent it over.\n00:10:15 - Dan’s iPhone (danddcompany.com)\nOkay. finished all the others. All the other stuff was done, but the stuff that you that we came up with last Monday, have not, he hasn't, he hasn't updated us on that. So there's probably no update.\n00:10:27 - Tina Marie (profitdriversinc.com)\nOkay. All right. Um, let's go look at this. Oh, yeah. That was my. Oh, no, haven't met with. So, okay. I'm meeting with Lauren's Wednesday. Um, and, but I talked to you Thursday instead of Monday. So, okay. I don't have anything new to report there, obviously.\n00:10:54 - mark sweet\nUm, this week, I'm doing a San Diego run.\n00:10:58 - Dan’s iPhone (danddcompany.com)\nYeah. Yeah.\n00:10:59 - mark sweet\nWhat? I'm What's in Sano Sacramento?\n00:11:02 - Dan’s iPhone (danddcompany.com)\nSan Diego.\n00:11:04 - mark sweet\nwouldn't love any of your cases. We've actually done really, really well with them. We just, I get your boy, Zach.\n00:11:15 - Dan’s iPhone (danddcompany.com)\nZach, come on buddy.\n00:11:17 - mark sweet\nI know.\n00:11:19 - Dan’s iPhone (danddcompany.com)\nAlthough he did tell me that like, he said that. Look at what he said. I should hit him up.\n00:11:27 - mark sweet\nHe's running the same issue. more buddies. Like he would like to send me cases. He just doesn't have a lot coming through.\n00:11:36 - Dan’s iPhone (danddcompany.com)\nRight. And but I can't remember if he knew whether or not they already had a lawyer or it was too late.\n00:11:45 - mark sweet\nI wonder if we should.\n00:11:47 - Dan’s iPhone (danddcompany.com)\nWonder if we should look at his stuff and be like. What are the issues. Like, hey, what is the status, right? car accident, right? Obviously would. Look at the ones that were car accident and then say, okay, have a lawyer, don't have a lawyer, have a lawyer, obviously, we'd be like, I'm just I know you. And then the other one would be don't have a lawyer. And then is it too late? It's probably the case is what, but I don't know. And what are the odds he's collecting all this data? I'll let him buy me some beer and then tell him how to run this business.\n00:12:32 - mark sweet\nHe said he turned everything AI in his office. So you're not even a front desk person anymore.\n00:12:39 - Dan’s iPhone (danddcompany.com)\nNice. Yeah.\n00:12:43 - mark sweet\nIt's interesting.\n00:12:53 - Tina Marie (profitdriversinc.com)\nThe ads are the automation. How's that going? All We're going to do.\n00:13:00 - Dan’s iPhone (danddcompany.com)\nDo that? don't know if we were actually doing that.\n00:13:02 - Tina Marie (profitdriversinc.com)\nAre we not?\n00:13:04 - Dan’s iPhone (danddcompany.com)\nI don't know. I don't remember if we said to do it, but if we are, it's going to go. We're going to do it. Eric's back. So Eric was on the town. So I'll queue it up. We probably put that live today too.\n00:13:18 - Tina Marie (profitdriversinc.com)\nWould there be any reason we would not do that?\n00:13:22 - Dan’s iPhone (danddcompany.com)\nI don't remember. I don't remember talking about it. I was like, he asked me. Are we doing it?\n00:13:29 - mark sweet\ngo, I don't think we talked about it.\n00:13:31 - Dan’s iPhone (danddcompany.com)\nAnywho.\n00:13:33 - Tina Marie (profitdriversinc.com)\nOkay, so that was still.\n00:13:35 - Dan’s iPhone (danddcompany.com)\nWe are doing it, apparently. I don't remember saying we were doing it. I remember pitching it, but then I was like, Oh, it was pitched and approved.\n00:13:46 - Tina Marie (profitdriversinc.com)\nMy notes say Dan can create an automation that is the answer of the automation and see what happens. No. No. Let's see. So that we can now intake and close. I certainly can close.\n00:13:58 - mark sweet\nI think her issue was.\n00:14:00 - Dan’s iPhone (danddcompany.com)\nearly when each doing take wasn't good oh yeah so we killed that that got killed on Friday too so we can now make one because all ads certainly leads as of Saturday well other than Sunday right there's still that Sunday thing but the vast majority of ads certainly leads we can now segment into their own automation we'll do that three calls in an hour yada yada yada and then they're gonna they're like they want to get out of washington they're like you guys for whatever reason washington isn't working but new mexico is so they're like we're gonna focus more on new mexico's and that's fine i'm not really hmm i'll have some with it you talk well we don't need that now no no no don't don't yeah i'm not just like just we to try to make some side money basically i don't want to be a mean focus yeah if we've got any that are very cost efficient for lower volume which is what we're seeing\n00:15:04 - mark sweet\nYeah.\n00:15:07 - Tina Marie (profitdriversinc.com)\nWhere is the doctor report?\n00:15:09 - mark sweet\nWas it America that's working on it? Yeah, you should be sure it on it.\n00:15:15 - Tina Marie (profitdriversinc.com)\nI mean, I'm going with share with me. I wish I know I've seen it, but I don't. I got to start it so I can. Do you know what it's called? No.\n00:15:37 - mark sweet\nI would assume like doctor map or something.\n00:15:40 - Tina Marie (profitdriversinc.com)\nYeah, I just looked up doctors and share with me.\n00:15:43 - Dan’s iPhone (danddcompany.com)\nI swear Google Drive sucks when you search for stuff.\n00:15:46 - mark sweet\nYeah, it really holds. It's list. 2023 to present.\n00:15:51 - Dan’s iPhone (danddcompany.com)\nYeah. It's cool.\n00:15:55 - mark sweet\nDrive definitely needs a little more.\n00:16:03 - Tina Marie (profitdriversinc.com)\nYeah, so let me send you an email asking you, or I can ask you, and America, I don't know. But I would like to see that and then I'm just going to bookmark it make sure it's in a place where I can see it all the time. See Mark. Mark.\n00:16:27 - Dan’s iPhone (danddcompany.com)\nI can't find it either.\n00:16:34 - Tina Marie (profitdriversinc.com)\nYou want to CC America just sent you.\n00:16:42 - mark sweet\nI'm going to give her control that part. What's her email should pop up that America.\n00:17:00 - Tina Marie (profitdriversinc.com)\nI get is the American now lines coming up. Okay. I'm very different. Yeah.\n00:17:20 - Dan’s iPhone (danddcompany.com)\nEric looked at that that you sent over and they got sent to each cube because. The 96 hours it expired. So there's got to be. We have to look at it like we need to figure out a way to know for sure. Either they both hit and contact the person on the same day.\n00:17:43 - mark sweet\nBut like we signed her before.\n00:17:46 - Dan’s iPhone (danddcompany.com)\nRight. So that means we need some sort of. So why didn't we see it as them being in contact? There's something we have to figure out. It should. a band that they were in pending contact or and then they didn't advance so we just need to figure out a way to go oh we're talking to them right um that should be pretty it's pretty cool i mean anything else i'm pending contact yeah i think a lot of times they just leave a person in pending contact but well we can let me look at it and then we can yeah what looks at it what was that i was reading i was sending up that emo who's the eric looked eric looked at that thing that even though we don't well we still need it for the 96 hours but the one that mark was like hey they double contact with them we figured out it's because it got sent to them but it technically should know but the question is how do we stop that in the future but i'll bet they're all like that yep yeah so it's like um We just got to find a signal we can use.\n00:19:08 - Tina Marie (profitdriversinc.com)\nSo is the error happening on a technology level or an intake level?\n00:19:14 - Dan’s iPhone (danddcompany.com)\nLike people, yeah, it's a people, yeah. So process, it's like a process issue, right?\n00:19:25 - Tina Marie (profitdriversinc.com)\nSo how are you solving that?\n00:19:28 - Dan’s iPhone (danddcompany.com)\nI don't know yet.\n00:19:29 - mark sweet\nI'm going to talk to you about making sure that we're only leaving pending contact when we haven't talked to them.\n00:19:37 - Dan’s iPhone (danddcompany.com)\nSo Eric is saying that that's what's happening. They are leaving them in pending contact. So we just got to, I'll double check it all, but then it just might be, hey, if you're working a lead, you got to move it over and then it would be 96, then we'd come up with the different rules. So it'd be 96 hours in pending and then from working, but maybe we're not.\n00:20:00 - mark sweet\nwe never move them. Yeah, as long as it's working, then we don't need to move it because that means we've gotten.\n00:20:05 - Dan’s iPhone (danddcompany.com)\nYeah. He's saying that's the problem. They are not moving it.\n00:20:10 - mark sweet\nOkay, I will talk calling people that your entity team is already working with because of this. Okay, got it. And so they're like, well, she's not there.\n00:20:49 - Tina Marie (profitdriversinc.com)\nOkay. um, No, I ran it down. So Patty's back from vacation. She hasn't left with the baby yet. When she leaves, it's going to be six months. I don't think that I wrote down when she's leaving.\n00:21:03 - mark sweet\nTwo weeks.\n00:21:04 - Tina Marie (profitdriversinc.com)\nThat's the same thing. Okay. When that's that. Like 24 or something.\n00:21:17 - mark sweet\nBasically, I'm on.\n00:21:18 - Tina Marie (profitdriversinc.com)\nAnother month. Okay. So, um, did you guys work on the intake script?\n00:21:28 - mark sweet\nAnd we're going to meet today to go through it a little bit more.\n00:21:41 - Tina Marie (profitdriversinc.com)\nWhat's the level of progress? Do you think out of like?\n00:21:45 - mark sweet\ncloser. I just, they have the basics of the script. I just want to work on our. Objections, I guess.\n00:21:57 - Tina Marie (profitdriversinc.com)\nYeah, that's important. Good afternoon. Anything that's a friction point should, like, you want to thoroughly, basically create as many guardrails as possible that your team can recognize, oh, this is the friction point, this is the trigger, therefore this is the response or the way that I need to handle it, and then, like, if they're not really good at doing it consistently, maybe some type of role play activity, because call control and call flow is, you can't script everything, but that practice and that immediate feedback of, okay, this is how you should handle that, this is how you should handle that, creates this muscle memory, but also creates confidence that they may not. don't have in dealing with something, because there's so many different things to process, the person on the other end, energy, their tone, what experience they had, your person, the mood that they're in, all these different things. So you want to try to make things as reflexive as possible where they don't even have to think about it. They know how to recognize this situation gets this response so that it just becomes habit and reflex. But you want everybody to have the same reflexes and obviously there's a, there's skill, you know, there won't be perfect consistency across the board, but it can be engineered to be probably a lot better, but I haven't listened to the calls. I actually keep reminding myself to do that. have to log into lead flow, but I don't have a lead flow rate access yet, I think. is my issue. Hold on a second, let me check. Dan, that's what it's called, right? Lead slowly, that's what I would look at, login security code. I did get that. Okay, I care to login. Okay, so that's what I want to do so that I can kind of add some feedback to that. Because managing call flow is something I've had lot of training and experience and it's been a long time in the corporate world, but it all, it's all the same for the most part.\n00:24:34 - Dan’s iPhone (danddcompany.com)\nOkay, it is all the same.\n00:24:36 - Tina Marie (profitdriversinc.com)\nYeah, people being people. Okay, you guys are working on that. Do you have anybody on the NTA team that, I mean, when's last time you listened to NTA calls?\n00:24:54 - mark sweet\nWell, I mean, I'll go and sit and listen to them, but to actually like to sit and go through the recording step by step is going to walk.\n00:25:00 - Tina Marie (profitdriversinc.com)\nWanna buy a while? Six months. Okay, that's not that bad.\n00:25:08 - Dan’s iPhone (danddcompany.com)\nIt's been a year for me.\n00:25:13 - mark sweet\nBecause it was like December, January that I got ticked off and that's where it's been about six months. Right. when it comes to my digging instead.\n00:25:23 - Tina Marie (profitdriversinc.com)\nLet me go back. Where do I have the intake team written down? Used.\n00:25:30 - mark sweet\nOh, so just the sort of an FYI will pass these out. splitting our role in two.\n00:25:35 - Tina Marie (profitdriversinc.com)\nYeah, you told us that last week. I got that.\n00:25:40 - mark sweet\nFeel comfortable with that at least.\n00:25:42 - Tina Marie (profitdriversinc.com)\nThat is good. Between I wrote it down, I just looked at it. So, but yeah. Um, so who, who, oh, I'm Maria Mia. Who is there anybody else besides those, those two want to take?\n00:26:07 - mark sweet\nThat are going to be running it now.\n00:26:10 - Tina Marie (profitdriversinc.com)\nOkay. So they're running it for her. Okay.\n00:26:15 - mark sweet\nthink we had a Zavato Marco, Jalissa Jose.\n00:26:26 - Tina Marie (profitdriversinc.com)\nWhat was the first name before Marco?\n00:26:27 - mark sweet\nA Zavato?\n00:26:29 - Tina Marie (profitdriversinc.com)\nA Zavato? Okay. And. How long? Let me see because I'm going to just go put this in my spreadsheet with the firm. Name this. This intake. How long has each one done working with you? Yeah.\n00:26:54 - mark sweet\nUh, me has got to be on like here. Three or four at this point. Maria has been with us for at least a year. She's the only one with a college degree and she's a very detailed specific, so she's going to be good at breathing the biles. Jelissa's been with us for about a year and a half, she's going to law school next year. Jose has been with us for eight months, I think. Marco's been with us for close to a year. Is all those new? think he's on month three.\n00:27:36 - Tina Marie (profitdriversinc.com)\nWell, let's see. Marco was how long. As well, though. One three, you said.\n00:27:53 - mark sweet\nYeah. Yeah, he knew.\n00:28:00 - Tina Marie (profitdriversinc.com)\nAnd then Patty, and stay one. Right.\n00:28:08 - mark sweet\nNo.\n00:28:11 - Tina Marie (profitdriversinc.com)\nNo.\n00:28:14 - mark sweet\nShe's been around since 2019.\n00:28:20 - Tina Marie (profitdriversinc.com)\nOkay. So, let's see what's. So, I know when I last updated this. If you can rank them. Scale one to 10. How would you write each of them? One being the worst.\n00:28:45 - mark sweet\nYep. or anything specific.\n00:28:48 - Tina Marie (profitdriversinc.com)\nI mean, we could, we could write them according to certain data types. If that would mean the more information I have about them, the better. And the more ways that you're. evaluating them and looking at them the better.\n00:29:03 - mark sweet\nYeah, so let's use Jose because he's kind of the most polarizing one. Okay, he's very good at closing on the phone, but he is not reliable, not detail oriented, and can't rely a lot. The next one, let's go to Jalissa. She's smart, but she's just here for a paycheck now and she's going to law school. So she does her job, she doesn't do anything beyond her job. She's mid-level, I guess I would say. She understands what to ask and kind of understands what clients are doing, but not around for a long time so she knows what she's looking for and she's developing a pretty good gut of like what cases to take which ones not to take which is good. Still needs work to help though on closing cases. Azvaldo is new so he's still just trying to make sure he figures out you know what we're doing. Not a slight on him it just takes time of course. But he wants to learn he wants to listen to calls so he's you're going learn to get better. Marco is like a B plus decently on closing cases could be a little bit more aggressive on the phone and a little bit of a lack of detail. And then Patsy I think we kind of all know where she's at. Again I think she's a little weak on closing cases but she's pretty good on what's taking what not to do. And then Maria is only one I forgot. Maria is very detail-orienting, weak on the phone or weaker on the phone, I should say. She's much more about order taker.\n00:31:23 - Dan’s iPhone (danddcompany.com)\nNow you know who's calls to listen to Tina, and in what order? Although, actually, you can't tell who's remembering.\n00:31:31 - Tina Marie (profitdriversinc.com)\nYou to learn their voices. I'm pretty good at that. Let's see. Okay, so you gave me those details, which are really great, but now I would like you just to write them overall scale of one to 10. Go Patsy first. Let's give her a seven. Maria.\n00:32:00 - mark sweet\nFive.\n00:32:01 - Tina Marie (profitdriversinc.com)\nYeah.\n00:32:04 - mark sweet\nSix.\n00:32:06 - Tina Marie (profitdriversinc.com)\nJelissa. Five. Jose.\n00:32:15 - mark sweet\nHe's anywhere between the two and a thing.\n00:32:19 - Dan’s iPhone (danddcompany.com)\nI really do. think on the day.\n00:32:23 - Tina Marie (profitdriversinc.com)\nI don't know.\n00:32:25 - Dan’s iPhone (danddcompany.com)\ndepends if he's had a snack or not.\n00:32:29 - Tina Marie (profitdriversinc.com)\nOh my god. Does he show up You might want to include that information. Yeah. Okay. Okay. Part is to replace and take people by the way that we've had this conversation but it's been a while.\n00:32:53 - mark sweet\nThey get burned out.\n00:32:55 - Tina Marie (profitdriversinc.com)\nreally don't want to do it. Yeah. Okay. Marco. Hello.\n00:33:02 - mark sweet\nMarco, I would say six and a half.\n00:33:11 - Tina Marie (profitdriversinc.com)\nOkay, although it's still new, but let's rank him as a newbie. As far as like previous new people.\n00:33:20 - mark sweet\nI mean, if I got to just put him on a scale, I put him at a, you know, a four. I think knowing that he's new, I would put him closer to, you know, the sixth, seven range. I think he could be the long term.\n00:33:34 - Tina Marie (profitdriversinc.com)\nFor six. That's, that's good. No, wait that. Um, whoa. Hate when I click on something and Excel about like disappears. I'll use my place.\n00:33:50 - mark sweet\nRight. But obviously those are, yeah, some swings there.\n00:33:55 - Tina Marie (profitdriversinc.com)\nhmm. Mm hmm. Mm hmm. Okay, I'll just ponder that for a while, because that's the only thing that my brain can do right now, and that would be not a fun conversation, because I wouldn't be talking, I would just be thinking. Okay, I'm going to think about that. Let's see.\n00:34:18 - mark sweet\nThey're highly incentivized at their goals so they're definitely motivated that way, but the one thing I do like about them is, they don't try to twist cases to try to design it just to try to have a goal.\n00:34:33 - Tina Marie (profitdriversinc.com)\nGood.\n00:34:41 - mark sweet\nBut their incentive is all tied to each other right so it's a team goal because when we try to do individual night, it became problematic of who signed what because look at the people talked to a client. So it just, it was just better to do a team goal. It cuts down on. on the issues significantly.\n00:35:02 - Tina Marie (profitdriversinc.com)\nIs there, and this is just things to contemplate for maybe some kind of separation and reward for individual performance, like even just, and because I have to think about how we can do this, obviously the HR rules and the things that you can specify and can't, but just punctuality, like is there anybody that's chronically late or leaves early or not back from lunch on time, things like that where you can, rather than penalize, just reward people for never being that or that type of Yeah, I honestly don't dig into that as much as I should.\n00:35:55 - mark sweet\nThey're generally there when we're supposed to be within five or 10 minutes. So the only one that we've got issues with this goes in.\n00:36:15 - Tina Marie (profitdriversinc.com)\nSo do they, they're not salary that early, right?\n00:36:19 - mark sweet\nSo they, they log in. Correct, except pass it.\n00:36:22 - Tina Marie (profitdriversinc.com)\nYeah. Do you ever look at their login reports?\n00:36:29 - mark sweet\nNo. I mean, they come in, they have to scan their thumb. So I know when they're here, but, you know.\n00:36:36 - Tina Marie (profitdriversinc.com)\nBut you've never reviewed their login reports.\n00:36:39 - mark sweet\nOnly if there's an issue, then you should bring it up to me. And Patsy is pretty good at telling it that someone's got an issue.\n00:36:49 - Tina Marie (profitdriversinc.com)\nAnd then do they stay in the same state all day? it just either like a time card like you're here? And not here, or do they have break periods where they, um, um. Like if they're going to lunch, do they log out for lunch? What's that with like?\n00:37:04 - mark sweet\nYeah, no, it's regular hourly. So at the end, clock out for lunch, come back, clock back in, 14 minutes.\n00:37:13 - Tina Marie (profitdriversinc.com)\nAnd paid breaks are not a separate anything. It's just going break and tell somebody, like, how does that work, too, for breaks?\n00:37:21 - mark sweet\nThey just have their 10 minute breaks.\n00:37:26 - Tina Marie (profitdriversinc.com)\nAnd nobody's looking to see if 10 minute breaks turn into 30 minute breaks or 40 minute breaks.\n00:37:34 - mark sweet\nNo, again, if there was an issue, well, it's your path to say something to me.\n00:37:39 - Tina Marie (profitdriversinc.com)\nSo I hear that. But I hear about it. Well, and define issue and define does Patsy even want to deal with it? Like, let's say it's, what does it say to me? Hold on, it's the, yeah, it's the drunk. Good. Right.\n00:38:01 - mark sweet\nThat's definitely more than annoyed.\n00:38:06 - Tina Marie (profitdriversinc.com)\nYeah, so any, but attention to detail and even caring about things, you know, it's, so what gets on path to these radar, for example, is the only thing that's on a radar is, hey, there's calls and nobody's answering them. Now I'm going to look around and see what people are doing, or is she in the habit of looking around and saying what people are doing. So to the point of the quality of team and who's showing up and being active and doing things, especially if they're all getting the same incentive, which totally with that type of behavior seems wildly unfair and demotivating, which is why you have to catch other things that you can reward if you can't separate this type of thing. But, but is, you know like if I show up and I'm on time every single day and I never go over all my breaks or rarely right and I am not abusing time and I'm showing up and I'm doing a good job and maybe I'm not the best person but I try my best and then there's this drunk that comes I gotta watch my mouth but that comes in and he's late and he's belligerent or rude or lying or whatever and like we're all getting the same reward and like nobody cares that he's just screwing around because he does it one more slow so like nobody's noticing but he's just hanging out like I'd be annoyed so um dealing with something because there's an issue is not high level leadership and management do you know what I mean that that's reactive is anybody paying attention and trying to optimize things like just the way people show up and act and and how they punch in and whatnot and I don't know what level you at that to me. It's not micromanaging. It's just understanding. It's inventory, right? Human resources are part of your business. And you've got an entire team of six, seven people here that nobody's paying close attention to. It's passing listening to their calls regularly.\n00:40:22 - mark sweet\nI got it.\n00:40:24 - Tina Marie (profitdriversinc.com)\nOkay, so there's like no quality control here in solid leadership or management on team of seven. That's a huge thing. Yeah. So, you know, we're really starting to get a lot of other things. Either under control or we're building a framework around it to to kind of, you know, putting the guardrails, putting the framework in and taking a look at it. intake, from the beginning when we've asked questions, it's just been kind of like like it is what it is, type, answer and response.\n00:41:04 - mark sweet\nIt's hard to find people to work it and not to burn down for sure, but it definitely needs improvement.\n00:41:12 - Tina Marie (profitdriversinc.com)\nWell, and I feel like we're at a point now because we go in cycles, right? Where sometimes our calls are super focused on one particular thing and we're fleshing it out and like we end the call and there's still lots of stuff to talk about. And then there's periods where like there's not a ton because it's all getting worked on and this is one of those periods where we've got room to be talking about other things and digging into it a little. It is a frustrating thing and it's going to take some extraction and we're gonna have to work hard to figure out what we can do because of the nature of it. But if you're willing to just kind of wrestle with us a little bit and try to figure out what we can do. I think that it's a critical part of your business and it deserves that effort. Even if it's not clear and there's no clear path, I would like us to be spending a little more time working on it. I do think now is a good time to do it. Now isn't like not just today, but like, you know, maybe for the next few months.\n00:42:24 - mark sweet\nYeah, no, I agree.\n00:42:27 - Dan’s iPhone (danddcompany.com)\nOkay. I think if you get a script in place, right? All the calls I listen to, all of them were way too long because they didn't pre-qualify the person when they got on the call. So burnout. I could see burnout coming from. Oh my God. have to listen to this person recount this accident that has no me, no purpose with me being on the phone. That would drive me nuts. But it's there. it's the process is what's causing that. It's like that that that would get eliminated. So if that's a factor, that fact can get eliminated.\n00:43:08 - mark sweet\nSo somewhat, I mean, they get a lot of abuse, and unfortunately, too, you know, only tell people that we can.\n00:43:14 - Dan’s iPhone (danddcompany.com)\nOh, yeah, I see some of comments.\n00:43:16 - mark sweet\nYeah, so, you know, that's an unfortunate part of what we do. And that's just that's been ever going to take up in part of like, that's just the nature of the people or else. Sometimes you can't change that.\n00:43:31 - Tina Marie (profitdriversinc.com)\nYou can't, but you can't train and help your team know how to handle that. Has that been done? Like, I know we did black, you have black phones. I don't know how helpful it was with that. And you've also had grief counseling, but what kind of training has your team had in terms of dealing with and redirecting difficult people on the phone?\n00:43:59 - mark sweet\nJust the black. on stuff. And then again, giving them solutions. You know, I'm sorry, we can't help you, but here's a place you can go to, which is really the state bar website for, you know, from there. So at least try to help them in some way, shape or form of at least to go to.\n00:44:17 - Tina Marie (profitdriversinc.com)\nRight.\n00:44:22 - Dan’s iPhone (danddcompany.com)\nMaybe you could turn it into a positive and be like, all right, Karen, call it the month award goes to so-and-so. Oh, I got the best one. I got the best . You're like, great, you get a new withstanding money.\n00:44:42 - Tina Marie (profitdriversinc.com)\nI mean, we could just get a trophy that I turned that frown upside down.\n00:44:50 - mark sweet\nDon't use the trophy with a big butt on it or something. Like, you got the, you talk to the forward.\n00:44:56 - Dan’s iPhone (danddcompany.com)\nRight. Instead of the talking.\n00:45:01 - Tina Marie (profitdriversinc.com)\nI mean, there are, there are soft skills.\n00:45:04 - Dan’s iPhone (danddcompany.com)\nYou get the plushy.\n00:45:06 - Tina Marie (profitdriversinc.com)\nAnd our soft skills, sometimes it can be learned and people can be empowered, which is respectful and erupting. And it doesn't always happen. But first of all, it starts with a frame of mind of just knowing, look, this, this is a thing that has to happen and that you're not being rude by coming somebody else, because the whole point of why they called is to get help with what they want. Occasionally, maybe you have somebody calling just because they want to complain and they're angry or they're lonely, I suppose that's possible too, because any type of dealing with the public, you're going to get some of that. But for the most part, the person called because they had a goal to accomplish. And if the intake person keeps that in mind, this person called me because they have a goal in mind. My job is to help them accomplish that goal and also to remind them because they're, they're going to be emotional and they're going to be distracting. did once they start talking about things that they had a goal in mind. Your goal is you got an accident and you want to get help for it. So the problem is the things that you're telling me right now are preventing me from helping you accomplish that goal. So if you don't mind, let me pause you there. I'm going to ask you this question and then oftentimes even belligerent people will be redirected. Now, if you ask them that multiple times, you can empower your people and say, look, sir, I've asked you three times for this. I really need this to be able to help you. If you're not ready to talk about that, I totally understand. How would you call us back when you want to discuss it or something like that? I don't know that you can do that, but my point is that there are things that can be trained and processes and you have to kind of weigh like what's it going to cost you? Obviously, there's a game to play and you can't be just getting rid of any difficult people. But I don't know, and I will listen to some of the calls, which I'm kind of dreading because that's probably going to be hours of time to really go and do that well. But to see what kind of skills they have, are people able to pause, professionally interrupt, redirect, refocus, because from what I've heard from Dan, that probably isn't happening really well. So anyway, just going through this, even if it's again 5%, 10% improvement, and maybe the improvement is not only on how long the calls take, but also reducing stress for your team. If this is a high burnout job, you know, if Sweet Law could be a place where you, people, your intake team is like, I don't want to go work anywhere else because I've been trained this. I've been. empowered to handle calls this particular way. I'm supported by getting a good intake script. We're not overly busy, like we're not just slammed with calls constantly and understaffed so that they can maximize money. Like all these different things that go into it and, you know, looking back a year from now, going, wow, you know, that's just a little bit of improvement, but I noticed it. And here's how it's reflected in the numbers. And here's how it's reflected on the team. And then we start the compounding effect of, you know, now Mia's been here six years and she's even better at this. And when we have to hire somebody new, we've got a better person to train and that type of thing. So it's like everything else. Like it's small, it seems like it's not going to make a big impact. And then you look back and you go, that was helpful. So in a very critical portion of the business. So anyway, I think you should go back and listen to some calls too if you have some downtime just maybe if you could sample a few calls from each person so that you've got something fresh in your head so that we can come back and discuss it would be good what do you think about that yeah no I need to and when do you have time for that time it's just it's one of those you need to make time we need time yeah what I'm asking is because I'd almost rather have a tooth pull and go do that maybe we just end up spending a call doing it together I don't know but um I want to be prepared when you start let's um maybe listen to it on the airplane traveling okay all right um so we'll try to discuss need to And our login report, something that you could share with me.\n00:50:14 - mark sweet\nUm, I have to, Isaac would be the one who would have to pull those.\n00:50:19 - Tina Marie (profitdriversinc.com)\nOkay, let me send you an email and just see, um, I'll see the Isaac. And that way all you have to do is say yes or no. So, okay. Yep. I'm going to make one. Okay. Uh, what, what was that? That came.\n00:51:02 - mark sweet\nI'm just going to ask a bit of answer.\n00:51:05 - Tina Marie (profitdriversinc.com)\nOkay, cool. I played that last. And I'll just shoot this off. All right. Oh, go back and take some files. Morning meditation. Um, Dan, you had something. Yeah. Did you send that to Mark?\n00:51:35 - Dan’s iPhone (danddcompany.com)\nOh, no.\n00:51:36 - Tina Marie (profitdriversinc.com)\nYou want to tell them what it is?\n00:51:39 - Dan’s iPhone (danddcompany.com)\nYoga nidra. Are you doing yoga nidra? You should try yoga nidra.\n00:51:45 - mark sweet\nYou should try yoga nidra.\n00:51:47 - Dan’s iPhone (danddcompany.com)\nThe yoga nidra, it's not really yoga, but it's a meditation that you do. part of it is that you set an intention, which is interesting. But you're, it's like you got more sleep when you're done with it. It takes 20 minutes and it's a little weird because you're, you're just laying down and it's, it's, um, dive in so they're like, do this. They're basically having you go through your whole body while you're doing it, like focus on different parts of your body. then at the end, it's like they do some at the end or whatever. But when you open your eyes after it, it's, you're altered, you're altered. You're like, whoa, you feel way more energized. It's like getting more sleep. I mean, that's, I picked it up from, um, Andrew Huberman, who's this book in biohacker dude. And he thought, he thought it was BS and then he started doing it. He's like, Oh my God, it's like to make a difference. And I think they studied when they're like, yeah, people are changed by doing it. The ultimate test. though was when our little friend Salco called me and he was like flipping out and he's like, dude, he's complaining about something. go, you need to try yoga, and he's like, what the hell is that? And I explained to him, he's like, I'm not going to do that. And I said, well, then whatever. I'll send it to you anyway. And I said to him, and then three days later, he's like, dude, he was so freaking out about something. He's like, I did it while I was in the So he legged out the airport and didn't, because I felt amazing.\n00:53:30 - mark sweet\nLike, told you, he also got facing the airport.\n00:53:35 - Dan’s iPhone (danddcompany.com)\nBut yeah, that's the difference. That's the difference. That's called, that's called Drumka Nidra.\n00:53:40 - mark sweet\nIt's different. Yeah, no, I'm looking at my text messages from while in the airport, which are not appropriate for this conversation in any way, shape or form.\n00:53:48 - Dan’s iPhone (danddcompany.com)\nWell, this is new.\n00:53:50 - mark sweet\nMine was a while ago.\n00:53:51 - Dan’s iPhone (danddcompany.com)\nOh, he said he had COVID.\n00:53:55 - mark sweet\nHe's got a COVID hangover. Because this was stampede was here this weekend. There's four groups of six Plus women who would all be quote unquote rodeos.\n00:54:04 - Tina Marie (profitdriversinc.com)\nOh, boy.\n00:54:05 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:54:07 - Tina Marie (profitdriversinc.com)\nOh, I think it was seven is flossing at the table.\n00:54:12 - Dan’s iPhone (danddcompany.com)\nOh, lovely.\n00:54:14 - Tina Marie (profitdriversinc.com)\nYeah. Like literally.\n00:54:18 - mark sweet\nNo. Center for you. There's no rules. You want to drink margarita?\n00:54:22 - Dan’s iPhone (danddcompany.com)\nare no rules.\n00:54:24 - Tina Marie (profitdriversinc.com)\nYeah. Okay. Um, so the point was that we were discussing it, talking about, um, morning, you were talking about morning meditations last week. And so Dan was like, Oh yeah, I've been, I did this thing. He should do this. And so I wanted to remember to see if he told you that.\n00:54:48 - Dan’s iPhone (danddcompany.com)\nThat's a joke right now. So one minute.\n00:54:52 - Tina Marie (profitdriversinc.com)\nAll right.\n00:54:54 - Dan’s iPhone (danddcompany.com)\nIf you don't follow Andrew Huberman, like all of his things. Yeah, he's. Yeah. all of these things are great. Getting up and going out in the sun and doing all that stuff.\n00:55:06 - mark sweet\nSo one of the people I work with told me this and this actually makes a lot of sense that negative emotions are used to avoid your responsibilities. many times someone's like acting out or there's a negative emotion tied to something because they're trying to avoid some kind of responsibility.\n00:55:24 - Dan’s iPhone (danddcompany.com)\nSure, that ties in with like the whole self-fulfilling prophecy and concept which is absolutely beautiful.\n00:55:32 - Tina Marie (profitdriversinc.com)\nYeah. Interesting. I will say though that while I've been working on my psychology degree and it's interesting doing it at this age and the stage in life as a parent and having gone through other things that I've gone through because when I first went to school, you know when you're when you're young, you're institutionalized, you're trained. that the teachers know everything, adults know everything, and that the people that write the books know everything and that they are the and all be all authority. And I know better than that now. So going through school, but what's interesting to me is some of the books have the textbooks have said, look, this is in the book because the book had to be created, but we couldn't even agree on this stuff. It's here because this was the general consensus, but a lot of us disagree. We disagree with the, you know, the main book. Do you see it? Why can't I even think about it right now, my gosh? Anyway, but for every scientist that will tell you one thing, there will be two that disagree with them. And so that is why, too, I think that it's so important that we take the notes and, and I don't know, explore and have our own experience. I've been taking sunshine breaks for like, I don't know, 15 years. It is crazy. I sleep better. get at least 15 minutes of sun. As Fuji already told him, he needs to start writing that down, but it's wild, all of these things. There's more to try and learn than we'll ever even have time to in our lives. But if we can find back to leverage, if we can find the levers that make a significant impact, it doesn't matter if you know all the things and do all the things and we're not disciplined anyway enough to do all the things consistently, but figuring out what our Kryptonites are, what are the things, what are our coping mechanisms, what are our defense mechanisms, what are the things that we use to avoid whatever, kind of paying attention to that and create the system.\n00:57:55 - mark sweet\nDid I have you read switch, Mark?\n00:57:58 - Tina Marie (profitdriversinc.com)\nYes. You know what I did. pay attention to and I didn't notice that Fuji pointed out today was that that you creating the path so and this is it was just different language but I didn't realize it was in there it's what I do anyway but to the point of like we have finite willpower you can only wrestle with so many things each day so if it's a Russell to get up in the morning at a particular time if it's a wrestle to not check email if it's a wrestle to not snap but somebody that annoys the heck out of you but to wrestle to choose good food choices if it's a wrestle to you know what mean like all these different things that we have to kind of fight with ourselves to do or convince ourselves to do put forth this willpower to will ourselves to do something that we don't actually really want to do right we know that we should but we don't it's not it's not naturally what we want to do but we only have so much of that in ourselves each day. the goal then is to craft the environment where choice and will isn't necessary because there's no other options. I don't have to ask myself if I'm going to have a cookie for breakfast if there aren't cookies in the house. So I created the path a little bit differently so that I can't wander into the cookies in the morning.\n00:59:24 - mark sweet\nDo you know what I mean?\n00:59:26 - Tina Marie (profitdriversinc.com)\nBut anyway, just so finding the things that make the biggest impact and then setting up our environment in such a way that the things that negatively impact us throughout the day are not in our environment so that they have less opportunity to impact us negatively which means that we've got more energy which by the way the other thing was is that it affects our cognitive ability. So every time we have to use an employee willpower to tell ourselves to do the thing we don't want to do. or not do the thing that we want to do, we have less patience and ability to even solve, let's say it's a mathematical problem. Let's say it's a business problem, a system problem, hiring problem, whatever. have finite mental resources, which is obvious, right? But to understand that we can create the environment in such a way that it optimizes our day by reducing and minimizing the rest souls that we have to have that evoke, invoke, invoke, will power. Anyway, yeah, so just one on hand. There you go.\n01:00:46 - Dan’s iPhone (danddcompany.com)\nYou got to bounce. I got to go drop the car off, get new tires.\n01:00:50 - Tina Marie (profitdriversinc.com)\nYou have fun.\n01:00:52 - mark sweet\ntask. My two cents, just get whatever cost it's going to charge you and wherever you're going, make them match it, because they always will, but they'll grumble about it, but I'll save you a bunch of books.\n01:01:02 - Dan’s iPhone (danddcompany.com)\nAlrighty. It's possible to not have the ones I wanted, but I will do that. Just right. Also, we need to meet with Patsy's husband still. Go ahead and work on that. Thanks, Black. Yep. mean, yeah. Whatever. Someone's husband. Good job.\n01:01:17 - mark sweet\nOkay.\n01:01:20 - Tina Marie (profitdriversinc.com)\nAre you taking care of yourself?\n01:01:23 - mark sweet\nYeah.\n01:01:26 - Tina Marie (profitdriversinc.com)\nDid you just say occasionally?\n01:01:29 - mark sweet\nUh, yeah.\n01:01:33 - Tina Marie (profitdriversinc.com)\nAlright, um, how's Ronan?\n01:01:37 - mark sweet\nUh, adorable, but shoot up my mom's hat. So, but it's a puppy.\n01:01:42 - Tina Marie (profitdriversinc.com)\nLike, this is gonna happen. don't know what she's expecting. For a couple of years, it's gonna happen.\n01:01:47 - mark sweet\nYeah, but he's adorable, which is good.\n01:01:51 - Tina Marie (profitdriversinc.com)\nIs he still coming to the office?\n01:01:53 - mark sweet\nUh, occasionally. How is your mama? Um, we've had to deal with a lot of dads. stuff so it's just been a little hard not and you know none of this is a straight border easy unfortunately so now kind of pulling back well um I went to the fight the Nate Diaz fight which was fun on saturday oh yeah throw that with whole bunch of guys so that was fun to do um one of the guys filled this way with like their family's multi-billionaires which you know it's just always interesting to see people at those high high high levels but it's still the same stuff systems and processes and people like it's just on a bigger scale um send me this one thing because it cracks me up I was on the phone I was walking back and forth on our second floor and the squirrel just comes in just like lays down on top of the roof like he's just chilling and it just probably just find it mildly funny as well but yeah it's awesome\n01:03:01 - Tina Marie (profitdriversinc.com)\nAnd me and the pool for the last two days. I'm just like, I'm not doing anything. love sun. That's why I need to be living in Arizona.\n01:03:11 - mark sweet\nMonday is a big day next week. So the $10 million check case should be done because they have to give it to us by the 14th. So I get it that Monday. And then I got my personal million dollar cases due on that Monday, so don't. Kind of exciting.\n01:03:32 - Tina Marie (profitdriversinc.com)\nThat is fun. So to the, you going out and hanging out with friends, I will say that one of the best things that I think anybody could do, especially through different seasons of life is actively cultivate friendships and different types, just different people and socializing and along with the stuff that you're. going through, personally, at home, with mom and everything else. Just having people who know you, who are aware of you, laughing, laughing is really, really important. Having fun, having people that are maybe in similar seasons, but also who are where you want to be. Just thinking about those, but being really intentional about making those times, making time for that, and reaching out to make those connections proactively not worrying about whether or not somebody else initiates it or not waiting for anything, but just being really intentional is I think one of the best tools and one of the best hedges, rather than a lever, it's a hedge against depression, it's a hedge against just kind of sinking. Because there's so many different things that can come up in life, and so I hope that you do lots more of that. It's good for you, and you people love you. You're a good guy, and people need you too. So that's my pitch. think that you should spend more time making friends and having fun and letting people fall in love with you. Yeah.\n01:05:27 - mark sweet\nYeah, no, it's good. On the up side.\n01:05:31 - Tina Marie (profitdriversinc.com)\nOn the what side?\n01:05:32 - mark sweet\nYeah, it doesn't make you mild entertain. So we got to start out from my old law firm. And super well, what? Because it's a case that we'd already settled. So I basically say like, no attorney who signed this. So I'm not sure who to address the letter to. Obviously, I know the wrong law firm. But we've already settled the case. the policy limits. Despite, you know, fact that. I called the collision, I think, previous owner for teaching me how to turn lemons in the lemonade on these types of cases. And I used to say, so we're going to certainly send the file, and we're just going to finally need to be starting our full attorneys fees. The response I got back was, it was newly retained on our, and we'll drop. thought it could be a assistance in your training. Obviously, I would have made a different decision knowing what I learned discovery years ago regarding your employment by our firm. But that is your karma, you must work out and I'm happy I'm on the other end.\n01:06:32 - Tina Marie (profitdriversinc.com)\nWhat?\n01:06:33 - mark sweet\nYeah, I don't know exactly what that means.\n01:06:38 - Tina Marie (profitdriversinc.com)\nWow.\n01:06:40 - mark sweet\nSo I asked my old boss, I was like, hey, do you have any clue what the hell she's talking about? Because there's, when they got raided in the DA got involved, that was bad. And then they sued each other when they ended. So I didn't know which discovery it was. Like I read it four times, I have no idea. So I'm sure I said something at some point. point is again the reason I learned lot what I learned was because she didn't show up or she was too intoxicated or whatever. She was in a meeting to just choke drunk or high. So I took a lot of meetings and met a lot of people that I wouldn't otherwise meet because of that so it worked well but not directly if that makes sense.\n01:07:22 - Tina Marie (profitdriversinc.com)\nSo she was bitter and deflecting and she is bitter and deflecting.\n01:07:27 - mark sweet\nI'm sure I said something about it and you know at some point that of frustration whatever else and there's no excuse but more than sure I said something and so it was interesting. I tried to make friends with her when I left and she said it doesn't work that way and yeah.\n01:07:45 - Tina Marie (profitdriversinc.com)\nWell whenever life is lessons and some of them really really suck but some are really really awesome. So yin and yang I'm telling you it doesn't matter like how good things get equal opposites will happen. So the better it It gets in some ways, the worse it gets and not necessarily directly, maybe it's just like the people around you, but it's it's kind of wild to notice. But I've learned that the the fortifying power of the good is that you can see the bad happening around you, but it is less impactful. And it it it doesn't create the pain that it could have the potential to create when you fill yourself up with so much goodness. And that's been interesting and fascinating to watch too that that that bad has less power to do its thing, you know.\n01:08:44 - mark sweet\nYeah, it doesn't really bother me. It's just a little strong with people.\n01:08:49 - Tina Marie (profitdriversinc.com)\nYeah, there's a lot of that all day long. What is wrong with you?\n01:08:54 - mark sweet\nAnyway, I got to deal with the angry, dead client person action.\n01:08:59 - Tina Marie (profitdriversinc.com)\nI will talk to you later. Have a good day. I'm Mark. know you. Yep.\n","contentPreview":"00:00:03 - Tina Marie (profitdriversinc.com)\nCan you hear me? Yeah. So did you said to say hi?\n00:00:08 - mark sweet\nYeah, they are COVID. So he's having fun.\n00:00:11 - Tina Marie (profitdriversinc.c...","processedAt":"2025-05-04T03:40:52.623Z"}