{"fileName":"Done Transcript for D&D Co & Profit Drivers - Weekly Review(3).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for D&D Co & Profit Drivers - Weekly Review(3).txt","type":"transcript","priority":"medium","content":"00:00:01 - Dan’s iPhone (danddcompany.com)\nHello.\n00:00:03 - Tina Marie (profitdriversinc.com)\nHello.\n00:00:04 - Dan’s iPhone (danddcompany.com)\nWhat's up?\n00:00:07 - Tina Marie (profitdriversinc.com)\nNot my energy levels because I've been getting up at 5.30 in the morning for the last couple days because I have a seminary student now.\n00:00:14 - Dan’s iPhone (danddcompany.com)\nYou have a what? Seminary. oh, oh. I thought you said something about a son. I'm like, wait, what? have a son in love. I thought you were going to say to jump into your ice bath and then expose yourself to sunlight.\n00:00:28 - Tina Marie (profitdriversinc.com)\nNo, you're not.\n00:00:29 - Dan’s iPhone (danddcompany.com)\nNever. You're not doing that.\n00:00:35 - Tina Marie (profitdriversinc.com)\nI'm using myself.\n00:00:37 - Dan’s iPhone (danddcompany.com)\nNo, no.\n00:00:38 - Tina Marie (profitdriversinc.com)\nOkay, I was like, wait a minute. Never no matter how many times that should tell me it would be good for me and a rim hop and blah, blah, blah. No, never.\n00:00:45 - Dan’s iPhone (danddcompany.com)\nI've never done it.\n00:00:47 - Tina Marie (profitdriversinc.com)\nLet me, I want to send this to you. I'm texting it. These are my past clients, current friends, very smart people who are\n00:01:00 - Dan’s iPhone (danddcompany.com)\num they used to do before covid they were agency um and for yoga studios and amazing like they spent a little bit time creating marketing campaigns and they blew these brand new so it was like um great the guys that make smart tools are your clients yes oh that's funny i know david what's his name bought this and met like no as a customer oh yeah yeah he met them at the high level event he met Jason and chandel uh i believe so yeah and i think he's a subscriber so but mostly his daughter is the sort of the face of that but yeah when david and her went to uh Austin i forget where the where the thing was but yeah he he was so funny he goes i met the number one affiliate for high level and i go uh cooch and he goes yeah um Did you know that? like, I know him. I've known him for years. He's like, that guy's the number one affiliate. I go, I didn't know that. I know he was partners, maybe with the number one. Anyway, David's a subscriber that Jason also had, uh, he had this one thing that it to no longer needed, but I almost bought it be. I mean, because there's somebody else that does something very, very, very similar. I'm a subscriber of the other guy. I'm not a subscriber of Jason. David's a subscriber of Jason. I'm a subscriber of, uh, the other dude. can't remember his name, but I use power tools or something else like that too. It's very similar. Yeah, I have that one. David has, David has Jason and David matches.\n00:02:48 - Tina Marie (profitdriversinc.com)\nYeah. So Jason's a beast. He's super tall and she's really short and they always did video even though Tina never did. I'm really good about it now. And she used to be a hairdresser. And they. They used to do media buying, but they did all the campaigns. They created all the marketing and really just the whole growth business plan. And then they did the ads and they wrote the copy, they tracked everything. And they did amazing for these yoga studios that then COVID came and shut everything down and went to here. But Jason, they're both brilliant. Chandel loves the systems and the marketing. Well, he loves marketing too, but so he loves marketing and the tech. And he is really brilliant at creating the tech and snapshots and creating the automation and she loves the marketing, but does the customer support, the hiring, the deadlines and all that other stuff. and I've watched their kids grow up and yeah, anyway, but you know, to me, they're kind of like under the radar, but although I've I mean, their group is just growing.\n00:04:01 - Dan’s iPhone (danddcompany.com)\nAnd I see people in here that I know that have done a good job. He gets called out fairly frequently in the main group for a couple of his bits and pieces. Oh, does he? Oh, yeah, yeah, for sure. That's awesome. Yeah, right. you're saying, hey, man, the other guy.\n00:04:21 - Tina Marie (profitdriversinc.com)\nThey're like the two go to the tools. got, oh, wait, wait, wait, okay.\n00:04:25 - Dan’s iPhone (danddcompany.com)\nBecause I'm like, no, it's a wife. Okay, I just want to make sure I don't save you. Yeah, I can't think of the other guy's name, but yes.\n00:04:31 - Tina Marie (profitdriversinc.com)\nYeah, I think I got their stuff and they offer like, they call it like white glove service or something like that, where you don't have to do anything for your people and they'll do it all and.\n00:04:41 - Dan’s iPhone (danddcompany.com)\nOh, no, that's yet another guy. Yeah, that's like, it's Stanley. There's two of those.\n00:04:46 - Tina Marie (profitdriversinc.com)\nIt's fine. There's like two of everyone. Well, what I love about these two most is that, I mean, they're just super smart. And I don't know, like Jason just gets excited about this. But he has the balance of Chandel, who is like, okay, but we need it to be this and just kind of whatever. And they also have Tina thoughts in the back of their head, although I'm telling them, okay, don't do this, don't do this. I think that's fun. So anyway, but like, as far as like collaborating type, they're just, they're, they're mom and dad. They're at hockey games all the time. He cooks like crazy, amazing food. She was an air dresser, so she still loves all the beauty stuff. Anyway, they're just so laid back down to earth and they're in this world, but they're not schmuckery's like, just, you know?\n00:05:42 - Dan’s iPhone (danddcompany.com)\ndo. Yeah, because I think that, you know, the good thing about high level is that the people that got in early, like then, like a lot of these tools providers, the early onset people, they were solving real problems. With real solutions, and now you have the hacks coming now you have the this Not just the bang whiz and you're like okay, whatever and it's someone that's been using high level for like a week And they bought some of our snap shot. No reselling it Thank you. Yeah, okay No, thanks Oh God now what happened Do that again somehow the audio button is just like Below my browser cuz I'm not looking at zoom.\n00:06:33 - Tina Marie (profitdriversinc.com)\nIt was behind my browser, but apparently it was just underneath it and so I was clicking Anyway, they had given me a high level account, but she was like tini you should just really have an agency account like Okay, I didn't think about anything. I'm like I just don't even want high level whatever But now that you're talking about it, and I know and you got that one snapshot. I really do think it will be in my best interest to understand this for I just see their growth like I was turned off by the whole Frankenstein code. Yeah, but what I see now is almost like I'm trying to think of the word but it's like socialism. Like I mean open sources Frankenstein code, Franken code basically all the things that are built off of it and so and also I'm telling myself there's no first of all I don't like anything being housed under one roof but this really isn't that because let's say high level did something really stupid and just blew it up whatever there's now this whole community of people who for sure even if they're not coders have coders who can very quickly pivot and splinter off a whole lot of related things because we're all now having thoughts we've never had before, it used to be owned by an entrepreneur or an infusion soft, and you couldn't compete with them. And now this is like a building full of all of the greatest minds helping to build it. so it doesn't feel as much of a death wrap is like, anyway, something else.\n00:08:23 - Dan’s iPhone (danddcompany.com)\nSo only way goes sideways. And I'm not sure it can even go sideways, but what will be inevitable.\n00:08:31 - Tina Marie (profitdriversinc.com)\nAnd for those of us that have been in the game long enough, it's like in a huge, a huge enough.\n00:08:37 - Dan’s iPhone (danddcompany.com)\nRemember when everyone was an infusion soft affiliate? Oh, is same thing's gonna happen here. Eventually that affiliate play no longer exists and they get rid of it. And then that turns into we're gonna raise the price.\n00:08:54 - Tina Marie (profitdriversinc.com)\nYes, yes.\n00:08:56 - Dan’s iPhone (danddcompany.com)\nYeah, that's it. Here's down the road, right?\n00:08:59 - Tina Marie (profitdriversinc.com)\nI don't know. because the pace of everything is exponentially faster and increasing. I don't, I don't think that timeline.\n00:09:09 - Dan’s iPhone (danddcompany.com)\nI see them doing it right now to through these add-ons, right? So a perfect example would be their, their, I think I'm not exactly sure what the relationship is here. So they have the conversation AI add-on. It's not have gone too deeply into this. It's not clear to me if it's theirs or if they have a licensing deal with someone else and it's, it's that. But either way, that add-on per account, 40 bucks.\n00:09:39 - Tina Marie (profitdriversinc.com)\nThat's huge.\n00:09:40 - Dan’s iPhone (danddcompany.com)\nYeah. That's a huge markup. That's a huge price. I even know what the markup is. So I see them doing that. Like they, they create certain add-ons and that's actually a way to get more money without raising the price. I'm like, they can do that too.\n00:09:56 - Tina Marie (profitdriversinc.com)\nYeah. I see that. I mean, because that's what everybody's doing is talking on to it. So anyway, but bottom line is I definitely do want to get into it and learn it because the one thing I do know is that somehow I'll think of a question somebody hasn't thought yet and then they'll be a day on and be like, you'll have a thought. There's no possible way I would think what you think. I cannot even come close to the things that you think. But when it can be as a catalyst for you thinking what you're thinking, I'll do that. Check it out. Yeah, so did you push that button yet?\n00:10:35 - Dan’s iPhone (danddcompany.com)\nNo, I didn't, because when I went to push it last night, my browser would not cooperate and I'm like, I'm just going to shut this computer off.\n00:10:43 - Tina Marie (profitdriversinc.com)\nThat is a sign that today is over.\n00:10:46 - Dan’s iPhone (danddcompany.com)\nI couldn't even close the time. oh my god, I'm going to close this time. But I will set it up right after this fall. Because it's Thursday, and it's Paul's day. It's Paul's in random tasks day.\n00:11:00 - Tina Marie (profitdriversinc.com)\nso there you go you know what i don't know if you would ever need it like i need it because i do but i do so many different things but you do so many different things and it is this extension called work on i'm sure i've told you i've used it yeah i use it religiously do you i i didn't see the i always have two browsers open and they're color coded because they're each in different google accounts which just makes it easy because i always have two i always have my mission tab open constantly because when i get a few breaks it and also it just serves as a reminder hey i've got to go get some work done there yeah so feel 12 hours doesn't seem like a lot but it is a lot but then i got it yeah and it also has to be concentrated work so anyway Um, so I have those two open, but then so I can switch in between each client, but then I have one that's like for my course and ones that's just AI research because I have all these different tabs that I'm looking at and one for finances and, um, one that's like, I have few miscellaneous, I have one for school because I'm back in school and Etsy and like all kinds of different things and it's so much easier to switch back and forth. And I do catch myself opening something because I'm in a browser and I'm not in that tab and like, oh, switch it. But then I can just easily go move that tab to the workspace that it belongs. You have to pay for it. If you're only using five spaces, it's not worth it.\n00:12:47 - Dan’s iPhone (danddcompany.com)\nUm, but right. But you could also do like, just go, this is but like, the way that I end up being effed is like, I'll have essentially three workspaces open across 20 times. And it's like, oh, all this ninja stuff should be over here. And then over here should be empire. And then over here should be fan flowy. And then what I end up with is just the row of tabs and they're not even next to each other.\n00:13:16 - Tina Marie (profitdriversinc.com)\nWait, which one is it? So, so you're selling me? Yes. Because also I have my computer is amazing and very fast. It can handle a ton of browsers. But it's browser windows, but there's still a limit to it. And I am one to push those boundaries. So this makes it easy. And I don't want to have to bookmark everything. And I lose stuff. And I don't lose things anymore. But also it serves because I've got that row of spaces on the left. Like, Oh, yeah, go check on that. Oh, I need to go check on that. So because I'm always in there choosing a space every day, I'm also getting a reminder of the things that I look at and work on most without having to be in a company. Completely separate app like a reminder app or my calendar or something else going.\n00:14:04 - Dan’s iPhone (danddcompany.com)\nOh, yeah, go look at that So anyway, I've been you know you can you oh you don't have back, but you can reduce like Okay, you can reduce that down right so that it's then in the bar and you're like, oh, that's my throat That's my basis work. I'm and then I could just launch that right. I literally have one called basis Okay, I'm gonna have to go. gonna have to this might be what I do this afternoon because I it was like I actually started feeling that it's the perfect time to start feeling that this week damn this is getting You know, it doesn't work and then I get to this place where I have to use the one tab because everything's just so janky and Then one tab reduces everything down to links, and then I'm like I never go back to it No, like they're there right. That's exactly the problem.\n00:14:53 - Tina Marie (profitdriversinc.com)\nYeah, I'm like I never go back to this That's why this is such and Although\n00:15:00 - Dan’s iPhone (danddcompany.com)\nBut it's like a cleanse, like, yeah, but that's always bad, though.\n00:15:06 - Tina Marie (profitdriversinc.com)\nYeah, because you need the tabs. Look, we're a tap your brain has multiple tabs open, your computer has multiple tabs open. It's just, it's the way your brain works, but I'm being able to switch from different devices. could log into my Chrome account on somebody else's computer, log into work on it and have all my stuff anywhere and just what you can.\n00:15:30 - Dan’s iPhone (danddcompany.com)\nYes. That's a problem I run to run into when I'm making music is because that computer is not my computer. But I have to sign in sometimes is me and sometimes as I have a shared account for Apple for that. And so, so it also has a email address. So sometimes I have to use that, but 99% I use me.\n00:15:53 - Tina Marie (profitdriversinc.com)\nAll you have to have is have whatever browser you're using install. We're gonna as a plug in on that machine. And then it's all into your Google account and you have all of your tabs open, right?\n00:16:08 - Dan’s iPhone (danddcompany.com)\nDealing.\n00:16:10 - Tina Marie (profitdriversinc.com)\nBecause I just might be pop open as soon as you click on the thing.\n00:16:13 - Dan’s iPhone (danddcompany.com)\nWell, that's interesting.\n00:16:15 - Tina Marie (profitdriversinc.com)\nYup.\n00:16:16 - Dan’s iPhone (danddcompany.com)\nI need to. I do that too. I'll sometimes be on my laptop and then I switch to that computer and I have to look it up again.\n00:16:23 - Tina Marie (profitdriversinc.com)\nNope. It stays. It's transverse.\n00:16:26 - Dan’s iPhone (danddcompany.com)\nOh, so what will happen though is I'll go on my laptop. So then all my bookmarks are inside Workana because that's the other thing because then I have to redo bookmarks and but I don't because I'm like I'm not doing that.\n00:16:42 - Tina Marie (profitdriversinc.com)\nNo, you don't and let's say you have a tab that you open frequently but you don't need to have it open all the time is let's say you've got 30 tasks tab work. Yes. Okay. So what you can do is save that as a resource and you can save it as a resource across multiple things. maybe. teamwork across spaces across street law anything else like that and you save it as a resource with one click to multiple workspaces and it's not an open tab but it's still easy for you just to go and click from the work on a home screen. Okay so here's the other thing so like let's say I have the tabs open my mission tab on my desktop and then I go open up my laptop and it says you were already working on this in another location do you want to resume work here and so I can say yes and it just takes over the most recent tabs and then just so the work transfers let's say I closed tabs on the laptop they're closed on the desktop when I come back to it.\n00:17:48 - Dan’s iPhone (danddcompany.com)\nOh wow okay. Interesting.\n00:17:58 - Tina Marie (profitdriversinc.com)\nI'm just client I told him about. He's like yeah it wasn't. I'm like, and you're not using it right.\n00:18:02 - Dan’s iPhone (danddcompany.com)\npromise you because. Right. That's exactly the message I'm getting. But it's also like I just there was no there. That's a perfect example of they don't really tell you I'd use it. Yes. You're like, how am I supposed to use this? Like this is like a mini course, right?\n00:18:21 - Tina Marie (profitdriversinc.com)\nThis is like that's exactly that. And I think I'm like, I need to do some of these little hacks. Let me make sure my daughter's OK. Yes, OK, yeah. When I teach people stuff, because it is these little things.\n00:18:37 - Dan’s iPhone (danddcompany.com)\nOh, Tina, Yeah, yes, but that's the other thing, too.\n00:18:42 - Tina Marie (profitdriversinc.com)\nI like finding examples like this because a lot of people have really amazing stuff, whatever it is, do a terrible job of marketing, especially local, like local businesses. I just I look at them and I think I've never seen it out of yours like ever. And I just anyway, whoa.\n00:19:00 - Dan’s iPhone (danddcompany.com)\nNo, yeah, totally.\n00:19:02 - Tina Marie (profitdriversinc.com)\nOkay.\n00:19:03 - Dan’s iPhone (danddcompany.com)\nMarket's best wins.\n00:19:05 - Tina Marie (profitdriversinc.com)\nIt markets at all. That's the thing. Speaking of markets and market share.\n00:19:11 - Dan’s iPhone (danddcompany.com)\nAnd another 71. How are we doing? I think I did the math roughly a few days ago. We're like, we're up like 16%. So we're gonna we're we're approaching 3.6 million. So we're we're on. I mean, I think we can get back to four because that's was like our apex. And then I'm still some of my Mercer stuff didn't work. And then some of it's not going to work. I got another answer from them today. So for yesterday, so now I got to go check. I set up some new stuff. going to make sure it's working. I think one thing is messed up. I'm going to have to ask them why it's partially working. But I got to peek at it really quick. first but if Mushi's new thing is tracking and the stuff that I overlooked that I added is working and then I got the video thing's the one that's broken I got to get help fixing that then I'm like done as far as like all right I know how to set a custom event Mushi I know how to set these other events these on page events the standard sort of built in which would be the video one then I know how to do sort of the his his ace events set those up don't know how to do them in GDN yet because they weren't working so I haven't taken that up with Melissa yet but if they're working I can get with her and then I need to go I still need to go through one more module now then I can go into the advanced JavaScript and just see if there's which is essentially what I did with Mushi anyway but that was very specific to me I want to see what they say like is there anything from that that makes me go oh that's interesting oh I could do that uh so ideally I would get that done I don't do it today or tomorrow right next week but then we're also going to visit Santa Cruz next Thursday so yeah so I can't be on a conics Thursday although I totally didn't think about that when I put the flight but I'll be on a flight or I'll be touring the campus I'll be doing one of the other I know you don't like calls on other days but can we reschedule yeah we can do it on Friday if you can do it on Friday or okay yeah Friday are gonna still be there because I can move it to Wednesday if you'd rather move in and out Tina boom boom okay we're just doing a tour and getting the lay of the land and then and then in two weeks we go back again for the movement Thursday no on a Saturday\n00:22:00 - Tina Marie (profitdriversinc.com)\nOkay cool. I moved it.\n00:22:02 - Dan’s iPhone (danddcompany.com)\nthen that that one we might stay over.\n00:22:04 - Tina Marie (profitdriversinc.com)\nUm, would you like it any earlier that day on Friday?\n00:22:08 - Dan’s iPhone (danddcompany.com)\nI can do whatever because that's that's why it opens.\n00:22:11 - Tina Marie (profitdriversinc.com)\nOkay. Well, we'll leave it right there at noon then. Okay. It is moved it in your calendar. right. I'd like to I'm gonna tap.\n00:22:21 - Dan’s iPhone (danddcompany.com)\nI was booking the flights and it was like, okay. And oh wait, that's September 11th.\n00:22:26 - Tina Marie (profitdriversinc.com)\nI am not flying on that day. Oh my gosh.\n00:22:29 - Dan’s iPhone (danddcompany.com)\nThere. That was like literally about to hit purchase.\n00:22:32 - Tina Marie (profitdriversinc.com)\nI go way to say. Ha ha ha. You're like, no.\n00:22:36 - Dan’s iPhone (danddcompany.com)\nEncore. No, thank you. Yeah. No, I'm looking for that. Any day would be a day to send a message. Right. Probably that. So I don't want to be a part of a message. Thursday it is.\n00:22:52 - Tina Marie (profitdriversinc.com)\nIt's crazy too how many people had stories of they were supposed to be traveling that day, but something happened or somebody said go or They knew they shouldn't go and like, why am I?\n00:23:03 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:23:04 - Tina Marie (profitdriversinc.com)\nOK, so you were about to tell me when you think it was going to get done.\n00:23:09 - Dan’s iPhone (danddcompany.com)\nAnd then you. So I'm going to try to get it done next week. So I mean, I could probably watch a bunch of it on those flights, too. So that's ample. Airports are great for that stuff and flight.\n00:23:22 - Tina Marie (profitdriversinc.com)\nMy throat is killing me because I almost literally choked to death. I thought I was on a call talking to my friend. And I'm like, I'm really, truly going to die. being here.\n00:23:33 - Dan’s iPhone (danddcompany.com)\nJust just be aware about to die.\n00:23:35 - Tina Marie (profitdriversinc.com)\nI had these capsules and they got wet and they stuck to each other. I'm such a miser. I could swallow that. almost did not able to. And it was mind over matter because I had to keep shoving water down. But the water wasn't going down. And I'm like, it's just coming back up. And I'm I'm just in suffocating. as a role, by the way, especially for an asthmatic when you've suffocated almost to that many times. Well, lovely. Well, I'm okay with it. It hurts now.\n00:24:08 - Dan’s iPhone (danddcompany.com)\nAnyway, well, then it feels like they're still there. That's the worst part.\n00:24:13 - Tina Marie (profitdriversinc.com)\nFortunately, that is not what's happening. Yeah, but it's just like everything just feels like if I swallow again, it feels like I have a sore throat, but I'm for all that it is, I'm like, thank you, God, thank you, God, thank you, God.\n00:24:25 - Dan’s iPhone (danddcompany.com)\nYeah, not dead, not dead.\n00:24:27 - Tina Marie (profitdriversinc.com)\nOh, yeah, literally. When I could finally talk again, she was just talking, she had no idea. I'm just going here. I can't believe this is happening. Like, and I'm trying to dream what I was soaking wet. Anyway, it was an interesting morning.\n00:24:40 - Dan’s iPhone (danddcompany.com)\nThought it's your dad.\n00:24:43 - Tina Marie (profitdriversinc.com)\nNo draw, though. No, no, no, Exactly. We can just watch ourselves die. I feel like, I don't know, it's just surreal. Anyway, okay, so we're going through that and try to finish it by next week. And then what's the next?\n00:25:00 - Dan’s iPhone (danddcompany.com)\nI mean, ultimately, I would like to have tracking goings that we can go into 2025, right? January, we'd be like, all right, it's a normal year, supposedly. And then we very much know what to expect, right?\n00:25:22 - Tina Marie (profitdriversinc.com)\nQ, how is it?\n00:25:24 - Dan’s iPhone (danddcompany.com)\nWhen not like 25, that's like a penny, but it's like, we're all intent, right? It's like, okay, no COVID, no, no exam changes. That is a change, but it's a positive change. I guess it's not totally normal, it's normal, or, I mean, I'm going to find out how many more that actually is, because I don't know, but the, and then just have, it's like this stuff is going to, should settle down in November, and then where people exit isn't December like all that stuff will happen as as it does But then it's like, okay, where are we really at if we keep this 31? Think I mean, I think 31 is 4 million if I'm not mistaken So it's like we've never got past that I Guess we could but it's not on purpose But if the numbers 31 it's like okay, 31 is the number to be and And then we'll do I wanted to advise a plan based on data shocker to figure out how to beat that number What was See this is why I need to make my dashboard, so Orange new subscriptions, okay, And you think that's for money, okay I Think that's for you know, that's our ideal number based on historical data. It's like that's the best we've ever been and kind of thing. So, we'll see.\n00:27:13 - Tina Marie (profitdriversinc.com)\nSo, just out of Thirty-one puts you over four million.\n00:27:18 - Dan’s iPhone (danddcompany.com)\nThirty-one, yeah.\n00:27:20 - Tina Marie (profitdriversinc.com)\nRoughly. And we'll find out where if the ceiling is real or if it changes because of all this stuff. So, I just, I'd curiosity, don't know how this works because I don't know what the different sections are. But I wrote how many score releases for CPA Exam 2025. This is the course Becker said, the course sections will be available with continuous testing and 16 different score releases release dates in 2025.\n00:27:48 - Dan’s iPhone (danddcompany.com)\nThe core is odd for in reg.\n00:27:55 - Tina Marie (profitdriversinc.com)\nThere's four sections in that, right?\n00:27:57 - Dan’s iPhone (danddcompany.com)\nYes, it'd be other sections. I forget what they're called, but those, Those are probably so all the additional score release. So I guess this is what they're doing. There are now section dedicated score releases. So the score releases that the score release. The core score releases usually where we get our huge bump and that will not be we won't be as effective as much because the number one section is far. So it's still in core. Therefore, their back is gone. Back is going to be those other things. And back is this I think the lowest section. So if anything, if we will either get the same outcomes around the score release or nearly the same, and then you're just going to get all these bonus outcomes around the supplemental or whatever. And there's three tests in that. But you only have to pass one so it's like ISC TCP and something else they pick one they have to pass it We don't really know the failure rates and stuff yet because I'm not people have taken it to fail But that number will be more solidified by Certainly by the end of the year If I add these up, I think it was around 23 and I don't know if this is right But I would imagine What do they call them the other ones?\n00:29:38 - Tina Marie (profitdriversinc.com)\nDisciplines the other ones are disciplines 16 And there's no other But unless 21 22 23 24 25 Are these\n00:30:06 - Dan’s iPhone (danddcompany.com)\nSo, that's this year, right?\n00:30:08 - Tina Marie (profitdriversinc.com)\nYeah, that's right, right.\n00:30:10 - Dan’s iPhone (danddcompany.com)\nThat's why. Those are the remaining ones.\n00:30:11 - Tina Marie (profitdriversinc.com)\nYeah.\n00:30:14 - Dan’s iPhone (danddcompany.com)\nYeah. that's all of them. So, I'm pretty sure that's way more core releases and core releases are where we crush.\n00:30:26 - Tina Marie (profitdriversinc.com)\nAll right.\n00:30:28 - Dan’s iPhone (danddcompany.com)\nAnd so, we should benefit just period, finally, something might go in our favor.\n00:30:38 - Tina Marie (profitdriversinc.com)\nSo, 16 core releases, how many are there normally?\n00:30:50 - Dan’s iPhone (danddcompany.com)\nIt's, there's been no normal, right? Oh, yeah. stopped doing them. Last year, they changed it, right? So, we'd have to go look at like 2019. I'm sure someone still has that post it somewhere, but I don't know about that. I'm That's something. Yeah, that sounds right. It's like, I was going to say, it's like two or three a quarter.\n00:31:37 - Tina Marie (profitdriversinc.com)\nYeah. So five more score releases than 2009.\n00:31:42 - Dan’s iPhone (danddcompany.com)\nRight. Five more core and then totally new ones. Well, not totally new, but they're new as of this year.\n00:31:52 - Tina Marie (profitdriversinc.com)\n2018 was 11. I it. I'm thinking 2025. And do you really good for another spending?\n00:32:04 - Dan’s iPhone (danddcompany.com)\nUh, yeah Does Jeff know how good he has it with his van? Yeah He should just making sure yeah, he just doesn't like He just doesn't like when I say no Don't like it. I already know where your hands is going to be. No, but let me just get it out.\n00:32:27 - Tina Marie (profitdriversinc.com)\nI go. No Hi Yeah Good like he's waffling on he's waffling on doing the new products.\n00:32:36 - Dan’s iPhone (danddcompany.com)\nI'm like we are doing it And he tried he tried to argue You know argue his point on monday and he's saying, you know when we did We did the subscription thing. I go dude. Well, we did the subscription thing I knew exactly what was going to happen If we did exactly what was on the sheet and we did you even call the timeline pretty close Yeah, yeah, it was all map. So here I said, I don't know what's going to happen. So he wanted to lower the make of the low end price $47. I'm like, no way, man. That's a bad idea because you're baking in a potential failure. I'm like, it cannot be lower than 67 because worst case scenario is everyone buys the 67 still and we have achieved nothing other than there's now a clear separation between a supplement and a course. And yes, some people will buy the course, but we have no idea. My argument is we raised the base price $10 and then we sell the other one for $87 and I'm sticking to that idea. And we're baking in growth. I mean, Jeff has had a winning idea or two, Oh, yeah, totally.\n00:33:48 - Tina Marie (profitdriversinc.com)\nHe comes up with stuff that I don't. But when it comes to the math of these types of things, I mean, the odds are in your paper for sure.\n00:34:00 - Dan’s iPhone (danddcompany.com)\nYeah, and it's, I mean, it's come out. She also wasn't understanding, I got, dude, we change the price of a subscription, we are starting at zero. You're literally erasing everything because we have no data on a $47 product. So then you have to wait 18 months based on our AOV or LTV to know what's really happening. go, that is not worth it.\n00:34:28 - Tina Marie (profitdriversinc.com)\nYeah. So, I saw a post of Noreos today with his watercolor.\n00:34:38 - Dan’s iPhone (danddcompany.com)\nyou see that? No, I haven't mapped it on the Facebooks at all. What?\n00:34:43 - Tina Marie (profitdriversinc.com)\na good distressor, but he's very proud of it. And it reminded me of Eor. So I thought about Mark's view. Terrible. They have that correlation. Yeah. So. It's not, I don't think that this is gossip, can not say anything, but, which is very interesting to me to get to talk to Chona, and I don't know anything about her other than you tell that people said he shouldn't marry her, but she is very enthusiastic. I'm like, is this going to be like when a, you know, husband recommends his wife to something and there's a strange woman, but she is so excited to work with me and so enthusiastic and so open and just really like kind of incredible, like the kind of person like, I just like, I love you, like, you're just so awesome. And anyway, and the first thing, well, the only thing that came up was, she's like, see, have to check my brain and be like, is this okay to share or whatever. This is between you and me and also, I think that is some type one good because of the. don't see intimate level we work with Mark and I mean that as just talking about the hard things that he goes through. We're not the average business people.\n00:36:07 - Dan’s iPhone (danddcompany.com)\nNo.\n00:36:08 - Tina Marie (profitdriversinc.com)\nBut the biggest thing is that she's like his brain is like zoom zoom zoom zoom zoom all over the place and I could do this and I could do that and she's like I don't understand how that works. I'm like calm down. I don't like you know so he's got these big dreams and big visions and she is just starting to because she's a Filipina woman.\n00:36:28 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:36:29 - Tina Marie (profitdriversinc.com)\nWomen in general are are bred to do a particular type of thing but especially in certain cultures and definitely in the Philippines and it's not to dream big and do big and act big but she's in this world where she's around very successful people all the time and thinks you know I could have that because Mark encourages or Mark thinks that she can do so anyway I can see how that would there would be a lot of resistance of not knowing how to to be in a world where you come from a culture of, I don't know, not the flash that Mark is around all the time, you know.\n00:37:08 - Dan’s iPhone (danddcompany.com)\nOh, yeah, totally.\n00:37:09 - Tina Marie (profitdriversinc.com)\nSo anyway, she's just like, I just, and I told her what I would do would bridge would be to bridge the gap between his excitement and his big vision and pace it for her and explain it to her. But I don't think that he can because that's the thing that I do, I think, really well as liaison between different types and personality types. And she's like, oh my gosh, that would be amazing. Anyway, she's, she's excited and I'm excited about it. And so anyway, I'll show that because I just think that that's cool. I also humbled and honored, I guess, if anybody puts you with their family member of any type, I just think what a compliment. So, thanks. also you gave me again. And also D&D company, I want to give a thanks to you guys, but\n00:38:00 - Dan’s iPhone (danddcompany.com)\nbecause there's going through things I know but you didn't but you didn't give me any ideas you said you gave me ideas oh i think i think so fixated on this like getting the whole moving like can't talk about it because i'm like it's happening like it got dropped in my lap and then but it's like people around her acting very weird right just like okay i'm gonna make this happen moving a needle in right yeah not you guys okay no no yeah that whole thing is like now it's real becoming more real right and it's but also it's like none of us know what it's right it's like it's just conceptual it's like yeah so what happened yeah yeah but even in the beginning it's still surreal until holidays or something happens and\n00:39:00 - Tina Marie (profitdriversinc.com)\nShe needs you and she can't immediately get to you. Although you've got way more resources so you can do that quickly. But, yeah, it's, uh, exactly. Thank you.\n00:39:09 - Dan’s iPhone (danddcompany.com)\nThat's why I dand signed up for Southwest credit card that gets points.\n00:39:14 - Tina Marie (profitdriversinc.com)\nYes. And gave Denise one and said, you can do this whenever you want them.\n00:39:20 - Dan’s iPhone (danddcompany.com)\nBoth, both you.\n00:39:22 - Tina Marie (profitdriversinc.com)\nThey don't like you, but they're going to know you're amazing.\n00:39:26 - Dan’s iPhone (danddcompany.com)\nGood job, dad. Good job.\n00:39:29 - Tina Marie (profitdriversinc.com)\nWell, anyway, if just a type of gift basket, something, if you have some ideas, I don't want to nag you about things or bug you, but you forget. So I'll just do texting and teaming until I get an answer. Okay. So Stacy said, um, I got more questions. But in terms of like, you said Bobby finished, she wasn't aware that he'd finish in about as I was wrong. Yeah.\n00:39:58 - Dan’s iPhone (danddcompany.com)\nOkay.\n00:39:59 - Tina Marie (profitdriversinc.com)\nYep. Yep. Um, but it's getting worked on still.\n00:40:03 - Dan’s iPhone (danddcompany.com)\nYeah, so I didn't realize that he so him and I have had a conversation about, uh, we're using like reset you as the example. So I think we had this conversation on Thursday. So like they made another request for, I'll just say a funnel. And the problem is that this is so sad. Apparently nobody can scope this except for me. Because Abish, I could be Jay's version. was like, Oh, think that's right. Bobby's version. was like, eh, that's not right either. And then Dan's version was, can't we just do X, Y, Z? And then those guys are like, yeah, we could. I go, OK, well, then let's that's how this is done. But then it and also my part. the problems then. And then I pointed this out. In the future, this would be a template. This would be a cloud template. So let's keep that in mind. Right. So in the future, if someone didn't, basically what I was like, Hey, no, no, no, we can just copy this funnel kit funnel and swap out the product. Done. Now if they want this to then go into lead flow or whatever, like this funnel does, then we need to, you know, estimate those hours or how much I can be doing this with those hours, which they can easily do. And I was like, but if it was just in the future, it was like, Hey, they want sales page. Well, we're going to have like sales page, ABC. And then we might have funnel AV that we might have phone or we might have whatever, right? And but it would be a cloud template. And we would say, so it would be launch cloud template, create product if it doesn't exist, attach product done. So we figured that out and then that reduced the scope, essentially, then, mean, I have to check in VJ's rate for that is like 25 bucks.\n00:42:12 - Tina Marie (profitdriversinc.com)\nYes.\n00:42:13 - Dan’s iPhone (danddcompany.com)\nYeah. So Bobby's like, what, what, what do we raise it? I go, my answer was all I'm saying is it needs to be a minimal 40% and Bobby's like, I think we should triple their price. I go, is that a minimal 40% because I go, is that a minimal 40% because it's way more than that. go, great. How much does it come out to be? It's like, it's 150 bucks. I go, I go, I like that better because then that sort of bakes in them being able to raise their price and us not having to, right? So, but I go, I always want to have a 40% profit margin on whatever we're doing. That's my target, right? We're not going for an agency 15. We're going for 40. just that's it, right? And then, so now. from that perspective, I was like, we can go revisit the pricing of the service from that vantage point. How do we say, how do we figure out what is the 40%, so it's not 40% now, it's that we're getting maybe it's 60 now, and we know that, hey, we're going to have to, this is going to happen, right? We're going to have to upgrade the server with Presidion. Well, that's a humongous price height. It's quadruple, but we won't be using all the resources, right? We're just going to absorb that cost. So you go from 800 to 3000, and I got, we've been avoiding it for months and months and months. like, no, we're not switching, because I'm not, I'm not eating that cost right now. So it would be like, okay, we have to factor in that. And then we have to factor in the Abish again, DJ, like I would factor in the doubling, right? And then, so where, how do we figure out that pricing that GPT will be? So that's, that's the last conversation I haven't thought about it on, I think it's 3-0 Friday. Except what I just said, I never said.\n00:44:10 - Tina Marie (profitdriversinc.com)\nSo that's it right there. don't know if I can have it, but I'll.\n00:44:15 - Dan’s iPhone (danddcompany.com)\nIt's okay. totally know what I just said.\n00:44:22 - Tina Marie (profitdriversinc.com)\nAnd I did make most of the notes in here. So if you wanted to look at that. Yeah.\n00:44:28 - Dan’s iPhone (danddcompany.com)\nYeah, because my other argument was like, we have to be comparative to a good job or whatever, but we don't have to. Pop their price.\n00:44:37 - Tina Marie (profitdriversinc.com)\nWe can be higher than that. Well, yeah, because.\n00:44:43 - Dan’s iPhone (danddcompany.com)\nIt's more than that. That's, this is a managed service. Yeah.\n00:44:48 - Tina Marie (profitdriversinc.com)\nis not managed. Right. Yeah. Yes, I'm just going to put this in here in your text or email or I'm just to send the link. I think that, I mean, it would be interesting to me to have a conversation with chat GPT about your scenarios where you can't get people on the same page with you about some of the text stuff and say, look, here's our scenario, here's the task, here's what these people said, this is their role, here's what this person said, so I'm checking BJ, this is what I said, this is what I suggested. I don't know if we could give it enough information to be able to help but. But anyway, the biggest thing is if you could come up with a, almost like a decision matrix for them to measure the logic and go, like, how did you come to that conclusion? What's the simplest way to do it, which maybe would be the decision point, right? little diamond, is it these options, whatever, which one is the simplest, whatever that type of thing?\n00:46:27 - Dan’s iPhone (danddcompany.com)\nI think the problem is that there is, like, we haven't defined, hey, these are the three landing pages, hey, these are the sales pages, right? They're defined only in design only, but they're not defined like, I mean, to be completely honest, they don't even exist in reality, right? They exist in that the blocks exist, so therefore you could make that layout, but we have never made the layout or used it, because the theme is irrelevant. So in the future, whatever sales page and checkout page reset you is using, I will get rid of it. It would be like, hey, put them on checkout page A or one or whatever the naming command becomes. And then there's no question, it's like, hey, they need a new funnel funnel one. Okay, great. knows what funnel is. funnel one is, what funnel one does, where funnel one lives. But right now there is no funnel one, right? Everything is, it's, there is no menu. The menu exists only in concept, but the menu does not exist in reality because the item on the menu also doesn't exist, but that should all be resolved come November, come October, asked Abishik for an update today, like, all right, Eric says we're on track with Frank. Are we on track with Frank? If we are on track, do you have an ETA for? the woofer site launch and he's asleep so I'll probably get that answer tomorrow. But I mean that's it, but that's literally D-Day. Or B-Day, basis day.\n00:48:18 - Tina Marie (profitdriversinc.com)\nGo B-Day.\n00:48:20 - Dan’s iPhone (danddcompany.com)\nD-Day's got the publications.\n00:48:22 - Tina Marie (profitdriversinc.com)\nI'm going to send that to you soon because I wasn't paying attention because I was talking to you. I'm just going to add this part into which is that you haven't defined the pages or the layouts and that that will help with the logic and the pricing.\n00:48:38 - Dan’s iPhone (danddcompany.com)\nYeah, the menu will be real, right? It'll be like it will be like you can have a picture, right? Here's what your burrito is going to look like.\n00:48:49 - Tina Marie (profitdriversinc.com)\nIt's like a catalog with an actual image that you can have and here's the you know the item in the catalog.\n00:48:56 - Dan’s iPhone (danddcompany.com)\nSo yeah. Yeah, and then we'll be able to and that it will be in use, right? Fulfer will be using what would be check out page one and then sales page layout like the sales page layout is, you know, the copy that Maria and I did and the design is done and if the copies all in it, like, but it's been built how you I'm going to I'm started meeting with her this week, every day. I'm again.\n00:49:24 - Tina Marie (profitdriversinc.com)\nYeah, so.\n00:49:25 - Dan’s iPhone (danddcompany.com)\nEvery day. Yeah.\n00:49:27 - Tina Marie (profitdriversinc.com)\nSo all 15 minutes a day. So I can just get a I'm talking to somebody who cares about what I'm doing. And so I get a little like accountability and. On the bill of body. Yes. Um, I think, I think, um, the, there's equal benefit to both of us, but the power I know of what I'm giving her is different. She already feels different. She's excited. She's on fire. she's, she's like, I should be so tired today. ate gluten and I went to sleep late. whatever she's like, but I'm energized. I'm like, that's what clarity does, baby. But yeah, so I think that I think that will be really good for me. But like one of the things we did today was I asked her basically her business origin story and she's amazing. Like she's done crazy things and she's probably a genius. And just really, um, I don't think she's always played small, but, but she, uh, again, I don't think I'm, I don't, by the way, telling people to have to think.\n00:50:43 - Dan’s iPhone (danddcompany.com)\nOh, her and I went deep.\n00:50:44 - Tina Marie (profitdriversinc.com)\nDon't worry. So anyway, basically being married to a narcissist, rector, as it does to women, uh, get anybody. Yeah. But yeah. So anyway, I think that, um, she's just. and new seasons of life and everything else. But anyway, she's really, really smart. She just is not centered on anything. I'm trying to figure that out, but I think her heart is her center because she just loves business. both had paper routes and bought our first bikes with our paper route.\n00:51:22 - Dan’s iPhone (danddcompany.com)\nAnyway, I didn't feel like you two have parallel vibes and almost parallel resumes. Because she was undercover behind the scenes on some largish stuff. But then ultimately, it didn't work out, right? Whether for whatever reasons, right? the business was F-ed up or the guy was F-ed up or whatever. And then she went sort of solo still undercover and she, like you, is very much resistant to it's bizarre. It's, I want to, but I don't want to do her own thing, right? So she's, so she's, she's putting her toe in and she's pulling her toe back out. And then she's like doing it. And, but it seems like it's inevitable.\n00:52:14 - Tina Marie (profitdriversinc.com)\nUm, he doubts herself very much. Yeah, which is weird because it's not how you deal with the narcissist for so long.\n00:52:22 - Dan’s iPhone (danddcompany.com)\nYeah, exactly.\n00:52:25 - Tina Marie (profitdriversinc.com)\nshe's got the result. You do crap.\n00:52:27 - Dan’s iPhone (danddcompany.com)\nCause somebody literally tells you that every day. Yeah. She's got the results. So it's like, that's the part that matters. Yeah. She's got the, the, the speak, she knows the language.\n00:52:38 - Tina Marie (profitdriversinc.com)\nShe, she's very, she's data driven.\n00:52:41 - Dan’s iPhone (danddcompany.com)\nYeah. Like, yeah, I mean, I'm dying to do something with her. just need a damn code.\n00:52:46 - Tina Marie (profitdriversinc.com)\nYes. We should do something with the three of us. You would balance us out. So good.\n00:52:51 - Dan’s iPhone (danddcompany.com)\nOh my gosh. Yeah. want to do mom and family with her period. Like, I'm going to, yeah, that's what I want to do with. I told her about it. She's like, oh my god that sounds like that sounds so cool and i'm like i already know how to generate the leads already you're i'm going to put them into that thing that i sent you that's my plan i'm like okay i can put them into this i will i'll use high level for the whole thing i was generating leads for less than two bucks on this one lead magnet i think i might change the lead magnet marks working on it i talked to them about it this week i just need to sort of revisit that stuff and go i need the code and then it would be like all right cool get all the design stuff pulled together you know most of it is and just make sure it's all looks right built right and then i don't want to run ads oh so you did that for sure i know i don't want to run ads but i want to be involved in the ads right it's like okay and then obviously be able to have someone this that gets data right and then i can and i feel like i can get her data no one else ever does yeah here we go like And then, but she's, she's, you know, all her little case studies are very dated through them. Yeah. That's how you do it. Yeah.\n00:54:09 - Tina Marie (profitdriversinc.com)\nshe gets it.\n00:54:11 - Dan’s iPhone (danddcompany.com)\nFunnels successes math, blah, blah.\n00:54:14 - Tina Marie (profitdriversinc.com)\nWe're going like, yep. Yep. I'm like, that's, and I could keep her focused. So she doesn't sabotage and over stretch and do too many things. So there's any, any way to help there or just, I would just love to see her work with somebody.\n00:54:33 - Dan’s iPhone (danddcompany.com)\nThat's good. I mean, it's literally my plan. I'm just waiting for the damn code and it's probably not going to happen until I realize it's probably not going to happen until January, but whatever. That's fine. New year, 2025.\n00:54:47 - Tina Marie (profitdriversinc.com)\nLet's go. She's awesome. I'm so excited to see what happens though when she, I don't know, I like liberating people and she is a person that was guarded and trapped. told her it's, it's, I saw the mask and I was like, I'm just going to tell you, I think you're guarded and you can't be like that with me. So I'm pushing and we'll see what happens, but she let me in.\n00:55:10 - Dan’s iPhone (danddcompany.com)\nSo anyway, yeah.\n00:55:13 - Tina Marie (profitdriversinc.com)\nmore smart women.\n00:55:14 - Dan’s iPhone (danddcompany.com)\nI'm so excited.\n00:55:15 - Tina Marie (profitdriversinc.com)\nAnd I wouldn't know about her without you either. So thank you, I had no idea.\n00:55:22 - Dan’s iPhone (danddcompany.com)\nShe was her. She, she.\n00:55:24 - Tina Marie (profitdriversinc.com)\nKeep my interest. But you find her because you go down rabbit holes.\n00:55:28 - Dan’s iPhone (danddcompany.com)\nYes. Hopefully.\n00:55:30 - Tina Marie (profitdriversinc.com)\nThank you for being a rabbit hole follower.\n00:55:33 - Dan’s iPhone (danddcompany.com)\nYeah. It was, she said something about writing coffee for women, I think. Or it was very into what I was doing with the chat GPT thing. The wolf or spreadsheet.\n00:55:45 - Tina Marie (profitdriversinc.com)\nOh, yeah.\n00:55:47 - Dan’s iPhone (danddcompany.com)\nYeah. Which we ended up using.\n00:55:50 - Tina Marie (profitdriversinc.com)\nhard. Superized guys, any movement in that conversation.\n00:55:58 - Dan’s iPhone (danddcompany.com)\nI never even wrote them back. just. don't see a path. And so I realized with you, right, where I was like, oh, we really need this. Right, right, right. I reached out to Hamza, wrote him a brief scope, saw that he read it on Upwork, hit him up again with my favorite, my favorite response. Yes, question mark, no question mark, maybe question mark. And he responded, and he was like, I would like to do this hourly because it's, you know, a bit of a moving target, whatever. And I said, that sounds great. Can you give me an estimate on the hours that would take you to create a beta that we only use internally? Does it mean a thing? I just need something that we can bang on. And he said, I will do that. And I will get back to you. think he said he would do it today. I am not really logged in off work yet today. So I'll check on that. He's 40 bucks an hour. He's as good as hired. Let's see. He comes back and says $400, which I seriously tell you So yeah, I think he's going to say, you know, 15, 20 hours, not even how do you know, we'll see.\n00:57:19 - Tina Marie (profitdriversinc.com)\nSo they'll be way cheaper than they and some of you that supervise things that they're going to get. Yeah, but then you'll be a competitor, guess what?\n00:57:30 - Dan’s iPhone (danddcompany.com)\nAnd I'll be able to go back with them and say, hey, look, I just did this for $600, right? And the cost, I know the cost, I know I can figure out the cost for me to use their software and convert someone to an email. That's the only cost I care about, right? So for them to create a follower is 30 cents. I can do that with an ad. I can do it at a greater scale. So then the question is Can I turn the ads? What's the cost of turning an ad into a follower versus the super ice?\n00:58:09 - Tina Marie (profitdriversinc.com)\nIt's going to be super duper close and The way I do that is with potentially $1,000 What I'm just taking $1,000 out $1,000 ad Yeah, was like we don't spend it Which could still be all power flowing You know what I just realized It took me that when you were talking about lead flow you're like I've never been able to visualize all that it is like for me It was a system that and it took me forever to get here figuring out that it was your automations in high level But to me, but now I it's your high level account period Right that you call lead flowing Yeah, that's my white they don't dance. Yeah, I do not realize that. This is the thing without seeing the stuff when we talk about it conceptually and not screen share, I'm like, it takes me so much longer to wrap my head around it. Yeah, which is probably a useful conversation in when you struggle with having any conversations with Abhishek and Vijay, maybe doing more screen sharing as they're talking about things, just clicking on it, looking at it so that they can make the visual correlation between what's happening in your mind.\n00:59:37 - Dan’s iPhone (danddcompany.com)\nWell, I don't know what I think the issue there is, you know, they were, they like, the information gets to them incorrectly. So basically, they based it off of literally what Ross wrote the ticket. But then they did another task that Frick rope, and I'm like, why is this a landing page? Like, is there a reason why you guys made this landing page that I'm not getting? Because it shouldn't be a landing page. And then, and then, so Eric screwed that up. And then I started to, I was like, oh, we should do XYZ. And then I sent that. And then the next day was like, wait a minute. I looked at the page, then even I got it. I looked at the page and I like, whoa. You know what, I didn't even talk to the SNO people. So, you know, when the information you're working off of is wrong, essentially, or, you know, sort of mis-scoped. But that version gets resolved by the menus. The one that I just brought up is just a one-off that, you know, we just, it just wasn't obvious looking at the design, what it was to any of us. Yeah. Then I went to Gert. And then even when Gert. Sabry wanted, I was like, how did he do that? This is custom. Okay, I know what it needs to be now. So they actually built it right. It's just now we have to decide it should not be on the page for a different reason, even though it works.\n01:01:17 - Tina Marie (profitdriversinc.com)\nOkay. Any updates on Mom? Just I got to get the book over to Katie.\n01:01:27 - Dan’s iPhone (danddcompany.com)\nSo Katie was waiting to close on her house, which they did over the weekend and they're moved in. Just sent a photo with her large cheeked baby. The baby's got like jowls. like, oh my god. So much cheeks. So now that there she's like, you know what, we just got to get that out of the way. So I got to dig that up, send it over to her with my thoughts. What I was thinking as far as this metaphor of the organization and then her and Jeff was like, We'll do it, or, you know, that her husband's name or something? Yeah, he's also an editor. So between the two of them and me, we should be able to get it. then Mark's like, I don't give a what you do with that. It's a great, because that's pretty much my plan. Not giving a about what you think. Sorry, buddy. Good job writing it. And then that to me is like the Maria project. It's like a book funnel. Or that's one of them. So like I imagine you could have a book funnel and then you could have the freebie funnel, which would be the cheat sheet, right? Which is going to be a release cheat sheet kind of thing. That's the new one that Mark's working on now. Before we used a royalty cheat sheet that worked, but I'm not sure it attracted the right avatar. But then again, we also didn't have a funnel to drive them through, right? Like I was just proving. step one, can I get a lead? could now buy that stupid snapshot probably today and then get moving on that. Oh, I guess I need to make a mom account or I don't think I have one. Now I have to move the mom account like I told you now I'm just move it. gonna move it between agencies and then I'll make the team account. I do have a bunch of leads in there.\n01:03:30 - Tina Marie (profitdriversinc.com)\nBecause I now that the girls are back in school, I'm just like doing the best of doing things out and they're not around all the time. It's something about just hovering as a mom when the kids are home. I'm afraid to get into anything because I'm not even kidding you. The percentage is probably high 90s. Every time I sit down and I'm ready to be creative, the people I care about most want to talk. nobody wants to talk to me for hours then hours hours and so I'm just can't about it because they're not gonna be here forever so I just be like okay let it go and I feel like a slacker and I judge myself and I'm like I'm not but still like that's just my priority but anyway all right it's 110 10 and they're texting me and I probably should let you go yeah I'll give you one update this is gonna be great it's gonna be like the cliffhanger update and then we're gonna I'm gonna just hang up on you and there is informing Jamie today that she's out I need to save those notes so apparently there's a 60 day first write a refusal clause that she's gonna tell Jamie this exists FYI so you have 60 days and she's asking for 300 grand\n01:05:02 - Dan’s iPhone (danddcompany.com)\nWhich is not going to happen.\n01:05:04 - Tina Marie (profitdriversinc.com)\nNo, so then what does that mean?\n01:05:06 - Dan’s iPhone (danddcompany.com)\nThen she can go sell it without Jimmy's input at all.\n01:05:14 - Tina Marie (profitdriversinc.com)\nThat's rough. Yeah. I am happy for Heather. I can't not feel bad for Jamie. No, what she did in it, but I don't. Wish, you know, there's so many things that go into how she behaves. And not everything is her fault. But even when we do do things and it is our fault, you still kind of got to feel bad. Because somewhere something, something went wrong and it's just. I'm glad for Heather moving on and maybe it'll help Jamie. I we all have to learn lessons and usually the hard way.\n01:05:57 - Dan’s iPhone (danddcompany.com)\nhave to learn everything the hard way pretty much. Yeah. mean. I talked to Heather and I said, just be prepared for like, no one's going to buy this. I hate to break it to you. And then so I'm like, you should have a, you know, owner financed thing on the table. She's like, I don't trust Jamie to do that. I go, no, I know you control all the finances. So the owner finance would be, I'm taking 80% of the revenue until this number is met. And then I'm releasing it all to you. Period. And she's like, oh, that could be a plan B.\n01:06:34 - Tina Marie (profitdriversinc.com)\nI'm like, girl, that's your plan A. hate to break it down.\n01:06:37 - Dan’s iPhone (danddcompany.com)\nIt looks like it's a plan B, but it's really, yeah, yeah. You might want to add a bubble to the bottom of that A because it's a B.\n01:06:48 - Tina Marie (profitdriversinc.com)\nThat's man, business is like, parenthood too. Like you think it's going to be one thing and you build it to be one thing and it's never, but you think it's going to be no matter how hard you work it to be that way.\n01:06:58 - Dan’s iPhone (danddcompany.com)\nNo, no, And I was like do it. Yes. was like just do it right now And then we had a call together this morning and Jamie was so awful on the call.\n01:07:08 - Tina Marie (profitdriversinc.com)\nI was like oh my god What's she?\n01:07:13 - Dan’s iPhone (danddcompany.com)\nWhat's that I was gonna ask what she did, but I'm not trying to be like oh it was just like she all out of nowhere Was saying well, I didn't get paid to do the gen pucks of videos last time and you know It's got a big deal, but this time I want to get paid and Heather's like you've never been paid to do those. Yes I have I think we're just both misremembering Heather's like no, Jamie Never happened. Yes. Well in December of 2022. So clearly she like Rose is narrowed over to her head I got a large check in December 2022 right before the gen tucks deal launched Heather said yeah That was a member distribution because we were flush with cash Nothing to do with generation that's not how I remember it and Heather's like yeah, but that's what it is. There's no record of you ever. So then Jamie there because Jen Tucks came back. And so first Jamie didn't want to do it because they have so many bad reviews. And it was like, you know, there's a moral aspect to this. And I was so ninja on the phone. And I was I can't wait. I was when I talked to Heather, like, you see what I did there? And by the end of the call, Jamie was like, Oh, yeah, let's do the videos. I'm like, you're so weird. And that but then I don't know where she brought up this thing where she should get paid as the talent to do the videos. And then Heather goes, I guess we'll just do the the version that doesn't happen. And then it was like, oops. And then I'm like, Oh, this is so over. That was after the show up on video. No, I don't know. I was on the phone.\n01:08:53 - Tina Marie (profitdriversinc.com)\nThey might have been I could just imagine the faces on one of the calls with the two of them when they were going through stuff. And that was when Heather first started standing up to Jamie after we'd had some talks and I was like this is really glad I wasn't on video because I have no hope for me at all. Okay. Anyway. That's a terrible way to end a meeting on whatever. Go pet my dog.\n01:09:26 - Dan’s iPhone (danddcompany.com)\nThere you go. Me too. Let me go eat some food too.\n01:09:30 - Tina Marie (profitdriversinc.com)\nPerky.\n01:09:31 - Dan’s iPhone (danddcompany.com)\nThat's good.\n01:09:32 - Tina Marie (profitdriversinc.com)\nYes. I am.\n01:09:33 - Dan’s iPhone (danddcompany.com)\nAs matter of fact, exactly that.\n01:09:38 - Tina Marie (profitdriversinc.com)\nSeven years.\n01:09:39 - Dan’s iPhone (danddcompany.com)\nI've learned a couple of things. Here we go. All right.\n","contentPreview":"00:00:01 - Dan’s iPhone (danddcompany.com)\nHello.\n00:00:03 - Tina Marie (profitdriversinc.com)\nHello.\n00:00:04 - Dan’s iPhone (danddcompany.com)\nWhat's up?\n00:00:07 - Tina Marie (profitdriversinc.com)...","processedAt":"2025-05-04T03:40:52.604Z"}