{"fileName":"Done transcript for D&D Co & Profit Drivers - Weekly Review(9).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done transcript for D&D Co & Profit Drivers - Weekly Review(9).txt","type":"transcript","priority":"medium","content":"00:00:06 - Tina Marie (profitdriversinc.com)\nOh, wait, you don't hear me. I was talking about you and being sassy and I was muted.\n00:00:12 - Dan’s iPhone (danddcompany.com)\nThat's the mute.\n00:00:15 - Tina Marie (profitdriversinc.com)\nNot very effective. Dang it, what is that? How are you?\n00:00:25 - Dan’s iPhone (danddcompany.com)\nMr. Van Ryan. Oh, I'm good.\n00:00:28 - Tina Marie (profitdriversinc.com)\nHow are you? It's sassy on mute.\n00:00:31 - Dan’s iPhone (danddcompany.com)\nThat's how I know There you go.\n00:00:33 - Tina Marie (profitdriversinc.com)\nI'm all sassy on mute. And the word castrated came into my mind.\n00:00:43 - Dan’s iPhone (danddcompany.com)\nOh, my.\n00:00:47 - Tina Marie (profitdriversinc.com)\nYeah, let me open up my notes and see which one of my faces. Um, what's new this week? What's been going on in the business world?\n00:01:00 - Dan’s iPhone (danddcompany.com)\nI Get ready moon here, okay Eric's gonna be happy about that. He doesn't know it yet, but he's about to know it Talk about weird late not weirdly not weird at all Tina let's face facts my life the the dude I Don't know where I found this guy, but he Frank guy. It's Frank. Yeah, I don't know where I don't know how I Managed to find Frank But I bought his course And I think I went through it Parts of it and then I gave it to Eric and Eric went through it now at the time. It wasn't really contextualized. It was like We didn't have stuff from here yet, so I don't think we'd actually Totally moved in the blocks direction, so it was Maybe a little premature or whatever, but I mean I definitely bought the course before moon year I think I could actually go with that up, but then Eric subsequently gave it to Amishik and DJ like two weeks ago And they started going through it went to them late and then I was like, okay, how do I? You know my thing, you know When I was around complain like oh my new you're so terrible like okay Well, do I how do I solve this and I was like I need someone Like we're 80 90% there I'm like I need someone that could come in and say do this do this do this and I don't even need them to write code because I ultimately To have Eric and Abishik and DJ or whatever to have those guys Write and maintain the code or at least maintain I finish it maybe whatever you want to call it I was like that's the ideal set up so then I found some dude that I don't know and I reached out to him And then I was like, I'm just gonna retuck Frank because I've asked him questions and he's always answered them and of course my other thought is why is no one else thinking of this but whatever so I reach out to Frank write him an email hey man we've got these developers he's like why was I ghosting us but it's completely like the projects on a basic standstill here's where we're at I need to finish it I've got these days and Frank writes me back and his emails like I absolutely do this I can do we can do it two ways we can do it hourly or you can take you can pay for the month and it will work like this we get on a phone call per week I'll do a code review each week make sure they're on track as a matter of fact I did this exact thing for this company and then he's like go check out their stuff and go check out this guy's testimonial and it wasn't even a testimonial which was great it was just a section of a podcast where the guy was getting interviewed and the podcast I started asking him about the development. He goes, oh, well, when it came time to develop this theme, had bought Frank's course and we contacted Frank. And he said, yeah, I can do this with you. And he guided us through, and our developers did it.\n00:04:15 - Tina Marie (profitdriversinc.com)\nI'm like, oh my God, this is exactly what I'm talking about.\n00:04:17 - Dan’s iPhone (danddcompany.com)\nAnd the theme is so similar to basis in a way. And I'm like, yeah, okay, yeah, you've literally done this. Right. Like, this is great. So he wrote me back today and he's like, yeah, let's do it. I was like, yeah, dude, I'll pay you $1,500 a month. He's like, you said it would take six to eight weeks, depending how busy they are. He's like, yeah, I'll take number in the six to eight weeks. I was like, I love it.\n00:04:45 - Tina Marie (profitdriversinc.com)\nSo I have to keep him. You had a similar kind of beginning with Munir.\n00:04:51 - Dan’s iPhone (danddcompany.com)\nYeah, this guy is definitely different because he's got this course and he's constantly updating it. Like he's very on.\n00:04:58 - Tina Marie (profitdriversinc.com)\nYeah, that is different.\n00:05:00 - Dan’s iPhone (danddcompany.com)\nand he owns his own agency. Like this guy, he owns a well-known agency. Uh, I think he owns part owner of human design. Um, what? Yeah, I think that's, or does, yeah, I know the name of the agency.\n00:05:15 - Tina Marie (profitdriversinc.com)\nI, I definitely know it. Okay, you know, design is like a, anyagram kind of like thing.\n00:05:22 - Dan’s iPhone (danddcompany.com)\nSo, um, it's something, it's something with human in it. I might not give any, it's, or it's designed by humans. It's one another. I don't know. But it's like a high-end agency. And so, but the difference is he's not going to write any code. He's not coding anything. He's just saying, you got to do this. You got to do that. He's like, I'll examine your repo. I'll make sure that all your processes are correct. How they can move forward to maintain the code base. All the things that they action. And I didn't tell him any of that. So, he was giving me stuff they, I've said that they need to get clear on. And he's like, Oh, no, yeah, no, I'll show him to do all of it. And it's exactly what he did for these other guys. And the other guy wouldn't shut up about how great it all came because they had never developed a block at all. They'd never done any block development whatsoever. They went through his course and they started and then they were like, Oh, we need more. We need to make sure that we're like, we need a Sherpa. And so I came in and shurpered them.\n00:06:31 - Tina Marie (profitdriversinc.com)\nWow.\n00:06:32 - Dan’s iPhone (danddcompany.com)\nYeah. So I'm going get that role in here today, tomorrow.\n00:06:37 - Tina Marie (profitdriversinc.com)\nWhat does Frank's course teach?\n00:06:40 - Dan’s iPhone (danddcompany.com)\nBlock theme develop block and block development.\n00:06:46 - Tina Marie (profitdriversinc.com)\nSo he's definitely on different level of doer.\n00:06:54 - Dan’s iPhone (danddcompany.com)\nHe's a teacher. like this dude said, he's the only, it's the only course I've that's, yeah, literally the only one I ever found, and that was, you know, over a year ago, and he's been on it from the beginning, like here. What's also so funny is he sent what the reason I reached out to him is because he sent an email the other day, like, I'm on the list of a buyer. And he pointed out this new feature, I was like, God damn, that sounds exactly like what we need. And then I send it to the guys and they're like, oh, yes, you can do this. That would be perfect. And I'm like, I'm sure we're not using that feature. So he's super duper. He's like up on things like Munir is, but maybe even more so. But the problem with Munir is like, he's just hosting. It's like he's writing the code. So it's like, it's his team. And then he's like, I'm not used to working in this type of scenario. I'm like, I'm pretty sure you suggested this. So why did you suggest that if you're not used to it, buddy?\n00:07:59 - Tina Marie (profitdriversinc.com)\nRight.\n00:08:00 - Dan’s iPhone (danddcompany.com)\nBut whatever, this is, as the medium told me, Nia was not going to work out of don't trust him. Don't add him to the team. was like, I'm not going to, but I did think he was going to finish the project.\n00:08:13 - Tina Marie (profitdriversinc.com)\nI was wrong in that regard. Yeah, I mean, it was so close. And yeah, it did not seem like it would go that way.\n00:08:24 - Dan’s iPhone (danddcompany.com)\nIt was so close until it wasn't.\n00:08:27 - Tina Marie (profitdriversinc.com)\nRight. So then Eric, I just keep thinking about Eric and his bitterness, but then and then directed at Meneer. But maybe there is, I don't know. So what's the, what's the overall temperature on Eric this week?\n00:08:50 - Dan’s iPhone (danddcompany.com)\nThey, those three seem to be getting on the same page about stuff.\n00:08:55 - Tina Marie (profitdriversinc.com)\nAll right.\n00:08:55 - Dan’s iPhone (danddcompany.com)\nB.J. and Abhishek? Yeah. So they're like, all right, we're going to get all this. So he actually just ran a bunch of stuff by me. was like, yes, he has no, yes. Do it like this. And he's like, OK, perfect, yeah, that's a few. I guess they had a long meeting this morning. So like, and it's just getting things so that like it's very, everything's the same. Like, OK, they're all, it all looks like this. And all that when we build the site, we're going to add these steps up and every time. It's very technical stuff that we've discovered recently because all of these hacks and whatever. Right. And a lot of it's stuff that I was like, we should do this. But I'm saying it in Slack, right? then now they're, you know, Abishik's really good about like compiling everything and then saying, hey, so I guess they met and they're like, all right, this is our game plan, what we're going to do.\n00:09:49 - Tina Marie (profitdriversinc.com)\nOK, so Frank, what is Frank doing that's different than what Eric and Abishik and me are going to do?\n00:09:58 - Dan’s iPhone (danddcompany.com)\nThey don't know how to code blocks. Oh, they don't really not not at all, but just like rank and be like, go here, take this path.\n00:10:10 - Tina Marie (profitdriversinc.com)\nSo, like, I thought most of the blocks were finished. So how much what blocks need to be finished, what, what is all the blocks are done.\n00:10:23 - Dan’s iPhone (danddcompany.com)\nSo the main problem right now is the theme. So there's 11 tasks that I sent. So if you first think of it in two pieces, right, basis is essentially two pieces. It's the theme, the base theme, and then basis blocks 2.0 is the blocks plugin. all the issues that Abshek and Vijay are having around building a site are theme based. So they're like, hey, the theme doesn't do this. And then they go look at, they started looking at like 20, 24, which is WordPress's default theme, right? And it's a blocks theme. And they're like, if it's here. or then it could be in ours, we wanted in ours. And then it's that, it's all these like, I mean, I could get into the menu show, but just suffice it to say, it's like theme level code. on the blocks, then it's like, oh, there's a couple things about the blocks. Like one of the layout of such and such a block is off, whatever, but they're like, doesn't matter. It's less, there's less to do there, but what's really holding up like, building wolf reciting are theme related things.\n00:11:32 - Tina Marie (profitdriversinc.com)\nNow, I thought Norio built the theme.\n00:11:35 - Dan’s iPhone (danddcompany.com)\nNope.\n00:11:37 - Tina Marie (profitdriversinc.com)\nOkay, cause I thought- He built the old one, but he has not been involved in the, so blocks require a block theme.\n00:11:46 - Dan’s iPhone (danddcompany.com)\nOkay. can't have, you can't have a classic theme.\n00:11:49 - Tina Marie (profitdriversinc.com)\nNorio built the He built the original basis theme and the child theme when you were like bootstrapping all that.\n00:11:55 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:11:57 - Tina Marie (profitdriversinc.com)\nOkay. All right. It's hard to like it's not like it's not that I can't comprehend a lot of it on the technical level It's that you have the conversation.\n00:12:07 - Dan’s iPhone (danddcompany.com)\nSo rarely like I can't remember And and I understand the details of it without asking some more questions and I wanted a little bit more about You were right. He did. He just did build this one. Okay, and like and the way things work now is like Completely different. That's why these guys are like how do we do this and Frank will be like It's here.\n00:12:30 - Tina Marie (profitdriversinc.com)\nI know because you started it and then they built out a Gutenberg and you're like but the Everything but but that's the thing everything changes and it constantly changes. So but what won't change is that um and this is this is like I don't know how to say it, but I almost feel like it's more like at a spiritual level Now that I'm thinking about it What won't change is that very is this oppositional force to clarity and to truth, right? If you can think about it, there's always opposition to clarity and truth. So there's opposition to good and clarity and truth are part of that, which so I'm just, I'm Tina braining right now, which is really weird. I hear myself, I know I sound weird, but it's a thought that I just had, because I was thinking about, you know, things evolved, you would think that clear analytics would be part of the evolution, but my brain instantly was like, well, no, it won't be because there's opposition to truth and clarity, because that causes confusion and there's definitely, you know, this force that wants confusion and anyway, that was just weird. But yeah, so you will be always be needed, because by default, I think there will never be something that is very clear that helps people have clear data, clear understanding of their business, because that makes them powerful, right? You can't know what levers are the right levers if you don't understand what they are, what they do, the impact that they make, aka data, analytics. So regardless of how much WordPress itself changes, and the themes change, and the technology, and the underlying foundational basis of them changes, I don't think there's ever going to be anything that is by default does anything like what you do for the purpose of the things that you do, which is, you know, fast, reliable site, but also clear, valuable, usable data, and easily created websites that give all of that, that, that, that make it possible to have all of that. Anyway, so I was just wondering the whole path that how long it's taken, but I guess what was the original motivator and it sucks because like if we could just do osmosis and like relay thoughts instantly, that would be so different because it takes like 10 minutes to explain something that passes through my brain almost instantaneously and simultaneously, but that like it's wild that it's taken this long to be working on this and the fear is that technology could evolve and you have done all of this and then become obsolete, but all of that that I just said was my brain's argument that happened instantaneously that you're not going to be obsolete because of the data component because of the clear, because of the simplicity, because of the reliability and all of that. Nobody does that on a massive, level, aka like WordPress, right? Or most of the other big things, because that isn't their primary goal, like that's your ML right there. Fast, clear, easy, reliable. Anyway.\n00:16:16 - Dan’s iPhone (danddcompany.com)\nYeah, and it's the, you know, if all these things are moving to like fractional this and fractional that, it's like you can outsource this whole thing to one place and be done.\n00:16:28 - Tina Marie (profitdriversinc.com)\nIf Dan sells it. Yeah.\n00:16:32 - Dan’s iPhone (danddcompany.com)\nWell, that's they mean.\n00:16:33 - Tina Marie (profitdriversinc.com)\nI'll sell it first.\n00:16:35 - Dan’s iPhone (danddcompany.com)\nI'll sell it when it's ready, but come on. But seeing what he did with these other guys, I'm like, oh my god, that's so close, except I looked at their stuff and I'm like, ours is better. Because they're, they're building it as an agency. So they're building for their thing. And I'm like, well, we're building it for someone to run their business on and stuff like that. Well, you're Frank going and then hopefully it'll be in six to eight weeks and weirdly that's exactly what the medium said.\n00:17:08 - Tina Marie (profitdriversinc.com)\nWell, so when did you go see a medium like the most recently?\n00:17:13 - Dan’s iPhone (danddcompany.com)\nWell, I didn't tell you that.\n00:17:15 - Tina Marie (profitdriversinc.com)\nWell, seen two.\n00:17:16 - Dan’s iPhone (danddcompany.com)\nI've seen two.\n00:17:19 - Tina Marie (profitdriversinc.com)\nOkay.\n00:17:20 - Dan’s iPhone (danddcompany.com)\nThe one was with my mom is the one that we've seen forever. hmm. The ball was the one that was like, there's someone on your team that you can't trust. And she's like, uh, and do not keep this person around. I don't want you to keep this person around and go, well, I know who you're talking about. I don't plan on keeping them around. And she's like, it's not a bad person, but you can't, you can't rely on them. And I was like, that's so weird that she would say that. But I knew exactly who it was. And then so I like, Oh, yeah, I know the plan is to, you know, not keep more. like I'm telling you don't. I go okay um so then we can dinkly. He's he's out. Yeah and then I met with a different I met with like a medium psychic channeler yesterday and uh that Molly turned me on to some Molly um and Molly's been you know Molly is like this uh woman that I worked with here.\n00:18:30 - Tina Marie (profitdriversinc.com)\nShe's the first person I met years ago um was she the like which one lady?\n00:18:37 - Dan’s iPhone (danddcompany.com)\nYeah she's the one that calls me which yeah okay so when you like I said that I was placing my hands together pressing my hands together because I was thinking about that story yeah yeah anyway okay I'm making her bring the right thing yeah so she recently resurfaced and seen her in a while and so she's come here a couple times the office and you the studio for stuff. And so she was telling me one day she was here. She's like, Oh, I gotta introduce you to Carissa. Like Carissa's that she's next level blah blah blah blah. And I was like, okay, she's like, you love it. I got you know me. I'll try it. So she reached out to Carissa and was like, Hey, this is my friend Dan and it'll be great if you could do a reading with him or whatever. And then her assistant wrote back like, Oh, Carissa's booked up for like 18 months. There's no there's no whatever like we can put him on the wait list or whatever. And yeah, yeah, got it. It was like, Oh, okay. And Molly's like, Oh, well, I mean, you're on the wait list or whatever. And I go, okay, whatever. And then maybe a couple weeks later, this person woman emails me and it's like, Hey, I've got I've neat with you. And I was like, Oh, okay. And then we kind of went back and forth and figured out a date. then I hit up Molly. I was like, Hey, Carissa reached out to me and set up a date. going to meet with her. I'm talking to each other. Oh, I can't wait to get her. Okay. So then in the interim, because this is months ago, like I was booked months in advance. And then in the interim, Molly went to one of her journeys, like they go to Sedona and go out in the desert or whatever, right? So when she was at the journey, she pulled Carissa to the side and was like, Hey, why, why did you like, I talked to Dan, you're doing a call with him. Like, I thought you were booked for 18 months. Like, why, how, what's going on? And she said, Oh, well, I reached out to him energetically. And she's like, I have to talk to this guy. He's like, his energy is crazy.\n00:20:52 - Tina Marie (profitdriversinc.com)\nAnd Molly's like, Oh, wait.\n00:20:56 - Dan’s iPhone (danddcompany.com)\nJust wait till you talk to him. And I was like, oh, that's so funny. And then then the call got screwed up because she got sick and then I started thinking I'm not going to do this call I was like weirded out by it for some reason. I was like, I don't think I should talk to this person. Like, I don't know. There's so I'm like, I was like borderline scared. Okay, I do this. So I did for like three weeks and then I was walking home the other day and I was like, no, just do it. Like the fact that you don't want to do it means you should do it. So I emailed and I was like, and she had sent the dates. I'm like, let's do this date, which is yesterday. So then we, right when we get on the call, it was like, I just need to tell you a couple of days up front. She was like, so what she had said was when I agreed to the call the first time, she goes, okay, the reading starts now. So I'm going to be meditating on you and reaching out to you and you can do the same to me. Like if you want to open yourself up and allow. Allow yourself to reach out to me. You can or whatever. I was like, okay, like what the are you talking about? Okay, sure So she's like three starts now, but so don't know a couple weeks and then I said that to Molly. She's like, oh, yeah, Like you can you can and I know I don't I don't I'm out. How would I even do that? So a couple weeks into it Like I don't and Molly was like, yeah, you can reach out to her in your dreams And I was like sure I Do not remember my dreams like ever. It's very rare to remember them, but One night I have this dream like weeks after this stuff's been booked I'm not really thinking about it at all But I have this dream and a woman is in my dreams and it's a face and I don't know who it is Like I don't know who that is and then I woke up the next day and I was like that was weird Like, I don't recognize that. I was just weird. I just remember thinking, oh, that's weird. And then I you not. A couple of days later, I go, wait a second. What does this person look like? I don't even know what this woman looks like. So the woman in my dream was like, 40s, maybe 50s, like strawberry blonde hair, there is . I look out this woman. That's exactly what she has. And I was like, that's so weird. That is so weird. I'm like, I wonder if that's okay. And then a couple weeks later, a couple weeks before now, four or like three weeks ago, I had this dream where a guy was in my dreams and it looked like my uncle. But I was like, I'm not sure that's him. But I thought, oh no, that's Jack. That's my uncle, Jack, who's alive. And then... And I remember waking up the next day and I was like, Oh, like, am I having one of those things where the person is Dan, and they came together. So I go online, looking to see if they want to get news. Like, I text my mom, like, have you heard anything about Jack lately? He's like, Oh, he's fine. Well, okay, whatever. So I got in the call with her yesterday and up front, she's going, I got to tell you some stuff. And she's like, your energy is crazy. And she's like, I have every time I reached out to you through meditation, she's like, you shifted. You've shifted again, you shifted again, you shifted again. She's like, it's not normal. She's like, you're, she's like, you're on this journey. And you've been on it for like the last four years. She's like, I don't even want to talk about what you did before because you did stuff before. We're not going to talk about it. We're going talk about the last four years. But she's like, just these last nine months, you've, you've made this thing and you're shifting. When every time I tap into you, you shift. You should get like a master's class in like spiritual journey, because you're doing things at such a fast pace. It's like nothing I've ever seen. I was like, oh, okay. And she's like, to give you an idea, when I normally do one of these readings, I come into the reading with one or two pages of notes. She's like, I have nine pages of notes sitting in front of me right now. So she's like, I'm just going to go. It's going to go fast because I want to cover all of this. And she's like, so just be prepared. That was like, okay. And then she just opened this fire hose and started going. And the accuracy was off the charts, right? So I was like, okay. Now, what I didn't tell her was before we got in the call, I never said this. I never told anybody this that what I've been wondering for years. I know that I have two guides. know it. I know there's two people. I don't know who it is. I feel like they're family members, right? I just know that they're there. So we eventually get into the call. And I don't know where she goes. You have a very strong connection with your guide.\n00:26:19 - Tina Marie (profitdriversinc.com)\nThere's two of them.\n00:26:23 - Dan’s iPhone (danddcompany.com)\nNow, I've always wondered who they are. So all of a sudden she goes, she switches into. She's like, I'm going to, and she said this might happen. She's like, at some point I might just switch into medium. And she goes, okay, I'm switching, right? There's a bunch of people here that want to talk to you, that are waiting to like interact. I go, okay. So the first thing she says is, I just hear piano music. Somebody is playing piano. It's beautiful. And this is a gift that they had. And they're like, but it's a gift that they got from their father. So it's my grandfather. I know that's he played piano, but what I didn't know was that his dad played piano. So I like, okay, she's talking about my grandfather, I think. I don't know that he played piano. So I like, no, to self, ask my mom. And then she goes, there's another guy here, and she's like, this is one of your guides. I you not, Tina. The second she said that, the name Joe popped into my head. And she goes, it's a J name. And then in unison, we both said, Joe. She goes, she goes, whoa. I want to come back to that. I go, okay, goes, okay. yeah, Joe, and she starts talking about him. And I'm like, this is either my uncle or my grandfather. And I thought it was my uncle, but she's saying stuff. And I'm like, sounds, I don't know. So she says all this stuff. she's like, Joe has been with you. I'll watch is over you Joe how Joe's life did not turn out the way he thought it was going to and she goes into all this detail I'm like that's grandfather and then she says some other stuff. I'm like that's uncle So I think she didn't realize that they had the same name and they were kind of crossing back and forth But then she's like Joe Watches over the girl with an a name He's very he's very watchful of her and I was like what the Like wow She's like who's that who is that? It was it was wild. It was wild some of stuff that she was saying But then she goes she goes okay. I want to stop How did you know it was Joe and I got I didn't it just the name popped into my head before you said it She's like seriously. go. Yeah, it's like dude. That's crazy. I'm like you're the medium What are you talking about?\n00:28:53 - Tina Marie (profitdriversinc.com)\nSo I have to tell you something because I So my spirituality obviously is religious specifically.\n00:29:01 - Dan’s iPhone (danddcompany.com)\nOh, so's hers. That was the other weird thing.\n00:29:05 - Tina Marie (profitdriversinc.com)\nI want to tell you this because this is this is where it's me. This is your dime, by the way, we're talking about all of this. Normally, I am very resistant to so the scriptures talk about beware of sous sayers, things like that, basically that really don't engage with mediums and whatnot. Okay, but here's, I'll tell you this, I approach the scriptures very differently because I feel like that there's there's a spectrum of people and obedience and understanding and spiritual strength and powers and whatnot. And I think that the majority of commandments are given for basically the average person, right? This is the guidelines that they need. And I believe that there is room for exploration and that people with higher level spirituality will be able to discern where the difference, I guess, between the letter of a law and the spirit of the law and discern between good and bad and be able to actually figure these things out for themselves rather than just to be like, okay, three-year-old boy, these are the boundaries, don't go outside of that because if you do, it'll be dangerous. But really, it is dangerous, but also, there's so much more to explore. You're just not equipped to be able to handle the danger, so I want you to stay inside here. Whereas other people are equipped to handle the danger and equipped to do the exploration and equipped to learn and to expand perpetually, which is where I fall. You fall. So, and I've had experiences with, like, Ouija board and it won't let me play with that by myself because it literally just moves my hand off the board because I don't want to talk to dark spirits and I believe that dark spirits can do whatever they want to they can lie and that good spirits can't but that good spirits also have to obey certain rules and act in a certain way and one of my biggest the only indicator I ever have that I trust what's the word like always always always always trust is peace because Jesus Christ is the prince of peace like that's the only whether people believe in him or not is irrelevant to me but that that he and God that that is the only emotion that Satan or any kind of darkness can't replicate they can replicate everything else pleasure excitement tell the truth mixed with lies you know a little bit here little bit there because They don't do good, but they can look like they're doing good. When you were talking, my original, you know, my normal, I would say kind of walls, but it's more like a discerning net, I guess, is my discerning antenna, not net, because I like to be open and receive things so that I can learn always and try to catch myself in judgment so that I'm not judging things that incorrectly. What was interesting to me, especially when you got to Joe, first of all, it was the absence of negative feelings and anxiety, which I often feel around many medium conversations, because I think there's a lot that just aren't great, but that wasn't there. So I noticed that that wasn't there, but what surprised me was this feeling. And that I'm very, very much recognized and identify with being God related, a piece of warmth, from head to toe, and wanting to cry, which is also that like manifestation that that comes with it. And that really surprised me, it made me think I want to talk to her. I'm always like avoiding, I'm like, I will, I'm not going to do things God does not want me to do. I just applied, did I tell you that I would be a missionary? No, I'm going to do a genealogy missionary mission.\n00:33:33 - Dan’s iPhone (danddcompany.com)\nI'm super excited about it.\n00:33:36 - Tina Marie (profitdriversinc.com)\nAnd she's like, you're not actually the youngest one. She goes, we have people in their 20s. She goes, but they're autistic. I was like, Oh, other than the autistic on there, the youngest ones are being it's called the senior mission. But we'll have devotionals on Wednesdays. And I've committed 12 hours a week to just genealogy work for the church. And that's we do that for so that we can do tempo work for the dead so that people that didn't have an opportunity to be baptized, to see baptism and things like that. Anyway, so that was just this whole thing. It was just wild to me. And of course she felt your energy, like, I was just thinking she's like, you're not normal.\n00:34:18 - Dan’s iPhone (danddcompany.com)\nThat's Dan everywhere in his life.\n00:34:21 - Tina Marie (profitdriversinc.com)\nWell, you know, it really crazy.\n00:34:25 - Dan’s iPhone (danddcompany.com)\nSome of the that she said, I was like, there's no way, there's no way you could never know this. So she was like, hey, I just want to let you know that like, she's like, you have a great heart. But she's like, you're a kiddie. You have two Achilles heels. Oh, I go, okay. And she's like, your first, your first one is, you help too much. And I was like, get the out.\n00:34:54 - Tina Marie (profitdriversinc.com)\nHow could you?\n00:34:55 - Dan’s iPhone (danddcompany.com)\nTina has told you that too. No, I know, but I was like, how could a stranger? Right. know that. And she's like, let me, let me explain what I mean by it. And then she goes into the explanation. I was like, yeah, I'm like, she nailed it. And I was like, yeah, I've recently come to realize that that my help is not helping. And she just laughed. She goes, Oh my God, that is so perfect. Yes, your health doesn't help because she's like, they're advocating responsibilities and putting them on you. And it's not your responsibility. And she's like, you need that you need to stop doing that.\n00:35:29 - Tina Marie (profitdriversinc.com)\nI'm like, you have no idea.\n00:35:32 - Dan’s iPhone (danddcompany.com)\nShe goes, at one point, she goes, she's like, the biggest word on this page of notes, she's like, I'm nine pages, but the biggest word and all this is the word space. So she's like, you've been creating space, you need to keep creating it. I go, there's one, there's one left. Like, there's one left. And she goes, what do you mean? I go, there's one of those advocating, whatever relationship. And I told her a little bit about how I figured all this stuff out.\n00:36:03 - Tina Marie (profitdriversinc.com)\nShe knows. Oh, yeah, you need they need to go Are you talking about Eric?\n00:36:07 - Dan’s iPhone (danddcompany.com)\nNo, um woofer They need to go and I was I forget what the other one was. She sent the call. I gotta listen to it again It was like two hours or some , but Now here's so much more now, man Here's the trippy here's the trippy part that she obviously couldn't have known or doesn't know And I went to the other medium right Paula who I've known for like 20 years At the end of the thing Paula goes is there anything else you want to ask me I go. Yeah I'm supposed to meet with this medium who's like a Channeler bop up by explaining to her and she goes, okay, let me let me, you know, let's look at that All right, great. So Paula like does her thing and she goes, okay She's going to tell you that she can't help you go any further. And I was like, okay, she's like, that's it. She can't help you go any further. I was like, okay, but I Molly that, Molly instantly goes, oh no, that is not how Carissa works. That's not what that will not happen. It was a thousand percent happened. She was like, at the end of the call, she goes, I have nothing for you. Wow. She's like, that never happens to you. I'm going to give you a couple of things, but she's like, you're organically doing these things. Yep. And you're fine. And she's like, and by next year, she's like, next year, you're going to have the biggest shifts in your life. And it's all the work you've been doing is leading up to 2025. She's like, 2025 is going to be a huge year for you on all. from, but she's like, I don't, you could, I could offer you to come to one of my sessions, and you're welcome to, but she's like, honest with God, you don't need it. You don't need anything. And I was like, oh my God, it really wouldn't been other person said.\n00:38:16 - Tina Marie (profitdriversinc.com)\nlike, this is trippy. Yeah, but it doesn't surprise me though, because if there is anybody that is, and I say if, because I feel like I have strong intuitive powers, which is why really early on all say things to people that I really don't have a foundation for saying. I don't really have enough knowledge to say it, but I know it. And a lot of that is psychological profiling, but that's definitely not all of it. There's a good portion of intuition. But also I've been watching you and you, you, I think the, like you have a level of knowing about yourself, but you, you fight it anyway.\n00:39:02 - Dan’s iPhone (danddcompany.com)\nRight. told her that.\n00:39:04 - Tina Marie (profitdriversinc.com)\nYes.\n00:39:04 - Dan’s iPhone (danddcompany.com)\ntotally admitted that.\n00:39:06 - Tina Marie (profitdriversinc.com)\nYeah. But I feel like that actually is the biggest shift that you've made, but the momentum of that it has rapidly increased in the last year and a half or so. And I'm not sure if there was a thing that happened or a trigger or you just arrived at a tipping point. Maybe I had something to do with the age of the girls too. was like, because being a parent changes you and raising people changes you. As you watch them, you start to re-evaluate your childhood because you can now see it from a parent side and go, okay, I have these experience and those feelings and now you just kind of see them differently or it re-validates things. But either way, you have a new level of knowing, just raising children, and that will change you. Anyway, regardless, your level of knowing and confidence and first of all, installing, but then enforcing boundaries and shrinking them a little bit. So like when I met you, there was all kinds of people in dance and or something that didn't belong there. And you, so that shrinking right first started happening, that just pushing people out. But at the same time, I think the, like imagine the boundary of being a physical wall, the density of that boundary also increased. And it's like, I don't know, however you want to visualize it. That's what's fortifying. like you're the certainty of you belong, you don't belong and here's why and it doesn't matter if you agree with that or don't agree with that and also your understanding of the cost for so like solving people's puzzles you're like oh well I learned this and I learned this and I accept the cost of that but I think that your value of what price you're willing to pay for learning has also shifted a little bit and then anyway all of those things are just kind of converging I guess would be the word and her hurt so I the funny thing is I didn't look into her that much right I was but then on the phone I was like oh she's like definitely like very Catholic I would say so at one point she was like you oh my god this keeps happening to Tina I don't know what else go\n00:42:00 - Dan’s iPhone (danddcompany.com)\nof this, but she's like, you are surrounded by symbols of Christ. She's like, you're surrounded by them. And she's like, you're like, there are, she's like, I'm seeing nuns and priests and churches. She's like, you're, you're surrounded by it. She's like, you're very, like, you're very connected to the Archangel Michael. She's like, you're very connected to that. But her explanation of like the journey that people go on. She's like, he compared it to Christ's journey in that like, but it's people's individual journey. She's like, there's a death of self. And then you, then you go into the tomb, and she's like, the tomb is almost like, she's like, if you think about it like this, Jesus was reborn almost as if he came out of a womb. It was the tomb, the rock rolled away, he emerged. she's like, and then he's reborn as his spirit self. She's like, that's the journey You can take not like him, but that those three steps and she's like right now you're in the womb So it's so funny that you're like you're fortified you're surrounded. I'm like, oh, that's weird Or like what she said So did I did I build a tune?\n00:43:18 - Tina Marie (profitdriversinc.com)\nWell, and my faith believes that he was resurrected resurrected like with a physical body and that we were all spirits before we came here and that we receive our bodies and that we will be resurrected and we see them back again, but they will be changed and unable to die unable to be corrupted and What we know about science that makes perfect sense to me that there's the ability to figure that out, you know Anyway, it's all fascinating to me, but yeah, yeah, so We spent so much time on that. really want to know that I mean, I don't regret that. I just want to make sure that we also do But it's anyway, it's part of journey we do that we do Mercer's course. Yeah, yes, yes. But this is the thing, though, is that I've really been able to I've been leaning more into the whole list approach because the business is nothing without the solidity of the CEO behind it, the visionary behind it, the the person and all of those values. Like I think about Mark, I think about everyone's evolution that I've ever worked with. And the biggest transformation happened with the person, then then their business, the business had a correlating transformation. But 100% every time the person had the bigger transformation. Like when you think about who you work with, how much time has been working with them, the way that you handle them, but also like your sleep, your hormone health, your physical health, I did I'm not the one that did all of that, but you've been on this journey, we discuss it, and then you go and do different things. But just being an assistant or facilitator or whatever it is to that process, and knowing that the systems, the teams, all those processes are critical, they're the simplest part of it. They're really easy to do. The first thing is kind of editing, modifying the person that's running it so that their prime is to be able to understand the power, the need for not only creating the infrastructure, you know, in the particular way, in the logical way, which to me also is part of my mission. What I don't to out of people's lives. I feel like that's kind of preparing them for when they're ready to talk to God, when they're ready to have him in their life, because they now recognize people that lie. They now recognize chaos. They now recognize darkness a little bit differently. And that's not the conversations we have, but it happens. They become happier people, but they put more order in their lives. They put more goodness in their lives. They put more integrity in their lives and in their business. Anyway, it's just been wild. The things that you happen, you're like, it's wild, but of course, I've been having so much of that, the people that marks into me. I was just like, I want different clients. And I was like, do you have anybody? And then he sent me somebody and that guy was awesome. And then there's, he's talking about another person that as I'm working with the new doctor and just, Working on the mission talking to you all the things that you're going through. I'm just like it's just it just keeps getting better Faster, but also like right Darker on the other side. You know what I mean? Like the polarity. It's wild. Anyway, okay. Yes. Marshall Mercer Mercer Where are we happening? Huh?\n00:47:20 - Dan’s iPhone (danddcompany.com)\nIt's happening. just got it's long Yeah, like there there's like it's not a course. It's like five. Oh Go through. Yeah. Yeah, finished one.\n00:47:31 - Tina Marie (profitdriversinc.com)\nWait, that the like the cave the whatever Is that what you were calling five or like what?\n00:47:38 - Dan’s iPhone (danddcompany.com)\nNo, no Framework So it's like framework then GA for itself then Measurement and reporting plan So like his whole thing is really you learn the framework and then you do the plan and the plan, I'm forgetting a step, a plan something and then the launch or plan to launch something, there's three steps. So but in each of those steps, you have to, the first step of planning in the cave is GA4. So you got to go learn GA4, right? So you go through the whole framework and it's like, okay, this is the overarching 30,000 for view. Now go set up, go learn GA4 real quick and then set up the basic GA4 and then you're going to go set up your reporting and forecasting and then you're going to set up whatever you're going to do the cave version of all those. So you're going to do those steps three times, then you're going to go back and you're going to redo the plan from the valley. So you're going plan again, that might be where you're out in GTN. I'm going to to go through all of them because I'm not in the cave in some respects. I'm in the Summit in other respect, right? So I'm all over the place So I have to go through all of them, and I'm sure there's little nuances like There's probably stuff in that a I don't need GA for it all right? So there's probably stuff in GA for I mean, I really don't know it, right? It's like I don't know But there's probably little said you say you don't need it or you don't know it know it know it Oh, cuz I thought you said you don't need it at all So it sounds like you're you'll do like the foundation the framework of everything then GA for then like this measurement and forecasting thing and Then something else and then you go back and they'd be like oh you want now you want to do custom Okay, Now you're gonna do GTM So there's at least four or five So I'm on two. I'm on the second one.\n00:50:03 - Tina Marie (profitdriversinc.com)\nWow, that's a lot.\n00:50:05 - Dan’s iPhone (danddcompany.com)\nYeah, it's a lot. But and here's the thing. like, who's going to do this? No one. But once you do it, and then it's available to everyone.\n00:50:17 - Tina Marie (profitdriversinc.com)\nYes. I love that though. Okay, so at this point, so last week, you told Lynn probably like another week or so or something. What are you thinking now?\n00:50:31 - Dan’s iPhone (danddcompany.com)\nOh, no, I didn't say a week.\n00:50:32 - Tina Marie (profitdriversinc.com)\nOh, my God.\n00:50:34 - Dan’s iPhone (danddcompany.com)\nYeah, I can probably get it done in that period of time.\n00:50:41 - Tina Marie (profitdriversinc.com)\nI just feel like it's a momentum kind of thing that it's and keeping everything fresh because of the technical nuance of it that. But then again, there's that whole kind of subconscious distilling that happens when you're like, your brain is working it out. when you're not like, oh, I could do this. Or, oh, I need do this. Or it just kind of makes more sense kind of thing. Oh, anyway. And I also know that it's not a, I kind of refer to myself sometimes as having full energy, which is just like, I'm going to plow through. And also knowing that that really never works out well for me. That doesn't work best. But anyway, OK, how is another 71 doing? Like, what have you observed anything? Any changes? Any ahaas this week?\n00:51:41 - Dan’s iPhone (danddcompany.com)\nNo, other than like the sales during 4th of July were higher than expected, higher than the last 2th of July. So it was like, oh, we can really get a dip, which is weird. But we got a bunch But it's on point with the other surge that was already.\n00:52:00 - Tina Marie (profitdriversinc.com)\nalready happening, right?\n00:52:02 - Dan’s iPhone (danddcompany.com)\nNo, so that would have ended on the 25th. So, and we did get a huge spike in cancels around that date. Like I'm so visually obvious.\n00:52:15 - Tina Marie (profitdriversinc.com)\nIt's like, Oh, that looks weird.\n00:52:16 - Dan’s iPhone (danddcompany.com)\nBut it was to be expected. So then that had us lose some subscribers. That that was week prior. Then this week we gained subscribers, but then the daily average was still 32. So I was like, okay. But if that makes sense, then we're in the high season. But what didn't make sense is that it was better than the last two for the July's. But not like crazy, Tom.\n00:52:50 - Tina Marie (profitdriversinc.com)\nYeah. So, and did you have any new thoughts or feelings around the ceiling?\n00:52:58 - Dan’s iPhone (danddcompany.com)\nNo, we're gonna hit it. It's unavoidable. Yeah, we're getting close. I think we're at 4060. So I had estimated that hitting at 155 days, around June 20th, I figured that out. So by August, I think, August, September, we should hit it. And that'll be also when sales start to dip again. So then we'll probably... So there's a chance you could go over it. That's the problem. It's like, yeah, we could go over it in this quarter. But when you zoom out at the end of the year, it's going to end up being that you hit it. Once you hit it, you're going to be in and around that number from that day forward. So if we hit it, we could hit it and exceed it in September or August. But when things slow down and we go back down to a 22-day average, we're averaging 32 now. you're going to go over, but your sales are going to naturally cycle down and keep 2, 3, Q4 to the 22. And if you're already out, that's if you're over the ceiling, it's going to come down to 490, but it won't go way below it. So that explains how in the past, we saw like, oh, we had like 4,500 subscribers, but that was like a peak that lasted three weeks, right?\n00:54:22 - Tina Marie (profitdriversinc.com)\nAnd we just weren't looking at in the context of, oh, when you zoom out, it's all the same, same, same, same, same, So I have notes for, and this was a couple of weeks ago that we talked about it, the conversion rates and the purchase path for the 2-path page. Oh, my dog.\n00:54:49 - Dan’s iPhone (danddcompany.com)\nHold on.\n00:54:49 - Tina Marie (profitdriversinc.com)\nYes. Thank you. for the 2-path page to determine which path has higher conversions and where to optimize. so yeah so yeah I'm not I'm not gonna do any of that stuff until I go through mercy yeah yeah because that's part of his thing is like why would you even do that like why would you do why would you do that in the context of not really knowing what's happening right which is what I've done forever right what the heck is that oh my gosh I just copy paste and it did percentage MCE paste bin percentage I feel like I'm gonna end up being tech support in my mission I I have I mean I spent six years in the tech support community and a call center and didn't do it the whole time I'm mostly managed but Yeah, it's okay. But also because it's like search stuff and mission, like I feel different about it. It's not like I have to do it, you know what I mean?\n00:56:10 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:56:11 - Tina Marie (profitdriversinc.com)\nThat makes it different. And they have to have some level of skill to even be able to do it, so there's stuff. Let's see, it's turning extent of customer confusion about ninja being the supplement versus the full course. Reach out to Delphi AI. Oh, that's the Joe thing.\n00:56:30 - Dan’s iPhone (danddcompany.com)\nOh, we did that. Yeah. We built a ninja bot. It works really well. It works really well. The Bobby's been working on that a bunch. We're actually just subscribed. We're like, screw it.\n00:56:45 - Tina Marie (profitdriversinc.com)\nIt's a little bit more about that, like what it does and how it's doing.\n00:56:58 - Dan’s iPhone (danddcompany.com)\nYou're basically building an agent.\n00:57:00 - Tina Marie (profitdriversinc.com)\nright?\n00:57:00 - Dan’s iPhone (danddcompany.com)\nLike you can't inject it to before, but they must add some layer on it that helps it. I mean, they're not. It's not like they have their own LL and they're tapping into checking the TV line.\n00:57:15 - Tina Marie (profitdriversinc.com)\nAll right. Oh, so I did ask this, but I like, or maybe I thought about asking it that we were deep in the whole medium conversation, but just Eric. Oh, I was asking, so you said, hey, I'm B.J. and Avishik or on the same page with stuff, but like, well, something I noticed on the call this week, which is not, I was trying to figure out like how you're reading Eric and his attitude. And I was like, trying to pay attention to him, and I remember him feeling this way before when I was first working with him. him and he got annoyed with me and mad at me. And it was it's because he's very subtle about it.\n00:58:08 - Dan’s iPhone (danddcompany.com)\nIt's full of passive aggressive.\n00:58:10 - Tina Marie (profitdriversinc.com)\nYeah, but if video is so acid. Well, hold on. I want to explain what I what I felt when I was listening to the call, which is this and but he's so mild in all of it, but it's almost like this annoyance and like I don't know anything like he's like I don't know. And like it's really when I was listening, I was listening carefully. I'm like, if you didn't know Eric, you'd never know that there's an issue. It's not overt in any kind of very sunny, very sunny.\n00:58:42 - Dan’s iPhone (danddcompany.com)\nYes. Yeah. It's very there's a the facade is like sunny, happy, helpful, but it but then you listen to the words and sometimes the delivery like Yeah, he's he's\n00:59:00 - Tina Marie (profitdriversinc.com)\nBecause was just very like, yeah, yeah, and it's really, I would have no way to be able to compel anybody to believe or understand that there's an issue if I, you know, wanted to. Yeah, which is just so interesting because that type of personality can really make you question what you think you're feeling, or you know what I mean, because it's so passive. Right. But I would imagine that that creates its own level of conflict, because like, do you just say what you actually think and how you actually feel?\n00:59:39 - Dan’s iPhone (danddcompany.com)\nWell, I mean, I think I have to do like, I can pick it up via a slack message. Like, I know what it looks, see it. Yeah.\n00:59:47 - Tina Marie (profitdriversinc.com)\nhere we go.\n00:59:48 - Dan’s iPhone (danddcompany.com)\nYeah.\n00:59:49 - Tina Marie (profitdriversinc.com)\nSo yeah, but it seems to have lessened for sure. Well, that's good. Do you think it's because Moneer's gone or less interaction with Givar?\n01:00:00 - Dan’s iPhone (danddcompany.com)\nLike, do you have any? any idea why? Oh, you might have hit on it right there. Yeah, he's gone. He's got some health issues, so that are sidelined him for weeks. So the vipers out of the building, right? Well, it's like the yeah, the toxic sort of you just made me think like something you said made me think like what like he sits around stews on things and I'm like really that's your problem. Like don't sit around and stew on it. Like redirect that energy into something else. Like go put on a fricking book or some . How's he? But I think when it's compounded when it's you have this soundboard for lack of a better term. Oh, yeah. Exactly.\n01:00:56 - Tina Marie (profitdriversinc.com)\nIt's not a soundboard.\n01:00:57 - Dan’s iPhone (danddcompany.com)\nIt's an echo chamber.\n01:00:58 - Tina Marie (profitdriversinc.com)\nIt's a it's from this negative energy.\n01:01:00 - Dan’s iPhone (danddcompany.com)\nYeah.\n01:01:01 - Tina Marie (profitdriversinc.com)\nWell, I mean, whatever, ultimately though, you, you, here's the thing, here's the trap with people like that is because they're so passive and so subtle. And because it waxes and wanes, we increase our level of tolerance for it, but it doesn't decrease the cost to us. So, and you've been working with them long enough to know that at the end of the day, the evolution, I mean, it's not consistent. His cycle is consistent. Growth is not like, because I have a mom like this. She appears to grow and have cycles of growth. But, and I wish that I could show this to you, but imagine me drawing spiral circles, but my hand keeps raising up. So, I'm drawing them, like do it with your own hand, make a circle, but then raise your hand a little bit, make another circle, and raise your hand a little bit, make another circle. So, even though you're coming back down, your low is higher each time. To me that's growth, like you go up, you go down, you go up, you go down, but every time you go down, you don't go as low as you did the last time, that's perpetual growth. So, up and down, and down, the lows are different.\n01:02:31 - Dan’s iPhone (danddcompany.com)\nEric. what? Like Bitcoin.\n01:02:35 - Tina Marie (profitdriversinc.com)\nYeah, totally. gotcha. Eric, on the other hand, they're like my mom, like the lows, they go right back to center.\n01:02:45 - Dan’s iPhone (danddcompany.com)\nOh yeah. Totally.\n01:02:47 - Tina Marie (profitdriversinc.com)\nsame. And those are the people I've learned, like I, I don't cut them off, like I'm never going to cut my mom off. Um, but I, and I'm never going to stop. trying, but the level of effort that I put into it and the level of hope I have and the level of energy I allow her to use of mine is fixing determined and will not increase unless she changes that habit that knowing that you know she's 67 years old she's not like really change that habit. You've been working with Eric as long as we've been working together basically so at least seven years and he he comes back down to the same place that we were at seven years ago, six years ago. However long it was when we first started talking to him together and I was able to observe him and that is massively telling like your night and day difference. I've evolved so much more since then. Right. has evolved so much since then. Stacy has evolved and I wouldn't even tell you the only problem I would have was Stacy as her\n01:04:00 - Dan’s iPhone (danddcompany.com)\nconfidence in being able to go out there.\n01:04:02 - Tina Marie (profitdriversinc.com)\nBut, but she's grown. And she's diedily grown and improved. So, but Eric has come all the way back to that same place.\n01:04:14 - Dan’s iPhone (danddcompany.com)\nAnd that and always does.\n01:04:17 - Tina Marie (profitdriversinc.com)\nYeah. Yeah. So, but you're letting that in in your your realm. And here's the thing that I told you many, many, many, many, many times. And I don't think that you believe me. Is that that takes a bigger toll on you than I think that you're aware of. Because you tell yourself it doesn't bother.\n01:04:39 - Dan’s iPhone (danddcompany.com)\nBut well, it doesn't. And it's not even relevant because we'll go back to the medium really quick. Okay. said she can't, this was out. Sorry. This was hilarious. So at one point, she goes off in this tangent, she's like, you really need to focus on like, or, you know, you got to get this foundation. right, right? If the foundation is right, then you can, you know, you don't want to build on sand. So once you get this foundation right and it's, and it's rock solid, then you're going to be able to build on this. So I'm like, uh-huh, that's real basis, right? And then she goes, and when you're working on this stuff, this blew my mind. So I like, oh my god, did I do this on purpose? I never thought about this before. She's like, you're going to get these things and they're just going to start to flow, right? The thing is just going to flow. Everything's going to say, she kept saying the word flow, flow, flow. Like, I know I'm like, oh my god, all of them are flow. All of them have the name flow. And I was like, I never thought about that. And then she goes, hey, come the fall. He said something about like between this time period, she's like, hey, want you to go on a trip, just go somewhere, not like international. She's like, just take time, go somewhere. And she's like, but at that, that's the period in time where she's like, You need to have some conversations and you need to have, you need to lay down and make clear exactly what is going to happen. All the eyes dotted, all the teas crossed, get these agreements in place. She's like, I don't know if they're agreements or contracts or what they are, but she's like, you've already been renegotiating with people and you're going to have to do that one more time in the fall. And she's like, I just want you to be super, super clear and get exactly, get it all out and get it exactly down. So she's like, transparency is like your biggest friend, you're a very transparent person. She's like, you just got to get that down. I'm like, oh my God, she's talking about all the conversations I'm planning on having. I'm like, And I was like, that's so weird. But so tied into what you were just saying is like, I still need to do that. And I'm going to do it. And it's like, and she's like, if you do that, then you're set, you're all set. I mean, I'm 100% positive. There's zero doubt in my mind. Like, there's not even a shade of doubt that we will sell Ninja in two or three years, period, it's going to happen. And I'm working, that is my plan, and it's not going to change. And it's whether or not this stuff works. Like, yes, I want it to work. But if it doesn't, oh, well, I've done what I wanted to do. but I'm going to make it clear. Like, Hey, know, it's time it's, I sent this to Denise yesterday, or this morning. I was like, their choice is going to be you either go get a job at 53, good luck. That's going to be a joy. Or you figure out how to make this thing, you don't. would treat this like a job anymore. Right. Right. And it's it's it's either or like it's up to you. So and that applies to all of them.\n01:08:10 - Tina Marie (profitdriversinc.com)\nYeah.\n01:08:12 - Dan’s iPhone (danddcompany.com)\nSo we'll see.\n01:08:13 - Tina Marie (profitdriversinc.com)\nYou will see.\n01:08:15 - Dan’s iPhone (danddcompany.com)\nMy job is to get the damn code done. That's it. That's my job. And Frank, I'm to do it.\n01:08:22 - Tina Marie (profitdriversinc.com)\nI am excited to see what but you know the cautiously optimistic but I'm always down for the journey though because it doesn't matter every time I look back. I'm like, wow, you know, like imagine being on on a mountain and then looking back at all the mountains you've already climbed. Like to me, it's always like that. never look back and go where I've barely moved or I've gone backwards. It doesn't matter what didn't go right, what's not what I planned on. I can always look back and go, wow, every single day. And I think that's pretty cool. I think you do that too. Whether you do the looking back and think that or not, I think that you are always moving forward and evolving. like, if you were to stop back, I really have to say, stop saying and I'm like, but anyway, if you think.\n01:09:14 - Dan’s iPhone (danddcompany.com)\nRight, I've got some of those.\n01:09:17 - Tina Marie (profitdriversinc.com)\nYeah, but if you stop and did look back intentionally and just evaluate where you've come from every time, if I were you, I'd be like, Wow, yeah, that's pretty cool.\n01:09:31 - Dan’s iPhone (danddcompany.com)\nYeah, I mean, I think what's interesting is like, I don't really have a destination, right?\n01:09:38 - Tina Marie (profitdriversinc.com)\nI don't think there is a destination. That's the why. That's the why stuff everybody thinks is even, even like Christians and getting to heaven, I'm like, do you really think? there's there anything that suggests, evidentially, evidentially, whatever. Evidently, right, that there is like, where you just, You get to heaven and you just relax and sing songs to Jesus all day long. like, does his life indicate that sitting around being saying to you is something he would like? Like the universe is continually expanding exponentially every single day. There is constant growth every single day and evolution, like you think at some point that's just gonna stop and we're all gonna rest and relax and like that's forever. Like that makes no sense.\n01:10:26 - Dan’s iPhone (danddcompany.com)\nSo to me there is no end point.\n01:10:28 - Tina Marie (profitdriversinc.com)\nThere might be destinations on a journey and plots on a course, but there is no end destination. There's a final destination. There is just continual evolution and growth.\n01:10:41 - Dan’s iPhone (danddcompany.com)\nso weird that you say that. So I, someone gave me this book like two years ago and the book is, hey, you're supposed to open up the book every day and then there's like, I don't know if it's a quote or it's just a phrase. There's a phrase on my... one page and then there's like two other not necessarily connected but they go together right they don't necessarily go together they go together and that they're on opposite pages but the one that I opened up to this week and then they're like and then just read it every day and think about it the one I opened up this week is that the goals are just stops on your journey and I was like that's interesting I never thought about it like that like or or your yeah it was something like that I'll send it you I was like that's an interesting I never thought about it like that but that it seemed very applicable to me because I'm like I know they're not the destination the goal is not the destination to me it's like yeah so like I've always said I don't have goals I just go I want to go to I want to have these destinations but it's in a greater journey I guess like I don't know yeah well or some goals or whatever whatever you call them plots on course but yeah I mean That's it. It's like the dot.\n01:12:01 - Tina Marie (profitdriversinc.com)\nIt's like, I'm going to go there.\n01:12:02 - Dan’s iPhone (danddcompany.com)\nAnd it's like, some people would call that a goal and I'm like, well, I don't really call it a goal. It's like, I just want to get there. But that's not where I stop.\n01:12:10 - Tina Marie (profitdriversinc.com)\nThat's the other thing, though, is that I think a lot of us get really attached to language, where a lot of times we're saying the same things, but we're using different words. And the meaning behind those words is what's more important. And you have cultures where the words were drawn. You have, you know, people that communicate energetically, those words aren't even spoken. So, but you can feel it. And there's alignment. And when you do use the words, you're like, yeah, now I've heard the words, you know, that that's true, but I already felt it. Like, I already felt that I didn't have words for it anyway. So, yeah. Just fascinating. No, no ends, destination and continual growth, which also just about guarantee is not what's on. Eric's radar, because if it was, he'd be doing it, which is anyway, neither here.\n01:13:07 - Dan’s iPhone (danddcompany.com)\nYeah, I don't think it's a lot of people's radar, fortunately.\n01:13:11 - Tina Marie (profitdriversinc.com)\nNo, but that's okay.\n01:13:12 - Dan’s iPhone (danddcompany.com)\nWe can be weird together, Dan.\n01:13:14 - Tina Marie (profitdriversinc.com)\nYeah, totally. All right, I will let you go. All right. lovely day. Oh, and that trip, you know, Denise was wanting some exotic, wonderful trip that she thought was once in a lifetime and never going to happen again. So. Maybe there's way to combine those things.\n01:13:34 - Dan’s iPhone (danddcompany.com)\nWell, she wants to go to the make up for our 25th wedding anniversary next year, so I am going to set that up. Let's go back to the same island that we went to for our original honeymoon.\n01:13:49 - Tina Marie (profitdriversinc.com)\nThat gave me goosebumps.\n01:13:51 - Dan’s iPhone (danddcompany.com)\nI can do that. So this is going to probably be Motelish. Yeah, we'll see.\n01:14:02 - Tina Marie (profitdriversinc.com)\nWe'll see. I can be excited for Denise, though, for that happening.\n01:14:07 - Dan’s iPhone (danddcompany.com)\nThat's awesome.\n01:14:08 - Tina Marie (profitdriversinc.com)\nYeah, you're a good guy, Dan.\n01:14:10 - Dan’s iPhone (danddcompany.com)\nAll right, good, sir.\n01:14:17 - Tina Marie (profitdriversinc.com)\nYou have a good day.\n","contentPreview":"00:00:06 - Tina Marie (profitdriversinc.com)\nOh, wait, you don't hear me. I was talking about you and being sassy and I was muted.\n00:00:12 - Dan’s iPhone (danddcompany.com)\nThat's the mute.\n00:00:15 ...","processedAt":"2025-05-04T03:40:52.551Z"}