{"fileName":"Done Transcript for Patrick(1).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Patrick(1).txt","type":"transcript","priority":"medium","content":"00:00:05 - Patrick Shahverdian (sweetlaw.com)\nI'm going to do on my phone because I can't find the other link.\n00:00:10 - Tina Marie (profitdriversinc.com)\nI was just emailing it to you because I sent that to both of you, sorry, yeah.\n00:00:23 - Patrick Shahverdian (sweetlaw.com)\nLet me just change the settings so I can use the camera.\n00:00:27 - Tina Marie (profitdriversinc.com)\nOkay, you don't have to, we can still talk, let's just look, there you go. Here we go. Hello. Hi, sorry.\n00:00:46 - Patrick Shahverdian (3)\nI'm having issues every week.\n00:00:49 - Tina Marie (profitdriversinc.com)\nWell, as long as you don't get frustrated by it, I don't get frustrated by it, it just is what it is, but anyway, sorry, thank you for rolling with it. It's a cool, calm and collected. It's good, baby. How are you, Ben?\n00:01:06 - Patrick Shahverdian (3)\nGood.\n00:01:07 - Tina Marie (profitdriversinc.com)\nYeah?\n00:01:08 - Patrick Shahverdian (3)\nBrining away.\n00:01:10 - Tina Marie (profitdriversinc.com)\nGrinding away.\n00:01:13 - Patrick Shahverdian (3)\nYeah.\n00:01:14 - Tina Marie (profitdriversinc.com)\nThat business. You do have some fun though, right?\n00:01:18 - Patrick Shahverdian (3)\nYeah, I don't know, weekends. mean, every time I go to the gym, I'm like happy, you know?\n00:01:23 - Tina Marie (profitdriversinc.com)\nYou know, you get that oxytocin when you lift heavy weights?\n00:01:28 - Patrick Shahverdian (3)\nI'm sure that, but I did not know that.\n00:01:31 - Tina Marie (profitdriversinc.com)\nYeah. I just learned that this year and I was like, that makes sense because I'm happiest when I'm like, for it. I'm also aggressive, so that might have a little something to do with it, but I'm just going to say it's about the opposite of it. Some good chemicals. So the size of last week, I'm a scare little AI. It was funny, actually we were comparing, it's not funny, but we were comparing AI notes and how badly it summarizes things or names people or whatever and it's a nightmare, but I've never had anything as bad as somebody being afraid of losing their job. So that was not fun last week. I was thinking about it makes me sick to myself. Okay, anyway, so let's start with just kind of what, where has your mind been besides, so I'm going to preempt this with when you're a grinder and you're operating, know, you just tackle stuff and knock it out. And operational mode is just operational mode. When I talk to you, when I ask you, like, what have you been thinking about this week? I want to know about the higher level thoughts, the ponderings, the things that you think, oh, you know,\n00:03:00 - Patrick Shahverdian (3)\na wonder if we try this or just kind of things you caught yourself observing about maybe processes or just just the business in general what you notice is good what you notice might be better things like that you find yourself contemplating from time to time just like oh one way or the other oh yeah lately it's been like how can I I make things move a little bit faster because I know Sam she told me how she plans like her months and it's like you know at the beginning of this month she's already getting ready for the next whereas I've been more like starting this month like let's get this month you know a good month this month but I'm trying to do it like a month ahead meaning if I could send a demand out as soon as possible this month then I can prepare for it to get done towards the end of this month, early next month, whereas right now, it's more like, you know, once it comes to me that I'm like, okay, I'll send it now. I'm just trying to be in control of how the months will end up as much as possible. So I mean, I've been going through the cases seeing like what I'm able to get started now that way. know, when next month comes around, I have a good idea. Okay, this one's going to settle. We'll be able to get this client as money next month. So more like efficiency as opposed to just, you know, grinding it out day by day.\n00:04:46 - Tina Marie (profitdriversinc.com)\nExactly. So that's what we've been talking about though. And I would love to know talking about is, so what are the priorities? priorities and the priorities for the day will be relative to what's coming down the pipeline, right? And ranking by different types of things. So first of all, if you've got a customer or a client, what you guys call them clients? is impatient and there's a risk of sub-out that automatically needs to be high priority, right? And if it's, so one of the things that you should do, I know we talked about a list of some things, but and I can send this to you, hold on, I'm trying to think about the best way to do it to make sure that we get it captured, but one of the things that you could do is have kind of a ranking document for yourself and for your team. So basically, You look at, you know, let's, let's figure this out. So when you start your day, how do you guys decide what's to work on?\n00:06:13 - Patrick Shahverdian (3)\nMe or the team?\n00:06:15 - Tina Marie (profitdriversinc.com)\nBoth, because the team is you also.\n00:06:19 - Patrick Shahverdian (3)\nWhat I always look through emails really quickly, that's like my kind of gauge of what to do if there's like an upset client email, which we got yesterday, like I see it, and I'll handle that right away. If I see that distribution came in, I'll send that out to the client right away that way. You know, by the end of the day, hopefully it's done and signed and we can get that done. The subtleness that came in, it goes out of the way, and then I'll go through my case list and see what's, what's ready to be closed, what I can send out. I'll And then once I kind of go through that, then I go back into my email and kind of read through like what documents came in that are going to help push cases forward, negotiating things like that.\n00:07:30 - Tina Marie (profitdriversinc.com)\nOkay, so I'm going to go hang out with a friend. So, this is me trying to think about like years' worth of systems and figuring out the smallest thing to say, but okay, so one of the things that we talked about doing, that is very tedious and people don't like doing is time tracking for two weeks. And it's not about micromanagement but it's about having a clearer understanding about where your time goes. So you have a lot of different types of tasks and there's a lot of mental shifting that happens throughout the day. We will choose our tasks for different reasons at different times. Sometimes it will be mood. Sometimes it will be it's just in our face and we don't have to think about anything else. So we do that. Sometimes it's because somebody else decided it was urgent by their attitude, their tone, whatever.\n00:08:44 - Patrick Shahverdian (3)\nIt could be your team. It could be the client. It could be your team because of the client, right?\n00:08:49 - Tina Marie (profitdriversinc.com)\nBrought it to your table. But that's reactive and what we want to do now. we're human beings so some things will be reactive. So like if a fire happens you're reacting to the fire but if you don't react to the fire what happens it's a big problem right so sometimes you have to be reactive but we want to plan for and create the ideal environment and system and routine that first of all prevents fires as much as possible. Second of all ensures the fastest recovery when you get derailed because the fire came and you had to deal with something that took a lot of time took a lot of energy took a lot of resources with the team whatever that type of thing. So understanding and segmenting your day and your week based off of types of tasks based off of priorities knowing that everything does have to get done and then also based off of your rhythm. So certain types of tasks are better done at certain times a day. Now there's a kind of a standard circadian rhythm to that. It doesn't apply to everybody. So for instance, statistically most people do better at higher cognitive function tasks like math earlier in the day. And anything passed like lunchtime one o'clock to a clock, that would be better for like task work, grunt work, where you're not having to be strategic, not having to calculate, you know what I mean? So those types of tasks. So what would be a really good exercise, which is not going to be a one and done kind of thing. Everything you do is going to be iterative. I'm just going to keep repeating that and improvement. But is really looking at what what are your types of tasks? What is the mental load of them? What is the you know social load of it? Because obviously if you're in a place where you just want to deal with people less at times a day, right? There'll be sometimes we want to deal with people face to face less or on the phone less or whatever. You want to be able to kind of plan those times for that time of the day. But what should be fluid is knowing that because we're human different things will happen. Those moods will up and flow. They won't always be at the same time every day. So knowing and just kind of checking in with yourself, okay, like my brain's on fire right now. What's the highest level thing I can do with this? Like everything's calculating. I got a savant thing like beautiful mind going on right now. Where can I apply that? That's going to be the best thing to do, right? And that's planning, strategy, it may be trying to figure out a problem for a client that needs to be solved. That's really a good planning strategy leading type thing. And then when you're in a mood where you're just like, I don't want to deal with anything, I can just panel paperwork, but that's about it. So you want to kind of plan a schedule throughout the day that is your norm, right? And when you recognize like you're just not at the ideal place for this thing, rather than grinding, you want to go through your types of tasks and look at it and go, you know what, I'm better suited for this type of thing. Now, sometimes that's not going to work. You may have like a few bad days altogether. We won't necessarily call them bad days, but the energy shift is different. What you can do is different, it may have nothing to do with you. may be the cases that have come through. It could be people, know, whatever the whole... No crazy retrograde thing like sometimes people just lose their mind collectively at the same time, you know, and like you got to you got to deal with that whatever is causing it there's definitely a vibe shift that tends to be like around so if you also take that kind of stuff into account and just look at it so what are the types of things so what I would love to do is kind of create a list together and maybe we create it as a spreadsheet and I'll start it and then we'll just like screen share and look at it and talk a little bit about requirements from you like what does it take out of you can you like knock it out no time no matter what the awesome at it can some of these be a little bit taxing you know when you're having to make calls our distributions taxing any of that type of stuff. So let's kind of categorize the activities that you have to do and then Bob. part of what we think you spend time on, you don't have to do the time tracking. It's always been, every time I've had somebody be willing to do it, revelatory for them. In that generally, they spend more time doing a thing than they think that they do. And that tends to be helpful because then we figure out, oh, that's the thing that we could improve the process on. We could get more training on or delegate to somebody who's a rock star at that type of thing. So, again, it's never about micromanaging. It's about getting information. So, how do you feel about going through and just kind of talking about the tasks that you have throughout the week, of ranking them in terms of value to the business, ranking them in terms of how much it has to be. Patrick, that does it versus somebody else on the team. And then kind of putting the, maybe the energy or the mental resources. that is higher priority. And we're talking super ambiguous now. So once we get the spreadsheets started and we start kind of putting things into containers, then it gets more specific, then it gets more clear, then the value starts to come out. But I'm talking about let's just create spreadsheet. Right now, screen share, do this together as an activity and see what we see.\n00:16:25 - Patrick Shahverdian (3)\nOkay.\n00:16:26 - Tina Marie (profitdriversinc.com)\nOkay. Okay. So let me go. Go sheet. I'm sure. I don't want to make it only to me, you're not behaving or being slow, that's the problem. I am not in the mood for waiting for things, I normally have blazing fast and it's going to be like lagging on me. Okay, Patrick, if I share with you at SweetLaw, is that Google account that you can get to Google Docs or do you need to have a Gmail account?\n00:17:40 - Patrick Shahverdian (3)\nAnd now you rejoin the Zoom on the computer? Yeah. Okay, might be easier.\n00:17:46 - Tina Marie (profitdriversinc.com)\nMm-hmm.\n00:17:47 - Patrick Shahverdian (3)\nOkay.\n00:18:07 - Tina Marie (profitdriversinc.com)\nAll right, so if I want to share a Google Sheet with you, what email should I use?\n00:18:15 - Patrick Shahverdian (5)\nDon't Patrick at sweetlaw.com.\n00:18:18 - Tina Marie (profitdriversinc.com)\nOkay. So, I think we're going to count that. And then I will screen share. It's your screen. Okay, okay. So you said we had distributions. I already forgot what you told me. Settlements. You reviewed caseless. Okay, so one thing I'm going to do is, like, the description of process. Okay. The reason for this is I'm not asking for what has to be done for distributions. What I'm asking in settlements or review case and anything else. What I'm asking for is, what is your process for deciding that is the thing you're going to spend this minute on, right? Because you have a whole case list, and it's just going to keep getting bigger. So what we're trying to figure out is, what is. the, almost like the equation for saying, this is the thing I'm going to spend my time on now out of all these cases. So when I ask for the description of process, that's it. What's your mental process for going? This is what I'm going to work on now.\n00:20:19 - Patrick Shahverdian (5)\nI mean, sometimes it'll just come from, if I get an email and look at what it is, and it's like the last thing we need to be able to get a distribution. So I'll just go ahead and request it at that time. Like every like 15 minutes, I just check my email, see what comes up at the top. It's just like a habit. Because in order for distribution, like you usually know like not everything comes in at once to be able to close a case or usually waiting on like one item. Also come from when I review the case list, you know, I'll see that case. I'll go through it. I'm like, okay, we need this. I'll call real quick, follow up, I get it, then I can request distribution.\n00:21:17 - Tina Marie (profitdriversinc.com)\nOkay. Now, I would imagine distributions when it gets to that point, that's high priority. That's, we don't want to drag our feet. That needs to get moved forward ASAP, right? can you think of anything that as a category, we're not talking about extenuating circumstances, but as a category would rank higher than\n00:22:00 - Patrick Shahverdian (5)\nProbably not.\n00:22:17 - Tina Marie (profitdriversinc.com)\nOkay. If you had to guess roughly how much time you spend on distributions, conversations, any part of it, that particular section of the case, what would you think that you do? I don't know. Do you be willing to do the time tracking for just two weeks? It will be really tedious, but I can help you a lot with optimizing your system if I get that information.\n00:23:15 - Patrick Shahverdian (5)\nI really don't want to do it. I mean, I don't feel like I waste that much time.\n00:23:21 - Tina Marie (profitdriversinc.com)\nOh, I don't think you waste time. It isn't about wasting time. It isn't that at all. It's about optimization. It's a completely different thing. It has nothing to do with wasting time. It's about looking for the weight. Okay, so checking email every 15 minutes. Absolutely productivity killer.\n00:23:43 - Patrick Shahverdian (5)\nI don't agree with that.\n00:23:45 - Tina Marie (profitdriversinc.com)\nOkay, I'll tell you why. And you can tell me why and we don't have time of looking for something to choose to work on. So, like, ideally, that would be better at specific times of day. Even if it's once every hour that you're doing it, being intentional, the problem is emails to volatile, anything could come in. You have to process all of that. If you're shifting from different types of thoughts every 15 minutes, you never get into it. I'm positive. You don't waste time. I'm also positive that you could get more out of your time if you weren't shifting so often. I've yet to find an exception. You could be the exception statistically, psychologically, biologically, physiologically, that would be an extreme anomaly. So, you don't want You don't want to track time, that's fine, but what I would recommend you do is just even just writing things down or just pay attention to where your time is going, but if you want to compete with Samantha, if you want to be top dog, you're going to have to be proactive about all of your time. You could start with just asking Samantha, do you break up your tasks? You just, like, check email constantly just do whatever. It's entirely possible that she does and just analytically processes things very quickly, that she's not even consciously doing it, she just doesn't really do well. But it also doesn't mean that she couldn't be more optimized if she does constantly shift. Everyone can be. There is a, so if you're in the middle of something, doing something, let's say you're just, your brain, like, goes blank for a second, you don't want to or you just check email or there's a ding and you check email you're shifting so now you have to get in this new what is this new thing you have to process it then you might go do it but then when you return to the next type of work you have to ask yourself again okay where was I what am I doing oh yeah that time adds up it could be up to an hour or more a day of just wait where was I what am I doing is there a frequency you suggest to let me check um so it so that's why going through this type of stuff and figuring this out would would be the starting place rather than choosing a frequency arbitrarily so that I understand and and so that you're measuring for yourself um what is the necessity of a going to email to accomplish these things, and whether or not, like, so tagging email first thing in the morning, okay, distribution, settlement, or whatever types of things, right, so you could have different types of labels that you use in your mail, so that first thing in the morning, and this sounds like more work, so I'm going to give you all the processes, you find the thing that works best for you, right? But say, for example, you just have a system of green flags for anything that's distribution, first thing in the morning, if it's in your email, when you're going through distributions, that's what you're going to look at first, and what that does is immediately removes the lag time of having to reread the emails and go, wait, what was this one? Wait, what was this one? You already know because you saw the green flag, that's distributions, I'm not working on that right now, I'm working on settlements, and that's an orange flag, or something like that, so that when you keep like active, activities together, you keep your mind in a similar zone, so you're not constantly shifting back and forth and reminding yourself, what is this? What is this? What is this? That is happening all day long if you're checking your email that often and you're you're reassessing things constantly, which takes seconds, but sometimes but those just seconds add up. So if we go through this, okay, so you've got distributions, you've got settlements. So settlements, would that be the next highest priority?\n00:28:40 - Patrick Shahverdian (5)\nSettlements slash like negotiating.\n00:28:43 - Tina Marie (profitdriversinc.com)\nOkay. Now I imagine this takes up quite a bit of time throughout the week.\n00:28:55 - Patrick Shahverdian (5)\nOh, yeah.\n00:28:58 - Tina Marie (profitdriversinc.com)\nCould you ballpark it like Do you feel like you spend an hour or more a day on distributions and settlements?\n00:29:08 - Patrick Shahverdian (5)\nLike today, I did a distribution. It probably took me like two minutes.\n00:29:12 - Tina Marie (profitdriversinc.com)\nOkay.\n00:29:13 - Patrick Shahverdian (5)\nLike I just had to email it to the clients. That's all I did for it.\n00:29:16 - Tina Marie (profitdriversinc.com)\nAnd just one.\n00:29:18 - Patrick Shahverdian (5)\nYeah, because I don't have that many words.\n00:29:20 - Tina Marie (profitdriversinc.com)\nIt's going to be like hours a week, right. And same with settlements and negotiating.\n00:29:25 - Patrick Shahverdian (5)\nNo, that's more probably like. Like an hour a day, maybe.\n00:29:39 - Tina Marie (profitdriversinc.com)\nOkay, and. Reviewing your case list.\n00:29:47 - Patrick Shahverdian (5)\nIt's going to be the most.\n00:29:49 - Tina Marie (profitdriversinc.com)\nOkay. So. Let's. right down reviewing the case list. What types of things are you looking for when you look at that?\n00:30:11 - Patrick Shahverdian (5)\nWell, it's like a new case, make sure like all the initial stuff is taken care of, which could be that we found coverage as the police report been ordered, hospital records in order Clamp and reached out to The treatment being set up what what's that treatment? Um, that's yeah, that's for the new ones for like Mid treatment cases, just making sure that You know corresponding Furls are being made, making sure that if it's at a point where we need to request policy when that gets done, as a client we've reached out to, do we have something that, or like we have an MRI, make sure I review it to see if it can be demand early.\n00:31:37 - Tina Marie (profitdriversinc.com)\nIf you can demand early, is that what we said? Yeah. Okay. So like if a MRI indicates a certain kind of injury or something you can do faster and expedite it. Okay. else?\n00:31:58 - Patrick Shahverdian (5)\nThat's about it for the middle. treatment stage cases, cases that are like towards the end, making sure that if there are any referrals that the client doesn't want to get or move forward with, give them a call, try and convince them to. If not, make sure Cynthia knows to request all the records. If we're just missing like one, I might send out.\n00:32:30 - Tina Marie (profitdriversinc.com)\nWe got this for second, I'm so sorry. Keep telling you my internet connection is unstable. What's going on? That's almost never happened. Okay, sorry. Case towards the end, can you start over from me?\n00:32:44 - Patrick Shahverdian (5)\nYeah, see where the treatment left off. If there's a big policy and we're not at the policy point, kind of just see Why why the case is coming to an end if the client didn't want to follow through with the medical referral hold on when you say See with policies like where we're at on policy limits like what do you can you like if there's a hundred K policy, but I look at the notes and It looks like the client's kind of wrapping treatment up Oh before they hit the policy limits like before yeah, like like they they haven't treated To get the policy yet Because they're let's say it's a hundred K and you know He's only gone to pain management and no injections or scheduled things like that Probably means the client doesn't want the injections So on those I'll reach out to the client, you know try and convince them Sometimes it works sometimes it doesn't And if they want to close out and make sure send your requests all the medical records If we have like three out of four facilities, I'll just go ahead and send a demand with that.\n00:34:09 - Tina Marie (profitdriversinc.com)\nWell, what was that last thing? I'm still running out.\n00:34:11 - Patrick Shahverdian (5)\nSorry. If we have a majority of the records, I'll just submit a demand with those.\n00:34:23 - Tina Marie (profitdriversinc.com)\nOkay, so you don't demand anything until they're done with treatment and have been taking care of within with the policy will handle. That depends.\n00:34:34 - Patrick Shahverdian (5)\nYou know, sometimes if it's like. There's 15 K on the third party, and I know the client's been recommended injection. I'll demand it right there, even though he has like a hundred on his side. Because I can get the 15 while he's still treating. That's the thing. make sure the health insurance lien has been requested and then you know depending on the client you know based on my experience with them thus far if they really need you I'll let him know hey you know this is where we're at with the case this is what I'm gonna do next so I might make a call or a text there I guess the next category would be like cases in negotiations see where the last offer was left off if you just call see if you know why they're not able to get to the number we're at Um, why they were not able to get to the number right, I think that I'm offering or I'm okay.\n00:36:18 - Tina Marie (profitdriversinc.com)\nNow, negotiations is about your attorney fees.\n00:36:22 - Patrick Shahverdian (5)\nNo, this is settlement.\n00:36:23 - Tina Marie (profitdriversinc.com)\nSo with the insurance companies, or, okay.\n00:36:28 - Patrick Shahverdian (5)\nYeah.\n00:36:29 - Tina Marie (profitdriversinc.com)\nUm, so this would be about policy limits. Or no.\n00:36:36 - Patrick Shahverdian (5)\nUh, it could be policy limits. This is like pre us. Pre settlement, so I'm trying to get to a settlement.\n00:36:45 - Tina Marie (profitdriversinc.com)\nOkay. Just trying to make sure that. I want to understand a neph of the process too, because one of The things that we're going to get to is figuring out how much of this stuff you do, how much of it is done by anybody else on your team. Really want to understand more about the process and the nuance of it. So the mechanics of it, we don't get into too much with with Mark and love for getting through some stuff. But but even being able to understand that better will also help me figure out how to lend support and kind of optimize what's happening, which ultimately is more profitable for everybody to move on. Okay, so where we weren't able to get to the number we want for settlement.\n00:37:36 - Patrick Shahverdian (5)\nOkay, what else? If it's like at a standstill, you know, ask the client to write a statement. Now we've been doing the second voice, so I'll, you know, reach out to someone to second voice it. Sometimes it includes if the number is a fair number and they're, you know, Max out and the client's the one that's not willing to accept Try and convince the client that To go to offer and they should accept it Often do you think that happens?\n00:38:26 - Tina Marie (profitdriversinc.com)\nMm-hmm not much Right now I just have one All right, what else in negotiations That's basically it okay, and then distributions We're gonna do settled cases so once it's settled there's still some stuff to do You\n00:39:00 - Patrick Shahverdian (5)\nGet the release, which is basically the formal agreement that, you know, works up in the settlement. Again, negotiating with the doctors for their. I would that part of we don't do we have a department for that.\n00:39:29 - Tina Marie (profitdriversinc.com)\nThe department. And inside a sweet lot.\n00:39:35 - Patrick Shahverdian (5)\nYeah.\n00:39:36 - Tina Marie (profitdriversinc.com)\nWho does that.\n00:39:38 - Patrick Shahverdian (5)\nOscar.\n00:39:41 - Tina Marie (profitdriversinc.com)\nOkay. I'm just curious about just understanding that where does Oscar. What are his other functions or is that it.\n00:40:00 - Patrick Shahverdian (5)\nHe does that, he helps with distributions. There's some more stuff I'm not sure, maybe marketing here and there.\n00:40:13 - Tina Marie (profitdriversinc.com)\nI think that too, but I know I've heard his name before. Okay, I gotta look Oscar up later. All right, so you don't have to do that. That's good because that sounds tedious as crap. What do you need to go sharing with the clients, the doctors, and they're like, basically, if I give up my fees, it's so you can make your fees.\n00:40:35 - Patrick Shahverdian (5)\nseems like a tug-of-war that just would suck. The only thing that we do is we send Oscar the numbers.\n00:40:43 - Tina Marie (profitdriversinc.com)\nOkay. Okay. Then what?\n00:40:59 - Patrick Shahverdian (5)\nIf it's. There's you I am to go after prepare that for.\n00:41:04 - Tina Marie (profitdriversinc.com)\nWhat's you I am under insured motorist coverage.\n00:41:09 - Patrick Shahverdian (5)\nSo you first have to get the third party settlement. You have to get their policy limits before you're able to demand for the U.\n00:41:18 - Tina Marie (profitdriversinc.com)\nI am. I believe that is enough for myself. Because if they have it that they're not uninsured right to see you've checked that first is that the whole. Underinsured yeah. Oh underinsured okay not uninsured uninsured means that they don't have insurance and we're just dealing with the client insurance from the start right so when you say you I am it was under insured.\n00:41:55 - Patrick Shahverdian (5)\nUnderinsured yeah technically meaning you know we got their policy limits and it's still not in.\n00:42:00 - Tina Marie (profitdriversinc.com)\nI have to cover it therefore they were under and true of it. Okay. Where am I Go. Okay. There's you. am go after that.\n00:42:22 - Patrick Shahverdian (5)\nAnd then. And then. I guess the next category would be like distribution.\n00:42:41 - Tina Marie (profitdriversinc.com)\nNow, are you one that does most of that on your team or all of it?\n00:42:47 - Patrick Shahverdian (5)\nI do all of it.\n00:42:56 - Tina Marie (profitdriversinc.com)\nOkay, so we talked about how much time is just not a lot the way. I mean, cases take a long time. You've got like 140 cases or something somewhere around there. And I know how many of you think that you do a month on average right now, knowing that that number is changing and increasing? I mean, what distributions will you work on in a month?\n00:43:26 - Patrick Shahverdian (5)\nAnd I guess I So this month so far, I've got one, two, four, five, six, seven. I was going to say roughly 15 at the moment, we'll just move on.\n00:44:21 - Tina Marie (profitdriversinc.com)\nOkay, oops. Here. So would you be interested in asking Samantha to show you kind of like her. Like, does she have any system? Does she have any sort sheets where she, like, how does she organize things and just look at her and see. And it may not be anything you want to do, right? Just because that's her process doesn't mean that's the way that you would work. But since you've already been asking her questions and What I think is, so the way that I figure out my systems is almost by triangulating. I get information from different people, I never copy anybody's system because nothing works best for me. There's nuance to everyone and that really should be the process. I'll give you some feedback. You can get some stuff from Samantha, you can ask other people but ultimately the best system is going to be one that you've custom made. There are things that all of us are adverse to for different reasons and it doesn't matter if the only reason we're adverse to it is because we just don't like it, we don't want to do it. What you have to figure out is what creates the most friction and drag and what creates the the best, the smoothest effort, right? And there are multiple things that will do that. drag can just be you don't like it, like you don't like reading books. It's not that you don't like learning, but you don't read books, right? We all have different ways that we we function and do things. So then but then sometimes what will happen is what we may like less is not being the last not getting the the cases done that we want to get, not making the amount of money that we want to make. And so, and this is one of those things where they say people make changes when the pain of staying the same is more than the pain of change. So if the only way to be the top dog and sweet law was to read books. And month after month after month and obviously that is not the way that that would work. I can't Think of a better example, we think about anything else. But we'll just say that that's what it was. If you knew without a doubt that the only way to be top dog and sweet law was to read books, I think you'd read the book. Eventually, you'd just be like, this sucks, this sucks, this sucks. I know that that's the thing, so why would we do that? Now that's not the thing. But what will be the thing will be your processes, will be how you organize your time and how you utilize your resources, because you have fixed resources. You're not going to get a whole big team to do other things if you can't manage your resource as well. 100%, the way to win, the game that you want to win to get the most amount of money, the highest payout to be top dog in the firm. If that's the main thing, I would think earning the money would be the main thing and doing it really well. So those are tied things, right? Because you're not, I don't think you're the type of person and be like, I want to make all the money to help with everybody else. already know that that's not the case, right? So it's got to be a crossover type of rule. So figuring out how to create a system that works, that doesn't annoy you, doesn't piss you off, doesn't feel tedious, will be the thing. But one of the things you I want you to just kind of keep in the back of your mind is, you may want to, it may behoove you to be less annoyed about certain types of things. It may not. This is all theoretical at the moment, things to consider. is there any activity that you do now, food that you eat, anything that you do because you know it gets you what you want, but you used to hate it. And now you don't because it gets you what you want. Can you think of any example like that in your life?\n00:49:01 - Patrick Shahverdian (5)\nOh, chicken reps.\n00:49:05 - Tina Marie (profitdriversinc.com)\nI actually have to eat that at three, and I'm already thinking about it. Yeah, and so let's be a little bit more detailed. What was this specific thing that Chicken Frost does for you?\n00:49:21 - Patrick Shahverdian (5)\nYeah, it's really big and strong.\n00:49:24 - Tina Marie (profitdriversinc.com)\nAnd protein levels are hard to get, huh?\n00:49:27 - Patrick Shahverdian (5)\nYeah.\n00:49:28 - Tina Marie (profitdriversinc.com)\nYeah. Yeah. why chicken out of any other protein?\n00:49:33 - Patrick Shahverdian (5)\nUm, stelliness, you know, gets you where you need to be with the least amount of comms, I guess.\n00:49:40 - Tina Marie (profitdriversinc.com)\nRight. So, um, it was a tradeoff, something you wanted more than not eating, boring, old chicken breast. Right? So, at some point, there may be some chicken breast you got to eat every day. If so, this to the thing I want you to really think about. And I know what you're driven towards. But if you're going to be top dogs, lean and mean, right, in sweet law, then what's your protein here? It's going to be using your time the most strategically every day. But if you don't know what is the most important thing, and if you're just going to email and reacting to whatever's there, I guarantee you that that's just it's not cutting it. I mean, it could be, we call it P protein. It could be salmon with all the extra fat like all day long. It could be like high fat beef. I don't know, but it's not optimized. It comes with cost. It comes with side effects that you don't want. Yes, you're working consistently throughout the day. And yes, you're probably making calculations on the fly about what you should do. But it it's still reactive. So going through and looking at these things and kind of triaging your activities throughout the day and throughout the week is going to, and I don't, there is no perfect way to do that, but being intentional about that is the first part of the strategy and it's the first thing that kind of will unlock things. So we know this Samantha is really smart about how she does things. I would recommend just go ahead and ask her, hey, do you have a system for like ranking? you like, what does your day look like? I would ask her, like what does your day look like? Is it the same every day? Do you have a rhythm? you have a routine? What does that look like? And how did you arrive there? Did you used to just like check email all the time and what was that like? I would like really ask lots of questions around where she is now, where she used to be, what the difference was as that happened. Um, and maybe you can ask other people. I don't know. I don't think that there's anybody else to model knowing what I know about you and sweet law. Mark's MO is very different. Um, being, you know, the business owner. What he does on cases and because he works them so little like I don't think he's he's the most optimized at that because he's doing all kinds of other things. So that's not a good model. Um, you're not doing litigation. So not Nick. Lorenz doesn't have the pace and he's not really the one to model after right now. And who else we have? Hank is new. So Samantha's Samantha's the girl plus she saw dog anyway.\n00:52:49 - Patrick Shahverdian (5)\nSo. Yeah, no, I've talked to her before and she's given me some, like I used to come in and like do demands in the mornings because when I started here, that's all I was doing. Mm hmm. And then she told me like she will do it towards the end of the day because there's usually less phone calls, the adjusters are already gone. So it's like if you can reach the adjuster in the morning, use that time to do your negotiating and stuff like that. And then by the end of the day, it's like the demands are so like chilling mode for me. Like I can just sit there and do them and it's kind of like a break. So I started doing those like at the end of the day too.\n00:53:43 - Tina Marie (profitdriversinc.com)\nOkay, so you're already recognizing a rhythm that you have and of the task and you okay, what else do you know like is there anything else that you kind of tend to select specific times of day to do. like how is it so far already?\n00:54:02 - Patrick Shahverdian (5)\nSorry let's do like adjust your phone calls and stuff like once as soon as I get into like 2pm ish. It's like sometimes they're on mountain time Eastern time so that's like usually the cut off file reviews to like around like 2pm we'll just go through how long does adjust their conversations take how much time do you think you spend week say like maybe 10 hours I don't know\n00:55:04 - Tina Marie (profitdriversinc.com)\nSo that would be like averaging two hours a day. Does that seem fall-parkish? Yeah. All right. What about far review? Specific time of day and roughly how long is there a specific time of day that you tend to do that more?\n00:55:27 - Patrick Shahverdian (5)\nLike after 2 p.m. I'd say like 3.30 to 5 is like 5.30 is like demand time. Sometimes you may not have a demand to write. So it's just like extra far review or sometimes I'll just reach out to clients like big ones just to kind of talk to them a little bit.\n00:55:54 - Tina Marie (profitdriversinc.com)\nOn a 5-bit one.\n00:55:57 - Patrick Shahverdian (5)\nLike usually 100k plus.\n00:56:05 - Tina Marie (profitdriversinc.com)\nHow many of those do you think you have right now?\n00:56:10 - Patrick Shahverdian (5)\nThat'd be 10.\n00:56:18 - Tina Marie (profitdriversinc.com)\nOkay. So, I shared this with you. These notes are bad. The order is not great. This will start to improve its structure over time. Would you be willing to, through the week, just kind of observe what you think your schedule is? I would love for you to do one thing this week and maybe next week as well. Check email once per hour instead of every 15 minutes and see.\n00:56:55 - Patrick Shahverdian (5)\nI don't think it's every 15. I'm just giving a number like sometimes if I'm writing a demand. an hour goes by and I don't check it but I do check it pretty frequently.\n00:57:05 - Tina Marie (profitdriversinc.com)\nOkay, so at the very least though, I'm being more specific about it. Maybe every hour and it may even get to every two hours or after specific chunks of time. So if you're in a transition mode already, that makes sense to be able to check emo, right? So if you did distributions and you've completed it, there's nothing to do that day and these aren't very long so that's probably not a good one but let's say settlements and negotiating. Let's say you've knocked that out. Okay, this is a shift period, now I'm going to go to a different type of activity. Checking email just to see if there's anything that already falls within your priority list, right? Needs to be done, needs to be responded to, that's a good. So using email as a transition time intentionally or specific slots of the day where you're going to it, looking for... things according to your order of priority. And then marking them and flagging them in some way, keeping a very simple system, Patrick, I'm telling you, very simple system of using the built-in flagging system, right, in the emails for colors so that you can just glance at that. you already read it once. You don't have to read it twice. If I put this flag on, I know it's ready for distribution. I know it's ready for settlement. I know it's, let's say, mid-treatment. There's usually about four flags, yellow, orange, red, blue, so maybe five flags. if you just have some assignments, then what you'll do, it's only few minutes a day, but it's more than that. It's in you can do. So you're going to make yourself a little bit more potent for specific applications. activities because you had to do less of it in email. So once you've identified what the email is because you read it, flag it. And when it's not in that thing anymore, change the flag color, or remove it completely. It's a tiny little thing. This is gonna be chicken. I'm telling you right now. This is chicken breast. It's, it will make a difference. It's annoying, but it will stop being annoying pretty quickly. Once you do it regularly, it I have no other way to explain it to you other than, you know, over two decades and hundreds of people that I've been working with. It's the simple little thing. So if that doesn't work, I don't know how else you could organizing that, but organizing email to a degree. Now, there's a way bigger way to do it, where you could create folders, drag everything into this, blah, blah, That's, that's a pain in the . Using the built-in flag. system. It's right click on the email and you choose a color. Eventually you'll remember what the color I think you'll do it very quickly. That will help. So that's what I would like you just to consider. I don't want you to half- it so if you're not going to do it don't do it. If you're going to do it stick with it and I really want you to consider it to be like chicken breast. Give it a little while if you're going to do it. And then the other thing is just really try to even if you just make some notes okay this is how I spent my time just a little bit for a week. Any amount of really specific information the fact that I asked you how long you spent on time you're like I don't know rough idea ballpark. If you want to play high level if you want to be top dog if you want to get the most out of get these cases done more efficiently knowing where your time goes. He is 100% the key to unlocking that, so you just have to decide if that's the thing that you really want to do. So ponder that for me, and we'll, so we have group talk next week. I'd be interested to see how Lawrence goes through his day too. And again, it's just kind of a slow and steady process, and you'll think new thoughts every week, and you'll gain a little bit more knowledge and gain a little bit more experience that we keep moving it forward. But these are the leverage points. So anyway, thoughts, questions, comments, annoyances.\n01:01:47 - Patrick Shahverdian (5)\nNo, I guess I never really like broke down. You know, what I spend my time on, like day by day.\n01:01:55 - Tina Marie (profitdriversinc.com)\nLet me ask you this, when you go to the gym, do you have a routine?\n01:02:01 - Patrick Shahverdian (5)\nSometimes I'll make it up as I'm going, but it's like a certain body part in that day.\n01:02:06 - Tina Marie (profitdriversinc.com)\nRight. And do you ever just not do a certain body part by ever just completely neglect any muscle group?\n01:02:18 - Patrick Shahverdian (5)\nNo, never.\n01:02:20 - Tina Marie (profitdriversinc.com)\nSo even though you're going and you may not have a routine, a workout routine, you mentally are calculating, I've got to do these muscles. I've got it like upper, middle, lower, you're thinking about everything that has to be done and you're thinking about even subconsciously the fact that you've got to create some balance. Like, you know, if you don't work, if you've worked the front of your muscles, but not the back of your muscles, you create imbalances, you know that, right? Like if you work your quads and not your hamstrings, you're going to have hip issues. There are things that we're doing constantly, and some of It is just because we've been doing it so long, but this you haven't been doing so long. And so you're there are some things that you can learn about why you do it. So I don't know what kind of results you get at the gym, but just kind of think about this. Like that is the area where you spend the most time on what makes you happy. And what is it that but so the thing that I know that you're going for is is we'll say be and talk about like you want to be the best attorney at Sweet Law. That is not going to come from just showing up and grinding. That comes from strategy. So that's the thing that's a little kind of bug I want to plant in your head to think about that and really just kind of breaking it down and understanding what does what. So you understand that there's different types of protein. You understand that there's different types of training to do. Everything gets us different types of results. That's what I want you to think about how you show up to work. The way that we do things matters and specific results are going to come from specific types of effort.\n01:04:29 - Patrick Shahverdian (5)\nSo just two lunches to work every day. First one is beef.\n01:04:33 - Tina Marie (profitdriversinc.com)\nsecond one is chicken.\n01:04:35 - Patrick Shahverdian (5)\nYeah, chicken and they have turned in. I put it off because I don't want to eat it.\n01:04:42 - Tina Marie (profitdriversinc.com)\nSee and now I would eat the chicken first. So I just like it's done and then I would savor the beef later and be like that so that I get to look forward to it because I like doing that with my energy. I want to knock the crap out first and then get to the good stuff for the rest of the day. Yeah, but that's the thing though, understanding how you tick what what makes you work. So and then also sometimes asking yourself, but does it work better for me that way? What would happen if I knocked it out instead of going stupid chicken for more hours, right? And just go now while you only got away for two or three hours, eat the chicken. Chicken's gone. I get beef legs.\n01:05:29 - Patrick Shahverdian (5)\nHave it a bad day. then I got to hit the chicken now.\n01:05:31 - Tina Marie (profitdriversinc.com)\nI'm even worse day. Yeah, right. So there's a book called eat that frog. I've never read it, but it's basically about do the hard thing as soon as possible so that you're not mentally being dragged down by the stuff that has to happen. Get the hard stuff done so that you can coast for the rest of the day. But it really isn't about coasting. It's because even if you want to like play hard, you're not diminished by the human. feeling resistance like I don't want to do it. So think about what where resistance shows up and you know how much you want to let it have power over you.\n01:06:13 - Patrick Shahverdian (5)\nSo when someone asks you if you want the good news or bad news first you always take the bat.\n01:06:18 - Tina Marie (profitdriversinc.com)\nAlways always always always because if they tell me the good news first I can't appreciate it because I want to know what the bad news is. I won't even be in that moment. The pain is coming. Shut the up and give me the pain. I watch the needle going in if I get shocked. I want give me the pain first. So I'm done with it every time. Every time because I want to be fully present for anything I get to enjoy. If I have to eat broccoli but I get cake I will throw up eating all the stupid broccoli and then don't talk to me. be until I'm done with it. And then when I'm eating my cake cup also because I want to be fully present, don't talk to me. Just let me eat my cake. And I'm going to really enjoy it. But I'm really, really, really conscious and intentional when it comes to energy. So, like, anything that has to happen. So, if I go get waxed, right? If the girl is talking to me, I'm like, you need to stop talking for a sec, because I need to focus. If I can breathe, it doesn't hurt me that bad. If she's talking, then I'm just like, I'm flinching and that stuff, but I can breathe through it. So, yeah, that's just something to think about. noticed like, you're young, you've got lots to learn still, and you've got through military, so you've got some different experiences. play around a little bit with things. things with routine and figure out what gets you better results. It's not so much about what you like better because that's going to be clouded by what you're experiencing at the moment. Ask yourself what gets you better results at the end of the day, wherever you can reduce stress and friction and most stress and pain comes from anticipation and people don't take that into account on that. That's why I choose what I choose first because I understand the anticipation is the pain. It's not just eating the chicken is the fact that you're sitting there thinking about it all that time. That is real distress in our minds and our bodies. It literally could pump cortisol into you just thinking about the stupid chicken. And then, but there could be literal endorphins and dopamine coming from you get the beef. Also because it's the vitamins. make a load way above chicken. Those B vitamins and steak and beef, if I'm in a really bad mood, I almost always don't eat beef because I don't digest it well. But if I can't figure out my mood, no matter what, if I go eat a steak, those B vitamins. Oh, through the roof. B12B6. I know those ones, I don't know about what else. B2B2. Yeah, it's good stuff. So think about those things, play around and just kind of observe them. And it doesn't always have to be the same, but be conscious about what you're choosing for yourself. And think about the thing that might be draining you a little bit because you're anticipating something you don't want. Knock it out. Yeah, I got chicken waiting for me. I'll tell you what though, and they may even happier than hate that saying something.\n01:10:04 - Patrick Shahverdian (5)\nSo, also, sorry about your talking to Are we with Lorenz next week?\n01:10:16 - Tina Marie (profitdriversinc.com)\nYep, Lorenz next week, one o'clock, this line that I sent you. So bookmark this one. It will be this one from now on that we don't accidentally send scary messages. All right, it's good.\n","contentPreview":"00:00:05 - Patrick Shahverdian (sweetlaw.com)\nI'm going to do on my phone because I can't find the other link.\n00:00:10 - Tina Marie (profitdriversinc.com)\nI was just emailing it to you because I sent...","processedAt":"2025-05-04T03:40:52.565Z"}