{"fileName":"Done Transcript for Fuji_Tina Coaching(13).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Fuji_Tina Coaching(13).txt","type":"transcript","priority":"medium","content":"00:00:00 - Fujinaka, M.D.\nGood morning.\n00:00:02 - Tina Marie (profitdriversinc.com)\nHi, how are you?\n00:00:04 - Fujinaka, M.D.\nGood. are you?\n00:00:05 - Tina Marie (profitdriversinc.com)\nSweetie. I am not used to my seminary schedule with my daughter right now. Is that my church going? Yes. Five thirty in the morning. All these things that I can go learn about God. And exhausted.\n00:00:21 - Fujinaka, M.D.\nI went to a Catholic school high school. remember it was seminary in the mornings for some of them.\n00:00:26 - Tina Marie (profitdriversinc.com)\nSo brutal. I didn't have any of that. And I've had two children try it and they stopped because I don't coerce my children. Faith can't be developed by coercion. Sure. So she chooses to go. And I am supportive of that. silently I'm dying. dying.\n00:00:49 - Fujinaka, M.D.\nThat's awesome.\n00:00:52 - Tina Marie (profitdriversinc.com)\nSo I saw you shared that spreadsheet. I also saw you did not respond to my email at all. And I was like. uh was he busy or was that just a lot? oh i did i said yes i agree did you uh not get a reply yeah you said i started to talk for you but barely added anything to it uh hold on a second oh because i asked you where do i put this info and then you you made then you made the spreadsheet oh well hold on a second my brain well even my email because i searched on your name and i sent my theme oh you know what it's because it was in a thread i'm like okay no you're right well i definitely agreed to it and i definitely didn't finish all the work so i i owe you a massage haha let's see uh she cost me though my massages cost $120 because i go 90 minutes but i'm supposed to take a fuji massage money um okay Well, I'm excited about this, uh, hold on, even though I didn't finish.\n00:02:06 - Fujinaka, M.D.\nI like where this is going because, uh, like for the one, the new one that I shared with you, I think you're on it right now called the next volume. So this, this is actually document I already had with my manager that I just recently promoted, like I was telling you. now instead of just these columns, I only had total number referrals and I was only tracking the visits. I added these extra columns, so I'm going to try to break it into how many new visits we completed, how many return visits, like you were saying, how many visits did I get from Washington, Arizona, New Mexico, and, uh, you know, I'm adding Missouri, but I haven't gotten licensed yet. So, but that'll be coming soon.\n00:02:52 - Tina Marie (profitdriversinc.com)\nI should have that. Uh, can you quantify soon and ballpark? Well, I'm waiting on things when they say soon.\n00:02:59 - Fujinaka, M.D.\nSo I always Yeah, I'm waiting for Stanford to say that I am I work there. And that is what's holding up my Missouri licensing, okay, so I need to keep bugging Stanford about that.\n00:03:13 - Tina Marie (profitdriversinc.com)\nAnd do you have a process in place?\n00:03:17 - Fujinaka, M.D.\nDo you have that schedule? Do you have somebody doing that for you? It's all done.\n00:03:21 - Tina Marie (profitdriversinc.com)\nI apply for these things. No, no, you said you need to follow up with them.\n00:03:26 - Fujinaka, M.D.\nI'm talking about the follow up. Oh, no. I just something floating in my brain every time. Mark is like, have you gotten Missouri?\n00:03:33 - Tina Marie (profitdriversinc.com)\nI'm like, no. So there's a program called Yes, where I haven't used in forever because I really don't need it, but it can hook into Google. And since you're already using Gmail a lot. Yes, where does a lot of really cool things. First of all, it can tell you if somebody, if you send to a Gmail address, it will tell you if somebody read the message. It'll give you a reader seat. It'll tell you where they were at unless they have a VPN. And when they opened it, but what yes, where does is allows you a lot of cool things and boomerang does this do I like boomerang also, but yes, where has more stuff. Anyway, Actually, think Gmail has it built in now too. It's a follow up thing. It's a reminder. So like you could send an email to somebody if that Let me ask you this way. Are you following up through email or phone calls? Emails Okay. Yeah, so You can use a reminder function either built into Gmail or get an app like boomerang or yes where which is just a plug-in to Gmail The thing is yes, where is you can pre-schedule your follow up to happen conditionally if nobody replies with an X amount of time. Oh, okay So then you don't have to delegate to an assistant if you don't want to it stays top of mind without you having to like Hope that it floats to your brain in a timely manner Without also having to add an external type reminder things like that. So, um, okay. Now month, I'm confused a little bit about the date here. Like you've got April 1st, May 2nd, June 3rd, July 4th. Where did the numbers come from? Well, this is just how many months since I've got you. I wondered when I got all the way down to August 17th and we've passed 12 months and everything.\n00:05:27 - Fujinaka, M.D.\nNo, no, I was, I'm just being vain because I was trying to create like a little competition for myself. Like how fast, how fast can I get this kind of going in a year?\n00:05:38 - Tina Marie (profitdriversinc.com)\nSo that's why I was tracking. Well, I don't think that that's vain. I think that that is smart. I mean, that's intrinsic motivation, right? More people should have it. Building the competition inside of yourself and against yourself is, I think, very smart. Okay. So I got to kind of get my head wrapped around all of this because we have Okay, really what we should do, and I will let you dictate how we use this time, but since the homework didn't get done, and this time is already slotted for business growth, I think the best thing would be to populate the spreadsheet together, and then as it's happening, I get to see it, I can ask you questions, I can see it would be great if you're screen sharing while you're gathering the data, because then I get to start wrapping my head around where you get your information from, and it could actually be, it would really be a good exercise for us.\n00:06:33 - Fujinaka, M.D.\nYeah, I'm just looking at that same sheet, but I actually just assigned this to that new manager, so he's actually, you know, this this week. What we do is we actually just pull from our key looks at the monthly calendar, and because we're not doing a super high volume, he just manually has been counting, you know, how many, how many of these, so he said he's, I told him to, you know, get it done by Friday, so he's going to work on this, getting all this, and the other, okay.\n00:07:00 - Tina Marie (profitdriversinc.com)\nGo ahead.\n00:07:00 - Fujinaka, M.D.\nNo, you go ahead. You asked about attorney data. So, I'll just show my screen. You asked about attorney data. So, I, I don't really have a good way of, we don't have a good way of tracking it. Again, it'd be all just manual. I think it, I'm not sure how to track it. This is what our, this is what our database looks like. It has the law firm name here. So, I could have my, my lawyer just kind of pull, you know, how many times, for instance, we've all sent to me.\n00:07:42 - Tina Marie (profitdriversinc.com)\nYeah, you can just do a count of column on the right.\n00:07:45 - Fujinaka, M.D.\nYeah. Okay.\n00:07:52 - Tina Marie (profitdriversinc.com)\nYeah, there's a really simple formula and it's count if. And so, it will count how many times a particular thing shall So the first thing would be, you take all of that, sort it by attorneys, and then get all of the unique companies that you have.\n00:08:13 - Fujinaka, M.D.\nOkay, so let me do that right now then. I think that's a good idea.\n00:08:18 - Tina Marie (profitdriversinc.com)\nSo I'll make another spreadsheet. Oh, you know what? This would be a great way to test the Gemini AI that Google has added to its suites. Because when you don't know how to write the formulas, you might be able to just ask it things inside of the spreadsheet. Oh, yeah. I'm going to remind myself to test that later today because I didn't have that thought, but that would actually be worth the like $16 $17 a month or something. that it is to skip the step going somewhere else, especially because some of the formulas that I want are complicated and the only way I can get people to do it is if I walk them through it. And sometimes I even have to look up the formula that I want, try Gemini first foot sheets. That actually would probably be super worth that, less than $20 a month investment. It is the European nerd.\n00:09:34 - Fujinaka, M.D.\nI canceled my subscription.\n00:09:36 - Tina Marie (profitdriversinc.com)\nwas a favorite for Plex City Pro, chat box, but I've just because we're doing the chat GPT and bottom of the thing I just talked about, chat GPT. I had all of them because I was comparing side by side. And right now, nobody beats chat GPT. And I watch, I watch a few AI people that I follow.\n00:09:59 - Fujinaka, M.D.\nSo I always go and...\n00:10:00 - Tina Marie (profitdriversinc.com)\nand check a few things first. So I'll tell you if something beats it.\n00:10:04 - Fujinaka, M.D.\nNice.\n00:10:06 - Tina Marie (profitdriversinc.com)\nYeah. But the difference of having it inside of your spreadsheet, because it's a Google sheet and Google Docs, that actually can make Gemini worth it.\n00:10:19 - Fujinaka, M.D.\nOh. Nice.\n00:10:21 - Tina Marie (profitdriversinc.com)\nYeah. Yeah.\n00:10:29 - Fujinaka, M.D.\nSo I don't remember how I made the formula. That's what I'm looking at. made a formula to copy in real time the data from the sheet. I'm just looking for work for it. What I want to do is make a new spreadsheet that mirrors the old one. Oh, here it is. So what I did it here. Oh.\n00:10:57 - Tina Marie (profitdriversinc.com)\nLet's see here. Hello, everybody doing, by the way.\n00:11:02 - Fujinaka, M.D.\nOh, we're getting, I think Esther's making a little bit more progress with the sleep, so.\n00:11:08 - Tina Marie (profitdriversinc.com)\nDid you, you're, I don't know what her job title role is actually the new lady.\n00:11:16 - Fujinaka, M.D.\nOh, Marty. Oh, yeah, she's, she's, she's, she's coming here at eight o'clock in the morning. And yeah, it's been really nice so far.\n00:11:26 - Tina Marie (profitdriversinc.com)\nYeah, and, like, this is getting done.\n00:11:30 - Fujinaka, M.D.\nwhat's all that. We actually just might do that with her today. Actually, we, we went through and, you know, set out kind of expectations, so to speak. About what what we'd like done, and we gave her a list of priorities. like, when she comes, she knows first, ask Esther if she needs help with Marty, if not, then start with laundry, then, you know, dishes, then I had her make. how to make my smoothies and drink one in the morning. So she's going to start doing that for me.\n00:12:06 - Tina Marie (profitdriversinc.com)\nAnd I love that you gave her a priority list so that you can rank it and she can now check this first and then go to this and then go to that. So did she start this week or last week?\n00:12:18 - Fujinaka, M.D.\nLast week. I wasn't here last week though. was in Disneyland with Emi. So Okay. Really a good trial run but this week is the first week Emi's back and I'm back.\n00:12:31 - Tina Marie (profitdriversinc.com)\nOkay that would be interesting to see how that goes.\n00:12:33 - Fujinaka, M.D.\nOkay where are we at now? So on this I'll do this after the call but I'm going to mirror. I don't remember how I did it. I'm going to mirror Master Leans onto this new spreadsheet I've created. Then I'm going what was it? Oh count if. Count if. Okay. All right yeah so I'll uh So, what do I guess I'll call this, uh, biomedical, I just also call it like attorney data, I guess. Mm-hmm. All right. So, I'll call this attorney data, I'll remove this tab.\n00:13:16 - Tina Marie (profitdriversinc.com)\nSo, well, once now, first of all, how many attorneys do you have? Because one thing that we're going to want to do is increase, how many referral partners do you have, right? Yeah. We are going to want to know who has been with you the longest, how many months? I'm going to increase, okay. How many months each attorney has been with you?\n00:13:42 - Fujinaka, M.D.\nMaybe I could ask, ask Chat TPT to write me a formula to pull out a list of unique attorneys. So, okay, people in that, okay.\n00:13:51 - Tina Marie (profitdriversinc.com)\nLet me get through this list before my brain just gets it's important list. How many unique attorneys, um, many months each one has been\n00:14:00 - Fujinaka, M.D.\nwith you. Yeah, like which month did they start? Oh, so I'll say ask for which. So I guess in the column, I'll say which date did they first send a client? Okay.\n00:14:20 - Tina Marie (profitdriversinc.com)\nYes, and but you do want to know how many months since then because we're going to get an average.\n00:14:27 - Fujinaka, M.D.\nOkay, so which date did they first send a client and then.\n00:14:32 - Tina Marie (profitdriversinc.com)\nCounts months from that date.\n00:14:34 - Fujinaka, M.D.\nOh, months from that date.\n00:14:37 - Tina Marie (profitdriversinc.com)\nthat's right. Right. So then how many cases referred? Total. And then average referrals per month, per attorney. So now you're going to be able to rank these really well. Um, because let's say this is why average is. No, you know this. I'm not telling you anything. You don't know, but but we don't often think about these things and we look at these spotlight data of, you know, the snapshot of the current time. And if you had somebody that sent you, you know, 200 cases and they've been with you from the beginning, but you've got this one one. And they've sent you 45 cases, but they've only been with you three months, know, that new one, what's happening? That's awesome. That's great. Or somebody else and they barely send you any, then maybe you want to nurture that relationship and say, hey, is there something that I can do to better serve you and to better serve your clients? I'd be interested in getting more referrals from you. Is there, is there something that you would like to see happen in the referral partners that you have that you, know, whatever. Is there something that stands out? Like, what is your best referral partner? for you. I'm interested in growing my business and learning from, you know, people who do that. So seeing what you can do, again, we want to squeeze as much out of what already exists as possible. So we want to first assess what we're getting out of what we have so that we have a baseline to work from and to improve it.\n00:16:21 - Fujinaka, M.D.\nAll right. Yeah. I think that one of my, I'm going to ask them referred any in like two weeks, I could be like, you know, hey, what up, right? can send an update email. like, hey, updating you. We just added another doctor to my clinic. You know, I stay in front of mine. And then I see that sometimes they'll send me more. So okay.\n00:16:48 - Tina Marie (profitdriversinc.com)\nSo Mark, like for his doctors, he has she has or America. Here's another. Anyway, somebody goes and meets with them and gets to know the ladies in the office. this, find out a little bit about what they like and brings them like, don't know, yeah, food, something like that. But just socializes and actually gets to know the people that do the work that send the referrals. So it might not be the attorney that actually does it, it might be his team. So maybe that's something you talk to Mark about and be like, okay, what's a good strategy play. But I mean, a lot of that right there is enough. Figure out who's the one that actually sends you people, gets to know them, talk to them. Yeah, scratch backs, things like that.\n00:17:36 - Fujinaka, M.D.\nSo I wonder how this should look. I think what I'm going to probably do is like, maybe this sheet will be my uh, my like, what I don't recall, like top level spreadsheet. Um, and then I'll put, I guess I'm going to need to put the, the raw data from master leans in another sheet. And then so I'm My top level, what should it look like? I guess it should have just like a turning name here, like almost very long brother or something like that, and then just start going from there.\n00:18:19 - Tina Marie (profitdriversinc.com)\nI don't know. Yeah, so the thing is sometimes the stuff changes, which is the great thing about spreadsheets is that you can kind of move and reorganize data, but that's exactly where I was going to go.\n00:18:31 - Fujinaka, M.D.\nData first referral. Well, what about how would I, let's see, like the months is going to get really messy if I do month, you know, January, February here.\n00:18:42 - Tina Marie (profitdriversinc.com)\nYou were only going to do that raw data. So what I would do next is data first referral.\n00:18:46 - Fujinaka, M.D.\nThe raw data, I pull it out in here. So this will be my whole spreadsheet. So it's going to look like something like this, right?\n00:18:57 - Tina Marie (profitdriversinc.com)\nSo what I usually do is I'll have multiple tabs with all the data. data and then I have what I call a snapshot, um, yeah, so this guy, yes, which is the easy way to look at the data and you can call it a dashboard, you can call it an overview, without the view, whatever, but it's the the easiest way to use the data is what you want to do.\n00:19:23 - Fujinaka, M.D.\nSo maybe I want to look at the most recent referral. In total cases and then average cases a month, that's a good one. Okay, I see what you're doing here.\n00:19:39 - Tina Marie (profitdriversinc.com)\nWell, because that's all the relative information that you need. Well, and the other thing would be maybe max payout, min payout, average payout per attorney. So that you can trend them and rank them that way as well.\n00:19:56 - Fujinaka, M.D.\nYeah, so the only thing I have here is I have this guy. right?\n00:20:02 - Tina Marie (profitdriversinc.com)\nAnd there's a lot of, you know, not done yet. But over time, and again, we play the long game, right? time, these things will begin to populate and you will be able to see some kind of trends. There are lot of factors that go into what you get paid, obviously, that may not be attorneys, skill and negotiation and the willingness to share whatever might just be the case. However, my experience says that track and capture and measure the data that comes, it doesn't take that much time. Things tend to pop out. And at the very least, what will happen is it inspires a good error and start watching it. And then, but you're going to have to have the formula that only counts the numbers that have a collected amount as well, right? and I don't, I couldn't tell you how to write that formula, but AI could definitely do it quickly, which says, you know, hey, this is what I want to know, but this is the issue. I've got to build amount in a lot of columns, but I don't have collected amount. I don't want to run this, this formula on anything that has an empty cell in collected amount.\n00:21:35 - Fujinaka, M.D.\nOkay. Yeah, we have the data that has zeros.\n00:21:40 - Tina Marie (profitdriversinc.com)\nRight. I am only as good with formulas as going and finding the one that I need and using them on repeat. There are so many people that are just genius with this. I am not that one. know just enough to get the job done. I can still smoke anybody just about in business with a really just basic spreadsheet.\n00:22:17 - Fujinaka, M.D.\nAlright, so I'll get this done. I'll get the figure out how to get that formula so that it's a real time update kind of can't believe I've done it once. And then I don't know why anyway.\n00:22:32 - Tina Marie (profitdriversinc.com)\nWith a good thing about reviewing the data and having to redo that again as it refreshes your mind on what's there. And so because I've done that and gotten frustrated and tried to go find the shortcut again and go find the old work. And it usually takes me longer than the rework. But what I found is in the rework is that that whole refresher is usually it's almost like it was divine help just like just unique. to do this. Go do it. Okay, so that's what we're doing. That'll be enough. Let's see, total case is referred average case of command state for first referral day and most. Okay, and then also we want the formula for number of months from the date of first referral you said. Yeah, you're going to need that but you don't want that in the top level. You need that in the raw basically it's for the formula so that you can do average cases per month and average revenue per month.\n00:23:42 - Fujinaka, M.D.\nOkay, I might just put it here because otherwise I'm going to forget.\n00:23:51 - Tina Marie (profitdriversinc.com)\nYeah.\n00:23:55 - Fujinaka, M.D.\nnumber of months since first referral.\n00:23:59 - Tina Marie (profitdriversinc.com)\nAnd that is also So I counted basically, well, there's two different types of formulas you could use there, whatever. I'll let you figure that part out, just the data columns.\n00:24:09 - Fujinaka, M.D.\nData must be some fraud. Okay.\n00:24:15 - Tina Marie (profitdriversinc.com)\nAnd then you want total revenue.\n00:24:25 - Fujinaka, M.D.\nOkay. So just to finish off this attorney one, then we want another tab that looks at attorney. Just attorney data, I guess. this is a specific attorney data. And then we want one of just like an overview of the attorneys kind of like that.\n00:24:53 - Tina Marie (profitdriversinc.com)\nBut hold on, in the specific one, we also want to know total revenue and average revenue per month, even though I know that it's just. Not a lot. Like I said, long term, you really want to be tracking that.\n00:25:06 - Fujinaka, M.D.\nOkay. all right. So, like, let's take one of these guys. this one.\n00:25:17 - Tina Marie (profitdriversinc.com)\nSo, could you sort by law firm really quickly?\n00:25:24 - Fujinaka, M.D.\nYou can undo this sort. How do I store?\n00:25:27 - Tina Marie (profitdriversinc.com)\ndon't know how to store it. You would have to just highlight the whole spreadsheet then go to data. Yep. Then go to store range. No, no, no, no, short range advanced range sorting options. I always choose that. You're going to want column N and it has a header row. And go ahead and sort. Okay, so now go to the one that has the most in the collected amount.\n00:26:08 - Fujinaka, M.D.\nThis doesn't look like it did it.\n00:26:10 - Tina Marie (profitdriversinc.com)\nYeah, it doesn't.\n00:26:17 - Fujinaka, M.D.\nAll right, we'll play around with that afterwards.\n00:26:21 - Tina Marie (profitdriversinc.com)\nWell, here, let's just take a section. No, yeah, but choose a note B. Row B, column B. Okay. No, pause. Okay. Just click on row 98, column B. Column B only. Okay, there that cell now just click on that and then highlights about a hundred lines. Like select. Okay. You know, you know how that there you go. OK, now in the right. OK, pause, pause, pause, right there on the right bottom.\n00:27:11 - Fujinaka, M.D.\nYou see where it says some.\n00:27:12 - Tina Marie (profitdriversinc.com)\nYeah, OK, click on that. Choose average. Click on that. OK, so now you have an idea. So the sun.\n00:27:26 - Fujinaka, M.D.\nOh, that's awesome.\n00:27:27 - Tina Marie (profitdriversinc.com)\ncan hear that. Oh, yeah, go click on it again.\n00:27:31 - Fujinaka, M.D.\nReal quick, please.\n00:27:32 - Tina Marie (profitdriversinc.com)\nOK, so click on OK, hold on set count 36. So I want you to hold on.\n00:27:44 - Fujinaka, M.D.\nJust don't click anything.\n00:27:45 - Tina Marie (profitdriversinc.com)\nJust just read for a minute. So 36 cases, the sum of the collected amount is 25,173. The average is 699. Now we don't know across what attorney. But now you know how you can quickly look at that.\n00:28:04 - Fujinaka, M.D.\nSo you don't have to go count the rows and how many selected, huh? That's awesome.\n00:28:09 - Tina Marie (profitdriversinc.com)\nYeah.\n00:28:10 - Fujinaka, M.D.\nDo that for everything? Let's do it for a reason.\n00:28:12 - Tina Marie (profitdriversinc.com)\nyes.\n00:28:14 - Fujinaka, M.D.\nOh, you do it?\n00:28:20 - Tina Marie (profitdriversinc.com)\nAnd you might have selected something that is not countable data.\n00:28:25 - Fujinaka, M.D.\nWhy would it be not countable data that's fair?\n00:28:30 - Tina Marie (profitdriversinc.com)\nIf anything in there is formatted some other way. So like I felt like I saw a date in there or something. So what you could do is go to format and just make sure that everything is in currency in that whole column. What did you highlight first?\n00:28:54 - Fujinaka, M.D.\nrow? Row two.\n00:28:59 - Tina Marie (profitdriversinc.com)\nOh, um. Actually, there's another way to go about that really quick, so how many rows do you have? Oh, no, it was there. Scroll down. Scroll down a little. There is a date in there.\n00:29:18 - Fujinaka, M.D.\nOkay, I'll throw the letter. It's okay.\n00:29:20 - Tina Marie (profitdriversinc.com)\nOkay, we could fix it super quick though. If you wanted, you just pass it again. Just highlight column B. Okay. From the very top, go to format. Go to number, currency. I'm selected and do it one more time. And you see if it'll change it. It might just be that. I did not do it. Okay.\n00:29:47 - Fujinaka, M.D.\nYeah, one more time. Yeah. had a date in there instead of an actual number. I hope it didn't get changed into a number now.\n00:29:56 - Tina Marie (profitdriversinc.com)\nWell, you can undo it. So you should undo it. So you can go because you don't know what it is, but that way you can get your numbers real quick if you wanted it.\n00:30:06 - Fujinaka, M.D.\nThere you go. We collected 300,000.\n00:30:10 - Tina Marie (profitdriversinc.com)\nAnd your average was 594 or 57, and I think that that might be higher than you thought.\n00:30:20 - Fujinaka, M.D.\nSo this includes some people that have had two visits, and I don't I don't differently, unfortunately. Yes. Like this guy, Jamie Hutchins had, let's see, one visit, two visits, three visits, and they gave me a total of 3,000. This is all high amount, but that increased the average, unfortunately. I mean, this is fine. This is I like this. This is just a quick and dirty way of how much each patient is worth, right? Yes. Whether they see me once, whether I'm the same friends, I at least know that average cost of patient value is right, $600 per patient, which is right.\n00:31:00 - Tina Marie (profitdriversinc.com)\nreally good to know, right? Because how many patients do you see in an hour because we're doing effective hourly rates? So how many patients do you average patients? Patients do you average an hour?\n00:31:11 - Fujinaka, M.D.\nThree.\n00:31:12 - Tina Marie (profitdriversinc.com)\nOkay, so there's your effective hourly rate?\n00:31:15 - Fujinaka, M.D.\nThat's awesome. So that I can go back to your clinic volume, right? If I got 300 new referrals, I could say it's about what do we just say? 600, yeah, 594, so it's like 550 or 594, I guess. 594 times 301 new referrals. yeah, 170. I should sometime in the future, these 300 people should bring me 178,000 eventually.\n00:31:45 - Tina Marie (profitdriversinc.com)\nThere you go. And that is why I love spreadsheets and doing some math and organizing the data so that you can quickly go figure some things out. So the assignment was to do this for each of your businesses to be able to get what the important numbers are so that we can do some quick number crunching so that we can figure out what is the most leveraged way to double your revenue this year. And when I say leverage, I've been able to multiple times, there's a threshold where this stops happening, um, 2x or 4x without increasing my hours at all. So, and for different businesses. Now, that starts with really taking stock of everything that's currently happening. And the capacity of the existing staff, a lot of times the existing staff is not topped, or, um, maybe they are for hours, but maybe they haven't been operating in an leveraged and optimized way. And so, we can get more out of them without overtaxing them, or even taxing them further, actually making their journey. jobs even easier because they're like oh I could do it this way and this way and so it's less tedious but they're still getting more output for you. So it really starts with capturing all of this data.\n00:33:15 - Fujinaka, M.D.\nWe're not sure if this you know one of the things we talked about in last fall was that you know for the same patient if we get a return visit a second visit or a third visit it doesn't you know really cost me a thing so we don't know if this number isn't anomaly that we got you know 424 visits but we my manager has started we have a rudimentary system of asking the case manager hey it's been six six weeks since your client saw us he literally just goes back in the calendar and is just emails the people from six weeks ago and be like hey it's been six weeks is your client want to check and if they say no we only do that initial cost and we say great but a lot of them we've been finding this thing oh yeah yeah yeah. I want you to see how they're doing for us so that my manager assigns the scheduler and says, hey, schedule this patient a follow-up. So I don't think this is reflective. I think this is just summer months. lot more people need our services in summer. But yeah, hopefully, know, if this number can stay above 400, I'm going to be super happy.\n00:34:24 - Tina Marie (profitdriversinc.com)\nI would like you to get that data separated from historical records so that you do know it should be in your records where, and it might be tedious. But again, that's really how important the numbers are so that you can start looking at patterns. Was there particular types of cases or attorneys where you have people coming back? So what's already right spots, right?\n00:34:54 - Fujinaka, M.D.\nThat was the conversation we had last week.\n00:34:55 - Tina Marie (profitdriversinc.com)\nThe data is how we discover the bright spots the fastest, rather than some pulling upon them. So it is worth the effort. But it also is insightful. There's something that just happens in the confidence of knowing like, oh, that percentage is way lower than I thought we really want to be more proactive on the, you know, follow up or it's higher than we thought, oh, that's good. I wonder why that type of thing. So really until we have all the data, like that, that's the first step is all the data across all the businesses and start evaluating that. The next step is going to be to come up with a plan for what are, what are we going to tweak in any or all of the businesses to make a certain type of list. And so what the data is going to tell us is, and what we should be able to do is do a forecasting exercise and say, if we were to create a 5 or 10% lift or 20% lift in this business, First of all, how doable is that, what would have to happen, what conversations, what marketing, what SEO, what hiring, what all the things, And then based off of current efforts, how much time and how much money is that going to cost, again, it's just a projection, right, and we're going to assume a roughly similar profit margin, but generally what happens is the profit margin either shrinks or grows, it almost never stays the same when you grow. And so we're looking for where do we get the most lift with the least amount of risk and or friction, and then we create the plan for that. Then soon, I would like to see you have an actual database that everything's not in spreadsheets that is searchable, but this is not the time to get there yet. The first thing you need to understand is all that they do. that you do need to manage, how important it is, where is it coming from and how you want to look at it before you try to choose a house for it. So this step will save you a lot of money in frustration going somewhere that doesn't even do what you want it to do and also it's a great start and most of your data could be imported from the spreadsheets that you're creating.\n00:37:28 - Fujinaka, M.D.\nI'm going to wait, so there's one other thing that I wanted to track. So we looked at total visits and you said we had to separate, why did we get this lift? Oh, yes. So I think on the attorney data, no, this wouldn't be, so what I'm thinking is I want to track which law firms let me have a second visit and a third visit. I'm trying to figure out where I should put that.\n00:38:00 - Tina Marie (profitdriversinc.com)\nThat should be in source, so wherever you track your patients, you want to track the referral so that you can have that source.\n00:38:14 - Fujinaka, M.D.\nRight. I have that on the sheet, right? have, you know, who emailed me the data to referral, but what I want to look at is how many gave me data service to.\n00:38:26 - Tina Marie (profitdriversinc.com)\nRight, so this wherever you're tracking all of that, that's where you want to. So you said that your law firm is in there. So add, you know, data service one data service to whatever and then you'll. Okay, so it's just another formula of extraction and.\n00:38:48 - Fujinaka, M.D.\nWhere should I, where should I summarize it, I guess?\n00:38:53 - Tina Marie (profitdriversinc.com)\nShould it be in this top level? Yes, okay, so let's go.\n00:38:58 - Fujinaka, M.D.\nHow would I do it though, because it's not. only patient number. It has to be by which firm and how many they've given me, right? the law is there. It's my biggest refer. You know, this guy lets me have two visits.\n00:39:15 - Tina Marie (profitdriversinc.com)\nSo let me go with you. Oh, yeah. So go back to your specific attorney data.\n00:39:24 - Fujinaka, M.D.\nOkay.\n00:39:25 - Tina Marie (profitdriversinc.com)\nSo let's have a column that says total second visits.\n00:39:31 - Fujinaka, M.D.\nOh, yeah, that's a good idea. Okay. And then I could divide it by the total number of referrals. What did I call that? Total data service to? Okay. So total data service to, then I could say, what is it? I guess I could say, call this one percentage of. referrals who get a second visit or something like that and then I can have total date of 90% referrals that get a third visit. All right, that's elegant. Okay, thank you. All right, you can keep talking.\n00:40:25 - Tina Marie (profitdriversinc.com)\nThat's what this process is. That is what it is. If you look at it, like I said, you just illustrated exactly what I say keeps happening. Once you start to organize the data, it triggers a new thought, a new question that you didn't have before, and it improves. The format improves, the formula improves, it's constantly iterative. So, that's exactly what we should be doing.\n00:40:54 - Fujinaka, M.D.\nwonder if I should have my manager take a, you know, I don't know how long it would take to go through. 3,000 lines of data, but I mean it's not terribly long, but essentially to make sure that my naming is correct. For instance, you see here at Lalaseri Law firm LLP, I know later on down the spreadsheet, they started calling it Lalaseri LLP comma. So that's going to give me two different pieces of data, like sweet right here already has a comma, but I know up here they weren't using a comma.\n00:41:28 - Tina Marie (profitdriversinc.com)\nSo there's a couple of things you can do. One thing is you can just do a find, replace, and remove all commas. The other thing is I really think it would be worth your while to explore and see what the Gemini AI can do if you can interact with the spreadsheet and ask it questions. Okay. I said, and actually it's a free trial for two weeks.\n00:41:56 - Fujinaka, M.D.\nI saw that.\n00:41:56 - Tina Marie (profitdriversinc.com)\nYeah, they've been advertising it to me. Yeah, I didn't buy it. And I wasn't going to I literally just dismissed it right before the call, but looking at this, this, if if if you can interact with this data, like I've been able to interact with spreadsheets through chat GPT, then it will definitely be worth it because then you don't have to export anything it's already housed in here. It's like the home bot basically.\n00:42:21 - Fujinaka, M.D.\nYeah, that makes sense.\n00:42:29 - Tina Marie (profitdriversinc.com)\nOkay. You like what and give it the example, for example, this law firm is also this law firm, but the, the whatever the characters that's not the word I'm looking for, but is, is not precise. So, can you tell me how many times you think one thing has showed up differently because I need to correct it and then give me the examples of what you find.\n00:42:59 - Fujinaka, M.D.\nOkay.\n00:43:01 - Tina Marie (profitdriversinc.com)\nBecause even if you have your assistant help you, first of all, human error with 3,000, 4,000, almost records, that's going to be a lot. But again, in the practice of doing it, you might think of a new question, a new way to interact with your existing data and go, oh, I wonder, blah, blah.\n00:43:22 - Fujinaka, M.D.\nOkay, yeah, I'll, uh, let me, I think that's a good idea to kind of start with the Gemini I like that. Okay. Yeah.\n00:43:38 - Tina Marie (profitdriversinc.com)\nSo just remind yourself, though, we do that when you're going through this tedious stuff, this, we are a few weeks away from having a plan for doubling your revenue. from what I know about what, what I've seen. At least half again, right, 150%, right, because that double would be 200% off to think about these things.% growth in revenue without hardly any extra time should be possible. I think that there's a lot of leverage already in your business. So when you just look at this, I just want you to remember that the clarity that we get from here, that is 100%. It's the compass. It's the one that tells you where you need to go to get that the quickest, the easiest without too much of an energy impact, and probably also staying under the radar and not creating too much data for yourself.\n00:44:49 - Fujinaka, M.D.\nGot it.\n00:44:51 - Tina Marie (profitdriversinc.com)\nOkay. That's it. This is the task. These are the things to do until it's done and until we've learned what we can\n00:45:00 - Fujinaka, M.D.\nand learn from it. Awesome. And then so I'll do the raw data specific attorney data. Oh, yeah. then, yeah, so that this collection tracker. I need to figure out how to clean this thing up.\n00:45:25 - Tina Marie (profitdriversinc.com)\nI would love to see what Jim and I could do with that too.\n00:45:27 - Fujinaka, M.D.\nLike when you say clean it up, what do you mean Well, I know this formula is not right. I wrote this with chat GPT, but it misses. It misses. Well, it's not going to be problem anymore. Like two weeks ago, I switched my billings and how everything is the same. Washington is the same. But before I was building a different amount for Washington. So it was changing the amounts. Okay. Okay. Just have to think about it a little bit, how to weave that out of the data. Because when I get paid like 300 from Washington, that's actually a higher percentage than a total bill because the bill was only 400. But anyway, but I stopped doing that recently. I made all the payments the same.\n00:46:18 - Tina Marie (profitdriversinc.com)\nYeah, I do think that would be something if Gemini is any good and has definitely evolved a lot, might be able to help you with that. And I think with them putting it into the Google, I cannot think of the word, the sweet tweet. That it might be ready to really interact with that well. And you'll know quickly, put it in there, ask it some questions. either gives you some good responses or not, and go from there. So the other businesses. Do you want to think about them at all? you want to look at maybe how to start tracking that data with a little bit of time that we have left? Or do you want to just go get at it?\n00:47:12 - Fujinaka, M.D.\nYeah, let's take a look. So that was, this is July. And then QMEs, okay, QMEs wanted to talk to you like what we should pull because we have the data in Salesforce, my wife's company. But we pay a consultant to pull data for us like this. We don't just have these. So I want to be specific about what data would be helpful to me. So these are the ones I thought would be helpful. Month by month, number of QME requests, or I guess I could say new requests. Oh, I know what I mean. But new requests per month divided by month by month. requests by attorney, I want to start there, and then these AMVs are referrals, so they're direct referrals to me. So again, track those by location and applicant attorney. These are SIBTF, that's another type of case, that's a direct referral. So I wanted to check track these by location and applicant attorney. Probably the location is not that important, but really just which applicant attorney is sending it to me. This is another subtype, I call it a agreed QMEs, so these are another direct referral. The QME is the lottery one, right? QME is the lottery, and the other three are direct referrals from a parent. So I do think location matters.\n00:48:47 - Tina Marie (profitdriversinc.com)\nOkay, well I'll keep the location.\n00:48:48 - Fujinaka, M.D.\nYeah, and then we just submitted the Public Relations Act for the data. I'm going to get the data.\n00:49:00 - Tina Marie (profitdriversinc.com)\nfrom January 1st, 2024, until now, and we'll be able to see how many hits are in each zip code across California and the level of competition in each zip code. Yes, you can't get it going for the back.\n00:49:18 - Fujinaka, M.D.\nI can. Yeah, I'm not sure what the price is going to be because they charged me decent amount last time I went back a year. Could you quantify decent amount? Like $200.\n00:49:37 - Tina Marie (profitdriversinc.com)\nWell, the work that we're going to do with that data is worth way more to you, so I would like you to get that.\n00:49:43 - Fujinaka, M.D.\nOkay, let me ask that.\n00:49:45 - Tina Marie (profitdriversinc.com)\nThe patterns that we'll see will be worth that.\n00:49:57 - Fujinaka, M.D.\nOkay.\n00:50:00 - Tina Marie (profitdriversinc.com)\nSo, um, think about, because, uh, she sent it for the, uh, I'll, I'll, I'll make it clear. So, like you saw as we just processed the data for July and started to kind of create the framework for it. As you start putting data in, you realize, oh, I probably should have this, I probably should have that. So, I want you to be really fluid, not rigid in the expectations as you organize it and invest in this particular process, because to come up with the best structure, you need to be able to be fluid and, and shift according to what, what it reveals to you. You know, so just kind of keep that in mind and. There's one thing to be conservative and there's another thing to just, you know, $200 to throw away is one thing, but $200 to get a whole year's worth of data and to watch the trend. really, as long as you've been in business, would be the data that I would like to see.\n00:51:18 - Fujinaka, M.D.\nOkay. Yeah. I just asked her to update the request we did to include all 2020-23.\n00:51:23 - Tina Marie (profitdriversinc.com)\nOkay. I mean, if you can think of anything else that has ever been important about that business or anything that you've ever looked at, then capture all of it, because...\n00:51:39 - Fujinaka, M.D.\nOkay. Yeah. Then it'd probably be, it would probably be a count of each, well, I'll be able to do that actually.\n00:51:49 - Tina Marie (profitdriversinc.com)\nOnce I have that data, I'll be able to do it.\n00:51:51 - Fujinaka, M.D.\nOkay. Once I have the month-by-month data that I can calculate how many total requests from one applicant attorney.\n00:52:00 - Tina Marie (profitdriversinc.com)\nBecause I want see how many each individual applicant attorney sent me cases.\n00:52:05 - Fujinaka, M.D.\nYeah, that'll be helpful.\n00:52:07 - Tina Marie (profitdriversinc.com)\nOK, right, whatever raw data, the formula we can come up with on our own and move things over. OK, so do you want to talk about any of the other businesses?\n00:52:17 - Fujinaka, M.D.\nTest prep, I pulled some data. I started in April 2023, and then I had 39 purchases, then 50, then 89, 50. So in total, I sold 236 pieces of whatever software. And it's made you what?\n00:52:40 - Tina Marie (profitdriversinc.com)\nAnd how much did that make you?\n00:52:44 - Fujinaka, M.D.\nTwo 36 times, I sell it for $300 a pop.\n00:52:48 - Tina Marie (profitdriversinc.com)\nSo I don't know how do Actually, here, so what you'll do is go to column C.\n00:52:56 - Fujinaka, M.D.\nLet's see, let's see. Actually, just do equals. No, it was at times three.\n00:53:02 - Tina Marie (profitdriversinc.com)\nI don't know. No, well, yeah, you can do that there, but yeah, that's not where it was that time 300. Yeah, and then some below that. So let me just show you something real quick. Escape that. So highlight column two C down to five C. Okay, and now go to the sum button. Do you know what that is? Top right of your formula bar. It looks like a sideways M. This guy? Yeah, click on that. Go to some and enter.\n00:53:51 - Fujinaka, M.D.\nI like it.\n00:53:57 - Tina Marie (profitdriversinc.com)\nYeah, so that's the total that it's made you. Then, of course, you can do the average by month and all of that stuff.\n00:54:06 - Fujinaka, M.D.\nI only sell twice a year.\n00:54:10 - Tina Marie (profitdriversinc.com)\nYeah, it's interesting that October and April flip flaps in.\n00:54:16 - Fujinaka, M.D.\nOh, no, that's just because this is the current cycle.\n00:54:20 - Tina Marie (profitdriversinc.com)\nI'm not. Oh, yeah.\n00:54:22 - Fujinaka, M.D.\nYeah. did run Google ads. And the first time I launched the product and I got 39 purchases at a cost of 1,300. I didn't think that that helped that much. And so what I did was for October, this one for all these going forward. I actually did a public relations act and I got all the emails to the people taking the test. I just sent three direct emails to them a week apart. And I said, hey, you want to buy my product? Hey, you want to buy this? And so I stopped doing the paid advertising and just did direct to because I know who the test acres are.\n00:54:57 - Tina Marie (profitdriversinc.com)\nAnd I have their emails. So I just directly emailed them now. How many tests take on rather?\n00:55:06 - Fujinaka, M.D.\nWow, it's just about 300 200.\n00:55:10 - Tina Marie (profitdriversinc.com)\nOh, that's not a big pool, is it?\n00:55:14 - Fujinaka, M.D.\nNo, but I mean, I got like a quarter of them.\n00:55:18 - Tina Marie (profitdriversinc.com)\nAnd April left quarter of them bought it from me. So two angles for growth would be market share increase, getting more of the students. Yeah. Then giving more to the students, you can get more out of the students. You were talking about other types of training. What could you be creating for them?\n00:55:42 - Fujinaka, M.D.\nYeah, that's good. know, can I do with existing customers? Yeah, I can offer them. And then the 12 hour rain course, but I don't I don't want to produce that. There's like a bunch of producing. There's not already, but maybe I could get like a referral deal or something in our kickback.\n00:56:04 - Tina Marie (profitdriversinc.com)\nYes. Yes. And it's really a question would be a very easy bit of revenue, especially if you're only referring to somebody who's really good.\n00:56:13 - Fujinaka, M.D.\nI could also know that this I know time, but this is my physician recruitment business. So I was I didn't complete this, but I was feeling in the data how much I make per month since I quit the other one. So the most recent month, I made 13,000 from company A and then 9,000 from company B, know, from recruiting, like four of my friends to doing this. So I could use the test prep to try to get more physician physician recruitments into this company.\n00:56:50 - Tina Marie (profitdriversinc.com)\nLike if I could recruit another two or three doctors per year into either company A or company B, that probably gave me like $2,000 a month extra. That's half of Tina's view there.\n00:57:00 - Fujinaka, M.D.\nright there.\n00:57:02 - Tina Marie (profitdriversinc.com)\nWe want to look at it. I told you we got to earn your watch so you also get your watch because you're like it was birthday or coaching or watch or coaching. So nice that we can make the coaching pay for your watch, right? That's the goal. want to see you get that watch and be like I got both of them. Okay, so that's what I want you to do is continue to populate these spread sheets the best that you can. And with anything, what else could you do with the existing population that you have? So there are other things that you can do for the existing attorneys, existing doctors, existing patients. Like that's a whole new, you know what I mean? Like what is possible with what you already have as an asset.\n00:57:53 - Fujinaka, M.D.\nOkay, that's what we're going to do. Oh, in the last two minutes, I'll tell you I got this other opportunity that just walked into my hands, where they want me to do a at-home record review. So they send me a car crash and they send me the doctor's notes, the lawyer's notes, and they just want me to comment on if it was appropriate. And I just did my first one, and I don't have to see anyone. They just send me the and they're going to pay me $4,000 for that work.\n00:58:26 - Tina Marie (profitdriversinc.com)\nOkay, so EHR, we got to do the calculations, effective hourly rate. You want to look at the volume, and you also want to see what else you could use, because AI can scan. I actually sent it to the first version, and then you go double check it.\n00:58:49 - Fujinaka, M.D.\nI actually used Esther's company to summarize the notes for me, and then once I had that, then I used chat GBT, I asked it the questions on the summary and said, hey, what is the summary show stuff.\n00:59:01 - Tina Marie (profitdriversinc.com)\nYeah, paying dividends like that. Yes.\n00:59:04 - Fujinaka, M.D.\nThank you.\n00:59:05 - Tina Marie (profitdriversinc.com)\nThat's great. Thank you.\n00:59:06 - Fujinaka, M.D.\nAlso, after you're done with Mark, can you email me or text me or PayPal?\n00:59:11 - Tina Marie (profitdriversinc.com)\nAnd because I need to send you the money. Can you really got to be accountable?\n00:59:16 - Fujinaka, M.D.\nYes. All right.\n00:59:16 - Tina Marie (profitdriversinc.com)\nI did not come up. Speaking of Mark, I got to run to that for your beautiful ladies. Hello, and I will talk to you next week. Bye.\n","contentPreview":"00:00:00 - Fujinaka, M.D.\nGood morning.\n00:00:02 - Tina Marie (profitdriversinc.com)\nHi, how are you?\n00:00:04 - Fujinaka, M.D.\nGood. are you?\n00:00:05 - Tina Marie (profitdriversinc.com)\nSweetie. I a...","processedAt":"2025-05-04T03:40:52.594Z"}