{"fileName":"Done Transcript for Lorenz_Patrick(1).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Lorenz_Patrick(1).txt","type":"transcript","priority":"medium","content":"00:00:13 - Lorenz Schuerch\nGood to see both of you guys.\n00:00:24 - Tina Marie (profitdriversinc.com)\nHow are you guys doing?\n00:00:27 - Patrick Shahverdian (sweetlaw.com)\nHow are you?\n00:00:29 - Tina Marie (profitdriversinc.com)\nGood. Sleepy.\n00:00:31 - Patrick Shahverdian (sweetlaw.com)\nActually, I'm running for nap.\n00:00:35 - Tina Marie (profitdriversinc.com)\nIt's the time. Yeah, I'm glad we were able to connect today. And Lorenz has been like a year since I've spoken to you, huh?\n00:00:46 - Lorenz Schuerch\nYeah, I was thinking about that. Yeah, last time we spoke with Sam.\n00:00:52 - Tina Marie (profitdriversinc.com)\nYeah, how are you feeling about your numbers? Well, let's see. I have so many questions, actually. They all fight in my brain and want to come out at the same time. so usually I just trip over them and eventually something comes up. Yeah, so let's see, I'm curious about your numbers, although I've been looking at them because I look at them every week with Mark on a whole, not always individually. And I know we have talked about Cynthia and how she works, but now she's on Pat's team, right? Yeah. So let's start with just kind of a recap of what you remember about what we discussed last year. And anything that it's, I don't know that you might have kind of applied or feel like forgot, didn't apply, whatever, your overall thoughts from your experience last year to now.\n00:01:55 - Lorenz Schuerch\nSure. So I think my real life things is, you know, trying to, I think, struggling managing individual members on the team. And we were working on trying to find everyone's strengths. We can't play to their strengths at the time. And so I've been trying to do that and not apply like a preset system on everybody equally. So I'm using everyone's strengths. You know, I split my, I have two teams, essentially. I have Jessica and Mike and John and Viri. And they, it's the same task. All the same tasks get done. the division of the task is a little bit different from one team to another based on their strengths.\n00:02:51 - Tina Marie (profitdriversinc.com)\nI love that. And how do you feel like that works for you? What do you notice about? just day-to-day operations. It could be in terms of cohesion on the team, how people feel like just kind of mood, satisfaction, their own satisfaction. There are so many different nuances to how we perform operations that impact us as people, but also as output. How do you feel like that works for your team?\n00:03:34 - Lorenz Schuerch\nI think they like the general idea. think the issue that we run into a lot is we have these goals and all five of us are very goal oriented, like knowing the expectations and so we all kind of sit down at the beginning of the month, go through the cases we'd like to set, all cases we'd like to close. And then invariably there's always, you know, it's like every day there's like crises that take away our time. And you know, there's clients that are just about to fire you because I never get a call back and I look into the case and, you know, we're talking to that person every other day. And so it's, you know, it's on some of us a little frustrating because it feels like, you know, the biggest, uh, variables that client themselves.\n00:04:34 - Tina Marie (profitdriversinc.com)\nYes. Um, so that's interesting too. Let me end that.\n00:04:42 - Lorenz Schuerch\nRight. Like today I spent an hour with a client who, uh, you know, wasn't happy with her conversation with Mike yesterday and I basically said, well, she had a list of questions. And I went through all of her questions one by one and essentially said the exact. same thing Mike told her yesterday, but she was super happy. And, you know, she loves us now. But yeah, to take an hour out of my time out of the things I had to set out to do today, to talk to her and repeat the exact same thing Mike told her yesterday.\n00:05:19 - Tina Marie (profitdriversinc.com)\nHey, um, that's good information. So I'm going to just kind of recap that the way that it's, well, and we only got to talk once and we've only talked once. We'll around you and I twice, but there was one as a startup and then just a follow up. But so Mark has committed to six months to work together for the three of us. And what I do with my clients is basically just take a holistic approach. So it's a lot of information gathering. And then it's a matter of prioritizing and ranking what we discuss and what we'll have the biggest impact. what's the biggest lover in the business in your day to day operations and things like that. So though we're just starting kind of working together, I've been with Sweet Law for three years. So we've been talking, you know, Mark and I every week for the last three years. And so some of the things that we're working on is going to kind of and overlap. So one of the things that we were talking about trying to figure out is how do we do, how do we create a client ranking system with intake so that we can improve our intake script and process to potentially if even possible because there's such a wide variety of types of cases that you take as well as types of people. And we can't, you know, just cherry pick everything, right? But, but are there ways of determining through potentially profiling and through recognizing through conversation very early through the script, what types of people are going to show up are going to do the work, you know, because there's always a portion where they've got to get us their information and, and do the reporting, will they return our phone calls, will they return our emails, all of those types of things. And so, anyway, not that we have enough information do any of that now, but, but, but all of the things that you share will be useful because then I can go back and we can look at and you guys might find that there are some parallels in what you experience. And one of you might say, well, actually we had that same issue and this is how we did it. So, there's a couple of things just as a general practice that I try to do. with all clients across all business types and it doesn't work uniformly and sometimes it's just not applicable but for example starting up the day proactively versus reactively meaning whatever planning we're doing whatever organizing we're doing and whatever we've prioritized as being the most important thing to accomplish those things get done beginning of the day as quickly as possible so that when we get pulled to the fires you know the things that have to be dealt with in a timely manner have to take time the things that were most important the things that moved the needle the furthest let's say it's a really high high level case right maybe it's a death case and and there's it's higher priority because of the client because of the client's needs and the impact it has in their lives but also what it's worth to sweet-law so What we'll try to figure out is are there ways that we can better structure either our day or the team or our styles of communication with customers or within the team where we have more time and more energy for higher value, higher impact activities, and we're either triaging the lower level stuff. Potentially delegating it. There's a lot of variety. You know how you manage a team, but those are the things that we're going to be looking at, seeing if there's things that we can do to improve. We'll take best practices and then I'll also take some of this information back to Mark and see if there's some feedback where he can help. So point being all of this is discovery. All of this is useful. And that's kind of I just wanted to talk about the approach of how we're going to be doing it since we haven't covered that yet you and I learned and Pat and I did that last week so just make sure this isn't a child it's not in mute everything sorry about that. Okay, so you were talking about. So how many people do you have on your team and I'll have your list right now. I've got four. And remind me who they are please.\n00:10:33 - Lorenz Schuerch\nSo there's Jessica and Mike. And then there's John and Mary.\n00:10:39 - Tina Marie (profitdriversinc.com)\nJessica and Mike are your case managers.\n00:10:42 - Lorenz Schuerch\nYeah, John is a case manager. So they're split into two teams. So Jessica and Mike do mostly the Spanish speakers. And then John. And they're both case managers and then. and John and Vary have more of a traditional split where John does most of the case manager asks and Vary does more of a record request and things like that.\n00:11:19 - Tina Marie (profitdriversinc.com)\nAnd those two were kind of a pair, weren't they, that are newer to the team? Very, didn't she come from somewhere else?\n00:11:31 - Lorenz Schuerch\nYeah, she came, I think she came from Sweet James maybe, I'm not sure.\n00:11:38 - Tina Marie (profitdriversinc.com)\nI was thinking not, but did she and John work together before? No. It wasn't them, okay.\n00:11:45 - Lorenz Schuerch\nBut Mike and Justin.\n00:11:48 - Tina Marie (profitdriversinc.com)\nMike and Justin, okay. I knew that there was a newer two people that had worked together and kind of came together. Okay. So how do you, when do you have your meetings, how do you meet set your goals like as a weekly, do you have daily meetings, how do you look?\n00:12:12 - Lorenz Schuerch\nSo right now we went through a few iterations and I try to get as much feedback as I get from them. We used to meet as a full team every other day and then the feedback I got was that there's a lot of, when we were going through cases for the other team, the opposite team didn't feel like there's a lot of value so now I'm meeting with individual teams every other day and we kind of do file reviews. We do, you know, if there's any fires to put out, we do those and then we kind of cases along.\n00:12:59 - Tina Marie (profitdriversinc.com)\nAnd how long have you been\n00:13:00 - Lorenz Schuerch\ndoing it that way about a month and how do you feel that's going for you it's going good I'm yeah I think I like the idea of doing foul reviews as a team it seems like we're all on the same page at the same time rather than information you know trickling in from different slack channels and we we have a better overall trajectory for each case what what's next you know how do we move this case along faster and you've only been doing this for a month but you you notice the trajectory changing and improving yeah yeah and we have a lot less a lot fewer cases while stagnating\n00:14:01 - Tina Marie (profitdriversinc.com)\nAnd that was primarily, would you say, from, um, the file reviews together?\n00:14:10 - Lorenz Schuerch\nSo all five of you doing that? Well, no, because their cases are split up. So like now I do, I do them with the, I do the, okay.\n00:14:22 - Tina Marie (profitdriversinc.com)\nSo file rules together per team.\n00:14:24 - Lorenz Schuerch\nSo team.\n00:14:25 - Tina Marie (profitdriversinc.com)\nYeah. Okay. Okay. Okay. Um, that's great. I'm, I'm really interested to see how that continues to improve, are you getting good feedback from them?\n00:14:38 - Lorenz Schuerch\nThey like that. Oh, they love it. They, I've gotten really good feedback from all four of them. They say they, this is the, the best thing. just. Let's go. Leader.\n00:14:51 - Tina Marie (profitdriversinc.com)\njob.\n00:14:51 - Lorenz Schuerch\nGood job. It took some. Several iterations.\n00:14:55 - Tina Marie (profitdriversinc.com)\nAs I said. Yeah. That's the thing about growth, though, it does. It takes several. Okay. Good iterations and you know there are different things that can throw a wrench in it just somebody having a major life event can do it um you know there's there's so many different things because at the end of the day it's just it's people and um we've got a lot going on so um let me keep an eye on the time because I want to make sure we we cover everything I'm really I'm really excited for that so you do you remember reading the book multipliers that we talked about yeah um do you feel like you are staying mindful of um looking for ways to kind of nurture and develop leadership in each of your team members I could be better I could I could do better I used to I used to make time to have like an individual kind of like check\n00:16:00 - Lorenz Schuerch\nwith each cheating team member like once a month and then you know people get sick they took some days off and it just kind of fell out you know a few months ago and to get back on the board especially with a new member very she's super super shy and so that's really hard to get it's like pulling teeth trying to get information out of her.\n00:16:27 - Tina Marie (profitdriversinc.com)\nDo you feel like that's her all the time or that it's a work situation and she maybe doesn't feel safe in in the work environment to speak her mind?\n00:16:44 - Lorenz Schuerch\nNot necessarily because you've created that but I see what you're saying you know it's hard for me to say at a distance I know that you know I I know she's a single mom with four kids, so I've always tried to, anytime she has a doctor's appointment or something like that, I to be as accommodating as possible.\n00:17:10 - Tina Marie (profitdriversinc.com)\nI can relate.\n00:17:12 - Lorenz Schuerch\nSingle mom.\n00:17:13 - Tina Marie (profitdriversinc.com)\nExactly.\n00:17:15 - Lorenz Schuerch\nAnd so I don't think I've ever said, no, you can't take time off or anything like that.\n00:17:21 - Tina Marie (profitdriversinc.com)\nWell, so as a single mom with four kids, sometimes just risk aversion keeps you from talking. Being afraid of stirring the pot a little bit, causing any kind of conflict, causing any kind of work environment hostility. you say things, you know what I mean? don't rock the boat kind of thing, which is why I was asking you, did you feel like it was more of her personality to not be open and say what she's thinking? Or is it that she's a single mom who can't afford to lose her job? and wants to have a good place to work. So she doesn't rock the boat and saying.\n00:18:04 - Lorenz Schuerch\nthink there could be some of that. And I have four kids, so I kind of get it too a little bit, maybe not to the same extent, but, you know, you want stability when you have kids. You're not looking to job hop. So it's abilities, your primary motivator. And so I think there's some of that. I think there's, you know, it's easy to feel when there's not a ton of parents around you. It's easy to feel like you're not sure if people are gonna understand your needs.\n00:18:40 - Tina Marie (profitdriversinc.com)\nYeah. Okay, so I'm gonna make a note of just something that maybe we can work on some exercises that we can at least experiment and see if it's something that we can, we can. help with because I look at this as most of us don't want to be job-hopping. Most of us would like to kind of have a place where we can nurture and grow and evolve ourselves as well as everyone around us for a long time. And if that's the case, then it's worth investing in every portion of that experience in terms of the skills, including the soft skills, the communication skills, including the relationships between the team members, all of those things. so being able to tap into each person's super powers, their strength, everything that they have inside of their minds, to the point of like what you read in multipliers. Pat, did we talk about multipliers last week at all?\n00:19:53 - Patrick Shahverdian (sweetlaw.com)\nyou remember? Yeah, I told you I didn't like to read.\n00:19:57 - Tina Marie (profitdriversinc.com)\nYeah, that's okay. That's okay. we'll have an approach. But the promise of the book was, and I think I did touch this, which is that you want to nurture the leadership in everybody that's on your team, so that basically everybody's playing at their best levels, and that you can create autonomy. Like you were talking about Cynthia, you needed to walk her through some things so that she would know just to get the job done, right? These are the things that don't sit around and wait to be told that type of thing. Like that's multiplying, that's making her more valuable, and there were things that Lorenz did as well to work with her. So that's just the thing is noticing where somebody might be pulling punches a little bit, might be holding back a little bit, or somebody might just not be having the support that they need to be able to to do what they can do. So as we go through our meetings each week, it's just kind of looking and going, oh, I noticed this thing. And some of it is just going to be human nature. None of us are perfect. None of us are going to do amazing at all the things all the time. But some of the things we can make, even if it's a 1% improvement, a 5% improvement, sometimes a 15% improvement. And then you start compounding 1% over here, 5% here, 10% here, another 1 over here. And then all of these different improvements, of them micro level, some of them macro level. And then you look at that a year later, and you look backwards and go, wow, this is amazing. Look at how steady we are at these numbers. Look at how happy everyone is. Look at how well everyone's working together. I used to have to say this to somebody every single week. now I really don't know. I'm to have to say anything to them about it, like little things like that, that just make the quality of your work day better, a little bit less stressed, not just for you, but for your teammates, which tends to end up coming out for the clients, which makes their experience a little bit better, generally will impact the numbers so that your bottom line revenue is higher without feeling more stressed because of it. So, they're very subtle things. There's nothing that you go, holy cow, that's an amazing whiz-bang like, you know, did that come from? It's nothing like that. It's just a little micro adjustment here and there that you look back at it and go, this is better. For example, around your goal last year to start improving your numbers, how are they compared to where you were at the beginning of 2023 versus now?\n00:22:56 - Lorenz Schuerch\nWhat's that like for you? I've been trying to work on... I'm quicker turnaround. think I had a couple of first quarter. I had a couple of rough months. One was kind of rough because of money in and then the following one was rough because of settlements, which doesn't make sense. You would think it'd be the other way around. that took a big chunk out of my confidence. I kind of like try to reset myself, reset the team expectations and try to press on the gas pedal. The numbers could be my goal every month as a minimum. of $600,000 and I haven't hit that in a couple of months, so I've been just disappointed. And then there's a couple of factors as of looking at that and State Farm has been just really awful to deal with this year. putting the brakes on everything I've got. Probably out of the 20 cases I have in negotiations right now. 10 of them are State Farm and they're offering less than meds. mean, I don't know about you Patrick, but they're just, they seem to be just slowing everything down, just gumming up the words. And it, it's just, it takes so much time.\n00:24:48 - Tina Marie (profitdriversinc.com)\nHave you noticed anything that sounds out about State Farm for you?\n00:24:52 - Patrick Shahverdian (sweetlaw.com)\nYep. Same compliance as like the cases. Those cases take the most time to get resolved and it's like, and it's crappy results. Yeah, like the, to the firm, it's like the lowest result of like, sometimes I'm like, it's better. We don't even just drop the case and I'd rather put more time into X case that's going to bring in 30K to the firm because, I mean, I just resolved one now. It's like the case settled for nine grand. We're going to take like two, like, I spent so many time just trying to reach somebody there. Clients pissed off because it took so long and the numbers like not even anything, you know, you would think somebody was going to wait five months for a case in negotiation would be getting like at least 10 to 12K in their pocket.\n00:25:40 - Lorenz Schuerch\nIt's to the point where, when I see in the intake channel that the defendant's insurance estate farm, I get anxiety and I'm like, if it's not a broken bone, I don't really want it. Because I know it's just going to be such a struggle.\n00:25:59 - Tina Marie (profitdriversinc.com)\nThat is really. really good to know. don't know ethically that we'll want to avoid those, but maybe, you know, because we talked about client ranking, but maybe there's a case ranking system that we have. And maybe, I don't know, I want to talk and brainstorm this with Mark and see if there's a different way that we handle it. Yeah, that's interesting.\n00:26:31 - Lorenz Schuerch\nBecause I look, the main issue and Patrick talked about is it takes just as long to manage a small soft tissue case as, you know, for a state farm as it does to manage something a little bit more serious for GEICO, for example. But the state farm case, I know if I get the meds, it's like party time, we've we've won kind of thing where with GEICO, we can pop the policies\n00:27:00 - Patrick Shahverdian (sweetlaw.com)\nAll day long It's also hard to game plan those state farm cases because even if you do all the right things like that mark has taught us on how to work up a case It like that just doesn't apply what state farm for some reason. I know the friends has cases where you know even The client got injections in the medical You know the offers like not even half the medical expenses like it just doesn't make sense And that's a case that you work up just like any other case would and you know The other one settles and gets done and this one you're still stuck like asking the most basic questions to the adjuster like why is your offer X amount and you get like Seven eight of the state farm cases now You know based on marks the stuff he sees this case It doesn't have any negotiations for X amount of months. The client's pissed off. It just snowballed into the time sucking machine. And then when it does get resolved, it's not even worth half the time that we spent on it. But to completely bar every state farm case from coming into the firm, I don't know if that's the right move.\n00:28:29 - Tina Marie (profitdriversinc.com)\nI don't think it would be practical. We can't lose that many, but we might be able to change the way that we process them. And I don't know, like, even maybe a team or a system dedicated to it, or just even just having an awareness. There sometimes there might be a conversation that Mark can have. Maybe there's a representative. I don't know, but...\n00:29:00 - Patrick Shahverdian (sweetlaw.com)\nIt starts with having awareness.\n00:29:02 - Tina Marie (profitdriversinc.com)\nHas there even been a conversation among the attorney is or with Mark that state farm stands out so badly?\n00:29:09 - Patrick Shahverdian (sweetlaw.com)\nYeah, every week, every week.\n00:29:12 - Lorenz Schuerch\nI can bring it up every week.\n00:29:14 - Tina Marie (profitdriversinc.com)\nWhat does he say about it?\n00:29:16 - Lorenz Schuerch\nHe says, well, it's you know, you can always have someone else second voice and things like that. I've had other people second voices. had Patrick second voice. I've had Sam, I've had Nick. And usually it results in an additional thousand bucks. And it's I'm not going to like bulk at that because I know if we get enough extra thousand dollars eventually builds up or whatever. So go ahead, sorry. And I feel like. Like where's my value as an attorney to the client?\n00:29:56 - Tina Marie (profitdriversinc.com)\nYeah.\n00:29:58 - Lorenz Schuerch\nIf I'm getting them. the meds paid for, basically.\n00:30:04 - Tina Marie (profitdriversinc.com)\nYeah, well, at the very least, one thing I wanna do, and I don't think it's in our, I don't know if it's in our reports, it's not on my dashboard, but I would like to see matters by insurance companies and look at what the volume is across insurance companies in terms of how many cases we get how many times we hit max policy limits. Just drill down on that a little bit more. We'll be interesting. And sometimes, so to the point of getting disheartened, sometimes you just have to put things in perspective and just say, is it, and not let it get to you. pause, you know, there's there's all kinds of science on the psychology when you just you focus on on the problems, especially the things that you can't control, it impacts the rest of your mood, it impacts your energy, it's going to impact your cognitive abilities, simply because your mind is over here wrestling the frustration.\n00:31:24 - Lorenz Schuerch\nYeah, but the metric that we're measured by is our average fee.\n00:31:30 - Tina Marie (profitdriversinc.com)\nRight, I get that and so but here so so this is part of why I want to have the report so I can look at statistically if everybody is averaging roughly the same amount of state farm cases so then we would look at is there any possible way and I doubt it that somehow intake is you know one team gets more of that and one team doesn't it's not very likely that that's the case. So that means that if everybody's getting right roughly, and throughout the year, it probably is. The same amount of state farm cases, then it really is not a determining factor, right? Because you would all be dealing with the same problem. And so, if Samantha, so I'm looking, I asked Mark this and I did not get the question, but you guys get to see each other's numbers, right? You know what everybody's attorney fees are, roughly. so I'm going to look at this for this year. Let me update it. So, Lorenz, for the year of 2024, your average attorney fee is 11,000. We're not going to look at Mark or Nick, because obvious reasons. Pat, you're at 8.8k, Sam's at 17k, Tyler's at 11k. So, you and Tyler are tied Lorenz. If I look at that for last month for June, which is a very small pool and not really a good way to look at it, for last month your 8.4k, Sam was 12k, Tyler was 9.3k, Pat, your 7.6k. A month is, I mean, it's not a good sample size because of how long your cases take to work up and to settle. And let me look at record counts. So, wait, that was last month. wanted to do this for the year. So, cases closed by team for this year. Lorenz 125 for you. Pat, you're at 59. is a 120, so learns you close more cases. Again, how long they start is not necessarily a good thing. Just a second, please. have a child. Teenagers, and I work from home, so like, thanks, guys. Appreciate it. Okay, so, click cases close by team. Lorenz, 125, is for 2024, Pat, 59, 120, then, that number's 100% not correct, gross the, oh, that's by state, I'm fine. Resolution by team. My average attorney, we already did that. Dropouts and subouts. Lorenz, your percentage of subouts. Let's see, subouts as they fired you or is that dropped out?\n00:35:23 - Lorenz Schuerch\nWell, subout is when they hired different attorneys.\n00:35:28 - Tina Marie (profitdriversinc.com)\ndifference I guess. So, your percentage is rough. That can't be right. Hold on. Let me make sure this year. I'm not positive. Okay, okay. I need to change this report because I want to see it per all the cases that you have. But for the year, you only had five subouts. Samantha had 13. Pat had... three. Tyler had seven. Now, there's a lot of reasons that can happen. It can be your performance. It could be the insurance. It could be multiple things. And they're blaming us for it, not necessarily because of something you and your team have done. But there's a lot of things to look at in terms of your quality and performance and how you do the job. It isn't just attorney fees. That is what your incentive pay is. But all of these things impact sweet lot. Getting subbed out. And I can't so one on sub out. And one out. Percentage for cases. And policy limit for that case, potential loss, because I think that we should be measuring the loss for team two. And then this isn't about penalizing anyone. It's about making sure that we're evaluating everything. So, let's say that your attorney fees are lower, first of all, you're operating primarily in Arizona, and I don't know. All of you are, so Samantha waved into, I don't remember New Mexico, I think she's New Mexico. Who's doing Texas, do you remember? Tyler. Tyler. Tyler. So, you know, there's different things impacting your numbers, and all of that needs to be taken into account. So, at the end of the day, Really, the thing is we want to look at each of those numbers, just your attorney fees, but we want to look at the sub-out rate. We want to look at policy limits. We want to look at how often is your team showing up and doing well, how happy are they because that has an impact on the likelihood that we're going to have to replace somebody soon. We have to replace somebody because the pod leader, the attorney, is burning people out. It's very difficult to find good people to hire. We are constantly looking and we go through a lot just to find one new attorney. So, again, my approach is holistic. I'm looking at everything in Sweetlock top to bottom, never just the bottom line. I'm looking at each individual, I'm looking at them as a person. I'm looking at all the costs, all the impact. act, all the wins, all the losses, and and how it affects everything because ultimately each of these things makes an impact on how profitable it is, including how happy everybody is. So if you learn to measure all the things that matter, not just your attorney fees, but like I think you should be happy with the fact that your subout rate is so low, I think that that's important. I think that that means that you're probably doing something good. However, what I don't have and what I need and why I need to change this report is I don't have that in relationship to how many cases you had this year. So Samantha, if she, so her subout rate is more than double yours, but if her case rate is more than double yours, then she's roughly in the same boat, you know what I but. Yeah, so anyway, those are some of the things to look at, Pat, you're coming up and now you've got those goals, trying to, so I'm just going to tell you Lorenz, Pat's gone in for being the best attorney in the firm, so we've got some competition in here, but I think it's good, I think it's good. I think how we handle the competition, like Samantha, she's leading in attorney fees, but when Pat asks her questions, she answers them, and thoroughly, really supportive in answering that. And so ultimately, if all of our goal is, how do we make the sweet law be the best place to work, the best place to go for help? Well, you know, I think that's winning, right? job security is, if you show up and you're continually improving, maybe you're not improving an attorney fees for... or three months. But maybe what you did was improve your team processes. You improved. You made sweet lot better. And that's important. So we're going to have those conversations too. And also going to take that and report back to Mark, like the fact that you figured out through multiple iterations and different processes and effort and communicating with your team that your trajectory improved because you split the teams instead of having people sitting around, wasting their time on meetings that are irrelevant to them, doing bio reviews per your groups. That's important. Sweet lot was improved because of that effort. So maybe it doesn't have an immediate impact on the attorney fees, but it will over time, 100%. There's no way that's not going to. And if we get to continue working together, so here's the other thing.\n00:41:56 - Lorenz Schuerch\nQ1 here. Yeah, I guess I might. I am competitive, but I'm more competitive with myself, so always compared to myself to one career.\n00:42:06 - Tina Marie (profitdriversinc.com)\nThat's best way to be, honestly, because that's the only race you can run, but I like both of them. I think ultimately that's the only race you can control and that you're really actually in, but with Pat, know, wanting to get the highest numbers, like I get that too. The bottom line is whatever motivates us, that's what we need to tap into. That's what we need to be working with. So what everybody has different drivers, and as long as there's intrinsic motivation and drive, that's all we need. There are people that don't have it. They're only externally motivated to please other people, to get accolades, to earn money, but mostly so they can show up things, not because they want to improve themselves, not because they actually want to be the best at anything they just want to be. he perceived as the best. Pat wants to be good at what he does. You want to be good at what you do. And that's valuable. But I want to make sure that you did hear me. All of Sweet Law is slow and Q1.\n00:43:13 - Lorenz Schuerch\nDid you know that? No.\n00:43:18 - Tina Marie (profitdriversinc.com)\nEvery year, I've watched it. Every year, every year, have a little bit of a freakout period. Mark has a little bit of a freakout period. And then everything turns around and we're like, oh yeah, this is a pattern. But I will tell you that Mark didn't know it was a pattern because Mark didn't track his numbers. And when I would ask him for his numbers, he would say, well, I think it's this. And I think it's that. And I said, none of what you say adds up. So how about we go get that information? Yeah, but it's a pain in the . don't know how to get it.\n00:43:51 - Lorenz Schuerch\nAnd like, well, let's figure that out, Mark.\n00:43:55 - Tina Marie (profitdriversinc.com)\nAnd so we did. And so now we've got some data and the more that we dig into it. Um, so we'll go get some information and all of a sudden, you know, nothing's really happening and then Mark sends an email because he can't sleep a night because he was thinking about something and he had an epiphany and he dug into some numbers and he's like, I just realized this. And then we have a big change and there's a big improvement and so really digging into all of these different numbers makes a difference. But something that I really love about numbers is it kind of takes the emotions out of it and in a good way. Um, because you see what's real numbers don't lie. Numbers tell you the truth. So if you see some good numbers, what do you know? You know that that's, that's a real thing. That's a good thing. If you see a number you don't like, it's also a real thing, but that's an opportunity to improve. And iteration upon iteration changes happen and occur. So, that's what we're looking at. So one thing I'm really excited about though by talking to you guys as I'm realizing how we can improve our reporting which is going to be really useful for us and what we're doing with Mark which will somehow come back and improve things for you including potentially improve because I don't know that we have the best incentive program that there is I want to make sure that you guys are incentivized for all the good work that you do including if we're minimizing dropouts and subouts I think that that should be part of it. Especially if the reason that we're getting subbed out is lack of communication and so this was something that really isn't managed super well I think across any team. I think it's getting better but we would have some cases where nobody been communicated with for two and a half months which is not acceptable and until I I was asking questions and probing and digging into that. That was just like that and it was unknown. So there's always opportunity to improve. And just by having the conversations, we figure out ways to, because you guys have a lot of watch, you have a lot of things to manage, you have a lot of people, a lot of processes, a lot of conversations that will fry the average person's brain every day. So dropping the ball is kind of part of the job, it's going to happen. we're trying to do is create the systems that minimize ball dropping. know what I mean? That also maximize making sure that we're spending the most time on the most important things, the highest leveraged impact type thing. And that we're making air pre-person on the team as potent as possible so that everybody's winning. So, um, okay, we've got about 15 minutes left and then Lorenz, um, before I forget, let's just go ahead and get out next week's schedule because next week will be just you and me.\n00:47:21 - Lorenz Schuerch\nYeah, I thought we said next Wednesday, same time.\n00:47:25 - Tina Marie (profitdriversinc.com)\nDid we? Okay, uh, that will work. Let me just, I think I just didn't schedule it yet. Let me duplicate this. What is the calendar? No, that's not it. That will work. That will work. You don't have to deal with All right. Okay, so that's done. So Pat, Mr. Patrick, um, have you had any thoughts since our conversation last week?\n00:48:11 - Patrick Shahverdian (sweetlaw.com)\nThe main thing that stood out was like the male, female dynamic. Um, it was obviously two of my team members or females. Um, we kind of touched on like how the male dynamic can help them like a camera with what you said. But like, I remember you talked about the dynamic between male and female team. Um, I want to see how I can use that to maximize. Um, because the team is super respectful. Um, you know, we don't have any issues. Sometimes I feel like there might be issues with the female case manager and answering to a male attorney, I'm not sure why, but that was like the main thing that really stood out. So I wanted to see if you had any thoughts on like naturally what's the dynamic like.\n00:49:18 - Tina Marie (profitdriversinc.com)\nSo just even observing dynamics between people, there are going to be different things, the female female dynamic, especially if they're super strong, A type personalities in the workforce can be very either they're going to be very supportive of each other or tear each other apart. There's not a lot of middle ground generally speaking. So the first thing is just observing what kind of dynamics exist. Who do do two people interact with each other and seem to be more open when they interact with each other versus interacting with other people? Do you notice any tension? Do you notice more forthcoming, more holding back? type of thing. What I was saying about you is that you have a, so the way that you approach Cynthia, I think Lorenz is the same type of way, is that he wants to bring out the best in people. You want to support them. That doesn't exist everywhere with every person. Not every female comes to work and feels safe, either because of anybody that work or one. And men of the, you know, not necessarily safe, but it impacts, it'll show up in a woman a little bit differently in terms of how much she will lead and share what she knows is gonna help things. So one of the things that I do and have done for several CEOs is higher higher. and install a right hand person for them, more than an assistant, somebody who kind of like pushes back on them a little bit and says, did you think about this? Hey, I noticed you said you were going to do this, but you're not doing this. That type of thing, right? Now, that was what they were hired for. That was their exact role. That was what was wanted from the CEO, somebody to push back little bit and hold them accountable because there's nobody doing that in the business. And we all need somebody to hold us accountable. But without fail, even though that person was told clearly, please call out when you see issues, please call that out every single time as often as possible. And even when they did that and they never got pushed back, even when they were fully respected every time, it took years for them to feel safe enough to do the job well. Because generally speaking, That's not how the rest of the world operates. Most people don't want to be how accountable. Most people don't want to be called out even respectfully. There's ego involved, right? You both come off to me as someone who is not operating from a you're coming off a little harsh or something like that. But more importantly, the energy that comes from that is that you're safe to be around. You care about the people that work for you and work with you. Here's how I knew that from you, Pat. Without being prompted, you were talking about how you noticed Cynthia was not doing X, Y, don't remember all the details of it, but I remember you're like, I tried to give her space so that she could just do her thing and not, you know, control her basically. But you noticed that. that wasn't working. And so you knew that she needed more support, she needed guidance, she needed to be directed. And so you did that. But what you told me was I didn't want to hurt her feelings. I didn't want to, you know, cause her any problems or make her uncomfortable. So I just took my time and this is the approach that I took. So you showed that you were concerned with how she felt and that you took the time to modify the way that you showed up in order to create a safe space for her. I'm going to tell you, and Lorenz, I think that you would do the same kind of thing. I think that that's how you operate primarily is being concerned with giving people what they want. And you've given other signals like that, same thing with Cynthia, noticing that she's process oriented and everybody else is kind of free. so you gave her some tasks to allow her to create those processes. also when your team told you, look, we don't like wasting our time, like, okay, let's make a modification split this and I'll just go ahead and do two file reviews even though maybe it's more tedious for you, you were there to lead your people the way that they wanted to be led. What I'm trying to explain to you guys and what I really want you to hear, and this is not a platitude or patronizing or anything, that is not how most leaders operate. Most people are more bosses, they're not leaders. You both show up as leaders because you care about how the people that work for you feel you want them to be happy and successful and even if it's not altruistic, even if the only reason you're doing that was because then they'll perform better for you and you get better paid. Let's say that was all it was and I know that it's not. It still gets the same end result, they're still taking care of. So paying attention to how people respond to you. I'm noticing, for example, if Viri doesn't maybe answer questions if you ask her how things are going. want to drill into that with you next week a little bit more Lorenz and get the details so that maybe I can kind of figure out what's going on a little bit and we can find a way for that. But generally speaking, that's going to be that she's received signals from other bosses or leaders that have said, you know, if you tell me too much, it's going to annoy me and I'm going to give you some annoyed energy and you're going to feel that tension and that hostility and she has taken that and gone, you know what, I'm going show up, I'm going do my job, I'm going to go home and that's it. And I'm not going to rock the boat because I don't want to deal with feeling threatened with my job or anything like that. So, um, paying attention to these types of things, being aware of them, and also paying So guys, what I want you to understand is knowing how unique you are, that you have an opportunity to really improve, especially when you have females working on your team. Because you are safe, because you do care, you can probably get better performance out of them than they've ever had before. But if you want to know the impact that it makes, and maybe this doesn't motivate you, but I'll tell you this anyway, you can help them show up better in the rest of their lives completely by showing them that there are safe people in the world where they can make mistakes, they can say the wrong thing, and they can still be okay. You know what I mean? Because if you have people willing to make mistakes out loud, then the mistakes can be seen in the open, which means they can be corrected gently, but they can be corrected. Whereas if you have people who feel like they need to cover up their mistakes. Who need to lie about them or just not show you, you know, what's weak within them? You can't correct it. You can't improve it. Does does any of this make sense? Yeah, absolutely so I'll give you an example of where I learned and then we can kind of close it and I was inquire for like ever and and We would be learning new songs and they were difficult songs and my my Quaritage was always trying to get us to sing louder and So he could hear so he could pick out the part so he could see like he's I could hear there's an off note But I don't know where it's coming from because every time I walk by everybody's mumbling and they're not really right So I'm just like, you know what I'm sure you can imagine I was loud I Don't do quite or settle very well, but um, so I did that and it was frustrating because I would get corrected but I would get corrected quick and you know what happened after that, I nailed the part and then I'd be a section leader and everybody would start listening to me. So when I would join in any other choirs, church choirs, whatever adult activities and every other thing, I'll just be loud. I'll just make my mistakes out loud. I have opinions, I'm very secure in my opinions and loud about them when I say them and confident in them, knowing that if I'm wrong, somebody's going to correct me and I will not like that, by the way, do not like being corrected. But I prefer being corrected to being wrong perpetually. Do you know what I mean? So I'm okay with being confidently wrong so that somebody who knows better can observe it and go, yeah, no, that's not right, Tina. This is actually what you need to do. So I try to create that kind of space for people that work with me. as well and encourage them, just go do things. If you make a mistake, we're going to figure it out together. But if I don't have to tell you and train you on every little thing because you're not afraid to try it, you're not afraid to problem solve, you're not afraid to explore, you're not afraid to go look for other solutions and implement them knowing it could cost us money, it could cost us time. But knowing that the end result is we're going to get more knowledge and we're going to have a deeper understanding of how these things work and you got it for yourself and you made yourself more valuable to me. But I'm paying you the same amount of money. Go learn, go explore, go figure some things out. But then when they do that, they start getting more brave and they want to explore more things and they want to try more things and they bring more things to the table and then they stay with me for years and I get to keep benefiting from this all because I was like, go ahead and make mistakes. Like it's powerful. But, you have to make it very clear that it's a safe place to make mistakes. It's a safe place to tell what you really think, as long as it's done respectfully. And if it's done disrespectfully, then you just correct it respectfully. But we're looking at this long term, your people evolving. And the other thing that I'll tell you is that these skills and these things, they'll help you as parents, if you're a coach, they'll help you as a friend, any other place you show up as a leader. When you learn how to create a safe space for people, but also help them be their most powerful selves, everything that you do, everywhere that you serve, everywhere that you show up and have any kind of interactions, improves because you will be one of the few places in the world where somebody is safe to show up and have some room to make mistakes. So that they can explore and. and learn. And it's, I think it's pretty awesome. I mean, I love watching people grow. love knowing that I had a little bit of a part of it. And the two of you have both demonstrated that you have that kind of interest and awareness and ability. And Pat, you've got a strong like shoulder spore things just kind of roll off you. Lorenz, I think you get a little bit more anxious and stressed out about it, but you still take it into you rather than putting it on them. And so, and if we can teach you how to let stuff roll off you a little bit better, that would be good. But at the end of the day, you both offer very unique things to your teams where there's a lot of potential and growth. And I think that Sweet Law is going to be, I think Sweet Law is blessed for having both of you. But if we can keep working on these things together, I'm looking at some awesome stuff coming down the road.\n01:02:00 - Patrick Shahverdian (sweetlaw.com)\nand some good numbers and of course you know you want to get that extra money and you've got those goals so we'll get to them too through the people that you're working with and just through day-to-day ops so um Pat before we wrap up so we were talking about dynamics beyond female dynamic and you said that's what you were thinking about do you have more questions do you have more thoughts like did you want to dig into that a little bit more now um i had another can i give you like another thing i was thinking yeah um how to keep them motivated because obviously like their cap on you know financial like improvement is kind of limited because just the nature like we have our licenses and we're attorneys and like your salary or whatever can just you know it's kind of like sky's the limit whereas with you you know, non-licens staff here, it's kind of like, there's kind of a ceiling, um, and I'm sure they know that, but they, which is why I applaud and I appreciate all the work that they do, because I mean, Lorenz and I was like, they take a big blunt of the work that we don't want to do, you know, just even taking the calls every day, it's like, one day if Elsie's not here, and like, it kind of falls back on me, it's like, pay this woman what she needs to be paid to be happy and keep her here as long as possible, because like, you know, they really do a lot of the work that, you know, as an attorney at some point you want to negotiate and get the settlements, which is the fun part. So just like trying to keep them motivated and happy to be coming to work every day, because like I said, they do a lot of the work and, you know, I don't know how much they make, but in obviously Lorenz and I have like the room to really grow whereas other staff members is kind of like a range because for me it was in that position like I don't know if I would have lasted as long as, know, people have doing the work that they do.\n01:04:19 - Lorenz Schuerch\nSo what I've done with my team is I've made my growth commence written affairs so we have certain bonus ladders where if we bring in this much money that month I'll take money out of my paycheck to bonus the people that and then that way they feel just as invested in the success as I do.\n01:04:50 - Tina Marie (profitdriversinc.com)\nI love that. But I thought that that was that the incentive program, so I guess maybe I was just probably thinking about intake because I know intake. takes incentive is combined like there's no way to separate it because each of them can touch a case multiple times before it becomes a case and before it's turned over to you because I've been trying to figure out how do I create some separation so that we can really measure and reward according to effort because not everybody shows up the same and I think that it should be based off of effort and ability but I didn't realize that the pods were separate like that that the case managers and assistants don't get incentive pay is that correct like not unless you're too mean right so that's some questions that I have because I would like to see that be consistent across sweet law I think that that would be better for the company but we've not had this conversation would like to have that with Mark. So that was a good point, Pat.\n01:06:03 - Patrick Shahverdian (sweetlaw.com)\nwill bring that up.\n01:06:04 - Tina Marie (profitdriversinc.com)\nMy staff hasn't complained about, hey, this is just something internally that I was. No, yeah, yeah. That's good. I'm glad you brought that up and I'm glad you're thinking about that because I would think the same thing. know, if you're incentivized and they're not like, there's obviously ceiling to how much you can ask for them when they don't get more for it. I, for sure, I'm motivated by incentives and if I'm not getting more for working harder, guess what I'm not going to do.\n01:06:34 - Patrick Shahverdian (sweetlaw.com)\nLike, don't go put that up for somewhere else that comes back. the end of the day, was not going to want to get paid more, know, but there's just one of those things I was thinking about because, you know, on those hard days, when you, you know, on by clients all days, it's like, I'm going to come to work the next day and then, you know, what's my financial future like, you know, whereas for me and Lorenz, you know, we can suck it up and, you know, get yelled at by clients, but you have a really good month and it's like, You know, this is why why I put up, you know, yeah, so just you know I want to make sure that For the long term the team is happy and you know despite their They've been like in certain range. They can have other things to look forward to and be happy about Well, that's like a couple hundred dollars incentive every month.\n01:07:21 - Tina Marie (profitdriversinc.com)\nI don't know it's not very much that takes to Yeah People yeah, yeah, yeah, okay, so that's good was there anything else?\n01:07:31 - Patrick Shahverdian (sweetlaw.com)\nI know I didn't answer that I've been to look into that I don't think so I think the The three of us on the calls would be helpful because I can get some more detail on how Lorenz you know organizers team and everything because I'm just free styling I see some stuff that Sam does Tyler does from Lorenz But obviously these are more in-depth calls so No, I'm excited.\n01:08:02 - Tina Marie (profitdriversinc.com)\nGood. I'm glad and I'm really glad that you said that because I wasn't sure how I want to structure this. I thought that one on one a month and then to all of us meetings a month would be best. So I think that that would be good. Still that way we can talk about your team specifically on an individual basis. So that's what the one on one call would be to really dive into the nuances of your specific people. And then twice a month, you could really just do some back and forth best practices digging into Sweet Long General.\n01:08:36 - Lorenz Schuerch\nSo how do you feel about that Lorenz? Does that work for you? That's great. I'm always, I always want to grow. I always want to do better. So I'm happy to just follow your lead and hopefully settle off. A lot more cases and have happy teams.\n01:08:59 - Tina Marie (profitdriversinc.com)\nWow. I think, I mean, just the thing that you did with the file review, I'm really looking forward to seeing how that goes. Pat, your team is going to be growing eventually. mean, you're definitely gun, and I'm watching your line grow. So it's good. I think you guys are awesome. I'm so excited to be doing this. Thank you for spending some time with me and letting me come in and do this work with you guys. So Lorenz, I will meet with you next week. And then Pat and Lorenz will will reconvene, not next Wednesday, but the Monday after that at 3 p.m. Sounds good.\n01:09:37 - Patrick Shahverdian (sweetlaw.com)\nYou send emails, right?\n01:09:38 - Tina Marie (profitdriversinc.com)\nEvery time like we're about to have a meeting? Yeah, you should get a notification through Google. And I have it set by default to send multiple reminders. But I don't know that the multiple reminders go to you. So, starting a day or yesterday. So what I'll tell you. though is so in the beginning we didn't have a set time but we're going to so what you can do is once I set that recurring Monday meeting call which I'll do by next week at the latest because we're doing Wednesday next week what you can do is go into your calendar and set up your own reminders to be whatever frequency level you want but I have mine going one day before just to kind of remind me it's a thing I do with all of my meetings and then four hours before and 15 minutes before just so that I remember because I've got a lot going on so I need other reminders but if you need anything else if you want other kinds of reminders let me know I probably will start getting to some point where there's some follow-up questions that I'll ask through email just to make sure that we're on track but right now there's a lot of just downloading everything from you guys so we're not getting to that point yet uh yeah so any other questions did you fix your pool my daughter is working on it right now because i just work hard yang are you in california no i'm in northern southern cal southern organ i want to say northern california southern organ southern yeah look now why is it more again oh we're at beaverton oh that's much nicer i live in the hictown and i cannot wait to move i'll be moving though every single night because i like oh we're at um probably the scott still area it's either that or vegas but yeah stop still it's very nice yes i like it very much all right you guys well i hope you have an amazing fourth of july i hope you have a great weekend and i look for\n","contentPreview":"00:00:13 - Lorenz Schuerch\nGood to see both of you guys.\n00:00:24 - Tina Marie (profitdriversinc.com)\nHow are you guys doing?\n00:00:27 - Patrick Shahverdian (sweetlaw.com)\nHow are you?\n00:00:29 - Tina...","processedAt":"2025-05-04T03:40:52.577Z"}