{"fileName":"Done Transcript for Fuji_Tina Coaching(10).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Fuji_Tina Coaching(10).txt","type":"transcript","priority":"medium","content":"00:00:00 - Michael F\nHi.\n00:00:01 - Tina Marie (profitdriversinc.com)\nHey, how are you, Fuji?\n00:00:03 - Michael F\nGood. Well, I'm so sorry I missed Monday.\n00:00:06 - Tina Marie (profitdriversinc.com)\nIt's okay. It happened like that stuff happened, Mom. It's a second. Sorry. this is why I didn't want you in here in the first place, you know? Yeah, it could be anything though.\n00:00:32 - Michael F\nlike to bark at the deer all the time.\n00:00:35 - Tina Marie (profitdriversinc.com)\nThey tag with the deer, which is hilarious. They'll chase each other up and down the fence. All right, so let's start with reports, just first your kind of verbal report of how things have gone for you this week.\n00:01:00 - Michael F\nI started working again so like yesterday and today I did full days of work well totally full but so I usually help with the baby until like one or something like that and then Esther takes over the rest of the evening and then I go actually we have an extra room so I go sleep in our office and then I get up whatever 745 whatever it is and then 730 and then go to work so yeah I'm thankful for the uninterrupted sleep so it's nice that Esther but yeah it's tough on Esther like she was super tired yesterday and super tired today just because I'm not helping her so it takes her like an extra you know 15 minutes to feed instead of gain sleep yeah just baby things baby things that's gonna be it so you have some assignments\n00:02:00 - Tina Marie (profitdriversinc.com)\nto them?\n00:02:01 - Michael F\nYeah, they lose it and then make a better, think, better chart for the sleeve, I think.\n00:02:13 - Tina Marie (profitdriversinc.com)\nYeah, we also talked about finishing the business spreadsheet that the time tracker, we talked about tracking time, but we're not going to start that yet, right? Because I think we said we start, I think I asked you to decide when you wanted to start because we're not really, things will normal out more once you get in September when you get your housekeeper, I guess, but she's kind of the assistant also.\n00:02:46 - Michael F\nYeah, I think that's a little more reasonable.\n00:02:50 - Tina Marie (profitdriversinc.com)\nOkay, going to wait until then. And how does you do on, I see the stuff that you have in the timesheet homework, but not nothing in step two, just the step one. And talk about that in a minute. talk about that in a We talked about you getting some information from the, or maybe this was the week before now, because sometimes things run together, but from the neighbors about the cleaner. Oh, yeah.\n00:03:44 - Michael F\nYeah, we interviewed her. Doesn't really like the cooking, because we were thinking we could use her as a cook to meal prep for us, but the neighbor was like, she doesn't. She can cook in a pinch, but wouldn't have her as that final. She's very meticulous, like she's kind of like loves keeping things clean, so that's nice. So hopefully her and Esther will see eye to eye. And then, yeah, overall, I think the neighbor just says she's just very good with the kids. The kids love her. And, you know, she's not a teaching nanny where the kids are going to come out being like, you know, readers or stuff, she's more of just a companion. She's always talking to them in Spanish. She's just talking, talking to them. And she says both of the kids are like super, and they're both introverted. And she's like, yeah, both of my kids are just like, love talking. They talk in Spanish. And she thinks a big part of that was the, Dolores, the housekeeper, because she's just talking to them, not on her phone or anything like that. So, yeah, we feel pretty good about Something happens in employment.\n00:05:00 - Tina Marie (profitdriversinc.com)\nSo it just helps you simplify the steps to hire her formally as an employee and so we talked a little bit about the structure of how you would hire her like whether or not you would make that a separate LLC with Esther or like an escort for paying wages. Did you give that any more thought for structure?\n00:05:26 - Michael F\nNo.\n00:05:28 - Tina Marie (profitdriversinc.com)\nIs that anything that you still want to think about?\n00:05:30 - Michael F\nYou've got some time so. Yeah, you know I'll actually that would just the easiest things I just asked my accountant. I'm like hey can we should we can we hire this person okay and then I think that'll take some yeah I'll just shoot a quick email to my accountant that'll take care of that issue. He says yes then we'll hire her under one of the companies. He says it doesn't really matter then I'll just do this pop-ins payroll thing and and set up. I don't think I'm for that. You asked them by any chance that they use nanny cams. No, I didn't. Sorry, I was going to do that now, but didn't.\n00:06:13 - Tina Marie (profitdriversinc.com)\nDo you want a reminder to think about that or not big deal?\n00:06:22 - Michael F\nI think let me talk that over with Esther. think that's a good thing. Yeah, maybe a reminder to talk that with Esther. She's been, yeah, because she hasn't had my help at night. She's been a little more sleepy and jumpy. So I haven't really talked to her the last few days about anything serious, more just kind of what do you need? What food do you need by your bed? can I help you with? But I think hopefully tonight I'll be able to help out obviously tomorrow. So I think she'll feel better after she gets. I have no idea how she slept last night. She hasn't texted me all day, so she might be just dead today again.\n00:07:08 - Tina Marie (profitdriversinc.com)\nMaybe they all got some naps together.\n00:07:10 - Michael F\nYeah, we bought a new bassinet because she was just dying. She wouldn't sleep in our other bassinet, so we're trying to win that like rocks.\n00:07:20 - Tina Marie (profitdriversinc.com)\nOh baby swings are lifesavers.\n00:07:22 - Michael F\nYeah, yeah.\n00:07:24 - Tina Marie (profitdriversinc.com)\nI would literally just pick the baby swing up. My muscles were good. I'd just drag it around the house if I was doing kitchen work working, whatever, because yeah, it'd be when they get bigger bouncers, but yeah.\n00:07:37 - Michael F\nThere we have one.\n00:07:40 - Tina Marie (profitdriversinc.com)\nYeah, but swings when they're little, especially the ones that have the mobile and the music at the same time, and they go side to side instead of front and back so that the baby doesn't experience like that falling sensation, and it's just more.\n00:07:55 - Michael F\nYeah. Yeah, we have that one that goes like this.\n00:07:58 - Tina Marie (profitdriversinc.com)\nUh huh. Yes. Okay, so what day, like is she starting the first week of September?\n00:08:11 - Michael F\nThe contract I think we're going to do is just straight up September, I actually don't even know what day that is, Sunday, okay, so it's probably September 2nd, yeah, so we'll start her on September 2nd.\n00:08:23 - Tina Marie (profitdriversinc.com)\nSo Esther's got a few weeks, do you guys have some like days to figure it out basically where you have slow days where you can just kind of let her catch up on sleep or something?\n00:08:36 - Michael F\nWe're gonna, oh, oh, yeah, you mean like the trial run, oh yeah, no I didn't ask Esther about that, that would be kind of neat, yeah, just like going like a sadder.\n00:08:49 - Tina Marie (profitdriversinc.com)\nWell, because Dolores works Monday through Friday with the other family, but I was asking about you like on your slow days just being able to give her a relief on a day a week or something where she could just.\n00:09:00 - Michael F\ncatch up. Oh yeah, that's interesting. I have an like on like Monday, I could help her Sunday evening Monday. Yeah. I think about while you're back to work, there's components of it.\n00:09:22 - Tina Marie (profitdriversinc.com)\nOne is just the actual being able to do it, but two, there is the remember how it felt as soon as you knew you had somebody coming in. There was an instant relief. So if Esther knows that there's a day that she gets to look forward to know if I could just get through this day, Michael's going to be here and I can rest and or food. She just calls me food time. so she just kind of has like, I don't have to get through to September. I just have to get through to this day. And then I can sleep all day long if that's what it takes. just kind of rest and know because I mean, it sometimes, especially when When they're that young, it can feel just so daunting that your body is never going to get a chance to recover because you don't know when you're going to get to sleep at all.\n00:10:11 - Michael F\nSleep deprivation is really hard on mental health too. Yeah, I think she's catching up to her now, but yeah, that's a good idea I could offer that. She gets up every two and a half, three hours to pump, which is just killer for her sleeping. And so, yeah, on the nights that I'm around, she just focuses on pumping and then I do the bottle feed, diaper, and then rock the baby back to sleep. So yeah, I mean, I think maybe, yeah, I can ask her if there's anything more that I can do to give her a more prolonged time off, but I know the pumping is really difficult right now because she's, well, she's breastfeeding in the day, and then she says at night, breasts hurt, so she has to pump every three hours. ours to clear it. Yeah, let me ask, let me ask if there's anything I could do to just give her something to look forward to or or something.\n00:11:08 - Tina Marie (profitdriversinc.com)\nJust until you get Dolores and in it, you know, it's not necessarily sleep doesn't have to be about nighttime, but just whenever you can get couple extra chunks like yeah, it was interesting. I was reading a study this week about how napping every well, so being a napper, being quantified as being somebody who naps at least three or more times a week, reduces death by heart disease or any kind of help heart failure by like 67% in women and like 84% in men. And that there is no medication, not necessarily being well, a pill, but any other prescription of any type that has such an impact. no pill that you can give anyone with any kind of heart issues that would have as much of an impact. so you can make all the correlation and inferences to what that does. And also, especially with people like you that have circadian issues, napping is really the only type of solution. And we know that it's been around long time because it used to be there was first sleep and second sleep, because there are people who have always been there who couldn't sleep all the way through the night. And so they got a bit little and I did things and went back to sleep. So sometimes trying to solve for nature doesn't really work out well other than doing the thing that we don't want to do in the middle of day, which is not, but it can be a minimum of it can be effective even at 20 minutes. So anything about for both of you, her and her current situation and you just overall Me being able to create nap pods where you work in your offices. Yeah, that's what my fiance does He has in his companies because he cannot sleep I call him a vampire because he's pretty much never slaves and He's got these little like egg-shaped cocoon areas that are nap pods that he can use but also his employees can use too because there are people who just can't sleep and so there's Sounds there's weighted blankets All kinds of things to kind of descend someone to just sleep much faster and come out more rested so that's kind of cool.\n00:13:37 - Michael F\nYeah, I I don't think I've ever gotten into a routine of taking a nap I'm just terrible at the willpower to get up But I guess if I had to have enough if I had an appointment that was coming up, I'd have to force myself up Yeah, that's I\n00:14:00 - Tina Marie (profitdriversinc.com)\nto the world. I'm comatized. So I only nap when the only way that I'm getting through the day with any kind of productivity is I have to nap. I'm physically and cognitively would I would just be a zombie who did nothing and I existed for the rest of the day. And that's unacceptable to me so I'd rather nap and even if I had to take a two hour nap and it screws up my sleep schedule and I'm up till 11 I've got things to do. So everything in life is about trade-offs. That's a trade-off I'll make. But what happens is when I'm really exhausted, it is so hard to wake up.\n00:14:34 - Michael F\nSo there's a few things that I do.\n00:14:36 - Tina Marie (profitdriversinc.com)\nI'll have something to drink next to me, sugar. Well, like a vitamin water, not a lot. Sugar, caffeine, something like that can do it.\n00:14:44 - Michael F\nJust having to get up to take care of my child automatically kicks adrenaline in.\n00:14:51 - Tina Marie (profitdriversinc.com)\nIt's chemical of one sort, even if it's my own chemicals. I can't be late to pick up my daughter. And that goes back to the whole kind of thing about energy sounds. is just purposely manipulating your energy to do what you want to the other thing that I'll do is I will set my alarm and give myself like a 40 minute wake up window when I read anything I could read a book I could read Facebook especially if I read news it just pisses me off so then I get mad but then again the adrenaline kicks in and it's not about engaging with it I don't actually have to care as soon as I read I'm like let's go I got stuff to do but learning what things like if you ever happen to notice is there a thing that wakes you up like I noticed one day that I was really really exhausted and there were two types of things that immediately triggered that my blood got pumping and I was ready to go with no other kind of help other than what I was reading and stimulating it was um something that made me really happy so a message from a friend a sister my sweetheart whatever That's just me and we go, oh, that's awesome, let's go, today's great. Or that is ridiculous, this world is crazy, I get ugh, whatever, and I'm up. It sounds like a stress response, but really I kind of feed off of opposition, so it's not, it's my motivator. But if you figure out what those triggers are for you, or build in a slow wake up, so let's say you take an app and you know that you're really groggy, and there was a podcast you wanted to listen to. If you are able to, now the podcast is going to put you back asleep, you can't do that. Or read it or whatever, but something that starts stimulating your brain so that the wake up process happens, and then just allowing for the time, but when you look at 40, 50, whatever, right, versus losing even two. hours, even if it's for a 20 minute nap and let's say front loading and back loading the slow down the wake up takes you two hours. But if you get to 80 capacity for the rest of the day, that's up to me.\n00:17:14 - Michael F\nI like that. Yeah, I think there's natural things like right now, I'm actually sitting outside of my daughter's preschool because I'm going to get her at 315. So like on days and I think I told you in jujitsu, right, we actually three months ago, we carved out my schedule so that on Monday and Wednesdays I finished at two and then I drive to her school. I get here by three and then actually I could just sit in this lot right here and nap for 15, 20 minutes, you know, and then that could be my nap on these days, Monday, Wednesdays at least. And then for Thursday, Friday, yeah, I don't know about that wake up window. could probably think of something but even when I'm tired, there's like nothing in the world. world that is interesting to me.\n00:18:01 - Tina Marie (profitdriversinc.com)\nBut I think if I have like a deadline, like a meeting at one o'clock or, you know, 130, then that's easy.\n00:18:07 - Michael F\nI just say, okay, well, I could sleep until 110 and then I have a meeting at 150. So yeah, that's interesting. It was three naps a week, three or four.\n00:18:18 - Tina Marie (profitdriversinc.com)\nit was what qualified as a napper was at least three naps consistently.\n00:18:24 - Michael F\nOkay, so during, yeah, that makes sense during the work week, try to get days when you're just zocked out.\n00:18:30 - Tina Marie (profitdriversinc.com)\nYeah, that's yeah. And you seem to always have them a couple days where sleep really, really sucked. Right? So if you use them and if you can look kind of for what the pattern is and recognize, oh, this is one of those like minimal capacity days, but maximum, like I got a lot to do. You're like, okay, throw an app in here and do a little journaling and figure out, you know, how does that equation... eight and work out how much more productive are you what does it do to the rest of your nap and what I would do is on days where you take a nap also do something make sure that there's some sunshine because it helps with melatonin production at night and then any kind of movement you can get that day so if it's and it might be harder you might be able to you might have to switch days and figure out what that rhythm is because like for me if I exercise it takes me hours to wind down and be able to go to sleep depending on when it happens and you might not be able to work out or even do jujitsu when you're really sleepy are you ever too tired for jujitsu?\n00:19:47 - Michael F\nno that's like if there's a day I'm not working at noon I'm just like if I'm exhausted I'll still go I'm always like that like I could work out I mean I used to always work out when I was just exhausted\n00:20:00 - Tina Marie (profitdriversinc.com)\nbecause once I did, then I would wake me up or... Right.\n00:20:04 - Michael F\nBut...\n00:20:05 - Tina Marie (profitdriversinc.com)\nOkay. Yeah. Anyway, all right. So those are some things to think about.\n00:20:09 - Michael F\nSo... like the idea of napkin. Sometime ago, I did take a sleep class in med school, and I remember there was stuff about napkin, and you know, it is beneficial to you, and I remember even a seven-minute nap was better than 60 milligrams of caffeine in cognitive tests of recall. I don't know what that study was, like, you might find that one interesting, yeah, I was like, a seven-minute nap is equivalent or better to 60 milligrams of caffeine on cognitive recall tests, like how many things you remember, but yeah, but no, yeah, I like that idea. I'm just trying to make that little change and nap something enjoyable, it's not like something that I have to force myself to do. And I think if I could just carve out a little bit of time to nap, I think that would be really cool.\n00:21:00 - Tina Marie (profitdriversinc.com)\nI'll try to shoot for too 20 minutes to start and then figure out, you know, what are the things that maybe help you get there? So for me, pressure sound because my brain is too stimulated by certain types of things. But it's not human voices and outside activity. So like, if I was in a car, I could totally sleep because people don't bother me but it's sudden loud noises that will disrupt me or it's consistent conversation because my brain wants to tune into it, even if I really don't want it to. So things to keep, maybe in the car or with you all the time, earplugs and or headphones or earbuds, know, something where you can play some and figure out what frequencies work best for you, white noise, brown noise, peak noise, prone to pink and brown, especially brown noise, a mask, which may be too much of a signal in a parking lot, if the parking lot is safe. Yeah, think about those things you do. You don't want to already know you're not being so much, but if you have a cap pulled down low, you still get the pressure on your head, it still blocks the sun out of your eyes. It has the same kind of effect, but it doesn't really send a visual signal to everybody walking by necessarily that you're napping, especially if you're like holding your phone or whatever, like you could just be listening to something. Potentially they have little weighted, instead of weighted blankets, they have weighted, it's like a lap pad. Weighted things can help people get that faster. anyway, if you're really going to be on a mission of sleep hacking and trying to get the most rejuvenation, cognitive and physical performance out of the least, then find the things that get you there faster, that get you to REM sleep or deep sleep faster and as frequently as needed in order to be able to function at the way that you want to through life.\n00:22:57 - Michael F\nYeah, I like that.\n00:22:58 - Tina Marie (profitdriversinc.com)\nYeah, we have I have the\n00:23:00 - Michael F\nI have like the headphones. I have three different eye masks that I alternate with. I've never tried a weighted blanket, but I'm interested in that. I'm always hot. I always thought I'd run hot. So that's why I love the car has like cool air conditioning all the time, so I'm always cool in here.\n00:23:20 - Tina Marie (profitdriversinc.com)\nDo you always keep a sheet on you though? Like do you always want to have some sort of, okay, so that's mostly like PTSD and trauma people. So that might not be something, which is why it's really good for people, a lot of people because so many people have been through trauma. So that might not even be anything that's beneficial to you.\n00:23:41 - Michael F\nIt might be more fun.\n00:23:42 - Tina Marie (profitdriversinc.com)\nI I'm in my birthday suit, like just splaining out. Free and safe, free and safe. So napping then you have to just get, so maybe taking off your shoes and being barefoot.\n00:23:56 - Michael F\nI hope you get a nap better.\n00:23:59 - Tina Marie (profitdriversinc.com)\nI'm just like if you're in a scrubs nothing constructing so that just all of those things and if you know like today I'm going to take a nap just making sure that that's the case maybe you've got some loose scrubs for nap days I don't know just all of the things and and you'll I think you'll notice over time that you figured out because you're being intentional and strategic about it it won't always work out that you can get it but you'll be able to operate at a higher level more often than not and catch up on sleep more often than not like I have gotten to the point where I don't even have to actually sleep I just have to lay down and close my eyes 20 minutes half an hour and I'm powering through the rest of the day like I actually slept and it's shocking me but I also did discover some really good things um dl phenolanaly it's an amino acid and it's pretty much replaced capping for me it's amazing and uh I did with depression and anxiety, that's gone. And, uh, gospel title sharing helps me with my ADD. Um, during the day helps me stay focused, helps me like, I was really experienced, especially in Perry, menopause, this type of the tongue thing. could not, I've got all the words except for one. And I can't, like, I feel the word, I know what it represents, but I could not say the one word. And so I haven't been dealing with that, but being a phospholipid, it, um, coats the cells so that they can communicate better. And, uh, you know, all of these little things. And then, um, the anything that helps with the neurotransmitters, because I do have those types of issues. They all help with sleep. Uh, things to think about and find out like what your issues are as we go through this. Okay. Um, to the spreadsheet now, you're not really where we can look at it on a good screen. And it's probably been a while. So I'm just going to go ahead and recap what you wrote. Hold on, me go back to my notes real quick.\n00:26:10 - Michael F\nI'll be easier for you to analyze. This is our second week trying it. Is it easier in the spreadsheet format like this?\n00:26:20 - Tina Marie (profitdriversinc.com)\nSo when this becomes really actually the most effective is when you've done time tracking and we have more details on the things and I can see basically the inventory of your hours, where your time is going, how much of your time is going, and then so if you tell me that your most profitable activities face-to-face visits now, you could quantify that because you've got meanings tracked. So we could do some math on that and we could figure out what that is. But then there would be other conversations and we are about to start getting into spending most of our time on this business stuff. It was more important to me to figure out you getting the house cleaner, the assistant, having some of that, you know, this is groundwork. But, but come September, almost all of our calls, I'm going to want you to be in front of your computer, we're going to be going over data. of the time, anytime something comes up, you know, like we just can't do that, then what we will do is redirect the conversation to catching up more in detail long sleeve, probably little bit more philosophical, just different thoughts, those types of things, like we started in the beginning. so, as a natural kind of consequence of just life, and some of those coming up, this is how we kind of circle back, have the technical, analytical, and come back to the kind of philosophical, it's not really that, it's still practical and analytical, but it's just more about how we're thinking about things. So, you, let me go ahead and let's see.\n00:27:56 - Michael F\nI'm excited for the business data and the numbers because As, yeah, I I think I told you that's what burned to me in my first business, know, between 20, 17, essentially. six years of my fricking life, I wasted because I never looked at numbers. And I'm really so I'm really excited to have someone to, and even now I'm not really looking at my numbers.\n00:28:17 - Tina Marie (profitdriversinc.com)\nSo I'm really excited to have someone to, you know, force me to look at the numbers with me. We can start. That doesn't have to wait till September. I'm glad that you're excited. So let me look at next week. Because you're just getting back to week, but that doesn't mean that still have my bookkeepers are still sending me monthly, you know, monthly balance sheets.\n00:28:45 - Michael F\nI have no idea how to read a balance sheet, but I'm pretty good at P&L now. But, you know, those are stuff that I can always look at. And yeah, my bank statements, of course. And yeah.\n00:28:59 - Tina Marie (profitdriversinc.com)\nOkay. know what's helpful for you or what what we can do to optimize things, what you need, but um, I usually don't go deeper than P and L's and depending on how segmented some of the accountant get with that stuff, sometimes my eyes glaze over and I'm like, I want to get that deep, but yeah, I have a detail of P and L that my bookkeepers do and a condensed P and L that I've created with them in a PDF document. So we could show you both and that would be great. Um, and then just kind of going over them in detail. So the things that we're looking for first is, is anything bloated? anything bleeding? if I ask you about something and you're like, I don't really know about any of it, then I want to dig deeper into that. Are you just wasting money? Because everybody, not everybody, but so far, everybody I've worked with has had that happening at some point where it was an expense that got started and is no longer really as valuable or or efficient or something like that. we'll look at that. But then what we're looking for too is, so, because this is driving me nuts, got something in my eye and I just won't. I wanna get it out, but busy. so like looking at most profitable activities, you have Q and E face to face visits. So what do you do that generates those visits?\n00:30:27 - Michael F\nHow do you get more of those? Yeah, that's a good question. It's a lottery system. Well, just take a step back. I have 10 offices in Northern California, and I roughly visit each of those once a month. And I step clients, I try to stack as many clients into those days, so I just have to go once. So to get a person, it's a lottery system based on how close that office is to an injured person that's claiming a work injury. So that's why I go to. like random cities that are highly populous and more blue collared so that because that's where injured people are. So in terms of like how I get more lottery hits, I have like a list of the most popular zip codes in California and I do look at that every about every year and I can kind of move locations within zip codes to find where the injured people are living in zip codes so we've tried to optimize that for the most part in our current we can only have 10 locations that's why I'm not doing like 20 but we try to optimize as best we can and that's how we've come up with our current 10 locations but I think there's more that we could do like if we kept switching them out but yeah part about switching them out is it takes about it's about it takes three months to close one location and then as soon as that's closed it takes about three to three to four months to ramp up on the next, so you're looking at like a cycle of six months to replace every one of my 10 locations. Yeah, so that's why like as long as we're maintaining at least three or four hits of the lottery every month, we're okay with that's that's what we've been doing. There's there has been locations that have gotten me less than two lottery picks a month. Those are the ones like in San Francisco, no one picked me ever in the lottery. So I cut that and I switched it to Merced, California. So that's that's the most recent switch we made.\n00:32:36 - Tina Marie (profitdriversinc.com)\nSo one thing, do you have a report of like a spreadsheet or anything tracked where you have how many lottery hits that you get each month for each location?\n00:32:48 - Michael F\nI do, yes.\n00:32:50 - Tina Marie (profitdriversinc.com)\nEsther's manager has that.\n00:32:52 - Michael F\nIs that something that could be shared with me so that I could Absolutely. Yeah, I would love to see that I haven't looked at it in a box since I changed locations.\n00:33:00 - Tina Marie (profitdriversinc.com)\nSo yeah, what was that?\n00:33:02 - Michael F\nAbout three months ago.\n00:33:04 - Tina Marie (profitdriversinc.com)\nOkay. I don't even know if I have any.\n00:33:07 - Michael F\nYeah. Yeah. Let me, let me collect that. That's easy to collect. I'll just ask for a minute. Okay.\n00:33:13 - Tina Marie (profitdriversinc.com)\nI'm going to put that on my list.\n00:33:25 - Michael F\nThere's also little like, you know, games that are played because the more doctors that do what I do in a particular zip code, that have an office in that same zip code is me, the less lottery hits I get, right?\n00:33:36 - Tina Marie (profitdriversinc.com)\nSo it's not just a population of how many people live in San Jose.\n00:33:41 - Michael F\nIt's how many doctors just like me are in that zip code and that dilutes my lottery pick. So that's why I went to Merced to try to see if there's more fertile ground where there's less people willing to go out there. But it is two hours away.\n00:33:55 - Tina Marie (profitdriversinc.com)\nIt's two and a half hours away. So do you get a monthly report of? injuries in the location and that doctors existing in the location?\n00:34:04 - Michael F\nNo, it's a report that I asked California for. California keeps how many lottery, lottery generated in each zip code. And then they keep track of how many doctors are in each code. So I can see how many injured workers there are, lottery hits, and I can see how many doctors per zip code. So I can request that report from the state.\n00:34:27 - Tina Marie (profitdriversinc.com)\nI haven't done that. I can that monthly.\n00:34:30 - Michael F\nI could.\n00:34:31 - Tina Marie (profitdriversinc.com)\nI haven't. I haven't in like six months since I chose. If when we get to an assistant or somebody figure out if there's anybody that exists that you delegate this to, but deputize somebody to do that every month and to get it to you, you shouldn't be doing it, but you should be looking at it.\n00:34:50 - Michael F\nSo is there already somebody that exists who would have the ability to accomplish that for you and who counted on it? Our manager should, you know, she's I'm a risk master's manager should probably be the one to do this because, um, yeah, that's her. That's wonderful job just to make sure we stay in business and the job, right?\n00:35:12 - Tina Marie (profitdriversinc.com)\nSo, so let's, let's make sure that that gets done and you're looking at that every month because then you can, um, do projections more accurately and rather than be proactive, like watch, there's an adjustment, but also sometimes, um, this probably because you have so many locations, you're probably a really good sense of what's actually happening with it. The doctor population is something you wouldn't be aware of unless you're looking at it. And so let's say the doctor population is decreasing steadily and you don't know. And you're wondering, so, so there's a couple of things that I think that could happen that you may not necessarily know that that walk watching it every month could tell you. of all, if doctors are leaving, why are they leaving? Do they know something? You don't know. Has there been some legislation change that's creating issues in the business that hasn't caught up with you yet that maybe you don't want to be in that location, whatever, I don't know, the state versus local government, probably not too much of a big deal for regulations. but also, let's say, because it's a lottery, you're not getting any hints for little long, you're like, I got to pull out and go somewhere else. But simultaneously, doctors are leaving, retiring, moving, whatever. You don't know why they're moving. You just know that they're not there. Maybe instead of pulling out, you want to ride that wave out a little bit longer because the population's going. So, and you know, if you're going to be doing this for a long time, let's say, five, 10, 15, 20 years, whatever, maybe not that long. But the longer that you're going to do it, the more data you have, two things. If you're going to sell it, all the data that you have makes it more sellable, or if you ever wanted to get investors, probably not. But I'm just saying data that's There's so many different reasons why you want to have as much as possible. And as far as KPIs, that performance indicator or, I can't think of the other word that I want, it's not KPIs, whatever, but those those those indicator numbers of what could have an impact on the business, doctor population being one of them, injuries and injuries will have a correlation to industry. So let's say the industry is expanding or shrinking, if it's expanding, more injuries are going to be And that's another thing too, if you if you watch that. So we just want to have more information, track it, track it regularly, bottom line.\n00:37:38 - Michael F\nI like the idea, it's something that I know I should look at and I know, actually I remember why I haven't put my manager in is because in this industry, not a lot of people know you can get that data. It's called the Public Relations Act, actually you could get it, anyone can get it, you have to make a public relations data act from California and a lot of the my competitors don't know about. this. So they just kind of blindly pick locations. But I've known about this for a while. That's why I haven't given my manager this data. Only me and Esther know about it as much as we trust our manager.\n00:38:14 - Tina Marie (profitdriversinc.com)\nThis is a very small You find an NDA because even though they're really only worth as much as you're willing to go to war with, most people are more afraid of them because they don't know that.\n00:38:24 - Michael F\nOkay, that's a good idea. Just like be like, hey, this is part of your- yeah, give her the NDA to sign and then be like, okay, I have this confidence. So remember, Swiss, when you learn, help people make the right decisions.\n00:38:35 - Tina Marie (profitdriversinc.com)\nOr relation is, here's your NDA. Go do this. Oh, I better not tell anybody. Yeah, yeah, that's a good idea. I don't think we've ever had our sign in NDA. mean, you should anyway because you're a doctor. I think just anything about your business. You have a specific unique business. They're as you involved. Again, they're only as good as you're willing to fight for and go to war over, but most people don't know that.\n00:39:10 - Michael F\nYeah, make it easy to be tempted to share the data freely. Go on webinar and speak about, yeah, Dr.\n00:39:19 - Tina Marie (profitdriversinc.com)\nFood, your request to this report tells you all the data. Yep. And sometimes you can help people understand too, because sometimes people are just like, well, I'm just telling Billy Bob over here. Billy Bob doesn't know anything. Billy Bob doesn't do anything like that. You don't know who Billy Bob knows and who he talks to. He might have a friend that's in a similar business and they just have to be chatting. Oh, yeah, I heard about this thing that this guy did. And now your competitor knows it. So people are more connected than we think. They have more conversations than we think. So just say like, the safest thing is, you just don't discuss this outside of this office, period, end of story. And you could say it in the Fuji way, not the Tina with the I'll cut you eyeballs. I'm not finding a violin or anything. I'm calm. It's the sweeper in me playing soccer that is like you will not pass that has never died.\n00:40:11 - Michael F\nSo funny.\n00:40:18 - Tina Marie (profitdriversinc.com)\nokay, so sales calls to law firms for July medical. So what is an interesting one? Yeah, what generates the sales calls? What is the rhythm to that? What are like, tell me everything all around that and then I'll formulate more questions.\n00:40:40 - Michael F\nWell, when I started this business, um, July, this is completely so this is July medical. This is the one I worked with Mark. Mark's law firm on. I had no clients like who's going to send their client to a telehealth doctor when they can go to an in-person doctor, right? So, um, initially, I, I look back at the business that I. close with my partner and I took the whole list of everyone that had ever sent me a patient from that business and then I just literally tried to get on the phone with them and yeah I would just try to the case managers that work for those law for I found that lawyers don't do anything the lawyers don't maybe mark those but those lawyers don't it's the case managers that give me business they send their clients to me so I just got that list from my old clinic and I just called them and thankfully most of them remembered my clinic remembered my reports and I had to explain to them yeah I do the you know I do this on televisits but I'm like a quarterback and then yeah a couple of them got it so you know I got a couple referrals the first month and I just kept doing that up until about I did it for about the first six months and once I got to about six months into the business which was September of last year I kind of cut back on doing that because I just had I was I was getting good traction anyway and you know I was\n00:42:00 - Tina Marie (profitdriversinc.com)\nmoments are right though.\n00:42:01 - Michael F\nIf you're not moment to mean you're dying.\n00:42:04 - Tina Marie (profitdriversinc.com)\nYou're moment to be. You're either getting or losing but you're never you never stagnant really. So be purposely intentionally. So one of the things I'd like you to consider is where in your schedule and.\n00:42:25 - Michael F\nWell I just not on that note. It was actually a conscious decision that Mark and I had talked about. In this in personal injury it's quite litiginous and the insurance companies will come after the doctors actually more so than the lawyers because we don't have patient client privilege and so they could take my deposition, take me to court. So at the point where my business was getting between like three to four hundred visits a month which is where I've been at for like last six months. Eight months now. That was in September, and that's when Mark and I were like, you know, if I get too big, I'm going to stick out, especially because I'm... So we actually sort of like throttled it, because if I kept getting, and what I do now is I kind of cherry pick my referrals, like I actually started turning away some, like for instance, there's a class of injury called slip and balls or dog bites, and those are highly litiginous because it's like, well, how do you know they slipped, right? There's no... It's hard to prove, and so the doctors get questioned a lot. So I actually stopped in like December, I stopped taking that with Mark's help, and now I turn away all that business, even though it could make me like a lot more money, right? But that was the way that I've, instead of like increasing the number, I've tried to pick better cases.\n00:44:00 - Tina Marie (profitdriversinc.com)\nOkay, so what I do you have, anything where you've done the map, a spreadsheet, a calculator of volume over quality and what that looks like to your revenue line over time?\n00:44:18 - Michael F\nNo, it's hard because I don't get paid, I don't get paid for about maybe like 18 months to two years, like I haven't gotten paid for, like some have started paying me, but it usually takes like maybe a year, 18 months to get paid.\n00:44:36 - Tina Marie (profitdriversinc.com)\nSo I'm aware of that because of mark stuff.\n00:44:38 - Michael F\nYeah, it's freaking wild.\n00:44:40 - Tina Marie (profitdriversinc.com)\nSo don't you, don't you know though in roughly six months what the amount's gonna be supposed to be?\n00:44:52 - Michael F\nWell, I mean, I can, I have like my spreadsheet and I can tell you right now how much I expect from each case. case, like, my average. So yeah, I could apply that. Really, I'm just looking at how many cases I get in a month, right?\n00:45:08 - Tina Marie (profitdriversinc.com)\nAnd I just multiply that by 300. So there's multiple things. Like, first of all, we look at the case volume, we look at attorney fees, which is, and I don't know, is there a variation of how much you get paid? There's not right? That's like always the same for every case.\n00:45:27 - Michael F\nI mean, if the lawyer does really well, like the average, like, I haven't done it in a while, but each law firm has a different average, right? sweet laws average is about 500 per case, but my law firms are like 300, right? but I just use 300 in my head because I'm like, well, that's the most conservative thing.\n00:45:51 - Tina Marie (profitdriversinc.com)\nOkay, so what I was getting at is that there are certain data points.\n00:45:56 - Michael F\nHow many cases come in?\n00:45:58 - Tina Marie (profitdriversinc.com)\nHow many get settled? a month, how many get paid out?\n00:46:03 - Michael F\nThat's right.\n00:46:05 - Tina Marie (profitdriversinc.com)\nSo now he has Lidify in Salesforce. Do you have, do you just use spreadsheets?\n00:46:13 - Michael F\nLike where do you track your cases? When I get a check, I have a Google spreadsheet that is, I've mirrored it. So I've created a second Google spreadsheet off the first one that no one else can see except me. And then when I get a check, I just find their name and put how much money I got to get the call.\n00:46:33 - Tina Marie (profitdriversinc.com)\nHe's a better system.\n00:46:36 - Michael F\nYeah, yeah. It's hard to track my month. I have no idea how much I got per month, except for my bookkeepers will tell me.\n00:46:44 - Tina Marie (profitdriversinc.com)\nWould it be helpful to have just one of our calls just be devoted to that business and bring Mark in for some of his ideas?\n00:46:52 - Michael F\nAlso, no, this is not a judgey thing. This is just because he and I have worked together.\n00:46:56 - Tina Marie (profitdriversinc.com)\nSo also, it'll help me not feel stupid because I When I get into a new business, there's so much I don't know, but I'm in here and I got to be confident and ask these questions, so this is me telling you you're not the only one, like we're all trying to figure out how to do the best thing where we're at. And we all have different skill sets that we bring to the table so, you know, my experience doing the same things over and over again in different businesses. I mean, again, I've got lots of years on you. Lots of years of practice, lots of watching my own thoughts, watching other people's faults and seeing that there are certain things to do. I'm not raising brand new babies anymore. Like, there's so many different things. But even with all of that, there's way more that I don't know that I do know, and it always will be like that. So, you know, but I was just thinking that for two things. Just his mark has been ideas, and it would help me understand your dynamic a little bit better too. to be able to see that in action on a call. I feel like I might feel like a third wheel with a romance that goes on. so we'll talk about that. would you share with me? And if you if you can, because I don't know if you can with so you do not get privileged with your with these people because that's accidents or how does that work?\n00:48:36 - Michael F\nYeah, everything that I do pretty much is discoverable under with a subpoena. Yeah, it's very uncomfortable. Like they can even go as far as text message. That's why Mark and I communicate on signal because those delete and I have all my staff message on signal, all our calls are on signal. But yeah, unfortunately, everything is. I mean, like sharing, sharing data with consultants, sharing data with accountants, bookkeepers, that's not a problem.\n00:49:06 - Tina Marie (profitdriversinc.com)\nOkay, because what I would like to see is basically anything that you have that you track any of your business. So what would be really helpful is, okay, this is the record, anything that you can do to give me a full understanding of why you do it, why you do it this way, what it tracks, how long you've been tracking it, that type of thing. That honestly, if that was all that we accomplished over the next couple of weeks is transferring that data so I could start kind of wrapping my head around it so that I can formulate the best questions. But here's the thing I want you to always think about when you're planning out your day, when you're planning out your week, when you're planning out your month, when you're planning out your quarter, and I don't even know if you think about it in terms of quarterly goals and things like that, that would have been my guess. Which is okay, we're just really getting track to like you're just very brand new on your own, you know, I never. used to think like that. It's really only been probably the last 10 years that I've been working that way and I could improve a lot and I do the quotes because so for example I have Mark and I think I told you to read Emith. lot of these business type books assume values that I have that I don't have and then I never will have. For example Mark's value is if I want to go in the office for month I'm not going to go into the office for a month. Now almost anybody who's a business consultant is going to say you're insane that's stupid you can't run a business like that. I would not because I would say you're not going to run the best business that way. There's going to be a lot that's going to suffer that way but there's trade-offs. If you have enough leaders in the business it's profitable. Your people are happy and your highest value is the freedom. to do what you want to with your time, I think you created the perfect thing. And business books and business courses don't approach things like that. They will give you that judge you kind of like, well, you could do better. You could hire someone, you could do this. Yeah, it's, but everything comes with more stress, every person that you hire, it's more stressed, it's more responsibility, it's more expectations. And we've already talked about how failure to mean expectations is where most stress and anxiety comes from. The more people you involve, and the more, you know, you're like, these are our goals, this is what we're doing, the more you have expectations that you have to meet. So if your higher value is flexibility, and fluidity in life, so that you can be a free agent across the board, then the trade-offs are going to be, you're going to lose some of the structure, and you're going to lose some of the benefit of the structure and momentum, but you're going to maintain that autonomy. and that freedom throughout your life. So you're leveraging everything as much as you can, not for the sake of revenue. Revenue is feeding the autonomy. Revenue is the secondary thing. The autonomy and the freedom is the first thing, which is generally who I'm working with, because yeah, I could do all of that, I don't want to. I don't either. I could have been a valedictorian and I'm like, that's way too much effort. I don't want to study. I will, whatever I accumulate during the class, that's it. I still graduated with honors, but I did zero homework. Zero studying. I'm just like, why? I'd rather play soccer. rather do this. I'd rather do that. I'd rather go, yeah. cheerleader and football and track and softball and tennis. Is that everything?\n00:52:52 - Michael F\nBasketball.\n00:52:54 - Tina Marie (profitdriversinc.com)\nI like to play. I still like to play a lot. So. You're you're in the season of parenthood. So we'll take all those things are in the count, but when What time is it?\n00:53:08 - Michael F\nWhen do we start?\n00:53:08 - Tina Marie (profitdriversinc.com)\nOkay, 15 When you're looking at these things I Always want you to start now. You're probably not gonna be looking at this in the week But but I would like you to just glance at this at least once a week for little while while you're starting to consider Time-blocking Which is not necessarily something you're going to do On a physical level like putting into the calendar you can and we can talk about that I Do mental time blocks because that's how loose I keep my calendar There are some things that are physically on there. They're the appointments. They're the meanings Everything else is I am keeping kind of a mental note of the types of things that I want to do and I always know what my priority is I always know I'm always thinking about it. So I always know and also because I've been doing it so long and it's so steady. I don't have to do that. But I still do on occasion come back and look at things like this myself. So you've got in these two businesses. Now QME is the one that makes all the money right now, right?\n00:54:17 - Michael F\nYeah. And that's the freedom thing and it's why I July because as long as I'm doing QMEs, I have to do face to face like today, right? There's no getting around that. Like I know that at least 10 days a month, have to 10 days a month or maybe eight, depending on if it's full or not. But like at least eight days a month, I have to be somewhere and that, yeah, I think it's good for the amount of money it makes.\n00:54:47 - Tina Marie (profitdriversinc.com)\nBut yeah, I mean, a long term, I would like to off for a month.\n00:54:52 - Michael F\nAnd not have to worry about that. So that's why that's a big reason why I like July and why I'm just kind of foster it.\n00:55:00 - Tina Marie (profitdriversinc.com)\nSo, for those purposes, the thing that you want to be thinking about with the QME is how do we maximize lottery hits, which is retracting the data and seeing what it is. And we can use some AI to look at the reports, too, instead of having just brain fatigue going over and trying to look at patterns we might be missing. And we can do that. And I'll show you how, even if you already use it, almost every time I show somebody something, I process it differently. And so there's a new thought, oh, I didn't think to do it this way. So we'll do that. And so every week, you at least ponder multiple times throughout the week, is there anything I can do to increase these visits? If you just think of it like, no, not really, but you still want it to be kind of at the back of your mind constantly, so that you're intuitive. except there's a kind of just on that, you know what I mean? You might hear a conversation about something that just was like, maybe I should be looking in this area, whatever. So just the kind of thinking about it just increases your perception or opportunities that might be out, or threats. And for a July medical, we want to figure out what levers there are. So, you want to make sure you don't have opposing goals. Sorry. This smoke is super bad here today.\n00:56:34 - Michael F\nThe air quality is like 281.\n00:56:36 - Tina Marie (profitdriversinc.com)\nThe fires are so bad.\n00:56:38 - Michael F\nWhere are you again?\n00:56:40 - Tina Marie (profitdriversinc.com)\nSouthern Oregon. Commathals. I don't know if you're part of it. It's a hit though. But yeah, but we get everybody's smoke. It just lands on our basin. What was I thinking? Okay, so you have to watch for opposing goals. If the goal is July medical is your path to freedom, but you're trying to stay under the radar, so you're not growing. Do those conflict?\n00:57:11 - Michael F\nYes. Yes.\n00:57:13 - Tina Marie (profitdriversinc.com)\nI do. And if autonomy is the ultimate goal, then are you going to live your life based off of fear of competition? I would say that's a terrible way to live. You have to decide what's the most important thing. Now, I'm not saying don't mitigate those risks in whatever ways that you can. What I'm saying is that we figure out are there other ways to do that. So those are longer conversations.\n00:57:52 - Michael F\nThey're not necessarily longer conversations. They're ongoing conversations.\n00:57:56 - Tina Marie (profitdriversinc.com)\nThese are the kind of things where answers reveal themselves because we're intentionally looking for them. solutions. But you have to decide and you already have, but you need to make sure also that you're on the same page with whoever you're talking to, including Mark. But if your priority is July medical is your path to being as free as you want with your time, then that has to be the price. Originally, priority didn't even have it was it was singular.\n00:58:24 - Michael F\nThere was no plural form of the word. Yeah, that's true. I can imagine. It was just there was there was one.\n00:58:31 - Tina Marie (profitdriversinc.com)\nIt's the one thing. I see now we have multiple and and they're right. But there has to be one greatest above all priority. Okay. And that should be autonomy because that insinuates and implies that you've got the financial resources that like I talk about these three different currencies, time, energy, and money that that that autonomy or freedom means that you've got all of what you want and need sufficiently. at least, right? And you want for nothing. And everything else feeds that goal. So you maximize how they feed that goal. There is, by nature of life, an enemy in opposition to all things. So if you're constantly focusing on the enemy in the opposition, what you're not focusing on is the growth.\n00:59:29 - Michael F\nOh, yeah, that's absolutely right in July right now.\n00:59:32 - Tina Marie (profitdriversinc.com)\nSo, but what we think about comes about where we put our energy and mind to, that's what increases. If you're focused on the scarcity and the threat, that's which you're increasing and manifesting. And if you're focusing on the growth, if there's sufficient growth, it mitigates competition anyway. If you're networking so well and taking care of of the people that send you business, the attorneys, if they're just falling in love with you like Mark's tweeted, what do you care if there's competition? They're going to cut you out? No. Also, I fully believe you can't take what's mine and you can't take what's Fuji's. It's either for you or it's not. So even if that's wrong, we know that there is evidence from MRIs, from all kinds of things that show what our brains do when we believe things, when we focus on things. It activates us. We behave differently. So you just have to make a choice of am I going to focus on playing small, on purpose, on purpose is what you just told me or being free.\n01:00:58 - Michael F\nYeah, that's a it's a good point. I mean, yeah, I've been just staying kind of small since September of last year. Really, I haven't pushed growth at all. I'm just, yeah, it's been nice. It's, I don't know, nice, but it's kind of bruising and we're growing in the right way, I think, but I'm not really pushing it at all.\n01:01:17 - Tina Marie (profitdriversinc.com)\nSo yeah, it's kind of weird, huh? It is weird.\n01:01:20 - Michael F\nWell, and there is definitely something to be said about keeping the guardrails on so that you don't grow too big, that it becomes a problem.\n01:01:29 - Tina Marie (profitdriversinc.com)\nBut then if you're looking at scaling, then, then a part of that is hiring the right kind of person, hiring somebody who can help it grow so that it doesn't become a burden, like Mark has Mary, but also he's got some really great attorneys and he's investing and coaching in them to make them better leaders. And we've done things like more surveys to find out what their weaknesses are. what are the things that they feel like they need to know. So we've got um grief counseling for the intake people so that they could learn how to have those conversations with people who have lost loved ones because they died. It's some of the the intake people they're like that is really heavy. I don't know how to deal with that because they feel that other person's energy and it was hard on them. And that had never been addressed before until we asked the surveys and in a particular way like his net promoter score surveys were useless to me. I'm like you're not asking anything that is very corporate-esque and it says I'm asking you because I feel like I have to ask you I don't really care. So we changed the questions and then the other thing that we found out is that people feel like they're not good at sales calls which we already knew but the fact that they're aware of it and they want to be better is wonderful. So we went and got black something. I can't remember what it is. Anyway, and they came in and they taught sales. And her best attorney, just from reading their book, like, she already figured out a strategy that was making her money immediately. Sam, yep. so, and it wasn't that everybody was better across the board from all of these things. It was that there were pockets of improvement, but they wouldn't have existed without finding out what they needed. That wouldn't have existed if Mark did invest in coaching for himself and caring about leadership. So his goal still is, I don't really want to go into the office. And so, my job is to figure out how do we make the best out of all of these things as much as they can be without you going in and being a leader and overseer. He's still leading, but he's leading from a recliner because that's what he wants. nothing wrong with that. I mean, he's still like, he's hard working, he's doing lots of things, he's just not in the office with his people. And statistically, that's not what you think of as somebody leading, you know, there. But he's happy with it. It's also not the most profitable thing, but Mark has been growing happier and happier and happier since I've known him. I used to call him Eor. That's funny. Because I'd say how you think he's I'd say, okay, bye, have a great day. He's like, yeah. Okay, yours and Tiggers, you know, he has a Tigger.\n01:04:51 - Michael F\nThat's so funny.\n01:04:53 - Tina Marie (profitdriversinc.com)\nUm, and now he just, he almost never has that energy. And when he does, he automatically is like, yeah. But this is what's good, and this is what's good, and this is what's good, and I'm like that's my boy right there So It's all it's all the process anyway. Oh crap the time. Geez Okay So I want you to start thinking more about how do you get more of your most profitable activity or More out of your most profitable activity. So you're not necessarily trying to spend more time doing it But trying to milk what you can out of it sometimes it's more time and then How we can support that the other work activities? This is where time tracking comes in we want to figure out what we can delegate and so if you look at it and go These are things also. What is not getting done? That should be done. Go ahead and put that down there and we'll highlight that in a different way Things that you know should be happening in your business, but isn't we want that list And then step two, oh, you did, no, I knew you didn't. Okay, yeah, step two. I really want you to fill out step two because what that is is things that energize you, things that drain you. it ranks how good you are at stuff. So that helps with delegation, but it also helps us figure out where's the sharpening of the saw activities that we need to do. And even if we're only putting a little bit of saw sharpening activities monthly, right? The pace is gonna be dictated by you and what you wanna do. But categorizing the things that you do across profitability and then energy and then skill really helps us rank where the time goes so that we can get the most out of it and also how we can utilize other people to get the most out of your existing team and assets and kind of future pace and figure out What would come next in order to get you to more of the profitable either activities or higher leverage profitable activities? Yep, I like that plan Okay All right, so I will send you some notes and In a few minutes because otherwise I might forget and I don't want to do that And then I will talk to you Monday cool.\n01:07:25 - Michael F\nI have my alarm set this time, and I will not miss it I have two three four alarms back up And always tuned it if you want to because my Mondays are crazy long but that you said that that was consistently the best for you Monday is the most consistent day that I have all four.\n01:07:43 - Tina Marie (profitdriversinc.com)\nOkay.\n01:07:44 - Michael F\nYeah, so Good luck.\n01:07:46 - Tina Marie (profitdriversinc.com)\nYeah, I only work one Monday a month generally So I didn't Quality to protein and take the day before And just let me know did you did anything pop out to you.\n01:08:03 - Michael F\nOkay. Okay. was good.\n01:08:06 - Tina Marie (profitdriversinc.com)\nAny questions or anything?\n01:08:08 - Michael F\nNo, thank you so much for scheduling.\n01:08:10 - Tina Marie (profitdriversinc.com)\nAppreciate it. My pleasure\n","contentPreview":"00:00:00 - Michael F\nHi.\n00:00:01 - Tina Marie (profitdriversinc.com)\nHey, how are you, Fuji?\n00:00:03 - Michael F\nGood. Well, I'm so sorry I missed Monday.\n00:00:06 - Tina Marie (profitdriversinc.com...","processedAt":"2025-05-04T03:40:52.596Z"}