{"fileName":"Done Transcript for Basis Integration_Sweet Law(7).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Basis Integration_Sweet Law(7).txt","type":"transcript","priority":"medium","content":"00:00:08 - Tina Marie (profitdriversinc.com)\nYes, how are you? Yeah, good. Good enough, you mean?\n00:00:18 - mark sweet\nYeah, it works. He's not so fluffy right now, but he's good. He had fun this weekend.\n00:00:29 - Tina Marie (profitdriversinc.com)\nWendy, do you?\n00:00:31 - mark sweet\nUh, came over. We had a family day. Enjoyed himself.\n00:00:35 - Tina Marie (profitdriversinc.com)\nThat's good.\n00:00:37 - mark sweet\nHe's convinced that he's a lap dog and he keeps trying to get up on the chair and sit in my lap and he's a little bit.\n00:00:52 - Tina Marie (profitdriversinc.com)\nThat's interesting. We hear back from Isaac. exam because I cannot get into litify and I really wanted to go look at cases by source but like over a few years. I'm really interested to see how much change with doctor referrals. I mean it can't be a tongue and they're not high but they're definitely changing and they just want to get an accurate visual on that. How are you doing Dan?\n00:01:37 - Dan Ryan (danddcompany.com)\nI'm good, how are you?\n00:01:40 - Tina Marie (profitdriversinc.com)\nIt's Monday. I got a lady freaking ran into me this weekend and hit my car. Now I have to go get work done and annoy it. The list of leads just keeps, like the lead sources just keeps growing, which is interesting. Cool. Okay. um, Dan, before we get started real deep in this, where is my and the flow we open. Oh, actually I found it. I guess it's just that there's a lot of. I'm going share screen anyway, because maybe you can help me use this more efficiently. Let me show you a screen. So window. I'm so frustrated that it couldn't do this on mobile because it would have been much more enjoyable if I could have done it from the pool, but. Is there way to sort this just by calls that had recordings.\n00:02:59 - Dan Ryan (danddcompany.com)\nOh, duration and seconds. Maybe.\n00:03:00 - Tina Marie (profitdriversinc.com)\nbecause there's so many calls that don't have recordings.\n00:03:06 - Dan Ryan (danddcompany.com)\nWhy?\n00:03:08 - Tina Marie (profitdriversinc.com)\nGood.\n00:03:09 - Dan Ryan (danddcompany.com)\nIf you hover over recording does an arrow show up or no? No, there's... So, I mean, you could, yeah, it doesn't. It doesn't filter like that.\n00:03:24 - Tina Marie (profitdriversinc.com)\nThat's really kind of lame. Okay, so anyway, you can sort by like, I mean, you only really care about incoming, so you can sort by incoming. Why are there some calls that aren't recorded? Like, what's its rule algorithm for recording? Actually, don't It's like every 10 or so.\n00:03:59 - Dan Ryan (danddcompany.com)\nMaybe you can also right? So you do incoming and then do the number drop down. So you're up top, step to the first over the area, right? So then you can pick like, you'd never, like LSU don't get LSA calls, but like GMB probably gets the most calls LA.\n00:04:21 - Tina Marie (profitdriversinc.com)\nGMB. Okay, that one. No data.\n00:04:26 - Dan Ryan (danddcompany.com)\nOr not. But you, so then you can just sort by numbers.\n00:04:39 - Tina Marie (profitdriversinc.com)\n15 calls. Okay. Well, that's interesting.\n00:04:45 - Dan Ryan (danddcompany.com)\nThat's weird because we're just showing up.\n00:04:48 - Tina Marie (profitdriversinc.com)\nYeah.\n00:04:51 - Dan Ryan (danddcompany.com)\nRight, there's all, oh, I'm sorry, new parts about LA.\n00:04:56 - Tina Marie (profitdriversinc.com)\nWell, I clicked on that too, and that was 15, but there were no, there's\n00:05:00 - Dan Ryan (danddcompany.com)\nData here. It says 15 calls and then no, not.\n00:05:04 - Tina Marie (profitdriversinc.com)\nYeah. I guess that doesn't work so hard. Yeah.\n00:05:08 - Dan Ryan (danddcompany.com)\nWell, then you're scrolling. I can't help you. No help.\n00:05:15 - Tina Marie (profitdriversinc.com)\nAll right. I'll keep taking around. And maybe I can just ask. So if I go to support for lead flow, which is a good HQ connector or you. Okay. Maybe I'll do that and try to figure out how we can. Get that better. So would like, unless, I mean, did you happen to have? You haven't listened to calls recently, right? No. Okay. And Mark said it's been like six months for you. All right. Oh, I'm past that and I will keep working on it. Oh. Um, so five dropped sub out, um, that's, they dropped you, right?\n00:06:08 - mark sweet\nUh, sub outs, got fired, dropped as we dropped the case.\n00:06:13 - Tina Marie (profitdriversinc.com)\nOkay. That's why I'm not going to drop slash. So I'd rather see those broken up.\n00:06:18 - mark sweet\nHow many did you get subbed out?\n00:06:20 - Tina Marie (profitdriversinc.com)\nSo I gave you guys a breakdown, like, Oh, sorry. Okay. Drop. Sub out, sub out, sub out, three sub outs. No insurance.\n00:06:37 - mark sweet\nAnd it wasn't like it was one source or something. like, Oh, source is screwing us or something like that, right? Especially no balance. Mary's husband, know he's not trying to screw us.\n00:06:51 - Tina Marie (profitdriversinc.com)\nYeah. And the mad that you can't get his license back. I mean, what are you going to do?\n00:06:57 - mark sweet\nThat's pretty nice time with a firm that would help them with that side. I get it. It's annoying, but I get it. Um, the first one where they sign what sweet dreams within 20 minutes is annoying, but yeah. and the two drops are, you know, was, there's nothing we can do and fine with that other drop. The other one, the guy just didn't want to treat and he already had a gap. So yeah, probably could have done something maybe little bit around that one, but yeah, so that, um, and the other values about, I mean, I spend a lot of time on the phone that guy. Um, they had signed with another firm like a month before us who already got the policy moment. There's nothing intake did wrong. nothing like anyone did wrong on the front end.\n00:07:41 - Tina Marie (profitdriversinc.com)\nYeah, I mean, stuff is definitely going to happen. Where is that we talked about getting, um, having America or Jasmine?\n00:07:52 - mark sweet\ndon't remember which one was doing at the doctor report.\n00:07:56 - Tina Marie (profitdriversinc.com)\nYeah, share with us.\n00:07:58 - mark sweet\nI didn't see that.\n00:08:00 - Tina Marie (profitdriversinc.com)\nwhich one was a Jasmine in America?\n00:08:02 - mark sweet\nJasmine doesn't work for us and hasn't ever a while.\n00:08:04 - Tina Marie (profitdriversinc.com)\nOkay, sorry. I thought it wasn't right. I am very struggling.\n00:08:09 - mark sweet\nname is pregnant right now. Oh, there it is.\n00:08:17 - Tina Marie (profitdriversinc.com)\nOkay, I just didn't see it and why is it not loading?\n00:08:24 - mark sweet\nWell, it's not loading. not sure.\n00:08:28 - Tina Marie (profitdriversinc.com)\nIt's weird. It's like and it's not a link. It must be an attachment, but the Google Drive. mean, hold on. I'm just gonna share again with you because I think you should see everything if I do it this way, but this is what the email looks like. Was it just to me? Yeah, it was just to me. I wasn't having an email issue, so I don't know what's up with it. this. Did you get a dance? I did ask for it to be shared with both of us.\n00:09:07 - Dan Ryan (danddcompany.com)\nLike a week ago?\n00:09:08 - Tina Marie (profitdriversinc.com)\nYeah. Could you forward it to me and see if somehow that works? Okay. Thank you. Mark Street. There we go. That I can actually open.\n00:09:23 - mark sweet\nThere's two things. Yeah. There's the list and then she grouped it by like proximity so that way we can better plan our trips.\n00:09:33 - Tina Marie (profitdriversinc.com)\nList. Right. The map. So that one. Okay. Okay. Carlos. that's the. This is the group trips. Deated meeting. Case is done. What does that mean? There are no dates in here and\n00:10:03 - mark sweet\nI wouldn't look at it. She did that to try to put it into a Google map to see who's close to who. The amount you really want to look at.\n00:10:15 - Tina Marie (profitdriversinc.com)\nOkay.\n00:10:16 - mark sweet\nThis is just for us to try to figure out how to visit people together in a group. So that's to learn more than five at a time. So the cases done are just the number of cases that we've had completed with them.\n00:10:30 - Tina Marie (profitdriversinc.com)\nOkay. Let's try to move up. Let's see. It's not. What order is it in location? Let me sort it by date. So these are these cannot all be matters. You're fine. Bye. Let's, uh, hold on, data, sort of range, events, comb, A. Mm, I just want to see a color right. So, 12, 27, 24, that hasn't even happened yet.\n00:11:34 - mark sweet\nI'm sure that's just, it's probably 24, 24.\n00:11:41 - Tina Marie (profitdriversinc.com)\nSo. Yeah, it's a 12, 23, Um, is this supposed to be Dr. referrals? This is not. Not doctor referrals. That's what I was looking for.\n00:12:03 - mark sweet\nThese might be all the kind of.\n00:12:06 - Tina Marie (profitdriversinc.com)\nOh, to doctors. Okay. Okay. Are we tracking how many doctors have sent us cases? Where's that at?\n00:12:23 - mark sweet\nThat's what I was looking for. That's ever before we can let it by.\n00:12:28 - Tina Marie (profitdriversinc.com)\nSo, yeah, I can get into right now. Okay, so you can you can find out which doctor has how many referrals you've had by doc like specific doctors. Yeah. Okay. I don't remember that that was something that did I mean because I know that we've talked about this before and I thought that's what we were doing here or we're going to be doing here. Maybe. You guys remember that differently, but I didn't. Okay. So, um, does anything stand out to anyone here? Let's see what where we at the 22nd walker seems low.\n00:13:16 - mark sweet\nYep. I pulled back a little bit on Walker. Um, a little bit. mean, just delaying it a time. But I can push them to deliver more, but it hasn't seem necessary and their cost preparations are fine. The one that I'm really surprised how low is this monkey?\n00:13:41 - Tina Marie (profitdriversinc.com)\nReally that I can't get into let it by. was trying to get in there 10 minutes before the call.\n00:13:45 - Dan Ryan (danddcompany.com)\njust send you the password.\n00:13:47 - Tina Marie (profitdriversinc.com)\nThank you. Thank you.\n00:13:50 - Dan Ryan (danddcompany.com)\nApparently got updated right before you went in there. According to Josh and Stacy and Isaac.\n00:14:04 - Tina Marie (profitdriversinc.com)\nWell, it's not here yet. Okay. So anyway, monkey. I mean, but we're still doing. Well, I guess it's slowed down a little bit. It was starting off.\n00:14:18 - mark sweet\nmean, realistically, we're like 61 or 63, whatever it was. If you take out these drops and stuff out, that pushes a little higher than normal. It's like one or two, but it's five. kind of moves things a little bit.\n00:14:36 - Tina Marie (profitdriversinc.com)\nYeah. Okay, so what can you explain to me a little bit?\n00:14:41 - mark sweet\nWhat's going on with Walker? I haven't been bugging them to increase their volume. Usually I brought them in the volume increase. It's going to spent a bunch of money.\n00:14:52 - Tina Marie (profitdriversinc.com)\nAll right.\n00:14:54 - mark sweet\nBut both propositions really, really high. the cases that we get out of them are fine cases. but they're not amazing cases, so we don't need to be the least for lack of better term.\n00:15:09 - Tina Marie (profitdriversinc.com)\nAre they profitable even with the cost?\n00:15:14 - mark sweet\nI don't know if I have enough data yet.\n00:15:17 - Tina Marie (profitdriversinc.com)\nOkay, so we can talk about whatever you guys want to talk about and then maybe we can talk a little bit about the employee paying compensation and just so if the priority is how do we make this more profitable? How do we make it most optimized and leveraged? Then we spend the majority of our time looking at how to do that. That's one of the biggest things and we can explore that a little bit while we keep kind of massaging all of the rest of the pieces. Definitely having intake be more efficient, having the whole team be better. at sales so that we're getting the most out of the leads that we're bringing in those are big lovers and then figuring out if there's a way and there's a way to change the compensation plan but at what cost and I would think that it's kind of akin to for you down like going to a subscription model like there's a big dip in the beginning but then you recoup the money on the back end because you're not spending so much so that's where I would like to go with it but I would love to hear what's on either one of your minds that we talk about and then just kind of go from there.\n00:16:44 - Dan Ryan (danddcompany.com)\nI am Anna I'm going to add thirdly right now to get their final numbers because they're both to run out. Their stuff works. just trying to get the number and then Eric and I set up all the custom stuff. them so that it does the three calls in the first hour just for them and then all their leads are only going to go internal. Well actually everyone's only gone. We got rid of HQ no longer gets them after 96 hours. It does seem like the internal team's making way more phone calls by the way so whatever whip you crack there Mark, good job. So they make way more phone calls like I'm going into like look at stuff and then I look at the number of calls and there's a lot more about both which is cool. So I'm just I want to get this out of the number. See I think they're I mean they're under five grams of retainer is what it looks like. I just want to get the exact number here and then they are like they don't want to do Washington anymore because it was the worst performer so they want to focus on Missouri and New Mexico. so they start they switched I think we dumped Washington last week and then they started putting into those other two states and I think the one that converted was like one out of three leads but that doesn't really mean anything so I'm just going to get their numbers so we can perhaps bring up with them and figure out what their actual cost is so I'm literally doing that right now but my Google she just doesn't want to open it which is very weird because I've never experienced this before there we go my other thing is like how do we feel about these monthly members it's seem like we're on a really good track six days ago and then all of a sudden like wait a minute this is Look, it's going to go where I thought it was going to go. Do we know why? Is that all Walker monkey?\n00:19:10 - mark sweet\nFor whatever reason, we just always seem to have a week that just slows down.\n00:19:16 - Tina Marie (profitdriversinc.com)\nYeah.\n00:19:17 - mark sweet\nI can't tell you a rhyme or reason for it. We just always seem to have that issue.\n00:19:25 - Dan Ryan (danddcompany.com)\nAnd it's a slow down, it's a slow down in retainers.\n00:19:29 - mark sweet\nCorrect.\n00:19:30 - Dan Ryan (danddcompany.com)\nCause I believe that's not Lee insisted. Okay. That is kind of weird, but there's.\n00:19:38 - mark sweet\nThe last one is 60 people. And that's we were at 64 and 86 people. So it's a pretty good increase from week to week.\n00:19:53 - Tina Marie (profitdriversinc.com)\nI'm in a mute for a second. I'm this is my daughter.\n00:19:56 - Dan Ryan (danddcompany.com)\nI'll be right back. I'm going. Yes, as early guys, they finally came to my camp, our camp, because like your guys are signing bad cases. So that's, I go, we can't use their math. Their math isn't real. So that's why I'm going through a figure out what the cost per retainer is for mark math, sweet math. It's going to be slightly higher cost per retainer, but in a better running model.\n00:20:40 - mark sweet\nCan we duplicate what, not necessarily who steals doing, but what Yes, I know exactly what they're doing now.\n00:20:59 - Dan Ryan (danddcompany.com)\nI just need to look a few more. data points. I know what they're both doing. So, mean, I could go try to do both. Although, I mean, it's not... I was like, that's always, uh, inviting trouble. Uh, yeah, I get, I totally know what the other guys are doing. I can't believe it works, but I'll try it. We should work.\n00:21:28 - mark sweet\nThere we are.\n00:21:30 - Dan Ryan (danddcompany.com)\nYeah, absolutely.\n00:21:37 - mark sweet\nBecause again, if we can keep building out these sources that are, you know, not just cheaper, but just more sources for you, we're gonna be better off. The less walker, the better monkey. I don't know what's going on in this month, but, you know, she generally didn't fairly consistent. and so I don't know what I'm down but fully based up this month but next month who knows so you know we can get 7 to 10 new cases a month right and just keep that growing it adds it adds up really really quickly.\n00:22:22 - Tina Marie (profitdriversinc.com)\n7 to 10 new cases a month are you talking about above and beyond what we are currently getting each month like increasing by 7 at 10?\n00:22:31 - mark sweet\nI'm saying if Dan can replicate what do you do with these two sources?\n00:22:34 - Tina Marie (profitdriversinc.com)\nOh okay and and he as a source gets 7 to 10 per month.\n00:22:41 - mark sweet\nSo even if I decide I don't necessarily want to go with more cases which that's a whole discussion if I can bring down my cost for acquisition then I'm making more and I'm happier.\n00:22:52 - Dan Ryan (danddcompany.com)\nRight right that's when you just start it's start massaging the math right exactly right.\n00:22:59 - mark sweet\nSo like I don't know. ever see us like cutting off monkey because we've gotten some of our biggest cases from them. But I definitely guess he has pulling back on Walker. Right. He's working on Felipe and Doritos. You know, I don't hold out a lot of hope with them.\n00:23:18 - Tina Marie (profitdriversinc.com)\nAre they responding?\n00:23:20 - mark sweet\nRight. We got one.\n00:23:21 - Tina Marie (profitdriversinc.com)\nOh yeah, I see. How would I look at this data over time, see something sort of like this, but month over month, doctor referrals, not necessarily not the not by doctors, not this, but doctor referrals as the source itself over time.\n00:23:52 - Dan Ryan (danddcompany.com)\nPulling the flag first.\n00:23:57 - Tina Marie (profitdriversinc.com)\nMark.\n00:23:58 - mark sweet\nBye. I'm thinking about it. There's probably a way this meet a source by source of month, like month of a month.\n00:24:14 - Tina Marie (profitdriversinc.com)\nSo we want matters by source cases signed by source.\n00:24:18 - mark sweet\nOkay, so if we go into reports and do cases signed by month source and state.\n00:24:24 - Tina Marie (profitdriversinc.com)\nOne source. I'm going to say my screen.\n00:24:35 - mark sweet\nYeah, just type source and then type month. There you go.\n00:24:56 - Tina Marie (profitdriversinc.com)\nCan it not be changed in the report with the dates.\n00:25:00 - mark sweet\nI have an easy way to do this, but I don't know you can see it.\n00:25:22 - Tina Marie (profitdriversinc.com)\nIt's in intake management, so you should be able to see it. Is that what you're talking about, this one? No. Sorry. Okay. Where do I go?\n00:25:37 - mark sweet\nI don't know why it's not showing for you in this. Give me one second just to finish this.\n00:25:45 - Tina Marie (profitdriversinc.com)\nOkay.\n00:26:04 - mark sweet\nCan you click on link I just sent?\n00:26:08 - Tina Marie (profitdriversinc.com)\nEmail or chat, oh chat there we go. So I just did this for only things I'd say so it's a little bit off because we doctor like kind of continued noise and can I change this that's record count but I want to see it by month over time okay it's by month over here November 22 that's that's because that's when transition the system so ignore it okay okay okay So 20. That's interesting. used to get a lot more doctor referrals.\n00:27:09 - mark sweet\nHold on. Hold on.\n00:27:12 - Tina Marie (profitdriversinc.com)\nNot right.\n00:27:14 - mark sweet\nYou're not looking at the right thing, but not because it's your fault.\n00:27:20 - Tina Marie (profitdriversinc.com)\nOK.\n00:27:22 - mark sweet\nF5 real quick.\n00:27:27 - Tina Marie (profitdriversinc.com)\nIt beats.\n00:27:28 - mark sweet\nWe're just refresh that screen. OK, go into edit.\n00:27:39 - Tina Marie (profitdriversinc.com)\nOK.\n00:27:41 - mark sweet\nAnd then filters.\n00:27:45 - Tina Marie (profitdriversinc.com)\nRight here.\n00:27:47 - mark sweet\nSorry. I have filter source. Flux source. And then equals on the bottom. OK. It's fine. Doctor and then do a comma and then put dr and then here space.\n00:28:09 - Tina Marie (profitdriversinc.com)\nSorry. Okay.\n00:28:11 - mark sweet\nAnd then run it. You need a space between the common and do your Okay.\n00:28:22 - Tina Marie (profitdriversinc.com)\nSorry. Wait. No. Yes. Okay. Okay.\n00:28:27 - mark sweet\nJust go back to the bottom.\n00:28:29 - Tina Marie (profitdriversinc.com)\nSee. Oh, yeah. Got it. Oh, there's a space now or not. Well, there is, but there wasn't.\n00:28:39 - mark sweet\nOkay.\n00:28:44 - Tina Marie (profitdriversinc.com)\nNo results.\n00:28:46 - mark sweet\nAwesome. Oh, go back to the equals and just do contains.\n00:28:58 - Tina Marie (profitdriversinc.com)\nOh, that makes sense. Yeah, sorry about that. Okay.\n00:29:05 - mark sweet\nyou go.\n00:29:07 - Tina Marie (profitdriversinc.com)\nAll right. So much better, much better, much better. Okay. Okay. Okay, so. Do you feel like there was anything around this time that you were doing differently?\n00:29:52 - mark sweet\nThe end of 2022.\n00:29:54 - Tina Marie (profitdriversinc.com)\nYeah, but through spring of 2023. Yeah, I don't know. I mean, it's interesting to look at because it has felt to me like they're getting higher, but maybe it's just that they're consistently, we're hitting at least six where it's 2021, 2022. It's 2023. So, mean, it's consistently like five to ten. Yeah, we haven't been under six since July of 2022.\n00:30:55 - mark sweet\nAnd those are just the ones we're signing and we get a lot more. In the takes that we say no to.\n00:31:00 - Tina Marie (profitdriversinc.com)\nYeah, I mean, so let's just do this real quick. Let's look. OK, we'll just all of that's 2021 for the most part. And then 2022, peak was 13, 2023, was 13. And it seems like it's growing just very, very slowly. But so back to levers again, what can we do where we're not basically going and buying leads from vendors? The biggest thing is doctor outreach. And then the other thing is of the stuff that we get from the vendors, optimizing how we're processing it internally. So making sure that intake is choosing the best cases. going cases. And best best And then other hand, on on the attorney side, making sure that we're hitting policy limits and moving things along in a timely manner and handling it so that we're not getting sub-doubt and maximizing attorney fees. So those are the things and let's just kind of write this down. These levels. But obviously there's real cost involved because you're traveling to meet them so...\n00:32:43 - mark sweet\nAlso, you're not going to get a big case.\n00:32:49 - Tina Marie (profitdriversinc.com)\nOn the house.\n00:32:59 - mark sweet\nLike the chance it's a big case. case is pretty small because you know it's going to be a small soft tissue case generally speaking how would you value a referred out compared to a retainer is it like 1500 bucks is it like is there even a number for that but the short answer is no because in a refer just all over the place anish level cases that are thrown into it so if i try to pull from quick books it's yeah i know that massively but like looking at you're like there i would guess on average you know it's under two grand um so i mean it's less right i had 1500 bucks for some reason well so i'm trying to figure out like i mean i'm telling the outsidely guys hey yeah no these these are like\n00:34:00 - Dan Ryan (danddcompany.com)\nNot even half value, right? It's not even close, but They've gotten like five or six of those. So I'm like, all right. mean they're not there. They go towards And I guess maybe it should just be like obviously you don't want things weighed in that Column like yeah, we'll take those but also no Right, right with money off of it, but not like yeah Yeah, and it's like that's word of this doesn't I was telling them. I'm like it That multi-state firm they have is is referring cases out left and right. I'm like bro Those are not retainers but does not count. I Don't know why they're doing that it could be this long-term brand play whatever but no We're not not equal, but I will tell you when it happens, but they're not evil do not call we're not calling that a case on No\n00:35:00 - mark sweet\nLook, I can get it to some level because if you want to give us the works or not, it makes sense, right, to start doing a critical piece out, assuming that that's blood. Sorry, I'm trying to find a way to get you the average real quickly. I'm trying to take out the gigantic cases because since 2022, just in California alone, it's been like 2.6 million, which is cool, but I'm trying to figure out how much that is the big business. So, don't know how to say that. So, if I take out all the pan-ish folders, we got one really good, I'm to add to it. So, total, the average is actually better than I thought, $5,029.84 over 180 of them.\n00:36:43 - Dan Ryan (danddcompany.com)\nOr what? It's literally half. Almost. Or right around.\n00:36:47 - Tina Marie (profitdriversinc.com)\nOkay. What was that number?\n00:36:52 - Dan Ryan (danddcompany.com)\nFive grand.\n00:36:54 - Tina Marie (profitdriversinc.com)\nOr what?\n00:36:57 - Dan Ryan (danddcompany.com)\nOr referred out case.\n00:37:02 - Tina Marie (profitdriversinc.com)\nThat's our average over what time?\n00:37:06 - mark sweet\nSince 2022.\n00:37:12 - Tina Marie (profitdriversinc.com)\nAnd your average attorney fee is like 10,000 or did that, I feel like that dropped or went up.\n00:37:20 - mark sweet\nIt's like three times that number.\n00:37:24 - Tina Marie (profitdriversinc.com)\nThree times this number.\n00:37:26 - mark sweet\nIt was like 14 then.\n00:37:27 - Tina Marie (profitdriversinc.com)\nOkay.\n00:37:34 - mark sweet\nBasically the five grand is what the cost internally. But again, if I can at least get something back for it, why not?\n00:37:46 - Tina Marie (profitdriversinc.com)\nSo this is great.\n00:37:49 - mark sweet\nWell, not for even because otherwise I would have just rejected it.\n00:37:57 - Tina Marie (profitdriversinc.com)\nSo what does it It costs you then to work up this case on average.\n00:38:02 - mark sweet\nAnd how would you track that? You need to be more. We don't work up this case. We send it out.\n00:38:07 - Tina Marie (profitdriversinc.com)\nOK, so it costs you 5k to get it from a vendor, is what you're saying?\n00:38:15 - Dan Ryan (danddcompany.com)\nYes, that's the case, the fee that you get. Yeah, like 11th to the average value of a retainers 11 or 12th average value would be referred out of this fact.\n00:38:31 - Tina Marie (profitdriversinc.com)\nI get that except we don't have to process this and we don't have to work on it. I'm trying to say is like, we more basically just said something to the effect. That's break even like that's what it costs you to get the case anyway.\n00:38:45 - mark sweet\nIf we want to take it internally, like that's the way our cost requisition actually it's lower than what our cost requisition is.\n00:38:55 - Tina Marie (profitdriversinc.com)\nOK, all right, I'll move on then.\n00:38:59 - Dan Ryan (danddcompany.com)\nWell, what I'm trying trying to do that is so if I use that number, so if I take ads, thirdly numbers, which I'm trying to compile here right now, and I say, okay, there's 40k and spend. And I get x retainers and y, x retainers and y referred out is the calculation I want to do. We want to do retainers times 11 times five. And then that's revenue versus spent, right? if I if I come up with 60 grand in revenue and 40 grand in spend, okay, yeah, keep keep that going. Or do I just say, don't just track them, but only do retain, you know what I mean? only do retainers. Although that doesn't really make sense. guess you would want to know the other one, especially since it's five, I thought it was 1500. That's what I told them.\n00:39:56 - mark sweet\nI mean, I don't think you're super wrong. Like if I Take out some of these larger ones like there's Some 50s and some 30s, but like there's a hell of a lot of 500 600 and 1100 Yeah, you can team 50 like there's a lot of those I Guess I guess that's that's the next level is should you call the panishes something else Right, so should we make sure that one gets called referred out is?\n00:40:30 - Dan Ryan (danddcompany.com)\nIs this not that? And then you can just call the panishes you call the curve busters where the Bankmakers the Benjamin's Because we're generally not referring out like off the bat to them Right and that's really not a report out. That's more like a it's more like litigation, but you're just not doing internal litigation You Those all go, all those go to court or no, they're just able to command the pre-lit because they're them and all the other lines up. Like the 10 million. Did that go in front of jury?\n00:41:17 - mark sweet\nThe one we just settled?\n00:41:19 - Dan Ryan (danddcompany.com)\nMm hmm.\n00:41:20 - mark sweet\nNo.\n00:41:21 - Dan Ryan (danddcompany.com)\nBut we did file. Really? Okay. I have not jury trial with them.\n00:41:28 - mark sweet\nThey just, again, if they're going to pay out the policy on it, like you can't do better.\n00:41:34 - Dan Ryan (danddcompany.com)\nRight. So it's, it is referred out, it's a totally different classification. It's like, whatever you want. But you should definitely do that. And then then you, then we can start looking at this referred out thing as whatever it is. Because these guys are getting a good, a good more. I'm going to say more than you get from other vendors, which is sort of odd, but. Maybe it's not, maybe it's just, don't know what monkeys refer it out is, but it's them there. Okay, I'm going to continue with my calculations moving on.\n00:42:15 - Tina Marie (profitdriversinc.com)\nI would be interested in seeing referred out in part of the data that we look at every week also.\n00:42:23 - Dan Ryan (danddcompany.com)\nI think the good thing about them is it does play into this brand, right, that like, I guess another thing you could look at. I don't know if this is, this is something we talked about a long time ago that I've been like, we should do this or somebody should do this. we can ask Josh about this. client-based, like, what clients have referred other clients? And then if you go upstream, say, hey, that was a that was a retainer or that was a referred out, like,\n00:43:00 - mark sweet\nAre there patterns those things will emerge over time, but you have a you know a decent data There's like no chance we're getting another call from it because some other from handed it So I Cannot think of a single case that we were heard out. We might call this back That yeah, so then tracking that it's just a straight Not it's not even quite me for a gravy revenue.\n00:43:28 - Dan Ryan (danddcompany.com)\nguess right. It's either you turn them down or you refer it out Yeah, so be worth tracking that respect.\n00:43:35 - mark sweet\nYeah, and then the other bit would be you are Yeah Two years plus to try to get money on a lot of these they're not quick because they're harder cases Really interesting Why do they take them Because they can make money on them.\n00:44:04 - Dan Ryan (danddcompany.com)\nI mean, that's okay.\n00:44:05 - mark sweet\nWe say that we can make money on it. It's just it gunks up the system because it's a lot of work or it's that they're not you.\n00:44:14 - Dan Ryan (danddcompany.com)\nThey're like, yes, we'll take this because they don't have a model of I've got vendors getting leads and yeah, totally.\n00:44:22 - mark sweet\nAnd so, you know, for them, it's a free lead and they'll pay a third of attorney fees on it, which is probably less than what it would cost to get a case, right.\n00:44:32 - Tina Marie (profitdriversinc.com)\nRight.\n00:44:33 - mark sweet\nSo for them, it makes sense and I get it.\n00:44:36 - Dan Ryan (danddcompany.com)\nIt's just. Now, to those guys. What do they do with their panish cases?\n00:44:47 - mark sweet\nEither they give it to the panish or some of them try to do it on their own, but most people are smart enough to do it to a panish.\n00:44:53 - Dan Ryan (danddcompany.com)\nSo they have a connect with that.\n00:44:56 - mark sweet\nYeah. That's what that's what panishes built upon.\n00:44:59 - Dan Ryan (danddcompany.com)\nYeah, yeah. I just didn't know how, what that whole flow looked like makes it.\n00:45:06 - mark sweet\nYeah. And we'll call panish locally, know, there's seven or eight from there.\n00:45:11 - Dan Ryan (danddcompany.com)\nThere's panishes. Yeah, exactly. They've got a paper that you prefer, but same idea. Yeah.\n00:45:20 - mark sweet\nMight be.\n00:45:23 - Tina Marie (profitdriversinc.com)\nHow do I look at valiant over time?\n00:45:27 - mark sweet\nIf you go back into edit.\n00:45:32 - Tina Marie (profitdriversinc.com)\nJust do the same thing right instead of.\n00:45:37 - mark sweet\nSorry. Good month to date. Can you go back into the other one you read? And that's his report that you're doing. I think it's all the way to your right.\n00:45:49 - Tina Marie (profitdriversinc.com)\nWhat was the report?\n00:45:51 - mark sweet\nNo top to the top of your browser. Yeah. Keep going.\n00:45:58 - Tina Marie (profitdriversinc.com)\nWhat am I?\n00:45:59 - Dan Ryan (danddcompany.com)\nWhat am I looking for?\n00:46:00 - mark sweet\nThere you go.\n00:46:01 - Tina Marie (profitdriversinc.com)\nOh, that in the other tab, that tab is the other browser tab.\n00:46:05 - mark sweet\nIf you saw a browser, how did I get it?\n00:46:07 - Tina Marie (profitdriversinc.com)\nAnd you did it? Yes. OK, that's the one. And then just put in.\n00:46:16 - mark sweet\nSally.\n00:46:16 - Tina Marie (profitdriversinc.com)\nSally, And run.\n00:46:30 - mark sweet\nI mean, it's only recently that they've really come on.\n00:46:34 - Dan Ryan (danddcompany.com)\nYeah.\n00:46:37 - Tina Marie (profitdriversinc.com)\nWhy is it even like got a two and a half in here? That just makes it look so big and so weird.\n00:46:47 - mark sweet\nAnd then 24 got up to me spent the better part of two years building up the website and we're paying forward to try to generate death blogs and everything else for then because the traffic that's from it. And then you start doing the PPC that goes with it. I guess that's some level of credibility. And now hopefully you are.\n00:47:08 - Dan Ryan (danddcompany.com)\nSo what does it cost? His numbers are shithouse, by the way. Like, it's like Isaac is so funny. It's like Isaac sends me a request. And he's like, Mary wants a report on the Google analytics up to top refers, because what's his name? don't even know what the husband's name is. He's like, he sent something to Mark. Like, oh, something happened. like, bunch of traffic, you guys block us with a cloud player, like, no, I don't think so. But maybe. His numbers are like off the charts. And I'm like, no, dude, those are not real. there's people I never thought about this. the coach just said, hey, I can go look at it. He must have like Google analytics of expiring multiple times on the page, because his numbers are like 10x. and then I did this report and I sent it over. like, no, you said like 300 people a month, like it's not thousands. I don't know why you would think you're getting thousands, but the way you would think that is that your analytics is set up wrong. And so it appears like you have thousands. But in reality, people are getting double and triple counted. That's probably what I can go look at that. Anyway, so he thought, oh, was going on. I'm like, no, dude, sorry.\n00:48:32 - Tina Marie (profitdriversinc.com)\nWhat does this cost us per retainer?\n00:48:39 - mark sweet\nThe hard cost is, it's been 11 grand so far. Since when? Like this month, increasing the budget of a month. Well, then we're also paying like 10 for the death logs that I'm doing a lot. do anything.\n00:49:03 - Tina Marie (profitdriversinc.com)\nSo those are besides maybe employee referrals and doctor referrals the most the least expensive retainers.\n00:49:15 - Dan Ryan (danddcompany.com)\nYep.\n00:49:17 - Tina Marie (profitdriversinc.com)\nNo. Okay. And what's keeping us from getting to talk to him?\n00:49:25 - Dan Ryan (danddcompany.com)\nNot scalable.\n00:49:29 - Tina Marie (profitdriversinc.com)\nI thought you wanted to look at what he was doing so that you could know that. I already figured it out.\n00:49:38 - Dan Ryan (danddcompany.com)\nYeah. It's not scalable though. So you could go run in parallel. might do nothing or it might do something. But it's not it's the strategy that he's using is not scalable because it's it's keyword based. Right. So it's like the only way it's scalable is to expand state. That's how that's the only way to scale it, but it could be scalable in that I start running ads, and then I don't know how much he knows about AdWords, but I'll start running ads and find other keywords that work as well. So, but he's only running like a handful of like very low volume keywords. But they convert. So, I mean, that's, that's where it's at, right? I mean, these niche, niche keywords. So, are there others?\n00:50:36 - mark sweet\nMaybe. I mean, look, I think the most any sources ever done in a month was like 28.\n00:50:45 - Dan Ryan (danddcompany.com)\nThat I can recall.\n00:50:49 - mark sweet\nSo, you know, if they're at half that, but their cost is quarter.\n00:50:53 - Dan Ryan (danddcompany.com)\nYeah, exactly. It's like totally.\n00:50:56 - mark sweet\nI mean, that's the good math. You know, not saying, Oh, we had this lead source that was, you know, 80 month and now we're trying to figure it out what tends out of time. It's totally different.\n00:51:06 - Dan Ryan (danddcompany.com)\nYep.\n00:51:10 - Tina Marie (profitdriversinc.com)\nOkay.\n00:51:11 - mark sweet\nSo we can find a way to replicate it in a similar cost. I'm all for it. And yeah, we've got to keep it standing state by state. Like it's not efficient, but for whatever reason I keep choosing to do that.\n00:51:25 - Dan Ryan (danddcompany.com)\nWell, it's not inefficient if the math stays like that too, right?\n00:51:28 - mark sweet\nSo it's like yeah. No, look, the math's that low then quite frankly referring it out makes sense. Which is what we're doing right with quantifying Utah and Brad.\n00:51:40 - Dan Ryan (danddcompany.com)\nRight. Exactly.\n00:51:43 - mark sweet\ndon't have a problem being a referral firm in the states that I don't want to get into. If our cost requisition is that low?\n00:51:53 - Dan Ryan (danddcompany.com)\nYeah. And then it plays into the weather or not. It happens. And it's felt a firm thing.\n00:51:58 - Tina Marie (profitdriversinc.com)\nOh, you're in the main state. It's like.\n00:52:01 - Dan Ryan (danddcompany.com)\nRight. It's a different. It's a different ring to it. And you get a bunch of non lawyers to work upon the cases and you're done. Oh, these are easy.\n00:52:13 - mark sweet\nOf course not.\n00:52:20 - Tina Marie (profitdriversinc.com)\nUm, get some AI and non lawyers done.\n00:52:23 - mark sweet\nThere you go.\n00:52:23 - Tina Marie (profitdriversinc.com)\nMm hmm. Yeah. Um, so how would I see a report of, um, states specifically, matters by state by month over time. I don't care about the source, but just the state.\n00:52:44 - Dan Ryan (danddcompany.com)\nhmm.\n00:52:54 - mark sweet\nmean, that would be the first one. If you go back to the link, I'd send you the cases signed by month source and state, but you're saying, You would just then go and delete the source part of it.\n00:53:05 - Dan Ryan (danddcompany.com)\nOkay, yes.\n00:53:06 - Tina Marie (profitdriversinc.com)\nYeah, that is.\n00:53:10 - mark sweet\nThen filters. You're going to get rid of value, obviously. So delete that and go back into outline. And then keyword is source. And then run it.\n00:53:23 - Tina Marie (profitdriversinc.com)\nI only want it. Okay. Well, I really only want it just wanted for New Mexico.\n00:53:28 - mark sweet\nOkay, then do filters, add filter for matter. Oh, I'm Then just type in the max field or just let the max field. And run it. You're going to have is there's not enough cases really to see the hell a lot. Yeah, and you're still too new.\n00:53:58 - Tina Marie (profitdriversinc.com)\nYou have 13 in November. Okay, I just wanted to see how it's going, we're not there.\n00:54:16 - mark sweet\nI want to try to go up to at least 20 each day. And I think that will help keep us pretty darn busy.\n00:54:27 - Tina Marie (profitdriversinc.com)\nYeah. No, that's not the right one.\n00:54:34 - mark sweet\nJust 20 in the five means. We're in right now, but I said 100. That we had in Colorado and Nevada next year. Then it's about 140. 150 is just probably where we're going to settle for a little while while we play catch up.\n00:54:55 - Tina Marie (profitdriversinc.com)\nOkay, so we're running out of time. One of the things that. Uh we were talking about last week is just is the actual plan to be working towards a soco type business? Um, and I don't feel like what was the answer? What'd you say? No. Okay. So 100% now.\n00:55:21 - mark sweet\nAgain, if we find opportunities that present itself, it makes us to have that as a complimentary component of what we do, but I don't think that that's the best idea.\n00:55:30 - Tina Marie (profitdriversinc.com)\nIs that goal? Sorry. I didn't mean to cut you off.\n00:55:33 - mark sweet\nGo ahead. The screw factor is just really high. you know, I that's been a lot of time and just tracking with these other law firms and making sure you're getting paid. I don't enjoy.\n00:55:46 - Tina Marie (profitdriversinc.com)\nOkay. And that comes down to values. And that is is a huge part of choosing the model. Um, and where the human factor really matters because if you're trying to do something, you just hate. eight, you're not going to be good at it, not for very long. burn out fast, and then it just goes to crap. So that's important to know.\n00:56:08 - mark sweet\nYou can keep finding cheap sources, like it makes sense to push that out.\n00:56:14 - Tina Marie (profitdriversinc.com)\nPush what out?\n00:56:17 - mark sweet\nThe cases. So let's just say we find a way to generate cases cheaply in new Hampshire. So then it would make sense for us to retain those. If that firm will let us retain it, that usually is the law firm's biggest issue is not being able to retain well, setting it to them and then getting more for a whole piece of it. Okay. become an intake center more than anything else with some of our excess capacity.\n00:56:45 - Dan Ryan (danddcompany.com)\nhave a question.\n00:56:48 - Tina Marie (profitdriversinc.com)\nOkay.\n00:56:50 - Dan Ryan (danddcompany.com)\nSo when we talk average retainer value, is that net or gross? It's gross, right?\n00:57:01 - mark sweet\nIt's gross.\n00:57:03 - Dan Ryan (danddcompany.com)\nWhat's the net? The net's 40% less than that, roughly?\n00:57:09 - mark sweet\nSorry, so I've usually average attorney fee than average case settlement.\n00:57:13 - Dan Ryan (danddcompany.com)\nSo I'm just thinking, like, if I'm going to look at a vendor, is it profitable? shouldn't that be based on the net that I'm getting from that vendor, right? And that's just bottom. That's like actual profit, right? So I assume I'm pretty sure it is. You pull a salary, but then the profit of the firm, I don't know if you can do an S-corp and , but then that becomes passed through potentially, or you just leave it and you're running it right back to this, right? I'm doing this ad-serb, I'm like, OK, well, if you spent 40 grand, you didn't really make. So they're $5 a retainer, $5,000 a retainer right now. So it's like, Okay, five grand a retainer. Did you make any money? that a break, even? You know what I mean? So it's like, what is the actual profit? What is the right number to use here? probably isn't average value of retainer, because then you're with the employee bonus structure and the whatever. It's like, what should be the number that we're putting against this cost of retainer? I don't know that it should be the average retainer value. Unless that is the net, but it's not, right?\n00:58:38 - mark sweet\nRight. I mean, the problem is that number keeps fluctuating to some of what we can use in average, right? know, the more cases the attorney settles more to get paid. That part's pretty easy, because we've got a percentage on it. But, you know, we add more staff, more overhead, more rent, all those things.\n00:58:52 - Dan Ryan (danddcompany.com)\nRight.\n00:58:54 - mark sweet\nYeah, because right now, right.\n00:58:57 - Dan Ryan (danddcompany.com)\nSo they're 5k a retainer. then I'm like, then I started doing the math. I'm like, oh, but that's 118,000 revenue. Oh, that works. But then I'm like, oh, wait, am I doing math magic here? I'm not. I mean, to a degree, it's some math magic. And then like you're saying, as things expand, that profit is the overhead goes, keeps incrementally going up and then the profit's going down. So anyway, go ahead and think about that.\n00:59:28 - mark sweet\nNo, that's your word negative 500 grand so far. Okay.\n00:59:33 - Dan Ryan (danddcompany.com)\nSo what do we what do you want to do about ads?\n00:59:35 - mark sweet\nCertainly if I grant a retainer. Yeah, that's what they are. It's fine if we're signing them off.\n00:59:41 - Dan Ryan (danddcompany.com)\nYeah, we are. So I just I just pull checked everything. Yeah, I double check everything. And I think moving into these other states is gonna like we got where two referred out one sign case off of five leads in Missouri right now that started.\n01:00:00 - mark sweet\ndays ago. Watch the referred out to see if it actually signed or we just referred it out just because this is referred out does not mean someone signed it.\n01:00:10 - Dan Ryan (danddcompany.com)\nHow do I know when it's actually right when it actually says referred out in line five or no I don't trust that. I literally just looked at them all in two word retainers that ended up getting referred out.\n01:00:26 - mark sweet\nSo I just adjusted them Edward Gilroy, which is the GMB and it's referred out. So referred out to Michael Ross 10.31 a.m. I don't know if he's going to sign it or not. So that's not how do you know when it's actually referred out? There should be. I'm going to show you signed it so we can track it.\n01:00:52 - Dan Ryan (danddcompany.com)\nSo should that refer out not even be it should be like sent to be pro like there It's like a step that it's, it's in before it's actually referred out.\n01:01:04 - mark sweet\nCorrect.\n01:01:05 - Dan Ryan (danddcompany.com)\nYeah, it's very good.\n01:01:07 - mark sweet\nThat's not clear. Like, yeah, like, we've tried to send Jeff. He doesn't want it. No, we're saying like, I mean, I want it. So it's, yeah, we just don't know at this point.\n01:01:18 - Dan Ryan (danddcompany.com)\nSo we should change refer it out. We sent for referral and then then when, then when it comes back in. What changes.\n01:01:29 - mark sweet\nSo what I was, you do know, he preferred out the same, but once someone signs it, don't want you to assess to like the preferred signed and we.\n01:01:37 - Tina Marie (profitdriversinc.com)\nOkay.\n01:01:38 - Dan Ryan (danddcompany.com)\nOh, good. There you go. Yep. Yep. Yeah, because it would, yeah, you're right. You shouldn't change refer it out. Got to get that implemented with Isaac.\n01:01:49 - mark sweet\nI'll work on that.\n01:01:50 - Dan Ryan (danddcompany.com)\nYeah, crack that whip.\n01:01:52 - Tina Marie (profitdriversinc.com)\nYeah, we keep working on expanding states, which were as a work in progress. Okay. So anyway, It just we're done for time, but let's keep thinking about do you want to sell like what is what's your three or five year goal. And I don't want to nail it down right now. I just really want you to think about it. And also, what are the nuances of those goals. what are the things that would make them shift for you. Like how Solid are they because I don't feel like anything is super solid right now because there's so much that we're working on that could change kind of the path that you want to take. But it would be really good to actually write down. And where where you'd like to go with what the ideal thing is what's the most plausible, but also kind of take into account what you want out of the business, what you want out of your work. So not doing the Salko model. There's a reason for that. because it would drain you like the cost of it is too much as a person. There's also the reward, you know, that like you've built a culture of people that enjoy working together, you guys do some fun things like there's something that this business gives back to you on probably an emotional level, but we don't really have a lot of those conversations and I think that but what we do what I 100% know is that those types of thoughts, whether we give voice to them, specifically and out loud, they impact the choices that we make and the past that we take and how we manage the business. And so I think that it's time to have one of those types of conversations again and just really be real about what you wanted to look like, what you needed to look like, what on a numbers level, but on a personal fulfillment level.\n01:03:59 - mark sweet\nSo if we kind of slate Okay, next week for that type of conversation, that'd be great. Okay.\n01:04:06 - Tina Marie (profitdriversinc.com)\nOkay. mean, proverbial three year plan kind of thing. Oh, no.\n01:04:12 - mark sweet\nYou can move in the goal post no matter what it is. Let's just what it's just here you are.\n01:04:20 - Tina Marie (profitdriversinc.com)\nYeah, but it's just a temperature check, basically. And I'm just making sure that we're taking into account the things that are affecting what moves the goal post and and just making sure everything is working together for the best. So that's all there's nothing like wrong. It's just more that's another data point, which is kind of the personal stuff behind it that is you're the driver, you're the visionary. So thinking about how you're feeling about all of it and any kind of changes that might have happened since we started talking is important. And we should be doing that more often. It's just that we get into the weeds a lot on these calls and the combined version of it with Dan and focusing on that, there's a lot to go in the three-way conversation, so I don't think about it as much because it's a different kind of dynamic that I have in this call versus like any other call, but it's definitely time to come to that type. So next week would be good. Okay, let's have good week and we'll talk to you soon.\n","contentPreview":"00:00:08 - Tina Marie (profitdriversinc.com)\nYes, how are you? Yeah, good. Good enough, you mean?\n00:00:18 - mark sweet\nYeah, it works. He's not so fluffy right now, but he's good. He had fun this wee...","processedAt":"2025-05-04T03:40:52.620Z"}