{"fileName":"Done Transcript for D&D Co & Profit Drivers - Weekly Review(7).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for D&D Co & Profit Drivers - Weekly Review(7).txt","type":"transcript","priority":"medium","content":"00:00:17 - Dan’s iPhone (danddcompany.com)\nHello, is this thing on?\n00:00:19 - Tina Marie (profitdriversinc.com)\nIs this thing on? Yes. Where's my volume? My kids are working on the. It's evil for us and they're very noisy. So I had to be somewhere else. They're on my left.\n00:00:35 - Dan’s iPhone (danddcompany.com)\ndon't know. Four hundred and twenty six away. He wouldn't. happens. Life. God.\n00:00:42 - Tina Marie (profitdriversinc.com)\nDang it. I know. How is Dan today?\n00:00:48 - Dan’s iPhone (danddcompany.com)\nDan is walking to work right now. Walking to work. Okay. Getting the in. Now I walk a couple of times a week. It's just easier. How far is the office? 14 minutes. So would I know the actual distance walking it's 14 minutes. Yeah, it's like, yeah, around 14 15 minutes.\n00:01:13 - Tina Marie (profitdriversinc.com)\nThat's nice.\n00:01:13 - Dan’s iPhone (danddcompany.com)\nDepending on my pace.\n00:01:18 - Tina Marie (profitdriversinc.com)\nThat's good. When did you start doing that?\n00:01:22 - Dan’s iPhone (danddcompany.com)\nOh, well, I'm talking about it. Since everyone's been driving.\n00:01:27 - Tina Marie (profitdriversinc.com)\nlittle bit, huh? Yes. You didn't start driving right away though, did she?\n00:01:34 - Dan’s iPhone (danddcompany.com)\nNo, she got her license last October. Listen to that. Yeah, so she held off. So actually she had to wait. So she got her license like October 10 or something. So soon after that. But I, you know, walked in a couple of times in between whatever reason.\n00:02:00 - Tina Marie (profitdriversinc.com)\nat that, like, moderate climate so that you could walk frequently.\n00:02:05 - Dan’s iPhone (danddcompany.com)\nOh my god, this is covering that with Mario. Like, you don't understand how you are. Wait till you go somewhere else.\n00:02:15 - Tina Marie (profitdriversinc.com)\nYes, that is the being about existence right now. crazy weather.\n00:02:20 - Dan’s iPhone (danddcompany.com)\nYeah. Yeah, it's actually hot here today. But like for fear, which is not really hot.\n00:02:27 - Tina Marie (profitdriversinc.com)\nLike, what is it?\n00:02:29 - Dan’s iPhone (danddcompany.com)\nOh, I don't know.\n00:02:32 - Tina Marie (profitdriversinc.com)\nI would say it's the 80s. I I'm going to look at a brand name. I get cold in the 80s. like it in the 90s. I'm happy in the hundreds.\n00:02:44 - Dan’s iPhone (danddcompany.com)\nYeah, I'm worried about that or the whopping 70 for it.\n00:02:49 - Tina Marie (profitdriversinc.com)\nI'm like, oh, that's hot for here.\n00:02:51 - Dan’s iPhone (danddcompany.com)\nThat is hilarious. That is hilarious. Um, how where have you gotten on the Marsha stuff? I'm like halfway through another one. Start the wrong one. So I'm gonna try to wrap it up today and start another one. This one's going sort of quick, so it's not. Yeah, so this is still like planning, understanding like it's like deeper into the planning portion of the framework, which is good. So I was like, I'm just gonna go through it all, just to don't miss anything. But yeah, like halfway through. Probably like six more videos, but these ones are all fairly short.\n00:03:46 - Tina Marie (profitdriversinc.com)\nAnd what are we doing? Good. What have you like, have you had any aha since last week?\n00:03:58 - Dan’s iPhone (danddcompany.com)\nIs Dashboards like this? yesterday. His dashboards are sick. I'm oh my god, they're so good. So he'll make like, he's big into Ikea. It's information, questions, actions. And then he has this other thing that he calls eyes on the journey. So the journey would be like a sales page, right? So he his argument is that there's a journey on the sales page. It's broken up into three eyes. So eyes on the journey is like a little too far. So it's like interest, no, impression, interest, interaction, something, something. And what he does is he sets different events for each. guy. So impressions, super simple page view, and then interest might be, they scroll 50%, and then the next one, it's not what I thought, but that won't be, they hit, they saw the pricing table, and they were there for 10 seconds or whatever. So he was firing these events for each of those things, and then he has like a visual funnel in Looker Studio of that page, and those steps of the funnel with like a breakdown of, hey, X percent did this I, then this I, then this I, and then that's on the right hand side, and then on left hand side, it's all the metrics broken out, so that you see like, oh, your conversion to interest, you had a hundred visitors in your conversion to interest walls. 12% of whatever it is, so that's all correct because you're supposed to be forecasting that already, right? That's part of your plan. Part of your plan is okay, you're either gathering the data and saying these are my baselines and then you're going to try to beat those. That's basically where I'm going to be at. So you just set all this stuff up and start capturing and then recording and learning. Like, hey, these are, this is my opt-in rate right now. Well, if I increase that, the action would be like, I want to increase my opt-in rates. Okay, great. this is what it is. What are you going to do? the action we're going to take, and then what's the outcome that's affecting. But he does that for multiple journeys. So there's like the sales page journey, the cart journey, the opt-in journey, the membership side journey. See, it's all these different... dashboards set up and they look fantastic I'd love to see those so Andy gives Andy gives to you he's like here's all the graphics here's how you build them but I've got no part I showed them to someday they were like oh my God who is this?\n00:07:22 - Tina Marie (profitdriversinc.com)\noh yeah I'll show you yeah I can give you access to the course to it that's the thing about being the type of people that we are that kind of necessarily are jacks of all trades like we get into some stuff but you can't do all the things really well all the time but when you're meeting the business you have to do a lot of different things like so for example split testing heat maps using split testing software like improved or what was the other one huh yeah visual Yes, so those are things that I used to do and set up and then ended up with, so I was doing them in coffee shop millionaire, well, what year is it, 13 years ago? Or before, a little bit before that, and then the, so that was Anthony Trister, and then Manish Punjabi, which nobody really knows. known kind of behind the scenes like you. And then so Manish and I were working on split testing stuff and he ended up partnering with Justin Christensen and they created conversion fanatics and I was working with them in the beginning. So that was like stuff I did a ton. On the same time I met Mercer was speaking at a little tiny mastermind event by this guy named Jared Elvitch who's also very like hush-hush but was like a mentor to Ryan Lee. The what do you call it? I don't know almost like incestuous bar. Oh yeah early days. Yeah but this so like when I ask you numbers and data and stuff like that I we only spend an hour together week that's the one thing that I kind of miss in being in the businesses more is having more time to really like look at data, set up the systems that capture the data. You don't really, you don't have an optimizer. And especially now, I think, I almost think that that's a role that everybody everybody should have it. But after, you know, at least one million, but probably more in the two four million kind of optimizing. Obviously, you can get there better. But I'm also thinking about the logistics of how many things there are to manage in a business and how much skill a person has when they're first getting to that, you know, even just breaking that six figure mark. There's a whole level of understanding difference between finally getting to that threshold and finally getting to the seven bigger threshold in terms of comprehension of the not nuances, but the facets of business and online business. And then just getting into the next level of it. So to the point of like, you wanting to increase your market share one percent and having determined how much that is being at the, you know, between three and four million spending time doing this, if this was the main thing you accomplish this whole year, is having a system like a really solid optimization system for all of these aspects, right? So there's the landing page, the checkout page, which sometimes is the same depending on what you built it with. Um, if there's an order bump, but then even the thank you page and the download page, which you've been diving into are people even getting their downloads, that type of thing. There is so much, you can't optimize what you don't know to, right?\n00:11:47 - Dan’s iPhone (danddcompany.com)\nLiterally, I was just going to say and people tried to do it all the time. Yeah. Yeah. Like he calls it, he was calling it like he runs into people all the time. And he's called it the curse of a good offer. So that guy's getting offered a throw. up and they throw it on Facebook and they're spending 500 and they're getting a thousand. And they spend a thousand and they're getting two thousand. It's like, then they're like, oh, we got it. Then they spend 10,000 and they get nothing. And they're like, wait a minute. Something broke. They don't know where to look because they were never looking. So, yeah, that's true. So, I don't have that problem. The problem that I have is that I'm not talking the thing. I don't know where new customers come from, but that's my problem. And that's my also the solution to my other problem is how do I get more market share new customers? How do I get new customers? don't know. If I sell one the second, then I can try to sell the first.\n00:12:55 - Tina Marie (profitdriversinc.com)\nYeah. So, well. keep digging in.\n00:13:02 - Dan’s iPhone (danddcompany.com)\nOh yeah, I just got I got some stuff I'm gonna wait for Mushy to do some stuff. I'm usually soft change her API so he's writing a bunch of our legacy custom code that we have and then when he's done with that he's gonna help me do this custom stuff that I figured out but I just got to wait for him to give me the high sign which could be like a little bit too but I should be further along. Good thing is going through these courses I haven't been like oh I'm doing it wrong where I'm coming.\n00:13:45 - Tina Marie (profitdriversinc.com)\nYou haven't been doing it wrong but because you do keep getting muffled in and out and like garbled.\n00:13:51 - Dan’s iPhone (danddcompany.com)\nJust that I haven't changed I know the thing right it's like I need to figure out where new customers come from.\n00:13:56 - Tina Marie (profitdriversinc.com)\nI don't think that's going to change. And they're and I don't know the answer so Now I might be surprised by the answer How much time do you figure you've been able to spend each week on this stuff on the Marshall stuff on just yeah At least six eight I don't even know how to like I've got kind of double questions in my head, which is Do you have any desire to increase or maintain that pace and at that pace? At what point do you think you'll be done at least getting through more stuff and are you building as you're going through it?\n00:14:53 - Dan’s iPhone (danddcompany.com)\nAre you just absorbing? There's been nothing to build yet. There's been no You hold method. That's next. I think next you go in and you actually set up Google Analytics 4. So I think that's going to be me going in, watching all this stuff just to see that I miss anything, right? For instance, he talks about cross domain tracking. I know I used to have that in GA. I do not know if it's in GA 4. I also do not know if it's that I'm saying or different or I don't know what. So if anything like that's missing and then I'll go implement it or it's there and everything's there and then I'll just have a better understanding of what I've already done. So I just set it up and I'm like it's working. I don't know what I did. I got used to work. But like there might be, oh this is like Keith's run out some words for like elements of GA 4 and I was like, oh I didn't know it called that. Okay. So stuff like that.\n00:16:02 - Tina Marie (profitdriversinc.com)\nOkay. I don't think I heard the answer to, well, I don't.\n00:16:09 - Dan’s iPhone (danddcompany.com)\nDo I want to do it more? Yeah, sort of part like that quote book. I should have, I was going to take a picture of the quote so I have it. So I'm going to murder it again. But the quote this week was like, you should only be working on high value tasks. Yeah. One of the high value things, so every day I get up and I read that. I'm like, yep, I gotta stay on this Mercer tracking. So, I mean, I would like to do more of it part of the part of the problem right now. No is this puppy. I get saddled with this puppy all the time. I'm like, guys, you're killing me with this puppy. Like, yeah, she's very cute, but she's, she's a huge distraction. Like, what are you doing? What are you doing? So I just have to break away and get something out of or whatever. My child brought home a baby duck. Oh boy.\n00:17:14 - Tina Marie (profitdriversinc.com)\nAnd she got she tied up for me and she did for a few days and then I went into her room. I was looking for something and I heard this little squeaking. There was a duck. A little fluffy yellow adorable duck that either raccoons or dogs will eat.\n00:17:36 - Dan’s iPhone (danddcompany.com)\nSo what's she thinking?\n00:17:39 - Tina Marie (profitdriversinc.com)\nYeah. No, I'm like, you don't get to keep it here. But in the meantime, she's waiting until she goes to her dad's for the weekend and she can keep it there. But but anyway, I was going to ask. Speaking child. Why are you bragging about that right now? Um, I had a question. Oh, okay. So, um, I don't think anybody's ever talked to you about. Staying focused on high level activities before.\n00:18:15 - Dan’s iPhone (danddcompany.com)\nyou sure?\n00:18:21 - Tina Marie (profitdriversinc.com)\nI know I've talked to myself about it. New content.\n00:18:25 - Dan’s iPhone (danddcompany.com)\nDan. Yeah.\n00:18:28 - Tina Marie (profitdriversinc.com)\nUm, like, is that a leveraged activity here? Like, I don't know. There it is.\n00:18:34 - Dan’s iPhone (danddcompany.com)\nI mean, that's my argument for me doing it. Like, I mean, I already tried this, right? already made my classic lunder. had Eric go through the GTM thing. He went through it. To what end? But did you learn that thing? You get like, no? So, it was like, I can't, I mean, this is the whole thing, right? When I look in the Mercer, and watch Mercer does, I can then go 2 plus 2 equals 4, right? I can then look at whatever business it is and go, oh, I know how I can get that there, because this is how this one works, and that's how that one works. So, I'm watching this stuff yesterday, and I'm like, oh, I would love to know all this about the Wolf Hurry Sales page. I would love to know this. What is happening? Because that's a leverageable point. Hey, have these numbers. We start to forecast and say, and his forecasting is crazy, too. We forecast, like, impressions to the page, opt-in, right, month. We'll have the forecast, and then it's out for 2 years in this spreadsheet that scrolls sideways forever, and at the end of every month. They fill in every metric, they go, how do we do this in turn? Oh, well, look, our impressions were off. Bump-a-bump. Meanwhile, they can go to the report, the eye on the journey report, or whatever they're forecasting, and drop a hat and go, well, how are we doing today, right? So I could do the today thing all day long and know that we're on track, off track with another 71. But I don't look at impressions. I just look at the outcome. So I'm like, oh, it would be interesting to see, like, our impressions changing over time. Like, I can go look at that, but not in an easy, digestible, snapshot-y, dashboard-y way. So I'm like, yeah, all right, that would be good. And then it's super repeatable, then it just would become, especially for me, because all these businesses were the same in a way. It looks like, oh, yeah. If I just build this once, learn it, then can I then just task it and say, I need you to go build an eye on the journey thing for this. And they know, oh, it's all these events, we've got to set up these events. That's the part that I don't know now, but it's JavaScript GTN, like 90% short, which I have personally never used. But it is a thing. Oh, no, we have used it. We've used it for the video time that we did. That's it. Which we could put in a dashboard. You what? Which we could put in the dashboard that we don't. It could go on a dashboard. It doesn't. So for me to really see what's going on with that, I feel like do these weird reports and an active campaign and like, it's not exactly what you want to see, but it's a wave. for me to use that data to find out the best way.\n00:22:04 - Tina Marie (profitdriversinc.com)\nIt's I'm just kind of contemplating the path to this because. So, and I'm trying to think about because you had wicked reports for a while. Because I asked questions about this stuff many times and the question will be like, I don't know, like if I ask a particular metric about a website or the sales page or whatever, where's this, what's this number and I don't know. We've had conversations about dashboards and what I'm trying to figure out is what I. And this is not necessarily relevant for you because we're here now. But like, and I hate when I have so many questions going through my head at the same time and so many thoughts because it can't come out and then they have to be linear, but they're not linear anyway. But the knowledge that. It's hard to impart from my mind the visualization experience that I have of seeing this type of data and having built archaic systems and spreadsheets to track this stuff for myself for different things in the past and then helping somebody, not you per se, but let's say it's a maybe, well, and it wouldn't matter because you'd be doing this for them anyway with basis. But that every person running any kind of business online needs to have a dashboard with basic metrics. to me, what Mercer is teaching is so far beyond what everybody's doing, but it's also basic. Like, these are basic KPI. How long are people there? How many people come? Where did they come from? from like, this is what white heat maps have been around for so long, but almost nobody uses them. Where are they getting paused on the page? And then, but looking at all of the pages that matter, so landing pages, all of the sections of the page that matter, how like, they're still not really a good provider of that for smaller businesses. I'm trying to think Neil Patel has stuff, but he's not affordable to everybody. Mercer is not, is so complicated that most people aren't going to go through this or understand it even if they do, but they'll be fried before they even get to most of it. If there was such a need for a, don't even know what you would call this, but like, the website optimizer type person, like a person who is just about the data, who either directs or does all the work, I say direct because they don't necessarily need to be the one that installs the tracking codes and installs the heat map codes and any of the code on the pages, but they need to be the one that says I need this code, they need to be the one that can validate that it's working because the reports are coming, they should be the one that would be kind of masters of dashboards and knowing what types of dashboards we need, that there are different types to look at so you're not looking on a ton of data like we've been doing with Letify, like there's the intake dashboard and then the matters dashboard. Anyway, thinking about the, which is anyway, just how there should be a role whole for you. it starts though, it starts like this, it starts with knowing what you don't know from first 10 experience by learning through it and going through it so that you know how number one's even just create the like rudimentary version of what is needed but then so you're informed and know how to hire somebody for this role because you have enough knowledge to be able to engage in a conversation where you can evacuate it and know what they have access to but anyway that was a really long way to get at there's there's a way that we need to leverage this moving forward and apply it to anything that you're working on any project that you're working on and then also for me in the back of my head like pretty much anybody I'm working with needs to be doing something to this degree and I have not done a good job of Being able to relay First of all, what's even possible because this is not new the stuff that Master's talking about is not new He's been talking about the same stuff for at least 13 years.\n00:27:10 - Dan’s iPhone (danddcompany.com)\nWe have this At breakfast one day But it's Right the great part about his stuff like my stuff is He did it for himself So he's like, this is exactly what we do and this is and we learned our way into this. So I'm like, okay You're right. mean, this is like a total bolt-on to basis and You know, I would the reason people Don't or can't offer this as a service really is like good luck Good luck going into some random website and and being able to just easily At all this code and at all that like no Not gonna happen Yeah, and I actually think that's too hard.\n00:27:59 - Tina Marie (profitdriversinc.com)\nIt hasn't been streamed by yet is because I doubt you would remember me bringing it up in the beginning, but one of the things that we talked about in the beginning when we started talking about data is how unreliable it is, which we did, I know you would remember that part of the conversation, but in that one of the ways we could validate it would be that all the different data sources disagreed with each other. Like visual or website optimizer versus improvedly, different stats, even if we've got both the code on there versus Google analytics versus wicked reports, whatever, nothing ever reported the same thing. So you know that there's discrepancies and then who's right? Is any of them right? And then if they're right, what's getting in the way.\n00:28:57 - Dan’s iPhone (danddcompany.com)\nIt's a bigger problem now than ever. That's the that's the thing that this advent of GA4 and the advent of these pixel blockers or whatever is that attribution has become more difficult than ever right so but my argument is that if you are in a world my world where I can drop a first party pixel I am fully integrated with I have the full integration with segment tricks 99% of people can't do either of those so I'm like okay I have all these things I'm the dude that Mercer described as I have been a collector like I'm collecting all the data and I'm collecting the data that has meaning but I've been as you know as I've been complaining about forever like I can't connect the dots like I can't see the things that I want to see and now I'm like oh this is but this is Show me some things that I didn't know before like, okay, I can get some data into Metarick and I can get some data. So I think between like GA4, Metarick and Segmentrix, which might not even be needed, but it's there. I'm like, I'm going to be able to get an attribution picture that no one else can get. And then Mercer, I'm positive, is going to nerd out on that. He'll be like, what are you doing? And then, again, that becomes something that like, oh yeah, no, you can only get this with basis, right? That's it. And it just, it's like things are getting more complicated. And so, and if the data becomes less reliable, then you can't make data-driven decisions. And as we know, if you're not making data-driven decisions, you're really just guessing. And guessing only works some of the time, most of the time does work.\n00:30:59 - Tina Marie (profitdriversinc.com)\nYeah.\n00:31:00 - Dan’s iPhone (danddcompany.com)\nAnd like the good job is in the click funnels and the go high levels of the world like they're not gonna solve it Yeah, but and then this is not meant for It's not meant to be like a mass product, right? I told it's funny that the development like to the general public Yeah, well, yeah, I mean it's it's not Truly scalable like the more I think about it as I'm going through as far as I'm oh, the price needs to be even higher It should be like it should be prohibited to get on it And like no if you want to get on this you have to understand What you're getting on and it's like you want us almost?\n00:31:43 - Tina Marie (profitdriversinc.com)\nshy away the people That can't that can barely afford it because they're just playing and not get it or whatever Yep, well and because it's a it's a Longer runway to And that means that there's constantly a burden of having to prove the value, which is why they're complaining, right? Because if they knew that they were putting in a dollar and getting out to, nobody would say no. Right. when, and this is, so there's two components to it. Number one, people that are doing, you know, multiple seven through the gears versus not less than that, there's, there's corollary data points, which is not just their revenue, but also their traffic. And in order for to collect enough data to be relevant and, and to be able to analyze it and get something useful from it, there has to be a significant amount of traffic. Or you have to wait a long time, but either way, so, so when they've got more volumes, they're doing more cells. They probably have a lot more traffic, which means we get to the data faster, which means they can see the correlation faster. And then all of that data leads to a split test, right? So here's our baseline. What's the point of doing that if you're measuring it, if you're not going to improve it. So then, you know, and if you're going to improve it, you don't just do something and think, I know for sure it's going to work, it's a split test. And then you run the test, but obviously there for it to be conclusive, you've got again, volume. So that's another reason why only offering it to people who have a certain level of success, traffic, sales, whatever, would be good, especially if you're just like, I don't know, proving out the concept, getting case studies, Glenn never had enough traffic. Jody out, he didn't even have What's that?\n00:34:00 - Dan’s iPhone (danddcompany.com)\nthink he did. Well, he didn't hit a personal website. Yeah, totally. Well, I've got like, they're like a, they've got the right stuff and they're on it. They'll be a good case study. Joe, like with Joe, it'll just be like, what are the metrics that matter for a podcaster? once you know what they are, right, like you leads and listens, whatever it is, then you build the dashboard around that. Once you know, I mean, you're going to have like this funk of JavaScript that you're going to par you's over and over again, you're going to get chat GPT to be your little, you know, I have Eric building these assistants where it's like, hey, this is a vanilla JavaScript assistant. And then this one's a Gutenberg JavaScript assistant, and then this one's going to be a GTN JavaScript assistant. And you just keep running the same types of code into the thing. You're like, all right, I really wish you those could get smarter, but they really can, but whatever. I mean, yeah, it's like, You can, if it works, right, of course, you know me, I'm like, yeah, we'll see. I mean, it all makes sense, but like, I need to see it, I need to see it, and I need for it to have meaning to me. And I obviously know the power of data, right? So it's like, oh, okay, that's the other thing with other people, like, they don't really get it. Like, I was just helping someone out. And they're like, yeah, we're paying. They said, like, oh, God, we turn off the ads. We're paying $250 a lead. I'm like, how do you even know that? That's what Facebook said. Yeah, but is that true? Oh, I don't know. When I looked at like their CRM. And I didn't tell them this, but I like, I did some quick math and I'm like, I'm at 90. So I'm like, but I'm not sure. Like, I have to really like, you know, do a little scrub or whatever. D do bit. I'm like, yeah, whatever number Getting from Facebook is wrong and they killed their ads and then 48 hours later like we got to turn our ads back on Which never was Yeah, and I'm like, but you're gonna Do you even know which ones converted and they don't mean I know they don't cuz I looked and I was like you guys aren't Bragging anything. Oh PS. know, you've had this was great. I mean you've had five hundred inbound calls And it looks like everyone I looked at no one answered And they're like really I go What's going on? Like where are those going that no one answers 500 calls in 60 days? Like that's a lot of calls per day. Sorry, right? So they're like, oh And that's the word that sometimes that's a good answer and sometimes that's a bad answer in this case.\n00:36:52 - Tina Marie (profitdriversinc.com)\na bad answer You shouldn't know I Was thinking you know if you get to the point to You Well, whether you have this analytics type dashboard thing or not, either way, if you get to spelling bases, I think the best thing would be a VSL because it really is a visual concept. think about all the exercises that we've done and the reason dashboards are so powerful. Like, we can talk about the numbers, but unless you're a savant really processing those without a chart, know, kind of seeing visually a relationship between this number and this number, it's hard to wrap your head around it the first time you see it, the second time you see it, the third time you see it. So if you're just trying to explain to somebody like having a sales conversation, they'll see, you know, just a portion of it, whereas if You say, like, before we even talk about it, you've got to go watch this video. You can't get on, you're not allowed, you don't get access to this, I know you've heard great things, it doesn't matter, you can give me all the money in the world, you cannot come here unless you watch this video and the video, like, we had the leaky bucket kind of visual that you've made to explain that to people and that was an aha moment for them. Now, if we could show something and I would have, you know, Joe used to make videos like this, there are definitely people who can make these videos that we could outsource it to, basically show them two or three different scenarios where, you know, this is your business, this is your traffic, and these are your steps on the dashboard and this is what business A has, what business B has, what business T has. And this is what they did, and then you watch them, watch the numbers change. And then you can tell the story where a business A had no idea, like these numbers are changing, but business A doesn't have a dashboard, doesn't track it, has no idea what's happening. so makes a decision by guessing, and it's the wrong decision because they didn't know why the numbers were, why they, you know, what they were, whereas let's say business B, same exact person has all the data, or maybe business B has half the data, right, makes a decision, same thing, doesn't go right because they're wrong about where the data, because they only have half the data, it's not accurate. And business C is like, oh, I can see everything, here's the problem, let's go fix it. And we've done X amount of split test because we've been tracking this. And so we know that we'll have\n00:40:00 - Dan’s iPhone (danddcompany.com)\nyou know better impact changing the headline or the image or the call to action or whatever but basically creating a video showing it could be like one video or multiple videos could be case studies but another could be like i'm talking about going after 10 million 20 million 30 40 50 million dollar businesses and charging a premium price premium um yeah i think that yeah i'm starting to think like so funny because a perfect example of that right there is Dave Asbury right so Jenny is doing all the Dave Asbury stuff now running his stuff and their setup is so clued it's not even funny what is that word oh messed up flute means messed up yeah so yeah so it's it's all Stop it. It just doesn't make sense and it's because it it's like it's the classic like you went It was it's just all inherited And so they just keep adding on right to Christmas tree and on to the Charlie Brown tree they inherited when it's like oh boy So the day she's like we're moving everything to Shopify. They sell like single products like that is not what Shopify is for Shopify is not made for that and then it's like They're they're not they don't have all the right data like even though Jimmy's very day-to-driven They don't have all the right data. I'm like dude. You should be on WooCommerce like WooCommerce and funnel kid because there's no limit That's my argument. That's the argument that I made to Frank the WordPress bill, but he's like give me the back story Tell me what you're trying to build and I told me he's like oh, Yeah, he's like you sound like you know what you're doing like you sound like you really he's like you So I'm like, you know, a lot about business. He's like, I know a lot about teaching stuff. He's like, I suck at business. Maybe you could help me better at business. like, yeah, maybe. But it's like, I think that the path is like, you go through Joe, right? So it becomes a tool for Joe to make Joe's coaching business easier. And then it's like, who's another Joe? Maria. Maria wants to go build all these customer automatic customer things.\n00:42:32 - Tina Marie (profitdriversinc.com)\nI could build an automatic customer starter site. Automatic clients, Alan.\n00:42:37 - Dan’s iPhone (danddcompany.com)\nYeah, yeah, yeah, automatic client. I could build an automatic client starter site that's just in the can. You launch it and reskin it for your next client. So then she's she'll get all the she wants and then some, right? then it's like, oh, who else is that? could go to like Greg Merley's and be like, hey, you should just be sending your clients to me because we can build because it's your designs are great, supposedly. don't know if they are, but he does good work. This platform is great. Yeah, exactly. I don't know if they really perform that well, but you can find out really quick by putting on a platform that gives you that data. So then it's like you having these other people sell it for you in the beginning. And I think to your point, it will eventually bubble up, right? So you could go like into Allen's group or go to Allen and be like, Hey, I'm doing this. But it's like, it's like, it's like, it's not open to the public really, right? It's like, we're, I don't want to deal with people. Like, I want to give a good service and good product to good people, right? Cool people, cool things, cool people. I'm not, I'm not trying to run around and get 10,000 clients because I just don't want to deal with that. But if I can get like, 10,000 clients, like, yeah, exactly. And then some people are going to, have are going to be a lot, they're going to need the funnels and the bop-a-bop, they're going to need the whole thing. And then it's like, yeah, then maybe you could append coaching or, and at that point, if you're not even coaching, you're just, it is, because you're like, you should be collecting this data, right? But you need to get, you need to expand what you're doing in analytics, because right, what you get is just the basic. But you want dashboards like this. Oh, okay. Well, yeah, that's, it's, it's a one time fee of $4,000. And we set the whole thing up for you. And then it's tracking all that stuff. And here's how you read it. And then that's it.\n00:44:37 - Tina Marie (profitdriversinc.com)\nBut, I'm set up of like 10,000, like it's just, whatever, yeah, whatever it is. mean, don't even know how to price it, because I don't even know what it is yet. And like, I would not be looking in the, I am world. I'd be looking at doctors and lawyers, like, where are they congregating?\n00:45:03 - Dan’s iPhone (danddcompany.com)\nBut it's not that I am world is on saying no, no, I know, but the other day I was thinking like, I mean, it could be it could be like these coaches in the world are not the lame ones, like the ones that have real businesses, like not the one that I left, I mean, I don't have a room business. I left a hilarious comment on someone's ad today. Some woman's like, I just can't stand these people. She's like, if you want to get my $50 million a year business . If you were making $50 million a year, you would not be running Facebook ads about your coaching business. Ma'am, give me a break.\n00:45:39 - Tina Marie (profitdriversinc.com)\nWhat do you look like?\n00:45:41 - Dan’s iPhone (danddcompany.com)\nYou look like a bottle blonde that is using 20 year old photos on your website, like a miss. You're not the same person. I can't remember her name. It's, I've never seen her before. And I saw like two of her ads today and then I just left a comment on her. was like, I can't help myself. But, but it was like the click funnels awards, the lame, the stupid, um, sign with the slogan, I'm like, really? I'm like, this is like a textbook. I am scammer. Like, where's the Lambo? What are you doing? Yeah, never, never be gone.\n00:46:19 - Tina Marie (profitdriversinc.com)\nemail version of it is it repulses me personally because, because I see behind it, because I know what game they played.\n00:46:30 - Dan’s iPhone (danddcompany.com)\nUm, anyway, I'm just so never them. It would be never that, right? like, it's not for you. So, and that would be very easy to figure out. You just go look at their website like, yeah, no, this isn't for you or you're not for being one way or the other. Um, but it's like those, those automatic customer funnels, like they can go either way, they can either be scammy or not. Um, yeah, it's like you get to. you get to decide. That's the whole thing. mean, they can't just buy it. It's not a do-it-yourself thing. It's never going to be. But I was thinking like two days ago, was like, man, really, what are you replacing? Like, you're replacing Upwork, you're replacing way more than just WordPress and Kajabi. It's really not on par with those. It's on a whole other level.\n00:47:25 - Tina Marie (profitdriversinc.com)\nTherefore, it should be priced on another level. But it's more than that. It's not about what are you replacing it because if you go with that logic, then they're going to try to do that math. And that is not really what the math is. It's like you've been walking around legally blind and somebody finally gave you glasses that are your prescription. And now you can see everything clearly and sharply. didn't have the glasses before. So you're not replacing something.\n00:48:00 - Dan’s iPhone (danddcompany.com)\ngetting something life changing that literally changes the way you see the world it's going to stop you from tripping on everything and you know like it's just the correlation is different it's more i mean i was thinking more like it's the benefit argument right what are the benefits the benefits are what you're saying you're going get this better knowledge into your metric you're going to get a better faster sigh you're going to have to you'll never have you don't have deal with outside devs ever or deal like that's gone right so you're getting time back you're getting you're getting all this up oh what are all the benefits now you could throw away the comparative idea like oh it's it benefits like this over kajabi rather than replace kajabi you'd say hey you don't have to deal with outside developers and outside designers like all that goes away you're going to save time and energy there whatever bye\n00:49:00 - Tina Marie (profitdriversinc.com)\nstop believing money because they're making stupid decisions because they're uninformed.\n00:49:05 - Dan’s iPhone (danddcompany.com)\nRight. Then you can start to make start to know your business on like a whole other level when then that I think that's key, right? It was like when I was on the forum with Jamie and Heather the other day and like Jamie's like, okay, gonna make these videos. No, she's talking about Instagram getting Instagram leads. I'm like, well, like Instagram leads have never really been proven to work, right? So if you go do a source report, which, you know, we can sort of do one of those. The data is somewhat there. And I, again, I would argue my data is better than everyone else's because I'm getting them forced when they become a lead. Now, could they have gone to YouTube before that or whatever? Yeah, maybe whatever. But when they entered, I keep calling this like first contact and what last contact people call first touch. Like, yeah, maybe their touch came through YouTube, but we can't, you can't trace touch. I can trace contact, right? can trace that hey, they entered our world One of contacts the right word still, but it's like they became lead and they came from this source It's far but I'm concerned. That's the source Right and then engagement instead of touch or contact Yeah, it's gonna be something else. It's like you can't use it's got to be a new word It's like yeah, like I can't use a word that's already used right so engagement's already used touch is used Contact is going to use Something I haven't read it through we'll read it through chat you can table immediately, but it's really good at that So it will be able to help you come up the word if you define what it looks like so it's not touch Like what does that look like to you and and what makes it not one thing but something else Well, I mean you could say well and I want to use the same word for the beginning and the end Right, so it's like your last so when they purchase it's that's the last version of the first version is a lead The last version is they purchased right so it's like Not interaction like it's some other word, but anyway, so when I was talking to her about it It was like I'm saying I'm gonna get an Instagram do more. I go well. Okay, you get more leads on Instagram. So what? So what you got more leads on Instagram, right? I'm like more leads is not gonna solve the problem. The problem is that you don't right She's making the cloud. go this is the classic blender get more leads like that's not the answer And she's like let me see if I get this street So you're saying if we go get more leads, we're not gonna make more money I'm like, that's exactly what I'm saying and she couldn't put it together And I go but if you I go that's not entirely true if you go get more YouTube leads They will convert therefore you will make more money. the question really is how do you get more YouTube leads? That's the question to me to answer because that's where your money comes from and she doesn't have an answer for that. So I'm like, if you don't have an answer for it, then I mean, it's not all that you can do. But if I can right now go spend $10,000 on Google Ads, I'll get a lot of leads and I won't get $10,000 back.\n00:52:21 - Tina Marie (profitdriversinc.com)\nHave you ever done YouTube ads?\n00:52:24 - Dan’s iPhone (danddcompany.com)\nYeah, we ran some YouTube ads, but like, it's you can't track them, right? You can't track like the Tom Breeze ones, so you run the ad goes to the channel so you don't get attribution back to YouTube or the ad. So you could look to see like, hey, when I was running these ads, and this is like, it's hard, it's very hard to do because you can't necessarily say, hey, when the period of time I was running these ads did leads go up. So you could do that and say yes or no, but then you have to dig deeper and go. Did all the videos have the same average views as the other period or did she put up a banner video or did this video from whatever so you'd have to look at these Intermatrix of like Did the referring video like which? Did the leads coming in go up? Where did they come from which video to go up and then does that make sense right? Does it make sense that this the video that usually drives leads went up? Therefore my running ads sort of juiced that That would probably be the way to do it I'm thinking I actually do that. I just never did it.\n00:53:45 - Tina Marie (profitdriversinc.com)\nNo, I'm not going to because they don't have any money run as Well, I'm pretty sure that was like one of the first goals Or things I said when we were talking about you doing level activity, part of when we do your effective hourly rate, years ago, was saying that whether you hired and trained or just hired somebody who could do ads well for you, that especially if it was somebody where you could say, okay, this is what we should be trying, like, so you're the strategist, at least or consult on it, but somebody that is good at doing it, but you know, did add like you and did the containers the way that you did, but how it keeps changing, the hiring pool keeps changing, so the thing about what I just said is like, I'm the only one that can do that, like not me personally, but like me Dan Ryan basis because nobody tracks the leads from their videos with the that I built.\n00:55:00 - Dan’s iPhone (danddcompany.com)\nof that, right? It's because I have that data. Now, in the Mercer world, that data would be in a dashboard and you'd be able to look at that at the drop of the hat. Yeah. I hadn't considered.\n00:55:19 - Tina Marie (profitdriversinc.com)\nWhich would change everything that you do in terms of add the lead generation, which is a huge part of your world and your puzzles at the very least, even if it's not necessarily part of basis, which could be. But anyway, yeah.\n00:55:37 - Dan’s iPhone (danddcompany.com)\nI mean, because that's like another avatar is like the Jamie, right? It's like going after the YouTubers and just saying, Hey, I've got a I've got this thing that's good for YouTubers. You should be on this because you get all this stuff. But I think part of the like Jamie is that they're like, I follow this to Rick Biano. who's got this massive YouTube channel and he's like this super music nerd he does great interviews but that MFR is running like a sale every other week and I'm like dude please stop stop running sales like you're losing money who's ever guiding you is guiding you incorrectly every week it's some stupid sale like you're devaluing yourself this is not a good thing but they're probably at the end of the week going oh look we got $10,000 in sales like oh geez no don't do that but he's like a he's a perfect YouTube and I can tell you right now he has no idea which videos drive business because nobody's ever nobody's ever done it on braces like I had never seen somebody do this yeah but I think will be interesting now a year from now because of AI like\n00:57:00 - Tina Marie (profitdriversinc.com)\nGoogle's integrated AI into search results, Google on YouTube, YouTube definitely has the AI, like what, whether or not it's available at a free level, which I don't imagine they'd want to, but I feel like, we don't know, that better analytics for this stuff is not too far away unless they want you to stay operating blind so that you keep guessing, so that you basically are gambling.\n00:57:35 - Dan’s iPhone (danddcompany.com)\nAnd that was the upshot of that video that I mentioned a couple weeks ago where the guy turned off all the black box stuff and got better results. he was like, the less I told them, the better I did. But that's because, you know, they just want us to take your money.\n00:57:57 - Tina Marie (profitdriversinc.com)\nYeah, but we're\n00:58:00 - Dan’s iPhone (danddcompany.com)\nright and that's why this stuff like I mean the thing that I don't know that someone brought up to they were like oh well you know stafari strips strips the utms I think that is true but I'm like I don't have that problem if just switch them all to PGT they are utms and then now I can't I can't tell google analytics that they're utms but I can get that data in google analytics as like an alternative utm right as these events better and then prime build dashboards based on those as if they were utms they are they act just like them they just literally are not them I was like that's something else other people can't do you\n00:59:00 - Tina Marie (profitdriversinc.com)\nlast week on. The summer pace is always a little slower and slower. The strolls to work. I got my dog and he made me my mom. can't wait for the kids to finish the Is it what are they doing building it? Well, it's a came, you know, all the parts. So they didn't have to like engineer it and blueprint and design it. But it's it's been, you know, top to bottom, start to finish building it. Oh, and almost done. What was I looking at? on. Sorry. I lost my notes when I lost my. mouse. I mean, that's all the stuff that we're working on really. OK, and hopefully you don't have to run anywhere. Just ask some quick questions about just whatever else has been happening. Rapid fire, rapid fire, rapid fire. Well, touching any of the projects, just just anything that stands out as a problem, an epiphany, an aha, since we talked last.\n01:01:00 - Dan’s iPhone (danddcompany.com)\nvery near higher Frank. Frank is definitely next level. So I think that's all gonna get done well and good. Norio finished. Perfect wedding timeline. And he released it to Abishik for software testing. So they're going back and forth right now. So Norio's like go find the thing. So he's like, all right, now we're in stage two. Bugs washing. So we'll get him to try and find some stuff. Then we'll let some people on it, let them start using it. And then it'll be like, then we can release it for like public consumption. Which my plan there now is, this is so weird like, so Jamie's tagline is lovely humans. So like over a year ago, that domain was for sale and I bought it. never told anyone.\n01:02:00 - Tina Marie (profitdriversinc.com)\none.\n01:02:00 - Dan’s iPhone (danddcompany.com)\nAnd then I started to figure the other day, like, I need them to give me this domain, like the whole point of me telling them to come up with a brand name so that I could be brand.\n01:02:13 - Tina Marie (profitdriversinc.com)\nYou need them to give you what domain?\n01:02:15 - Dan’s iPhone (danddcompany.com)\nTo take that. need to do ownership domain, and we'll keep using that name. But the domain needs to be my name now. And I was like, she's never going to do that. And then I thought, Oh, wait, I'm going to trade her domains. I'll give you lovely, lovely humans and you're going to give me perfect wedding time line. And she 1000% will do that. And I paid like 900 bucks for the domain or something. So I like, I got to do that. So then we can roll that out. And then I think, I'm just going to tell Heather and Jamie, but just tell the dude, Hey, just working with another vendor. That's it. Like, you don't owe the guy an explanation. Just say, yeah, we're working with another vendor that we can. That's it.\n01:03:01 - Tina Marie (profitdriversinc.com)\nWhat guy?\n01:03:02 - Dan’s iPhone (danddcompany.com)\nAnd the timeline genius, the guy that's getting- Oh. They're doing like a 50-50 rev split, but like he actually makes more money because we have to pay someone to do all the customer service. So he actually makes more money. So, but I think I'm going to, I mean, kind of want to tell them like we have to change the split, maybe, or I haven't really figured it out yet. So anyway, so that's going to, so now Norio's available. And then I hit him up yesterday, I go, okay, great, can you start working on this fan flowy stuff? And he's like, absolutely. So I had a couple of tasks there for Saad, he wasn't responding, and then all of a sudden today, he's like, done done. So we'll see if those are done that we can finish this Spotify integration, but then I'm going to unleash Norio on like the two or three apps. We want there, which he should probably be like, dude, this is simple. I go, well, the other is even simpler. One might not be. I'm going to hold that one for the last. going to get some clarification on how to build this. We need to build some sort of API into GoDaddy that will allow people to make sub-domains on fan flow. I know it's possible. just not sure. It's actually the right move. But anyway, Noreo can start working on that stuff.\n01:04:31 - Tina Marie (profitdriversinc.com)\nI'm going to hit up Mark and then take that lead. Because you can make sub-domains on high level also, can't you? It doesn't have to be done at the registrar.\n01:04:41 - Dan’s iPhone (danddcompany.com)\nIt does with all this new email . You got to append all those extra records. But yeah, so yes and no. You're going to want it to be custom. They'll get to pick the sub-domains. but we're going to be like it should be your band name teama gang dot fan flowy dot com so that won't probably be last because i think it's the most complicated but i'm going to actually ask i level like hey how would i do this uh and then i'm going to go back to shot and mark and then they've got so many bands on this now so we need to like take a step back and like clean up some stuff but like the core stuff is built it works it people are getting results right now i'm like we just need to clean up some stuff and then go this you know version one was waiting for the Spotify thing stamp it as version one but like okay and then i'm like you guys need to charge everyone that's on there right now a subscription like you should not be selling this as and and um and included it should be hey start your subscription and then we're going to charge you to run your ads above the clock because you're your bypass the whole primary model of it being a recurring subscription based business, right? You're you're including the software for free. That's a mistake. Like, now, if you want to, like, give these guys like, uh, founders price that we never take away, fine. I'm totally okay with that. Let's do that. But they need to, they need to be running subscriptions and then because then they can tell people, oh, I have a subscription, but you might not be able to get the price that I get.\n01:06:30 - Tina Marie (profitdriversinc.com)\nSo then I was like, okay, value of the software and service.\n01:06:35 - Dan’s iPhone (danddcompany.com)\nYes. So then I was like, all right, we're going to do that and they'll do it. And then it was like, then I started thinking similar line to your, like, I told Darryl about it and Darryl was like, what? are you building?\n01:06:50 - Tina Marie (profitdriversinc.com)\nAnd I told him, I was like, I have to, I'm sorry. Every time I think this, did you ever watch Darryl? Larry Larry Larry Larry Larry Larry my brother Dale Every time you see Daryl every time. I'm all the brother.\n01:07:11 - Dan’s iPhone (danddcompany.com)\nNo Okay, I told Daryl and I was like, oh man, I just got to figure out the math of this So once we have like whatever the price is I was like we should do an affiliate thing with Darryl's Daryl's in the studio with a band every week Every week. I'm like if we made him an affiliate and we paid him a percentage of the script subscription for a fixed period of time Right. Hey, you get x percent for the first Six months or if they stick three months you get x percent and it's equal to Why So for every band you get on you're going to make 200 bucks or whatever it is he'll refer it out all day long. And I'm like, how many other darels are there? Or maybe you do pay them in perpetuity, like high level. If I came in as long as I stay on, then he's even more motivated to do it.\n01:08:16 - Tina Marie (profitdriversinc.com)\nYes, yes. But it could be like, there's a higher front end costs or whatever reward. No, because you don't want to tend to bring people. So tear it up. So once you bring us, you know, 20 people, and it has to be how many people are currently subscribers. So let's say if you get up to 50 subscribers, so up to 50 subscribers, it's like 4%. 50 subscribers active and above, it's 5%, whatever. numbers mean nothing. point is that you unlock the levels by how many existing subscribers you get. Yeah. So that they are incentivized to bring people that stay because then he doesn't have to keep replacing them just like, you know, any other business, you're better off having to go chase down new customers. And, and then he unlocks higher levels. And like, why would you not want to pay somebody? there's a marketing budget anyway.\n01:09:24 - Dan’s iPhone (danddcompany.com)\nThat's just basically the marketing budget, they go get you customers. And he'll get bulls-eye customers, right? And then it's like, okay, and then if you only have a handful of them and those guys know people, right? So it's like, yeah, if we just open this up to a handful of people, like, it's not come one, come all sign up for our affiliate program. No, no, it's like, taste maker affiliate program. And if you get like 12 or 20 people that are dialed in, they'll do it. Especially, I mean, because it's going to be, it is going to progress. So that stuff's all going, and then it's just like with another 71, it's like steady eddy. We're still climbing towards the 490, which I think I figured it out the other day, sometime in September.\n01:10:17 - Tina Marie (profitdriversinc.com)\nYeah.\n01:10:18 - Dan’s iPhone (danddcompany.com)\nHere's September. Yeah. Yeah. We should hit that, and then I got some other, like the dent repair guys, those are the dudes I was talking about earlier that have all the leads, like they want, they want to build, it is interesting. like, do you think you could build a PDR as the name of the industry, or do you think you could build a PDR version of high level that could, we could sell the PDR industry?\n01:10:45 - Tina Marie (profitdriversinc.com)\ngo, yeah. Yeah. What's PDR?\n01:10:48 - Dan’s iPhone (danddcompany.com)\nA painless dent repair. Oh. So like their, their business is a show and, but they're making money hand over fist, and I'm like, but you're probably losing money hand over That's sort of that that's sort of that the hidden the hidden thing, right? It's like By not knowing all your numbers. You're you're losing money You just can't you just can't see it. Yeah, yep, sort of like mark like mark on Monday. Like he's coming It's coming around to what the real problem is mark. You pay people too much hate to break it to you He's known so last year No, I know but now it's becoming like Painful. Yeah, yep, and painful is when the change comes and and the reason he did it Was to be a nice guy Right, he didn't he didn't do it because oh it wasn't for retention. It wasn't for whatever It was for Whatever it was to feel a good number room I think that's part of it, but I think part of it was retention because he was if you remember Really concerned about losing people, especially samantha I But I just don't know if his concerns real, and I think that I think that's also happened. No, I don't think it is, but I think it was to him for a long time. Yeah, yeah. definitely.\n01:12:11 - Tina Marie (profitdriversinc.com)\nHe the theft. Yeah, that like, and how long it takes to replace people and the comfort like people weren't as happy.\n01:12:18 - Dan’s iPhone (danddcompany.com)\nOh my God, the revelation was wait, these people don't need to be lawyers. I was floored when he said that. I'm like, whoa, And he's like, yeah, no, they don't need to be lawyers. So I'm like, oh, well, that totally changes things, right? Because you cannot, he cannot tell me, and especially if you talk to Salko, Salko's like, dude, this isn't that hard. He's like, these guys, they're not lawyers. Like Sam and Tyler, and they're not lawyers. They are not. He's like, they are people with law licenses. There's a huge difference. mean, he would argue that. Mark is not a lawyer. He's like mark has never set foot in the courtroom ever and he never will so it's like ever Yeah, most of them won't most of them never will because I know that's right doesn't want to that's why he likes this I mean, that's the track that they're on right so in a way they're completely overpaid and now even more so I'm like Dude, they're really overpaid and you know, I just keep saying it But it's like I know the time's not right, but I know the time is also rapidly approaching If you start to dial in these processes, which is happening with intake, which is where it should start You start dialing in these processes You're he's gonna discover. Oh, yeah, I don't need lawyers Like you could because it's all It's there's no if you're never going into the courtroom Right if you're never going in and trying to woo a jury and get a higher verdict And you're just dealing with the black and white. It's either there or it's not Right so you can't make an argument to get this huge settlement when the policy doesn't go that high. So there are these built limitations, but the processes don't exist, right? like in Salko's point, that's why the whole AI conversation I had with Salko when I was like, oh, no, no, you could teach it to look for words. And he was like, oh, wait, what, really? Yeah, yeah, totally.\n01:14:25 - Tina Marie (profitdriversinc.com)\nBut, okay, so, and this is why I take a holistic approach to business is because the CEO is always a bottle that one way or another. all are, because we're But one of Mark's issues. I know I am. Same. Is that he needed Bonparone, but now he's making friends.\n01:14:48 - Dan’s iPhone (danddcompany.com)\nYes, exactly. All kinds of things happening.\n01:14:52 - Tina Marie (profitdriversinc.com)\nYes, yes, yes. So his need for that is changing. And in, I, I didn't put the two together before, but you know, yeah, anyway, that's what happens when people and it's like, you're looking at the map on the page and I mean, he knew it.\n01:15:12 - Dan’s iPhone (danddcompany.com)\nI wasn't even really sure, but it came out of his mouth. He's like, oh, it's way too high. I'm like, yeah, probably is.\n01:15:21 - Tina Marie (profitdriversinc.com)\nWait, what?\n01:15:22 - Dan’s iPhone (danddcompany.com)\nWhen he was talking about payroll, he's like, my overhead is way too high. And then we, and then he drilled it further and said the overhead is payroll.\n01:15:30 - Tina Marie (profitdriversinc.com)\nI mean, a bunch of people wrote it. Okay.\n01:15:36 - Dan’s iPhone (danddcompany.com)\nThat's the other interesting thing. I don't think he had thought about it. It didn't seem like it to me, but I'm like, dude, if you're just growing and you're not making more money, what are you doing? And he thought it was to sell the firm and I'm like, but is that, is that what the multiple is based on? And he's like, no, not really, right? It's like, oh, it's the cases. That's the thing. I think he's starting to see that. I mean, he's done it. He's on pace to do almost a hundred this month into the math yesterday. I think it's in 94 Not counting whatever closed yesterday. I sorted I could be slightly off. So he's on pace to do a hundred in July where there's a holiday in the summer Right three things three things that are against that happen with his best lead source Monday getting the bed Totally just doing horrible and it's like get here you are and You know what? not hearing I'm overwhelmed. I can't we need more pods like it's not a trip That is not true. That's the next thing bringing it that up Monday Yeah Bring that up Monday And if anyone's gonna complain about being overwhelmed, it would be in California in the summer Cuz they're like I'm missing out going it's not like something like dude every time I talk to Tyler, he's at the airport, going somewhere, like I believe in me.\n01:17:06 - Tina Marie (profitdriversinc.com)\nOkay, so the last thing that I wanted to say, well, two parts, I don't know, my brain is like shutting down now, but that even our thoughts are iterative, you know, like, because we are changing, having new thoughts constantly, like it gets frustrating because like something will be obvious to you, something will be obvious to me, but that's, we're thinking based on our lenses, based on our experience, but also based on our makeup, being, for example, you're happily married with two kids, and like, home life matters, and our ability to make certain types of decisions is affected and affected and infected by the rest of our circumstances and so changing those things, changing his morning routine, him changing friendships, changing all these different things, makes him able to make decisions he couldn't have made before because Mark as a person, as an emotional creature, which we all are, as EOR, needed to make alterations, but those changes don't happen like that. They don't happen overnight. They don't happen because we had a conversation last week and you immediately apply it and change it and then you get the impact and effect and but it's it's all gradual. It's all a gradient spectrum type of changes, results of changes. Now we have new insight. Now we have new lenses. Now we see things differently. we know more things. things. Now we've altered our environment and the gist. That's why it's so complicated. That's why pacing matters so much. I know, you know, like I'm not preaching to you, but it's just every week, I think about, you know, what we could have done and what we already knew, but you can't take the person out of the equation. But, and that's also why, if you're going to launch basis, your first few people, 100% because that interaction is probably going to be more weighty than maybe down the road when you streamline everything. Those should be the most cherry-picked kind of clients, partners, whatever that you bring on, because that will affect the trajectory, I guess, of how basis evolves. because no matter how much we want to think of it as a system, a process, a product, whatever, you're at the center of it and whoever you're interacting with regularly is at the center of it and that energy makes a huge impact on the decisions that get made so the path that gets plotted out and so on. Yeah, anyway, just pondering, I guess. And my brain is going, I need food and probably nap. Well, I get a massage in two hours. My Russian massage Elena, she's so good. She's like scary also because she's Russian, but also she's like a second mama and loving and it's awesome. It's a 90 minute massage and I'm gonna go nap after that.\n01:20:54 - Dan’s iPhone (danddcompany.com)\nYeah, or during.\n01:20:57 - Tina Marie (profitdriversinc.com)\nNo, she talks too much.\n01:20:58 - Dan’s iPhone (danddcompany.com)\nShe always wants that. I pass out sometimes it's hilarious.\n01:21:02 - Tina Marie (profitdriversinc.com)\nYeah, I just thought that honestly I might just go in and be like I'm in a nap Lina right Okay, you I glad that you walked to the office keep taking care of yourself and I Dan You\n","contentPreview":"00:00:17 - Dan’s iPhone (danddcompany.com)\nHello, is this thing on?\n00:00:19 - Tina Marie (profitdriversinc.com)\nIs this thing on? Yes. Where's my volume? My kids are working on the. It's evil for us ...","processedAt":"2025-05-04T03:40:52.600Z"}