{"fileName":"Done Transcript for chris mason - Profit Drivers Systems Consult(1).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for chris mason - Profit Drivers Systems Consult(1).txt","type":"transcript","priority":"medium","content":"00:00:01 - Chris Mason (chrismason.net)\nHey, how are you doing?\n00:00:03 - Tina Marie (profitdriversinc.com)\nApparently too eager to meet me because I got here to meet.\n00:00:11 - Chris Mason (chrismason.net)\nWell, yeah, I to double check. Double check myself.\n00:00:18 - Tina Marie (profitdriversinc.com)\nnot going to meet you early then too late, but I woke up and I got immediately had missionary meetings to go to and anyway, I was just been like, oh, I'm on to my next meeting and yeah, anyway, so I gotcha.\n00:00:32 - Chris Mason (chrismason.net)\nYeah. When you said I woke up, I finished the sentence in my head as soon as when you said I woke up, I was like, I woke up and I chose violence.\n00:00:44 - Tina Marie (profitdriversinc.com)\nThat's what I, I don't know why I just feel like, well, I eat, so how do you feel about Tina? Well. The vibe she gives off is she chews this balance. I can't be like that. really wrong. I'm coming down in my old age. feel like this mission is probably really good for my attitude. Anyway, so I put notes on your last... Oh wait, okay, so just the invoice thing just to keep up with it. because I put them on, what think go automatically every month? And then when we started back, it was the first of whatever month it was like April. And so there's another one automatically going to come in a few days.\n00:01:40 - Chris Mason (chrismason.net)\nIs there...\n00:01:42 - Tina Marie (profitdriversinc.com)\nIs that right?\n00:01:44 - Chris Mason (chrismason.net)\nIs there anything wrong? No, there's nothing wrong. I guess I just got off in my... I probably was late on one of the earlier ones.\n00:01:58 - Tina Marie (profitdriversinc.com)\nYeah, and then... So there's a remind function that I can use, and I just wanted to make sure, you know, because in the beginning, like I think your finances have straightened out and whatever, but I just want to make sure everything's okay. And then if it, we need to adjust it, let's adjust it.\n00:02:18 - Chris Mason (chrismason.net)\nWell, I mean, yeah, it's finances. The third month in my cycle of billing with titans and everything. I consistently get to that third month and it's like, oh, this is going to be, this is going to be tight. I've got, you know, I've got nine grand in my account right now. And that's for the rest of August and September. And I'll have mean, a little bit from VA and BAM. I have some money coming from Tim, which he, I'm talking with him. He wants to renegotiate, so I'm talking with him about that now to do a profit partner deal with him, so he wants to scale back to, he asked me to scale back to 3K a month, and so I talked with him, got on the Zoom last week and was like, you know, obviously like I can't, if we, if we do two things. So one, we ran that one promotion, you know, you, you, you did a little over 40k, one person signed up for your mastermind, and he, and he was, you know, that, and I think he's got some, some um, uh, some amex debt that he's dealing with, because I heard him mention he's paying like 2,500 a day on it.\n00:04:10 - Tina Marie (profitdriversinc.com)\nWow.\n00:04:12 - Chris Mason (chrismason.net)\nSo I think he's got, yeah, a day. Wow. I think he's got some, uh, I think the money just comes in and it goes, but he's got a big event that I'll be at next month in Chicago and I've been really not installing it.\n00:04:28 - Tina Marie (profitdriversinc.com)\nOh, sorry. I'm just like, so anxious right now because I'm so upset and I'm trying to hold my mouth.\n00:04:33 - Chris Mason (chrismason.net)\nOkay. Keep going. Sorry. Yeah. And so I, um, you know, I've been promoting that event, uh, for him because that's really when he wanted to focus on and because that's where he sells people into his mastermind and we've got more people attending this event than any of the past five. um, know, he converted 25% of the room last year. if he does that this year, you know, that's like a little over 700 grand to him. So he may feel different post event. But I told him that we got to reduce the scope. If we're doing 3k, I said a way around that. And this is why I proposed to him. And he said, he'd give me a half, a half yes on this because he likes, he just wants to think about it. So I said him the proposal. And I went ahead and I invoiced him for 3k because I need that money. I need some of that 5k coming in this month. But it would be 5% of gross sales that I bring in, including evergreen funnels that I build. And so in my goal would be you know, make up that extra, you know, 2K a month, but also it's like, well, he, the other thing in my mind is like, well, I probably, I probably need to go ahead and get working on another client as well that can pay me the 5K. And, you know, I do, I do like working with him and his team, you know, there's something to be said for that. He paid me, he's paid me 20 grand so far. So, I, as I did in Moison for the 3, and I got that and then, and his whole thing, he said, it's not that you, like, is nothing that you're, you're doing, like, he, he, like, likes to work and he just isn't able, I guess isn't able to afford 5k. So I feel like there's something to be said for, you know, he's not breathing them my neck. Like I have pretty much full autonomy. So there's some pros and cons there. So I'm trying to be flexible and also stand up for myself too. so if he were to say, you know, I'm not going to do the 5% of growth of what you sell, I'll probably just eke out another month or to a 3k and find some how to replace it. But also I said the near-road scope would be like I'm just going to focus on creating and running promotions. under this new deal and you know because they'll ping me like for I mean just random stuff and it doesn't take me that long but but that kind of stuff I would just you know back away from and not not do any more you're updating existing sales page copy that I'm not really involved in or anything like that or that we don't have a promotion for so so that kind of stuff would would go away and I would just focus on activities that bring me in that I can earn them and so I think it's a really good deal for him and so I think he'll say yes I I send it to him I sent it to him on Friday, yes, sent him Friday, and I know he's looked at it, he hasn't replied. I'll follow up with him before the gross summit next week just to confirm that he saw it and say let's connect after gross summit because I think that he'll be in a happier place once he has that influx of new members, and I've helped him with the order form that he's going to pass out at gross summit and a little bit with his presentation of how he's going to pitch our encircle. So, mean, I think that like today, he got an email deliverability warning from Keep because the spam complaints are getting a little high and he asked me if I could take a look look and you know that that's one of those things is like that's that's definitely out of scope but i but i know that he's using email smart which is Adriene sappages software okay and and so i did send a talk about sending email to the because i know those guys really well because they we have brian so i just an email see if they can advise or consult with him but i'm not going to work on his email deliverability um so well we're seeing that that leads but i yeah there they're kind of two things floating in my mind is like man i'm tired of getting to that third month and and just feeling the crunch and and i did have a couple of expenses that i didn't anticipate one was paying my EPA that I thought I'd already pay back in in tax season, but we did an extension that we're filing now. And I guess he built me now. So that was like 1,700 bucks that I wasn't expecting. And then there were, there were some kid expenses on the personal side, but can I dig into this a little bit real quick?\n00:11:32 - Tina Marie (profitdriversinc.com)\nYeah. Okay. So first of all, let's cut my bill in half because you don't talk to me at all other than our meetings. So like, you know, extra effort, and it's old prices and we'll just, you're just grandfathered and keep what I charged hourly basically. So we'll cut that in half. That's not a huge out, but it's something and it let us keep working together. Because that's really important to me. Yeah, me too.\n00:11:59 - Chris Mason (chrismason.net)\nIf you like it. I do.\n00:12:00 - Tina Marie (profitdriversinc.com)\nAnd so we'll start that next invoice. If you see it and I haven't fixed it yet, because I can forget between now and two minutes that I need to do that, just pee me back and say, Hey, don't forget. And then I'll fix it. Okay. It would just be an oversight. It wouldn't be. I changed my mind. know. And then if you end up being a little bit late, because you're in a crunch or whatever, however, don't about it. It'll just need to take care of it when you take care of it. Yep.\n00:12:33 - Chris Mason (chrismason.net)\nThat's one thing.\n00:12:34 - Tina Marie (profitdriversinc.com)\nOkay. This guy.\n00:12:35 - Chris Mason (chrismason.net)\nWhat's his face? Top home?\n00:12:37 - Tina Marie (profitdriversinc.com)\nTim. Tim, Tim. So, um, he's, he's feeling the pain of his mismanagement and his errors and a lot of times people will displace that responsibility or just make really dumb choices because they're not in a good way. one of the things. things that you can do is the math, because the numbers tell the truth, right? So what you do is you put in a spreadsheet and you compare the price that he's paid you and the money that you know you've helped him earn. And the no brainer math that says, uh, we've our, I've already earned that. Okay. But in addition to that, that there's the unquantifiable kind of help that I've given you that hasn't been measured, such as this kind of advice, this kind of consulting and, and peer support really. Um, and, and so, you know, so it's, and, and you are not in the business of charity. And I would, I would really say these things in your way, but I think that this, this is one of those things that you write up or you do like in a video, so that you have a chance to really kind of script it out in your head. And so that you don't get interrupted and shift your energy. So he doesn't like argue and persuade or anything because sometimes people like that, especially when they're desperate, they really try to control the conversation. Yeah. And you need to make sure that his ego doesn't get in the way. So if it's if it's a long text or video, he can't argue with those things as much. He might end his brain, but he gets a little bit of space where nobody's listening to him and watching him and where he can manage his ego if he chooses to. So it gives him a better chance to be able to deal with his ego if you handle it that way. And I would imagine he might want to, because if we don't manage our egos, then, you know, we sabotage. But so you give him the math and show him, like, obviously, I've already earned my cape and I want to do more. This lights me up. I enjoy it. I understand the financial problems that you're in. I've been there. for myself. However, here's what I know. Getting rid of the golden egg, the golden goose kind of thing, or getting rid of the money producers out of a scarcity mindset is absolutely the wrong thing to do. And I'm going to put my time somewhere that is going to come back to me. You know, that's just business. But also in this economy, everybody's got to manage their resources. Well, I only have so much time and so much mental effort to apply to a project. So I'm not going to put it where I constantly feel like I have to prove myself or somebody doesn't understand the value. So I'd like you to take some time to contemplate this, look at the numbers and reevaluate. And you know, you could just read, read, restate that. That's why this offer is good, because I see your value. I know what you could earn. I know that there's a good potential for me and I'm willing to have some skin in the game by instead of requiring this 5,000 that I'm going give you my minimum. What do I call that?\n00:16:10 - Chris Mason (chrismason.net)\nRetainer, base retainer, base retainer.\n00:16:13 - Tina Marie (profitdriversinc.com)\nMan, it's been so long since I've used the base retainer. I forgot what it's called. This base retainer, which basically ensures that I am not a victim of your poor money management. And of course, you're going to probably want to tweak that, but that's the truth of it is sometimes people manage their money bad in case in point 2,500 day on an AMEX. Something went wrong there. So it's just a matter of being bold but so respectful using the numbers and then forcing accountability. Make a decision, but just know that if your decision is to devalue me, I don't have that issue.\n00:16:56 - Chris Mason (chrismason.net)\nI'll move on.\n00:16:58 - Tina Marie (profitdriversinc.com)\nSo that's the The one thing about that. So cut my bill in half, my suggestion for how you handle that. I do think you should take another client because I feel like we're right now at that. know, we we felt a recession was going to come and then it was artificially inflated. that's the great vine and you listen to the conversations that are happening. There's a lot of people that are not having money, a lot of coaches, a lot of whatever in the industry. It's definitely not hurting the labor industry. It's so crazy. You still can't get laborers for anything skilled laborers, whether they're fixing cars and mechanics or HVAC or doing nail technicians and hair. Like people are still spending all that money. But in the education world and the coaching world, that's changed. anyway, so that and then I would love to dig into T, what you're doing with Ryan. Oh yeah, the one question I wanted to ask you with. Tom was, have you ever tracked your time and kind of come up with an effective hourly rate for you? And what I would like you to do is if you do that three thousand dollars, if you can create it so that you're spending less time and that you maintain a similar effective hourly rate to what you were doing at five thousand, because you modified your scope, then you should be able to be okay with that too, because three thousand is nothing to sneeze at, if you work well together, then that could grow. And if you're not, if it's not costing you more time, like if you're, you know what I mean, if you're correlating that correctly, then then there's no reason to not do it.\n00:18:50 - Chris Mason (chrismason.net)\nYeah, that kind of, I haven't done effective hourly rate, but I have, I did just look at like, all right, what is, Because I had to, you know, my days are kind of tasks, their tasks are driven. so my mornings are most productive. so I was giving, you know, a couple hours dedicated in the morning to thinking and working on Tim's stuff. And then I was becoming more, I was keeping more of an eye on the Discord chat. I even got, I put it on my phone and I was getting notifications on my phone. And then I took that off after this 3K because I was like, well, I'm not going to have those dinging me anymore to take up just more of my brain space. But I was kind of thinking that, like, yeah, I could give it 3K. And if I'm earning on what I sell, then then I kind of feel like, you know, a couple hours dedicated in the morning for really four days a week because Fridays I treat little bit differently. But for Monday through Thursday, I have started, I'll spend like no more than 90 minutes on either Saturday or Sunday, sometimes both in the morning after coffee, just, I don't really do coffee work, but I do more like planning and organizing and thinking about the week ahead. So, which I don't mind. doing that. So sometimes Tim is, Tim is definitely in that thinking. But so is Brian and everybody else fits. So I mean, that cadence has been, has been good for me. But that's kind of what I've been thinking is like I'm going to limit it to, you know, like two hours a day. For I have a Monday meeting with him and the team. That's an hour. And then I do a 30 minute call with this girl Amanda, Amanda Dake. don't know if you've ever lost pass with her, but she's another consultant. She's effectively, I guess, his fractional CMO. And she's great. I really like working with her. So that's really like, I'm trying to limit my time and the week for Tim, if the 3K ends up being what sticks, and especially if he, I don't think he's going to balk at the Refshare thing.\n00:22:19 - Tina Marie (profitdriversinc.com)\nBut... I'm sorry, I only have one, don't know, there's two amount of days I have mutual friends. D-A-K-E. Oh, D-A-K-E?\n00:22:28 - Chris Mason (chrismason.net)\nYeah, D-A-K-E. She's got a girl in here.\n00:22:33 - Tina Marie (profitdriversinc.com)\nI've seen her face, maybe he's just with the Titan stuff, but we're not connected.\n00:22:38 - Chris Mason (chrismason.net)\nAnyway, sorry. Okay. She's really more project management, and she's handling the, like all the hotel stuff for his growth summit, all the negotiations, food, menu, that kind of stuff. But she's got a marketing brain, she's got good ideas too. you.\n00:23:03 - Tina Marie (profitdriversinc.com)\nSo how much time, because I was listening and I feel like you said like 90 minutes a day for him?\n00:23:14 - Chris Mason (chrismason.net)\nTwo hours a day.\n00:23:15 - Tina Marie (profitdriversinc.com)\nTwo hours a day for 10. So like 10 hours a week.\n00:23:19 - Chris Mason (chrismason.net)\nAnd that was before? Before I was doing more than that, like I would do my creative output for a couple hours a day. And then I was a little more active in the Discord. And I get one off request for help with preexisting copy and that kind of thing. Or if I'm like I would sometimes write scripts for his, it's really his assistant. she's she's the one handling the like the direct messaging in the in the Facebook group. And this is not her not told him that like this is not her skill set. She doesn't. She's not a cell. She's an appointment setter. She's not a sales person like that's that's who he's using. Instead I was writing to help her be more successful which would help ultimately help me be more successful. I was writing scripts for her and I probably still do that on a specific promotion that I was running because I would see that as you know that like her her follow-up matters um when we're we're in a week where we're making an offer.\n00:24:58 - Tina Marie (profitdriversinc.com)\nDoing a quick EHR. affected hourly rate calculation. So we can just, then I'm going to, sorry, bring it only due to things at once. Let me screen share, because this is safe for you as a value calculator that we created to create some like offer calculations. We don't really use it, but can you see? Yeah. And so what do you think you worked before? Like how many hours a week? were talking about it, but I didn't hear it specific.\n00:25:38 - Chris Mason (chrismason.net)\nI probably gave him three to four hours a day.\n00:25:51 - Tina Marie (profitdriversinc.com)\nA day? So we'll say 3.5 times five days a week, right? safe for some. Okay, three point five times five, so we'll say seventeen point five Well, I gotta bring this down five That's crazy First of all that it's not very much We really should do this for everything And I really think you need to do this because You know, you're more valuable than that. Yeah, way more valuable than that And let's do one more thing earned for The name And So we're gonna call that Yes. Um, Tom, let's do this for a Titan. Let's do this for tea. And let's set a baseline of, well, for sure, you don't make less than that.\n00:27:14 - Chris Mason (chrismason.net)\nBut then let's start doing these calculations and make sure that that numbers start growing to a minimum of $250 an hour.\n00:27:23 - Tina Marie (profitdriversinc.com)\nYeah. Because, I mean, when we go do this, when we go start plugging in these numbers. And so let's, we'll do this drag up. Man, you need to use this for your profit partners modified a little bit. I'll put it in my, my stuff that I'm teaching, um, because everybody needs to do this. so you just take it. You could say, you could say you got it from Tina, that'd be nice, you know, but you don't have to. But But give this if you teach people this. Okay, because they need no so so we'll call this a month Jan 2024 and I'll just I don't think it's gonna let me drop. Yeah, okay, so If I did a few of this Let's do this oh I Think if you do if I do it a couple times hold on hold on. I I want to I want to do it myself Chris Let's do 24 and then 03 24 if you if you highlight this three and then go it'll finish it You know sometimes you have to train it with a few things because it doesn't have enough, but anyway, okay, so I um and then obviously we don't need these to be so big and no you want to there okay hold on oh tina don't don't watch me don't look at me and i really shouldn't even be doing this yet until i populated this video i want it to be but anyway we drag this out you can put this and anything new and if you go populate this and then do some math um i think that you'll figure out what your target EHR should be and um also kind of your return on investment by the hour for them let's really start digging into what you're earning people versus what you're getting compensated because you have a kind of ambiguous value in your head and their head. And we want to make that crystal clear. So your ambiguous version is you know that you're worth way more. Their ambiguous version is probably the same, but they struck themselves and let them believe that you know that they're justified in this until you do the math. And then you can take yourself off the table and be like at some point, right? Obviously you can't right now, but there's going to come a point. But I can tell you when I did this exercise for the first time, everything changed. I'm like I am making people millions. The first time I did it, I went bankrupt making people millions and that just made me mad. then, you know, still making people millions and getting Trump change for it. And I'm like, I got to change this. And when I, the value that when I really understood my value differently, I held myself differently, I conducted myself differently. And it was off putting to the types of people that would take advantage of me because they just recognized I wasn't the one they were going to be able to manipulate. Because there's lots, most people have really no idea. They have an ambiguous right. But they don't have a crystal clear like, I am 100% worth this. So then what happened is I started attracting people who are like, I want to pay Tina, I want to pay her. Like she's valuable. I want to pay her. You're one of those. And it doesn't even if they can't there's a difference between can't and won't. Yeah, you know, and so you want to be in the trenches for the people that can't but would. I want to be in the trenches with you.\n00:32:00 - Chris Mason (chrismason.net)\nI worked for free for a while, right?\n00:32:02 - Tina Marie (profitdriversinc.com)\nThere's a whole different level of engagement and even relationship and concern and mutual respect and honor. And people get to prove it by how they show up not what they say to you.\n00:32:20 - Chris Mason (chrismason.net)\nYeah.\n00:32:21 - Tina Marie (profitdriversinc.com)\nSo anyway, let's you take some time. However long it takes you, I mean, we're not going to talk for a month, but I would love you to fill this out for everything that you're working on. Even do it retroactively for it was Tim that you worked for before, right, for a few months, or maybe that was time. This is Tim now. This is Tim now. Oh, my bad. Okay. These people with their similar names. Okay. Anyway, um, yes. So I think you should go back retroactively to anybody that you consulted with and do. You know, it's not going to be perfect because you don't have a crystal clear memory of what you did, but fall part of the best you can. And and and compare so that when you do future client work and profit partner alignments, you have a real idea of what you've been compensated before and also what you've earned. You're just going to feel different like it's going to be eyes wide open and it may actually create some resentment if this didn't already. But the good news is that is a springboard to the place where you're really happy regardless of how this market is and how many people are suffering. Plenty of people are doing really well and it's because of the people they aligned with. I just did. It was crazy. Biggest deal I've ever done. And it was the easiest thing, really, he had to take, I don't know, two or three weeks to really think about it, but it was $100,000 deal. I've never done that before. And it is almost no work. And but it's because I made him millions. it's a law firm. It's not I am. So that's a big difference. I'm working for like my, the next client was a doctor. And it's like a no brainer for him. And in one session, I got him enough traction and taught him something that I have to do the math. What's 15 times? How much was Yeah, so he's definitely got himself paid for because there was something he he was doing and it stressed him out and he hated doing it, so he just didn't do it, so I showed him how to use AI to take the friction out of it, but also because he's nerdy, it made him excited to kind of game the system. Instead of defeating him, he gained it and I was like, I don't have to work so hard. don't to stress so hard. And he enjoyed teaching the AI model how to work for him. So each one of the reports that he wasn't doing because they were tedious as a doctor. Now, he still has to prove it, right? So it's by copy-teeping versus copy-writing scenario all over again, right? So I got him out of the copy-writing and just into copy-teeping effectively with his reporting. And his manager is so happy because he always drags his feet on this. So in one week, that's how much money he was able to get. at $180,000 that he was dragging his feet on and potentially risking losing that attorney referral source because he drags his feet on it. So I potentially stay 10 just that relationship also, which we can't be quantified right now. It can be, I don't have the data for it, but it's going to be worth millions to him. Easily, it's going to be worth, because that was one month, $180,000. He keeps getting referrals, and they all need more doctors. All the attorneys need more doctors, and they need good, reliable doctors. And he's good and reliable just slow, because he hates doing it. So now, not only does he not have to deal with the stress and the friction of doing it, but he's also not going to deal with the delayed payment, and he's also not going to risk that relationship. my value, and I pointed it out to him, my bill's paid for over and over again, copy work that you did, he gets to use that copy again and again. or versions of it, right? go ahead. So that's the thing. Changing who I worked with because of it and knowing my worth and then just doing the math in front of people and making sure that they pay attention to it. So I don't and you know this because we've been doing it repeatedly. I don't assume my people are doing my math, you know, for themselves. So I make sure they do it and go, okay, you wouldn't have had this if we weren't working together. You wouldn't have had this if we weren't working together. You wouldn't have had that. It isn't about ego stroking, but it's like, we do need to know what it does that makes a difference, like tracking macros. When do you figure out that if you eat more protein, you're not hungry anymore or you sleep better or you don't crash as much? It's not until you really look at the data, but nobody's going to make you look at the data if you don't do it yourself.\n00:38:00 - Chris Mason (chrismason.net)\nkind of thing.\n00:38:02 - Tina Marie (profitdriversinc.com)\nSo do this for yourself, get really clear on it and then do it with your people and say, look, this is where we're at. So just so you know, this is what I'm going for. I'm going to take us there. If I'm not compensated appropriately, when we get there, we're going to have a different conversation. I've done that and I've terminated relationships even when I had no other money coming in, Chris. And every time they try to come back and double what they would pay me and I refuse it. No, you had your chance to appreciate it. I'm going somewhere else. So these are hard conversations, but I'll tell you what, when the economy is the way it is, you've got more leverage than you think, if you're willing to pay the price of being bold. But the leverage point is having all the other conversations and potentially taking on more work than you really want to do for a little while, knowing that the deck is shifting. And that's going to be what allows you to walk away from other things and the only new things that you take on be highly leveraged.\n00:39:27 - Chris Mason (chrismason.net)\nYeah, for sure. mean, I think I've got a moment of, I haven't heard anything back from that conservative group that said they were going to be hard to email copywriters and she's been on vacation, I think she goes back today. I was going to email and check in with them, just see what was going on and then my, I had The CPA I mentioned earlier, I met him through Brian's mastermind and he was in Nashville, took me up to dinner a couple weeks ago. He's a little awkward guy and he does all of his clients are on he just does a subscription with a monthly subscription. I think he's got two different office locations like he's got a house of wine and Las Vegas and he was in for his clients he bought the the white label version of go-high level and he just gave it to them. for free is part of their subscription to him. And I said, were you selling any kind of services or build outs to your clients and go high level? And he said, no, we're just making it available as a bonus. And he said, that something you would want to do? And at dinner that night, I said, well, yeah, that interesting. And we kind of left it at that. And I didn't really pursue it because I'm like, I don't know. This guy, he's I don't know. There's just something a little strange about him, like.\n00:41:45 - Tina Marie (profitdriversinc.com)\nOh, thanks, I said, you're good, always.\n00:41:49 - Chris Mason (chrismason.net)\nYeah. But but I was thinking I was contemplating today is like, we should have reached out to him and see because I mean, it wouldn't and offer like that, like. It wouldn't be at all. As clients, it'd have to be like a specific, you know, nitched client or something that could be replicated, you know, folks in sort of the same industry. So I haven't done anything with that. It's percolating in my head, but you know, like in September, I think I want to do another be a boot camp and in that all, you know, the last one was giving me a 10 grand and we did that one.\n00:42:38 - Tina Marie (profitdriversinc.com)\nCan I hate interrupting, but sometimes I feel like it's probably more effective to do that because I have an intuitive thoughts with the experience and the experience that you have had. I know that your intuition is very good, very, very good. Within the parameters, sometimes the intuition is just a don't do anything and sometimes we can use that just to make a very narrow scope of support contract that serves us and it's temporary. So you don't look at it as any kind of long-term potential but also there are always going to be things that you need to run through the good better best filter. You have X amount of time and high level brain energy to use each month. So to the point of if you say yes to anything this scope needs to be clearly defined, narrow and highly lucrative and highly leveraged and you can make the pitch of here's the offer take it or leave it basically. Now your energy is take it or leave it. The words are not, obviously, but you want to be very clear energetically in your heart that like, you're not attached to it. You don't care if they say yes or no. You don't think about, but I need this money because if you do that, it comes out in your energy. You need to trust that the money will come and you already have your, you've been improving the leverage and efficacy of your efforts in tight. Regardless of the fact that you should be getting more, it's still improving, not very quickly, but it is improving and your attitude and energy about it is making that leverage increase. We have been refining this process more and more and though it is small and not enough, 100%, it's a measurable increase in leverage, which is really important because It's also an increase in the compounding effect, meaning you're spending less time spinning your wheels and reactively responding to what's there in the Titan's world, do you agree with that? Yeah, for sure. so we have to trust that continuing to massage and leverage and refine what is happening there is to your best interest and that that simply takes a matter of time has to, but that we know that it has a return that it continues to improve for you because we've got other resources, other people, I mean, like where we are this year is night and day from where we were last year trying like at this time last year was when we were getting operational help and conversations. got Brian and Carla on to meetings, and you got a couple of different people helping as a result of that work, that, you know what I mean, you were so stressed out about all the emails that were happening and having to do the development work just night and day difference in a year, not night and day difference in the last six months, right? But in the year, which is why I like that as a look back, very significant and it only happened because of you. That would not have happened without you driving. You drove it, you obtained those results. So we got to take that into account. So now, I don't know how much time you have, but I don't have a hard stop.\n00:46:49 - Chris Mason (chrismason.net)\nDo you have a hard stop? Yeah, I got to go pick up Madeline at 2.30.\n00:46:54 - Tina Marie (profitdriversinc.com)\nOkay.\n00:46:55 - Chris Mason (chrismason.net)\nSo I can catch up on the fee.\n00:46:56 - Tina Marie (profitdriversinc.com)\nYes. But also, you If you want to have another conversation and I won't change the fact that I'll cut the invoice in hot to really kind of refine what's happening on Titans and help you just get a little bit more clear on what you're doing. I've promised you before and I mean it now, oh, give you more time. I know that you're very capable about doing some things by yourself, but I do also think that the experience that we've had is that I really can help you figure out a way to better leverage your time and I think that it's time sensitive that we have a deeper conversation about what's on the table for you right now so that the next time that three month comes around, it's not so stressful for you. Especially because that's coming around winter, holiday, time, know, I would really like you to be better prepared for that. So, if you want to have another conversation, not next week because it's the first week of school for my girls, but the week after. I would like to have an extra call.\n00:48:04 - Chris Mason (chrismason.net)\nWould you be okay with that? Yeah, yeah, that would be great.\n00:48:07 - Tina Marie (profitdriversinc.com)\nOkay. All right. So yeah, let's dive into tea and then we will come back in a couple of weeks and please do feel free to use voice messages or whatever as you're contemplating things. But really, let's set the intention that the next three months, you're not stressed out like this. Let's let's meet that happen. Okay.\n00:48:28 - Chris Mason (chrismason.net)\nOkay, Mullen. Yeah, so the, I mean, the tea is steadily moving forward. just been, it's just so slow. Like, and I know that if I was doing this, like, it'd be done and up and running and I think the, well, I'm Today, I'm supposed to get an update from their developer who is connecting ClickBank to ConvertKit. I gave him everything he needed on Friday or Monday of this week, but easy connection. mean, easy for me to say, but I feel like it's easy connection to make. So that buyer is using ConvertKit for the tea company, and so he's like, I'll have an update for you on Wednesday. so sort of my way to see if I can update today. And if I don't, then my message tomorrow is like, let's get on a call. Let's figure out like, why does that It's taken so long. And to figure out what the roadblocks are, hopefully there are no roadblocks I don't know about, that would be not great. And because the product has already been approved, in ClickBank, the sales pages are up. They're just not, it's not live on ClickBank yet. I've got all the initial email. Like everything's sitting there ready to go. And John, I think it's yesterday, John texted me, he's the elder, he's the dad. And I was just apologetic, but it was taken so long. And. So I just, I just don't know why it's taking so long.\n00:51:12 - Tina Marie (profitdriversinc.com)\nAnd this is not still the server issue?\n00:51:15 - Chris Mason (chrismason.net)\nThis is not still the server issue. This is like just the crossing teas, dotting eyes, getting all the back and stuff to connect and that's probably not there. I don't know. Let's say it's not their forte. They've got this developer bin who they hand all this tech stuff off to. And so maybe it's just, and I don't know, been under a minimum. And so maybe he's just the hold up and they're not pushing him or he's not the kind of person I would hire or I don't know what it is. But yeah, it's just feeling like this. it's just taking way too long to get this offer up. But it's funny when I think about, then I spent this morning, because I wasn't feeling great this morning, and I had a headache, so I was sitting there thinking and I started making a list of what are my client options and then my brain then goes to, I start thinking about the tea, like, the thing I like about that is it's product-based, it's something that we can build, at the heart, it's really a nutrition company in the health space, which gets me excited about that. And where that can grow, we all have the, we're all thinking, eventually this is something we want to build so that we can sell it. So, but I brought that up because I was like, part of my mind today was like, well, I just started like going down these rabbit trails and Google keyword, was like, what are people searching? And then, like, the quilting niche and what are people searching for and, you know, dog training. I was just like, because I started thinking like, maybe, because I hadn't really, anyway, I was like, maybe I should be open and just kind of spend some time thinking about this and I was like, well, that's kind of what attracts me to the tea. So, I don't really have like an end point in that, it's just where my mind's been today, like I've been looking at that. these different niches and thinking that, well, I did kind of lean on one, you know, the fastest path I need some cash is probably doing some kind of client work, but anyway, I've been kind of, I've been kind of all over the place this morning. Yes, I've been off my game, well, I guess, whatever.\n00:54:31 - Tina Marie (profitdriversinc.com)\nSo, here's what I think. I think there's two things. First of all, I think we have probably about two years, because I think that we finally hit the, what happened in 2006 to 2009. I think that we're, I think we're right around the 2007 kind of numbers. it really tanked in 2008.\n00:55:02 - Chris Mason (chrismason.net)\nI don't think we've hit bottom.\n00:55:04 - Tina Marie (profitdriversinc.com)\nSo I don't think we're at 2008 now, but it started in 2006. People really have focused on 2008, but it started happening in 2006. If I recall correctly, going through all of that, it was shifting then. Anyway, so always be thinking leveraged, and the most leveraged thing that I think that you can do is be a high-paid consultant. Now, why that's leveraged is how much time you spend doing it. You have enough connections, but here's the other thing is, you're in a situation where almost everybody is not highly leveraged, and that's the issue. don't have the kind of money to make you a highly paid consultant. So the way that you could be leveraged is having somebody that you can actually use, who is not as smart as you, might be very good and should be very skilled, but not as smart as you and aware as you in terms of being leveraged. So a lot of the contractors are not making, probably not going to be making the money that they were, because the people they were working for are losing money kind of a fist because they don't manage their business as well, and they don't manage their money well. There is going to be a shortage of client work for those middle level people who are really good at what they do, but who don't have a marketing engine to get them new clients and who are losing clients because their clients can't be. So what I think that, and this is going to be like we've talked about rolling up your sleeves, and you've been there for a while, but It feels different when you have somebody else to riff with and to work with. I think what you should be figuring out is, and to me, I think Chris, one of your most powerful and valuable skills is offer creation. The hook and the offer is high level strategy, but then most people don't have the fulfillment team to write that copy, write the email, write the sales pages, write the follow-up sequences, and that actually is not as valuable, but it is necessary to offer creation. Most people don't have the brain for the offer creation that can write copy pretty well. Okay, and they don't have the co-honies to say, hey, this is what you should be doing, and here's why, and they won't do to do the math, but they can write the persuasive copy. So what I think that you should do, and this will take a little bit of time because you gotta find the right person, but I think that you should focus on a consulting gig that makes you a minimum of $100 to $150 per hour, effective hourly rate based off your number, and that might change after you go plug everything in. And then what you do is you price it accordingly, and then you go hire a copywriter to help create your vision that you copy chief, again, trying to focus on that effective hourly rate, being an increase of what you've already been doing. So that way mentally you're like, yes, I'm working more, but I have raised my value and I can see it. So that level of satisfaction, and basically what you're doing is removing that friction and that resistance that's been stressing you out of I could be doing better. because now you know you are doing better. Does that make sense? Yeah. So I know you got to go, but what I want you to do, and let's revisit this. Again, we don't have to wait until we meet. can have these conversations, okay? Look for some consulting jobs where they need help with offer creation and leveraging their business so that they're not bleeding money and they're getting the most out of what they already have, right? Repurposing things, improving their offers, their leverage. Nobody's talking about leverage, really, you know that. But that's the saving grace for us in these hard times, is leverage. So create leverage, and then you go leverage somebody else's writing skills and ability, or even chat GPT and train it well, but focus on leverage because that's the thing that's going to keep you, especially in this third month. people from stressing out. We need to talk more. You've got a lot on your plate. Use me. This is my genius zone and I want to use it for you. I don't want the third month to be stressful for you. There's no need for it. You've got too much value and too much that you bring to the table to ever feel that again, no matter what the economy is. Okay.\n01:00:26 - Chris Mason (chrismason.net)\nAll right.\n01:00:28 - Tina Marie (profitdriversinc.com)\nI fixed the invoice. don't know if you saw a screen share. I didn't realize I was in paper. I adjusted it. I sent a schedule for it to me in two weeks. Please talk to me more. Let's make sure we get you through and then ready so that the stress month doesn't ever come again. There's no reason for it, Chris. You're very good at what you do. You make money. There is still money out there. We just need to get you correctly aligned and leverage. bridging other people.\n01:01:03 - Chris Mason (chrismason.net)\nYeah, that makes sense. I'm bored with that.\n01:01:07 - Tina Marie (profitdriversinc.com)\nYeah, it's all there. You've done we've talked about the community and your network for a long time. You are primed for this. We're just going to need there's going to be one other talent person that we need to figure out. So ponder on that. And we'll we'll find it. But but you're in a good spot. Still, we just need to use it better.\n01:01:30 - Chris Mason (chrismason.net)\nThat's all. Yeah, I think so. Yeah, I mean, it's a it's a better third month than the last third month.\n01:01:39 - Tina Marie (profitdriversinc.com)\nBut definitely the next one's going to be better. That's what we're going do. We're going to make the lows higher and the highs higher. That's the improvement. Awesome. Okay, it's always good to talk to you. Let's keep talking.\n","contentPreview":"00:00:01 - Chris Mason (chrismason.net)\nHey, how are you doing?\n00:00:03 - Tina Marie (profitdriversinc.com)\nApparently too eager to meet me because I got here to meet.\n00:00:11 - Chris Mason (chrisma...","processedAt":"2025-05-04T03:40:52.556Z"}