{"fileName":"Done Transcript for Warren Trust Ops.txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Warren Trust Ops.txt","type":"transcript","priority":"medium","content":"00:00:11 - Seth Ellsworth\nHello.\n00:00:13 - Tina Marie (profitdriversinc.com)\nHello. Kind of quiet.\n00:00:18 - Seth Ellsworth\nAlmost be my hair pods.\n00:00:21 - Tina Marie (profitdriversinc.com)\nYou're nice and loud now. Okay. Well, I am struggling with energy. I'm super allergic to where I live. And yesterday I had an asthma attack. I wasn't sure I was going to survive. And I'm just kind of sleeping. Yeah, it was pretty scary. But also I've been through stuff like that. But anyway, my brain is just not, well, I don't know, my energy, I think my brain is fine. I just, and I feel tired. So hopefully it'll pick up. I've done all the things. It either will or I won't. But yeah, just letting you know how to time if you're like, what's up?\n00:01:21 - Seth Ellsworth\nI'm sorry. No worries.\n00:01:26 - Tina Marie (profitdriversinc.com)\nI'm used to it. Just got to let people know because my energy swings so much because of health. That sometimes people are like, what, like, is it me? Did I do something? So I just got to let them know at a time that I'm like, no, I'm fine. Everything's fine. It just feels different. Not me.\n00:01:51 - Seth Ellsworth\nAwesome. Yep. Okay.\n00:01:55 - Tina Marie (profitdriversinc.com)\nI'm excited for this. excited to see what you've been doing. I think if we can screen share. I've been praying for it every day for you and also for them so that we know that we can be inspired for them to help us them accomplish their mission and know how to package and put things together. So yeah, anyway, I'll be quiet. Thank you.\n00:02:20 - Seth Ellsworth\nSame. So we're thriving on the same level there. So can you see the workflow? I'm sharing. Okay, let me point out a couple of things here. They just did this event last week. Okay, they reinvent your self-summit and over five days they traditional summit style where replace available for a while. If you join our $39 month thing, you get all the replays, plus all 80 of my meditations or hypnosis audios.\n00:03:13 - Tina Marie (profitdriversinc.com)\nHow much of that for?\n00:03:16 - Seth Ellsworth\nThey sell those on their shop. How much of these on the summit for? It was free.\n00:03:25 - Tina Marie (profitdriversinc.com)\nOkay. Okay.\n00:03:27 - Seth Ellsworth\nI think they had a VIP level. And they only got like 30 people in there. Oh, I have no idea how many people they got in there.\n00:03:38 - Tina Marie (profitdriversinc.com)\nOh, I thought you said okay.\n00:03:40 - Seth Ellsworth\nI was like, wow, they had a VIP level. And this is because this this thing right here, I'm going to highlight it in yellow. This is their seems to be their new focus is building this community. This is this is on Um, mighty networks, okay, $39 per month. And I imagine, you know, that's, this could be a play that, and John mentioned this on our first call, it's called grow and transform. Um, getting more people into this would be freaking child's play with a proper email. Um, So this could be the guts of what we suggest for them as a focus. Um, So, so that's, that's, that's a potential direction. Now, just to give you a picture of, of their business model, they kind of have two paths or two buckets. And these are absolutely not clear on their website either. Uh, because there's a lot of confusing crime. crossover. But they have the RTT therapy and personal development. And here they give away some regifts. Here's the landing pages to get a therapy partner. So so Marissa does not do therapy calls. She has a team of therapists that are trained. And people book calls just like they would from any therapists. So there's that. This, if I had to guess, is a small percentage of their revenue. Because they're therapists, we don't know because they haven't asked those questions per se, the career, the career path where they become a therapist and are allowed to offer RTT to their, to their clients. That's the 15. This is the $15,000 high ticket thing. think this is probably 95% of their revenue.\n00:06:09 - Tina Marie (profitdriversinc.com)\nIt based off of experience with other people and smaller models where they do a thing or they teach people or certify them how to do the thing.\n00:06:20 - Seth Ellsworth\nThat's always the case. It's the teaching and certifying, yeah. Right, so this certification, and they do have a certification course, I'm sorry, they have a course and a certification, but it seems to me like they drive most of the traffic to the book a call stuff. So let's see, book a up here. So there's that. We have, they have events. They do these all over the place. They have events for both tracks. One, the track for people that want to experience their own breakthrough and the track for people that want to be practitioners and then they have events as part of their fulfillment. So there's marketing events and then there's fulfillment, fulfillment events. This is, this, their conversion is probably really, really high with this. don't do a lot of marketing events. And I'm sure that that expands a lot of resources and time and they're getting older. So I'm. An educated guess would be they don't want to do more events.\n00:07:41 - Tina Marie (profitdriversinc.com)\nRight.\n00:07:43 - Seth Ellsworth\nSo an evergreen thing that runs that sells this $39 a month deal to where they don't have to do this is the first time they ever did the reinvent yourself summit that's a brand new thing. I have no idea how it produced. And a lot, I watched probably 10 of those sessions released the replay and most of them were recorded previously, which is a big undertaking, but now they have an asset that they can use. just, my opinion would be, this is incongruent with RTT because it's a bunch of random value that is not going deeper with their unique ability. So Marissa showed up and she did, she was, I think on three of the days, she was the first segment where she led them through a meditation or a sorry, I keep calling a meditation hypnosis, which great, but to me, they're running somebody else's playbook here. which is incongruent with this offer. So what we would do for them, essentially, this would be what I would look at, is I would go to their, let me share a second. I'm sure my browser. Here's a re-event yourself summit. Lander. They had some ballers in here. Jim Wick. John Asiraf, James Altucher, Pace Morvey's huge. He's a $600 million guy. But he's real estate. And then, anyway, this is a very, very random sampling, which I think is good five years ago. I don't think summits convert very well. And I could be wrong, but if I had to guess, I would say this didn't exceed their expectations. Here are landing pages. This is a landing page for free gift that is for somebody who doesn't know what path they want to go on. Here are an example of four gifts that they give away for free. So you click on this and you fill out your name, for each of these. So potentially, we could take one experience from this bucket. This is the this is the heal your self personal development bucket. This is the I am enough meditation. She has a book called I am enough. This could be a big one because that could also support the book. So my questions to them would be which of these produce the most revenue. And then we would take this automation or sorry this hypnosis and automate a four or five day email based experience for this. And also do the same thing for their free gifts. Let me see where that was the free gift. Okay, here's the opt in for the training courses, which is essentially just a prospectus that or a guide that it can opt in for. But we can take either their prospectus or their guide and then turn that into an experience that's delivered over time so that people can determine if being a therapist is right for them. So that being said, that right now they're pulling, based on our previous conversation, they're pulling a lot of their therapists from those who go through the personal development track and they say, hey, this would be really fun to make money with. And so there's a bridge that goes from the personal development track to the certified therapist track. And that is, is this right for me? My, my sister-in-law is a, she's a fangirl of Marissa. to like hardcore fan girl. This is almost all she can talk about. It's wild. And she's the kind of know it all girl that, you know, she has a solution to everything that yells you. And she's been considering this, but she's still on the fence. So it's an interesting ecosystem. They have, here's their book of call, which is literally just a book of call. this apply now just goes to their certificate or their $4,500 course for their, they call it certification. So is only $4,500 and they have a $15,000 like business in a box version of that. based on what I understand. Anyway, here is the shop just to get a real quick overview. They sell bundles of hypnosis audios. And each one of these kind of has its own little bucket. It is very unclear which of these does the best other than best seller bundle. And then here they categorize these based on the buckets that they serve love and relationship, health, overcoming addictions, personal development, wealth and success, weight management. And these trainings are our courses. So there's also these other foundation certificate for hypnotherapy. um, foundation certificate for rapid transformational therapy, I guess you can get started for 240 bucks. Um, confident coach, certificate and applied and this is the one videos. They have trainings and then they have a certification and then a business and a box $15,000 thing. Uh, sold via phone call and live events, most likely. And also have a couple of webinars. I didn't mention that. Um, I don't really want to touch a webinar, but, uh, they have one. So it seems to me like the, the better questions would be which one makes them the most money. Um, is $39 a month, their current focus, if it is, why don't we turn their current assets into an automated evergreen experience that upsells people into the $39 month thing at a very, very high rate. At $39 a month, based on their current price points of their hypnosis audios and people going through the hypnosis, conversion rates gonna be really, really good. I wouldn't be shocked to have 15, 20, 30% in terms of immersion. So, this to me would be, I think we can be reasonable in our... communication of expectations. But to me, this would be a home run. I can't imagine not hitting a home run with this. This is right in my house.\n00:17:14 - Tina Marie (profitdriversinc.com)\nWell, it's so you have to keep in mind what their goal is is to break the $20 million ceiling. And that's really difficult to do with the low ticket offer. So there's more to it than that. So here's some questions that I have. And I'm going to give you a stop your screen sharing I'll share from in a just a basic little thing. And just share some questions with you. But I'm going to show them to you so that you can visualize it as my share. So these are the things that we want to know because there's several different things. And I broke this down. What's the right down at your revenue? But percentage of your revenue comes from each offer. You can see the power in understanding that, right? How much of it from? But we need to know from everything, even if it's only 2% comes from weight loss. need to know all of it. Chances are pretty good that they won't know off the top of their heads how much they might have a guess. And so the next question is, what effort is applied to each offer, meaning what ads, landing pages, just follow up sequence, what did they focus on? We need to ask these questions and also get a read on their answers. So you can ask them ahead of time on the call. But I'll get to this in a second. Do you have any Google or any other kind of analytics? We will need access to that. What things are you wanting to do less of and why? For example, Brian wants to do, Brian Kurtz wants to do less events. He's hitting an age. And that's why, because he's just, he's tired. And so it wouldn't surprise me if this is something that they want to do less of also. What do you want to do more of, and why? I would imagine they want to do more of a scalable thing, because they're getting older. we don't want to leave the question. We want them to answer, and we want them to answer honestly. And why we're going to find the gold and the magic is where what they have gets optimized with and overlay what they want, where they want to go. So let's say that the primary, and this will be the biggest issue, and the biggest hurdle, if the primary source of their revenue is live events where they sell people into becoming a therapist and becoming certified. that's what they want to do less than. That's a problem. Now, there are a couple ways to look at this. So it's a problem meaning that's the thing that's already working and they want to do less on it. What you don't know is what the onus is that they're putting on you. Is it Seth, I saw your thing that you do and I want that or is it that I need to break a 20 million dollar a year ceiling. They seem like the same goal to them probably, but they're two separate things because you're not necessarily saying that that's the thing that we can do, especially if when they think that in their mind, they're thinking he can get us to do that without us doing the thing that we're already doing. But it's much more difficult. Let's say they're selling that for 10,000. or $15,000 or $20,000 or whatever, and they want to cut that source off, and now, like, how many sales do you have to make at $39 a month to recover one $20,000 sale? It's ridiculous, right? how much traffic exists right now? Do you even have the potential to be able to do that? So then, here's the thing, what they may be able to do is transfer what they've been doing at events to a lesser degree through your email automation sequence, so partly the selling and the transition from, I've been taking it, now I want to do it. Or I took a career path and I was doing this thing, and now I want to do this thing. So figuring out, whatever their highest revenue thing is and figuring out how to make that experiential. So let's say that their biggest source of revenue and audience and fan base is their events and it's because they what people tend to pay most for is two things results and access. Access doesn't have to have results. Access is I get to say I met so and so I get to say I get to take a picture with someone so people will do that because they think it makes them look big better so people will pay big money even if they get no results out of it just to go see these people so that's something right. But the other thing is results so there's there's another play where you don't necessarily get access but you can say I went through the same thing that John asked or after it or Jim quick or whatever, or you can see you learn from them because they're your mentors because you took a masterclass with them, that type of thing. It's the psychology and the angle behind all of it. the other thing is how much does it cost then to put on those events? Well, if they're paying for those speakers and chances are pretty good that they're paying money for their speakers because of who they have on them. Generally those level of speakers you're paying for them because they're not doing it for free. It's part of their job. They get paid to speak like Marissa gets paid to speak. So how much money does it cost them to put on their events and then how many times are they doing events? Actually, let's go look at and what's the conversion rate and what's the the revenue. So Let's see, these are physical events, three in April, two in May, two in June, nothing in July and August, one in September. So that's a lot of events and that's a lot of traveling. And let's say that whatever, like you could put a price on how much the event costs, how much time it takes to do and how much set up. And then you've got a conversion right on top of that and how many people actually get into it. So what if, and you can only put so many people into event because of cost, because of travel, because of location. But what if the events could be either their virtual or something else where they're not having to actually spend as much money or as much time organizing it and it's maybe It's an evergreen thing, and maybe they can't because it's not as experiential can't charge as much, but maybe they can get two or three as many people in there, and the conversion rate might be less, or the price is less, but because they can get more people into it because it's less cost prohibitive, and because it's not location prohibitive and all these other things, and then your, so let's say it's a two-day event, three-day event, let's see, these are four-day events, that's crazy, that's a one-day event, that's a four-day event, that's a one-day event, that's four-day event, so they have one-on-four-day events. Let's say for the four-day event, you know, you break it across three weeks, like event, it's immersive, and it's super... accountable, right? It's like, did you show up for this? Did you do this thing? Did you show up to the thing? Did you do this thing all the way through? And so there's a potential that they could replace their events or even, you know, let's say they replaced half their events at their age. That's a big deal. If they only did, you know, event at a quarter and so they could charge more money for it because they're doing it less, then it's a lot less stress to them, a lot less effort, less cost, but they can charge higher prices and get maybe more premium level people because they're still offering this, they're just doing it in a different way. I think that that's an angle that you could bring. I think also, if they don't have a CMO, like, that actually does a really good job, that is talking to them about scaling and other opportunities and leveraging. I think that that is kind of, yeah, who is it though? How good are they doing? Because they feel stuck and they're not leveraging their email list. all the things that you said, you're seeing them all dropping them off.\n00:27:17 - Seth Ellsworth\na Dobson.\n00:27:21 - Tina Marie (profitdriversinc.com)\nOkay, and how long has she been with them?\n00:27:26 - Seth Ellsworth\nI'm not sure.\n00:27:31 - Tina Marie (profitdriversinc.com)\nSo, you know, if I'm a CMO, I'm not letting my people not do their email stuff and not be managing all of these things. So, you know, there's an angle of, do you want some more help? let's just like call yourself something. are you a scaling expert? you a retention expert? You're the completion. experts, but you have more gifts to bring to the table and a team who has other gifts to bring to the table and a $100,000 offer that you want to make. So I'm just telling, I'm just trying to help you figure out like what are some of the things that you could do and also learn from this in terms of like what people need. Generally, getting to this eight-figure business level, I can't even tell you, I've got one, my eight-figure attorney, how much is just left on the table and it's just, it's a slow walk, but it's a steady walk upwards, way less time working, way more money, and we don't have to change a lot. eight-figure people for the most part get it and you need them to get the help, they go get the help, like it's a whole different ball game than bottom seven figure people, like low seven figure people, which is what, you know, most, I can barely make six figures, even wrap their hands around, I think seven figures is great, but on a business level, low seven figure people are a lot of times just still struggling. Just, they got there by dumb luck a lot of times, or just by hustle and grit. Now, to get to eight figures, you have to have learned some things. A lot of that can still be hustled and grit. Like, it's really hard for people who aren't operating in the space to have any idea what it actually looks like. But, you know, showing up at events, there's a particular look they have, conversations they have, like, you just know that it's charisma, personality, obviously the psychology behind it, what they know, NLP, things like that. They know how to persuade people to do things. He also can teach and give real skills. It doesn't mean that they're great at business and optimizing things. And they know that, which is a key opportunity for you because you do understand conversions and conversion rates and how to combine. And also, I mean, it's just perfect because they understand the psychology behind it too. And you can ask them, you know, are you applying everything that you know about psychology to your email sequences? Answer is no, 100% the answer is no, right? So how much more powerful would your stuff be if you walked the walk, right? So you just show them the things that are left on the table. So going back to this, what percentage of, what do you call it? What's the breakdown of your revenue? What do you wanna do more of? What do you wanna do less of? That's gonna be really huge. And then where's the money coming from? from, and how do we leverage existing assets, traffic, et cetera, to break the $20 million dollar ceiling? And so, what have they been doing? Have they, even having to do more just to keep hitting the $20 million, they probably have, right?\n00:31:53 - Seth Ellsworth\nBecause they're suffering just like most people.\n00:31:56 - Tina Marie (profitdriversinc.com)\nRight, right, exactly. how would it feel Also, is it what is the ultimate financial goal, retiring, selling, because we want to understand, you know, what it's going back to what are they want to talk to you about, like, says, stay in your lane, just build us an email sequence. So we've got to be really clear on that. do you want me to just talk about how I can build you an email sequence and off to the biases, or would you like to really go into kind of a business audit and an opportunity on it for. What, what I see that you could be doing and. you know, there's that. So that's a conversation. These conversations, these questions, you could ask ahead of time, maybe fill that out, pray about it, and we can meet again on Thursday if you do end up talking to them at all, or Friday, go in and start asking questions. But at the end, have a pitch to make because, and also, is it increasing wood, increasing margins, even if top line dropped a little bit, but bottom line room. is our goal. Especially if it's scaling. and lower barrier to entry. So it means it should continue to be scalable and growing like the, you know, $39 a month offer. Because what I think that the offer is, is that we do two things. We figure out how to experience, like email experience if I. What we're doing in their events. And then also. Apply the same treatment to whatever their other top two top three offers are. So that's a lot of work that's ongoing. But. Most of the work is in analyzing their data. Which. we can do together. Chris is actually also very good at that. The automations, so we're definitely going to want what's his face, but we can also probably go hire other people. And I can help you with that and we can do that on the call together and just go look for people together. And then I have a whole process for hiring and testing people. We can do that together too because we're going to want more people than that. If we're creating this offer and doing it more. And then Chris would be writing the copy which he'll be paid for.\n00:35:40 - Seth Ellsworth\nWe might have to find somebody else besides Matthew because he's tapped out.\n00:35:46 - Tina Marie (profitdriversinc.com)\nWe can find other people. promise that there are other people who are amazing at automations and they're just quietly working for other people because they're not. They don't want to run a business. I just want to get paid doing their thing. My experience with hiring people this year compared to even just three years ago, night and day difference, I'm shocked at what they know because the world has just changed that much, especially since COVID, in understanding online business. So the resources are massively increased. So I'm not worried about that, we shouldn't be. With Copy, if Chris can't do it, we've got a whole bunch of people to tap and we can tap through him or, again, we can go out and hire. whatever has to be built, the biggest thing is that we need to have the money for it in the sale. So it needs to be, this should for sure be $100,000, not 75, and with a potential growth. So let's say that $100,000 covers the email. experience of their live events, plus one other thing that leads up to the selling the live events. So it's like a breakthrough challenge. Obviously, that's right, right. And if it's not, then we plug in the things that are. So either way, what I'm saying is that we do something that is akin to building them a breakthrough challenge and T three, right? So it's the small thing that leads to the big thing and it's all an email sequence. And the goal is to do that in a quarter, but you have to build it and then you have to, and that may take longer than three months, depending on how long it takes them to get us all of their material. And you need just tell them that, you know, like, if you could hand everything over to us the same week that we close the deal, then, you know, 90 days we could do this. But the odds are that most people take a while to hand everything over, and it takes a few weeks, takes about four weeks, a lot of time to get all the stuff. So they'll send you stuff, and then you'll say, I see a gap, and then you ask for it, you send a request, and then it takes them a few days, and then they send it back. So there's this whole process. The first 30 days is really just a transfer of access to things that we need. Then you have to create the framework and say, this is what I think it should be, and go back to them and say, do you agree with that? That's another roughly about three weeks, and then you start to build it roughly about six weeks. So that's where we're at with the 90 days, and... And then, so is it like, once we get all the everything that we need is 90 days from there? No. Or 90 days total, factoring in, it could take up to a month to get everything we need. Yes. And if it takes longer than that, then it pushes our timeline out. And we're talking 90 days from the first iteration for the first iteration. So then it has to actually be sold and we put people through it. And then we have to see how it's doing and watch it. So that's another 90 days, because it takes time to get that feedback going. It takes time to see if something's stopping them and then we tweak it. So really, we're looking at a six month runway to make sure that we build, launch, and optimize the first level. of whatever it is that we built. So the six month thing allows some fluidity between the 90 days, you know, it doesn't have to be exactly 90 days that we launched it. The bottom line is after six months, you've got something and we've optimized it and by now you should be getting your money back if what we're doing is applying the email treatment to the thing that makes them the most money. So but they don't have sales copy for that. So they do for a live event but it's an angle. So there's a lot to be built. So the hundred thousand dollars is we're building this giant thing that replaces what you're already doing and it's scalable but also we're building the feeder into it. we'll be building the copy for it. We're going to, we're not going to just give it to you and say, look, we're going to give it to you and watch it with you. We're going to give it to you and make sure that it's working. Whatever is not working, we're going to fix. And we're going to stay here until you get your money back from your investment with us. And that shouldn't be a hard scary thing for us because it's just doing, I mean, this is stuff I do regularly. This is what chris us regularly. We look at the offers, we take, tweak it and test it. So let's do the map, you know, if you, hold on a second, if we sell it for $100,000 to buy a buy.\n00:41:46 - Seth Ellsworth\nIs that one other, one other thing that I think is a big little mover for John, like he wants his team to be top notch. And I get, I get the fee feeling that his CEO, Skip Johnson, and Amanda Dobson are new. I think he wants, I think he wants them to be trained. So that is another level of this. like, Hey, we're 100 K and 30 K per. Order, like we'll be fixing this optimizing it, making sure your team is fully capable of running with it and the understanding the strategy behind it because we've taught them what we've done and why. So that they could potentially build other assets without us.\n00:42:43 - Tina Marie (profitdriversinc.com)\nYeah, effectively, effectively working ourselves out of a job. So then maybe you sell it for it's 100 K plus for 90 days. And then it's. 150k for six months, which is a lot less for the follow-up, and we'll train your team. They can show up to all the calls where we are working together and diving into this. We will explain it. We will document it through a loom process of, look, this is what we built. This is the psychology behind it. This is how we analyzed it. This is why it's working. These are the things, the team that we need, you need an automation person, you need a copy person. We can tell you how to hire these people, you potentially, we'll do that. I think that's the, because honestly, an extra $50,000 for the three-month-light positioning at that way, 100k, it's 90 days. This is everything that we're building, and we're going to need, you know, An omniscience people were gonna have two copywriters like there's a lot to be built and and outline what has to be built Right, so there's the landing pages. There's the sales pages. There's the follow-up sequences that Nurture the people who didn't purchase from the landing page to the cell page For however many weeks and then there's the actual experience that is replacing a live event So you're talking about high-level Strategy that we're applying it to going through all of your material Making sure that we're choosing the best stuff and then turning it into experience like that is a lot of Mental work and we're paying high-level people to do it You mean Chris whoever else you know, we're we're looking at the stuff. So that's that's a lot and Then on top of that rather than building your dependency And then upon us, you know, obviously you're going to want to keep this skill and how as much as you can, we'll train your people to do it. And it won't really be an extra step. We're not going to say we're going to certify your people doing it, right, that they can do it. We're just going to make sure that they've got everything they need, which will be easy because what we're doing, if you want your clients to be really happy and you want to be able to get a raving testimonial, but you have to show them what you've done. have to show your work. So we'll create loom videos where we go through and say, here's everything we've done and broke it down so that they know and then we'll show them the data like, here was your baseline data. Here's what you were making. Here's this new offer. a completely new offer, right? Here's the revenue it's made. So we'll have evidence to show them so that they're like, I'm very happy I paid this money with you. I can see your results. That same material will work to train. There are other people because we'll show them this is what we did.\n00:46:01 - Seth Ellsworth\nThis is the details of what we did.\n00:46:03 - Tina Marie (profitdriversinc.com)\nSo it's one action, two benefits, and but also two values. We're not selling them on the reporting. It's just what's going to happen. We're selling them on training their team, but training their team is going to happen as a result of the reporting.\n00:46:25 - Seth Ellsworth\nSeven cents. Yep. So really just high level questions first about what's driving the revenue and then what do they want more of? What do they want less of? Customize our pitch to either that event based thing or selling the $39 thing for whatever reasons they want. then the offer under K over 90 days done for you 30k per quarter from there on out. Just stay on as long as they want. All this based on the fact that they want more revenue, they want less time spent, less resources spent, most likely, and their email game is currently abysmal.\n00:47:14 - Tina Marie (profitdriversinc.com)\nNon-existent.\n00:47:16 - Seth Ellsworth\nYeah, so let's say their angle is, like for us, we also have quick wins, for example, when somebody opts in to anything, we just add the little reply trick, and that is a forced multiplier for the health of their email list as a whole, which is huge. They have a huge, huge list. I don't think it's efficient. I don't think they have access to their whole list, because it doesn't seem that they're the email very well, but they do have a very big audience on social media.\n00:47:51 - Tina Marie (profitdriversinc.com)\nhave lots of assets. So, that's something else that you could bring down, like if you're going to do a... atomized invoice, the email health and an email audit, you could call it, but you can put a price point on that and you have to, you can put down why it matters, why it's necessary, you know, so if they're like, well, what is it? Because most of time, the biggest thing that you'll get, so people that pay the most expect the least, the difference is, what am I getting for my money? That's a conversation that you'll have. What does my $100,000 get? People with the least amount of money, they want to be told you're going to make X amount of dollars with it, right? They don't want that atomized details. They want to know the mouthwatering details. People that pay a lot of money just want the bullet list because they can look at the value themselves. So the email audits, why it banners, you can break it down, open rights, conversion rights, follow up sequences, inbox placement, email help, all of these things are, and you can say like how much money do you spend on email, on your email holds, how big is your list, like how much money are you bleeding, and I don't know how much you want to get involved into it, but if you're going to be doing an email sequence, I would imagine that needs to be part of your service anyway, which is going and getting their sender score, and figuring out getting a report, you know, what's their domain health, what's their domain score, where are they emailing from, all of that, an email audit should be built into it, and it should be high value. So that, you know, look if I'm going to have you build all these emails, are they even going to get to the inbox? of your people, and what types, like where are you sending from, all these things. Anyway, so an itemized invoice of here's the copy, here's the automations, I don't know if you want to do that, I don't know, we really have to think about that, and I think looking at it will help us make a decision. Do we do it that way, or do we not put a price point next one, but say these are the things that we're going to do, email audit, write the copy, here's the types of copy that we're going to be doing, X amount of landing pages, a range of landing pages, a range of email follow-up sequences that are solely to ascend the opt-in person, the lead to sales, and then the email experience is a whole separate thing, right? That is the primary chunk of of everything. But for the email experience to work right and to work best, it means all of these other pieces into it. And then there's the analyzing, right? The iterations and optimizations, all the things that happen. So if you're putting together an itemized list and you're not putting, I would not put a price next to each of the things, but I would create an invoice. And this really should be your offer. And it will be specific to them, but you'll be able to model it for other people because it's going to be very, very, very similar, right? Which is these are the things that we're offering. So the small thing that leads to the big thing, so that there's a whole ascension process, the $39 all the way up to whatever the, become a certified, whatever, RTT. person, a therapist, in that thing, in their specific skill sets, in their therapy, that's telling me my brain right now. I'm also looking at like all their different words and things on the page while I'm looking at this, my brain is reading one word and saying another. Anyway, that's what it should be, so we should have that ready in a Google Doc, so we show up, we ask them all the questions, and ask them the questions. Basically, it's going to solidify what we already know, and it may allow us to tweak, so plan on some conversation back and forth between you and I in the background, as the call is happening, and then we give them the offer, and you have to decide what you want the price point to be, it's $100,000 $150,000. But the burden is that you have to convince them that they're going to get their money back and grow from it. Because, I mean, why spend their time if all they're going to do is just get their money back. They need it to grow. needs to be more than what they put in time and energy. Coming out with a better marketing team as a result of it, because you've gone through and got data. So, you're going to want to ask these questions. And are there marketing people going to be there on the call, do you know?\n00:53:40 - Seth Ellsworth\nSo far as I know, I'm at Adopson and Skip Johnson, the CEO and the CMO, are as well as Marissa and John Davies are to be on there. Okay.\n00:53:55 - Tina Marie (profitdriversinc.com)\nSo, we're going to want to ask very specific questions, which will reveal what they know. they don't. So we're going to want to ask, okay, um, do you have a heat map on your pages? What percentage, like, okay, how much traffic do you get?\n00:54:11 - Seth Ellsworth\nHold on a second. Where's my question? can figure that out.\n00:54:14 - Tina Marie (profitdriversinc.com)\nYou can figure what out.\n00:54:16 - Seth Ellsworth\nThe heat map. I can just find the code on there.\n00:54:18 - Tina Marie (profitdriversinc.com)\nOh, you're missing the point. That's not the point. The point is we want to show what they know. So, um, do you have a heat map? It's a focus on what the point is there. Heat map. How many unique visitors per month? What's the bounce rate?\n00:54:45 - Seth Ellsworth\nWhat's the bounce rate?\n00:54:51 - Tina Marie (profitdriversinc.com)\nHow long did people say? Do people stay on site? primary traffic sources, and what's the average time per landing page version great for offer. For average part value, per offer, or TV, per customer, per channel, per offer. Guarantee you they don't know these answers, almost nobody does. If they know them, they have an amazing marketing team, but we know that they don't have an amazing marketing team, because if they did, they'd be doing a better job of emailing, right? Okay, so what these questions are going to reveal is your marketing team isn't looking at what they need to do again, because the marketing team is going to be there and they're not going to have the answers. So if you don't know these things, do you have analytics we can review because we need days answers to optimize what you're doing. So that allows you to add in to your value offer, and you can cut it if you don't need it, but it should already be in a Google Doc with everything that we're offering, which is because we will train your marketing team on how to... make sure that you're optimizing all of your sources and that they know all of these things, but also they can review the results of your marketing efforts to make sure that each of these things that we're looking at is at optimal levels. And you just, that's just part of your value stack up. Here's the price point, but here's all the things that we're gonna get. So you're gonna, all these questions should reveal numbers and data and all that data should sell your offer for you.\n00:57:43 - Seth Ellsworth\nSeems to me we'd have to send all this stuff prior to.\n00:57:47 - Tina Marie (profitdriversinc.com)\nNo, you just have to have it written ahead of time because if you send it prior to, you miss the opportunity of revealing what's not known because they, their people can go scramble and look for these things. You need the CEO to know that their people don't know this stuff. And you need everybody to be exposed on the call that they don't know this stuff. So because they need to hire you. They know they need to hire you. they don't want to do is pay the price. What they don't want to do, their team doesn't want to be exposed. It's not knowing it. Why aren't you doing this? But what they want most is to break that $20 million a year ceiling and work less hard and have the money that they want to have. If they want those results, they have to get out of their own way. Why didn't they get out their own way to begin with? Because nobody confronted them with what they need to see.\n00:58:56 - Seth Ellsworth\nAll right. Can you send me that? Nope. Can you copy it over?\n00:59:00 - Tina Marie (profitdriversinc.com)\nYeah So we have a looking at the Looking at the calendar invite we have a total of a half an hour Yeah, do you think they're gonna want to stop talking to you so if they do like first of all you ask all these questions really quickly when you have them And if your pitch is prepared you can get to them quickly I'm just posting it in the bottom of your work flow. You can move it put it wherever you want to so Eat the Having less time can just mean that they're foaming at the mouse dinner because they're like holy crap They just showed us everything we don't have and Everything we don't have is clearly why we're not getting where we want to be They also just showed us how they can give it to us and they're gonna they their brain's going to need to close that loop. Either we're hiring them or we're not. But if we are, then we need to figure this out if we need it, we need to get there.\n01:00:10 - Seth Ellsworth\nYeah.\n01:00:11 - Tina Marie (profitdriversinc.com)\nSo, and you can tell them, look, only take on one of these a quarter. So, you know, I just want to, I think that this is ideal. I love what you're doing. I love what you're teaching people. You know, here's why I think what you do matters and why I want to be a part of it. And here's why I think what you're doing matters and why the world needs more of you. And here's what we're going to do to get that for you. also to make sure that you've got enough energy to keep serving because people need you. And this is how we're going to make it less work so that you can conserve that energy. We'll build this experience that can keep going. Even when you can't like that.\n01:01:09 - Seth Ellsworth\nI got those notes. A couple of thoughts. Thing number one, I'm just looking at my pension to way over deliver. I look at their four buckets that they have on their freebie page. They're four different audios. And I'm like, well, why don't we just build a four or five six day thing for each of those. And then, but that's four of these, which is four times the work.\n01:01:48 - Tina Marie (profitdriversinc.com)\nThat's your upsell after we've done what we're going to do. If you want to keep working with them. And if you don't, you can just say, hey, here's what I recommend. Go apply what we've taught you to each of these. Have your team do it.\n01:02:01 - Seth Ellsworth\nDo you want to consult with me?\n01:02:03 - Tina Marie (profitdriversinc.com)\nWell, here's a fee for consulting on it, and we'll have your team build it, but this my recommendation to you It's not where you should focus because you want to make them more money Right, so either way we should just focus on one of these channels one experience That we have a high probability of being home run because that's where most of the revenue is already coming from And then the 30 the 30k per quarter is essentially just for oversight and consulting And you don't want to package up like that. No Because they'll know if you say that they're gonna be like why am I paying that much for oversight and consulting?\n01:02:52 - Seth Ellsworth\nNo So how do I How How do I not\n01:03:00 - Tina Marie (profitdriversinc.com)\nStell myself into a corner why offering what I just told you so to me that leaves like a it leaves like a okay then what do we build next why are you even thinking about that i don't know it's more my mind naturally goes oh that's your problem you keep trying to extend things when instead of letting them finish and be done right maybe probably because i care more about the recurring revenue oh i was just about to tell you that's exactly what it is because you're like i got to pay the next month's bill you don't need to look at them for doing that so if you sell this and if you sell another one or two to other people with ending right and you want it to end because that's your wow factor and your wow factor is what gives you the big price points. You don't want to stay in somebody's team. You don't want to stay in their business. We let them come back to you for one-off consulting or something or whatever, but just go in, do the wow, then leave and leave them wild. So they keep telling people about your wow factor. But don't get in the grind of their business and having to and feeling like you're a part of their team, because then you lose the leverage that that gives you your price point, but also the energy and the way that they see you. And it's important for everything that you're doing with your high level people that that's how that stays, that dynamic stays that way. The money that we get from this needs to be budgeted so that there's money going to building out your own scalable office. That's where your next money is coming from. It's not from here. There is a very clear ending process we build the thing we leave if you want more you can ask us for more We'll give you a price point and it's not going to be stressed And you're not going to be built into a thing to be only thing that you're going to do from this point is consults Because we'll we'll tell you your team how to do it if you want to pay a higher price We'll even go hire people for your team to put in there and we'll teach them, but there's always an ending period So in this scenario, you wouldn't You wouldn't do a Risk reversal scenario where you'd say hey, it's a hundred K We'll stick around until you double that Sure, I would and there's no reason not to because that's not building you into a truck Because there's no way there's not enough potential for that money and\n01:06:00 - Seth Ellsworth\nDo you think it would be silly to to go for some type of a percentage?\n01:06:06 - Tina Marie (profitdriversinc.com)\nYeah, because this is the first time you've even tried this offer. Get some, get some evidence under your belt, get some more experience. Now you can do it at the end and say, if you want to keep me, here's how you can do it. It's a percentage.\n01:06:27 - Seth Ellsworth\nBecause if that were the upsell instead of the 30k per quarter, that's a hell yes.\n01:06:36 - Tina Marie (profitdriversinc.com)\nWell, and I don't even know where you got the 30k per quarter afterwards. No, the first like $100,000 for the, no, actually it was the response to yours. Like we go through and look at the transcript. When I was looking at, if you want to make it $150,000 for six months, and it wasn't considered Salting it was 30k per quarter. Basically we're building out these things. It wasn't like that.\n01:07:05 - Seth Ellsworth\nIt wasn't 30 paper quarter for consulting I'm not sure where that came from Yeah Um, I would love to do 100k for building one of these and then they pay a percentage for us to go in and build out the other three That would be awesome Or four or five or six of these Okay, well don't get ahead of yourself because you've never had a yes on this offer at all No, I haven't And never built it Yeah, that's an end zone that I would that's an end zone that I would love for this particular business because It is A high degree of confidence with this one Um Well, there's so many unknowns including managing the team and and doing the whole thing together So I really want you to focus on what we've already talked about Yep, I'm part of minimizing it putting it on one\n01:08:00 - Tina Marie (profitdriversinc.com)\nclear offer was to start to finish and I'm not going it would be cool if like just don't do that because that can sabotage everything if we get through this and then you want to be it would be cool all day long go do that but first you need a confident sale that you can close that you can take care of the family with you can have a team that you can build out your own offer which is going to take your time and focus and and be very very very practical with this there's lots of time for it would be cool if later and there'll be lots of opportunities but right now it just needs to be here's the offer here is that we can just knock it out of the park and this is what we're going to do for it cool and then in terms of price points like how do how do we be\n01:09:00 - Seth Ellsworth\nthat we haven't taken swing yet. How do we confidently value this?\n01:09:05 - Tina Marie (profitdriversinc.com)\nBuild out what I told you, which is the, like, itemized invoice that doesn't have a price point on it, right? But here's all the thing you're building. So quickly, repeat back to me what I said we're building.\n01:09:20 - Seth Ellsworth\nYou asking me that or is that what I should ask them?\n01:09:23 - Tina Marie (profitdriversinc.com)\nNo, I'm asking you.\n01:09:26 - Seth Ellsworth\nWell, I don't know exactly because it would be slightly different depending on whether it's the event based version or the low ticket front end.\n01:09:36 - Tina Marie (profitdriversinc.com)\nIt should not be the low ticket front end and you shouldn't give them that option. If you want to knock it out of the park, you mean tell them let's experience it by your event into an email experience. But to build up to that, we'll take one of the low ticket options to build up to that and bridge a gap because if you want to get your money back, then There has to be high level stuff if you're trying to get if you're gonna be there till they get their money back at a $100,000 with a $39 offer you can be there forever Certainly they have six hundred thousand people on their email list Yeah, how many people do you think actually open it and how many people are even still valid email?\n01:10:19 - Seth Ellsworth\nYou don't know anything about their email help I don't But you can assume it's crap We can assume it's crap. They're also flying ads and they have very active socials. So there's a lot of available to them Okay, so how many thirty nine? Here's here's how I see this taking Taking their hypnosis audios that they're currently giving away as a lead magnet Turning that into an automated email-based experience that converts it 30% to the $39 thing That's easy. That would be a very very simple simple thing, taking a live event and automating that to get the same result as or some result, no, not even similar, doesn't have to be someone that's either way, taking a live event and putting it into this type of a structure much more difficult. Is it possible?\n01:11:23 - Tina Marie (profitdriversinc.com)\ncourse it is.\n01:11:23 - Seth Ellsworth\nIt's much better.\n01:11:25 - Tina Marie (profitdriversinc.com)\nThe bottom line is done right up today because we need to have time to tweak it. The itemized, what the invoice would be. So you asked, how do I confidently sell that $100,000? This is how. If you can't write it out and look at that and go, hell yeah, that's a $100,000 offer and also it's not going to be a whole ton of work for me because I'm having other people do it, then there you go. And if you can't do that, maybe you don't need to have a call for it. So write it up send it over Thursday.\n01:12:02 - Seth Ellsworth\ncan work on Tweaking it and make sure we've got it nailed down and then probably see what happens Yeah, I think I think we should probably be prepared for Both options the event based one or the That the hypnosis audio version That seems to me that they're right there. I'm just Green with the way you just said It seems to you what it seems to me that if they've turned their focus to the thirty nine dollar a month thing for whatever reason So they've spent a lot of money all ready To to grow that It'll be interesting to see What their priorities are versus where they're currently generating their revenue, which has got to be the events To me it make that makes the most that's you're going to make more $15,000 sales from the event than you are from any other, they're not doing any other marketing. So it has to be from the events. What is it already wise? Is it the event or is it this new $39 thing? That'll be interesting because the revenue won't likely justify focusing on the $39 thing, like you said. But they may see that as their path to getting off the hamster wheel. I don't know.\n01:13:35 - Tina Marie (profitdriversinc.com)\nWell, so to break even on a $100,000 investment in us on the $39 offer, we need about 2,500 sales. But if there's an episode, if there's something else next, $1,000 or $2,000 offer, and maybe it's something in becoming a therapist or whatever the next step is. There's some gap that we don't know about that exists, some mid-level offer that is not an event that we're replacing, but it could be the training or whatever, maybe a certification process or pre-certification process where you can sell it for, whether it's a few hundred or a thousand or two thousand, you know, the burden on that, $100,000, a hundred people buying $1,000 offer, and with that amount of traffic that they have, that's a no-brainer like that. We could do that easily. So I think that there's a missing piece there that we could plug in, which was one of the things I was thinking about before, and I don't remember how $39 members to $15,000 sales. Well, are they getting $39 members to $15,000?\n01:14:55 - Seth Ellsworth\nSure they are, because he mentioned that the whole point of that group. It was to nurture them, to ascend to the bigger things.\n01:15:05 - Tina Marie (profitdriversinc.com)\nSo there, and there could be segments, you know, are there different types of things that they teach? they teach one thing, and so maybe they ascend them up through, instead of going straight to the $15,000 thing, it's, well, there's this aspect, right? This is, let us teach you about CBT, it's $1,000, let us teach you about the hemotherapy, it's $1,000, you know, and step them up through something. There's a path, and there's missing data points, where we can do that, but what they need to understand is that your way of doing it isn't just email, it's a very specific way based off of psychology, which they should appreciate that speaks to them, and uses, know, accountability, and actually is very much CBT, because it's getting into the head, like, who are you, what do you want, why are you doing what you're doing, are you watching? yourself behave the way you're behaving, is it getting you the outcome that you want? No, it's not. So you need to change your behavior. So here's how you change your behavior and changing your behavior is, you know, leaving them through a sale at the same time. That's what you've been doing. It is very related to CBT, which is observing your behavior, asking yourself if the current behavior that you have is getting the results that you want or not. And if it's not, then what are some options for how you can behave to get more of what you want. And then as you're watching yourself, are you seeing yourself through the right thing? Do the wrong thing? we get fixed it? That's it? That's the cognitive behavior there. It's a repeat.\n01:16:56 - Seth Ellsworth\nOkay. Awesome. By the way, I have heard back from Landon Ray.\n01:17:05 - Tina Marie (profitdriversinc.com)\nHave or have not?\n01:17:06 - Seth Ellsworth\nI have.\n01:17:07 - Tina Marie (profitdriversinc.com)\nAnd?\n01:17:10 - Seth Ellsworth\nHe agreed to the 10K thing.\n01:17:14 - Tina Marie (profitdriversinc.com)\nWhat is the 10K thing?\n01:17:16 - Seth Ellsworth\nJust a power day at onto Port Campus in June.\n01:17:22 - Tina Marie (profitdriversinc.com)\nNice.\n01:17:23 - Seth Ellsworth\nSo he's, I need to send him a one pager and he'll send, he'll get his accounting to send 5K and then 5K on the day of.\n01:17:35 - Tina Marie (profitdriversinc.com)\nGood.\n01:17:38 - Seth Ellsworth\nSo we've got some movement somewhere.\n01:17:43 - Tina Marie (profitdriversinc.com)\nYeah. So, I mean, I think for the most part, this week you've got, I know you have things that you have to fulfill and you need to get prepared for this. I don't know what else you have going on, but I would like to know what else you're going on. an appointment I need to get to. So I need to wrap up. But I think that this is going to go well. Either they're actually open to making the changes or not, but based off of the conversations that's happened so far, I would say that they are. And if you can just show them how, you know, this just makes perfect sense, but also clearly they need to stop chasing it. That conversation about, how much basically, how much harder have you had to work to get to that 20,000? Are you just coasting or have you had to work harder just to keep hitting that $20 million? And if you've had to keep working harder, how long can you do that? if 20 million is the number and you can't keep chasing harder and harder and harder, then you have to go smarter. this is what we've got, and you know, break it all down. It'll be important to Like, at some point, guaranteed, I've never been to a call where there wasn't something that was high value that I could add to it. They need to be primed for just even listening. So decide how you want to represent me. But it works best if you've done that ahead of time. This is Tina. This is what she's bringing to the table. So if I ask a question, because everybody's ego is a little bit different. I don't imagine they're going to be high ego people, but it could be. Um, so it's sometimes people like who knows this and why they ask them questions. So it's best to avoid that by pre-framing this, who she is. That's what she does.\n01:19:46 - Seth Ellsworth\nYep. I already, I think I already did that past. Yeah. And my, in my original email, which you didn't see. Um, I said, I don't do anything without. her. She keeps from painting myself into a corner.\n01:20:04 - Tina Marie (profitdriversinc.com)\nThere you go. That's enough. So that way, if there's there's anything I want to help out with, and I'm just like, I know I can add some power value to here, then then it'll be there for the most part. I'm just going to be quiet supporting and texting back and forth. But if I sense that there's a way that I'm like, okay, well, I can answer this question powerfully and clearly, then I'll do that.\n01:20:28 - Seth Ellsworth\nAwesome. I'll bring you in. Would you want me to, is this like a tag team thing, or would you just hop in? Meaning like, hey, Tina can speak to that.\n01:20:44 - Tina Marie (profitdriversinc.com)\nI would probably just hop in. wouldn't even want to be to recall if I'm not hopping in, because then I can't be myself. And if I can't be myself, I don't want to be there.\n01:20:55 - Seth Ellsworth\nAwesome. So I will work on this invoice for both scenarios.\n01:21:01 - Tina Marie (profitdriversinc.com)\nYeah, because then you'll have an option. can just say you, without them knowing, just pick the one you want to show that and then go ahead and screen show so they can take look at it and break it down.\n01:21:13 - Seth Ellsworth\nIf I had, if I had my druthers, what I would do for them, this would be, this is their entire business model. They have four of these running with their most successful four verticals that have proven to be the most profitable. They drive all of their traffic to those four. Those dump $39 per month members and then quickly ascends those who have achieved a high level of confidence with that and introduces the opportunity for a career with those things. Or it assesses their need for deeper therapy. And so all roads lead through this $1.39 month thing that liquefies at costs and makes it infinitely scalable, and we just pick people off and push them down each, each path based on, you know, any number of things that could happen. But we could build one of these to go on the inside that ascends them into the career.\n01:22:26 - Tina Marie (profitdriversinc.com)\nYes, and the great thing about this is that this is the type of thing that is perpetual evergreen lifelong. So whether you need therapy or you need to keep sharpening your own saw and being better at what you're doing. Come back to us as the authority for people that can help you, you know, continue your mental health journey, being as strong as you possibly can. So you live with us forever. That's the goal, right? Or, or same thing as becoming a therapist because the bottom line. as we all know that we need support and we're here to offer that to you. So whatever we need built is perpetual. mean evergreen not in terms of an offer that never expires but also your potential to stay with us as a customer lasts forever as well. And so we want to make sure that we show them that hey we're looking at it that way and we know that. And so one of the goals and the metrics would be life's and value their customer whatever is we want to increase that and extend that. And what you do says in the nurturing through email sequence has the greatest potential to do what should have already been on their radar and probably already the goal but probably not their success in the past.\n01:23:48 - Seth Ellsworth\nYeah.\n01:23:53 - Tina Marie (profitdriversinc.com)\nSo I got to go but send me over what you come up with in your two versions and then we'll just you keep hammering that out. But I imagine that you'll probably show up to that call more confident that you have in any other cell call, even though it's the highest, like, have you ever sold any one thing for $100,000 for yourself?\n01:24:15 - Seth Ellsworth\nUm, I sold a website for 220.\n01:24:19 - Tina Marie (profitdriversinc.com)\nAnd I'm about like this service something.\n01:24:22 - Seth Ellsworth\nNo.\n01:24:23 - Tina Marie (profitdriversinc.com)\nYeah, selling a website or business is a whole different thing. This is selling you as a service, um, doing this particular thing that there's been a lot of, well, just a huge lack of clarity and confidence. So going into this success way is a big deal. But I, your confidence seems to be growing and the clarity growing almost daily, definitely weekly. And I think that you have the potential just to go in and knock it out of the park Friday.\n01:24:58 - Seth Ellsworth\nThank you. I was just saying, I think we can ROI these guys before we even build anything.\n01:25:08 - Tina Marie (profitdriversinc.com)\nBuild anything before we build anything. Well, I don't know how, how you would do that without doing something. What do you mean? Well, I mean, before we build the experience, just, okay, don't say anything and then say the experience, but yeah, build that thing like just with a few tweaks, maybe you say that, but the language matters very much because that's almost like we can get your money back without doing anything. That's what it sounds like.\n01:25:42 - Seth Ellsworth\nOkay. that's not what I'm.\n01:25:44 - Tina Marie (profitdriversinc.com)\nRight. So anyway, so like you could say something like where I think we can ROI just by making a few actually simple tweaks that we can implement into your system within a couple of days. that can start, you know, getting you money while we're building the big thing. The language is different, it takes more, but it's factual, and it's clear. You know it's clear because it's reflected as email, you know, and improved this type of thing, and that doesn't take a lot of effort. But that clarity makes a big difference because when you're not there, you create confusion. Confusion creates friction. Friction slows down sales. You don't want any confusion. You don't want any friction. So be very clear when you say anything on the call.\n01:26:39 - Seth Ellsworth\nCool. right.\n01:26:42 - Tina Marie (profitdriversinc.com)\ndefinitely have to go. Let's keep working this out. Work on the two different offers and send over what you got when you got it.\n01:26:50 - Seth Ellsworth\nYeah. Thank you much.\n01:26:52 - Tina Marie (profitdriversinc.com)\nRight. You're welcome. Good talk. Talk to you soon.\n01:26:54 - Seth Ellsworth\nBye.\n","contentPreview":"00:00:11 - Seth Ellsworth\nHello.\n00:00:13 - Tina Marie (profitdriversinc.com)\nHello. Kind of quiet.\n00:00:18 - Seth Ellsworth\nAlmost be my hair pods.\n00:00:21 - Tina Marie (profitdriversinc.com)\nYou'r...","processedAt":"2025-05-04T03:40:52.557Z"}