{"fileName":"Done Transcript for Basis Integration_Sweet Law(10).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for Basis Integration_Sweet Law(10).txt","type":"transcript","priority":"medium","content":"00:00:00 - Tina Marie (profitdriversinc.com)\nTwo Mark sweets.\n00:00:01 - mark sweet\nYeah, I wasn't sure which one was right. So that's all right.\n00:00:10 - mark sweet (3)\nI just don't know one. They're just down just to one me.\n00:00:16 - Tina Marie (profitdriversinc.com)\nJust you. That's OK. I just got up with Fuji this back to back meeting. I'm not used to it. And I'm like, I got to go.\n00:00:25 - mark sweet (3)\nNo, he was asking me a question about multiple company names or a different company name for each day. what we have, if that wasn't really helpful. But his situation is a little different than mine because the tracking by a doctor name, not the only reason we have different companies for different states is more because of our trust account and because each day has different laws where it's a little different for him. So I mean, I'm the whole, it's better. But I don't think it's going to make a big difference.\n00:00:59 - Tina Marie (profitdriversinc.com)\nI feel like. like um oh so I got to flip something for him. love when people think one thing about their business and then I'm like oh we go do some math and then you find out it's not that at all so July is actually way profitable way more profitable for him than Q and P.\n00:01:18 - mark sweet (3)\nGood.\n00:01:20 - Tina Marie (profitdriversinc.com)\nThat's pretty cool.\n00:01:21 - mark sweet (3)\nOne quick thing from the legal side though just in a facamot, the CUNY practice that's legitimacy to his personal injury stuff.\n00:01:30 - Tina Marie (profitdriversinc.com)\nOh I'm not telling him he shouldn't do it. Okay. That was a nice like exciting thing for him to know that July was actually like that.\n00:01:38 - mark sweet (3)\nYeah yeah good tea faces.\n00:01:41 - Tina Marie (profitdriversinc.com)\nUh you guys always join on video and Fuji he said that it's more intimidating but like accountability so he's like I like when you're there because like I feel like I've got a I don't know pay attention so I think facial expressions which makes a difference rather than just seeing if on the earth. It's not okay.\n00:02:00 - Dan Ryan (danddcompany.com)\nGreat.\n00:02:00 - Tina Marie (profitdriversinc.com)\nMy face is as crazy as my voice. Hi, Dan. What's up?\n00:02:10 - mark sweet (3)\nOkay.\n00:02:12 - Tina Marie (profitdriversinc.com)\nDan Jeep, my new voice.\n00:02:15 - Dan Ryan (danddcompany.com)\nMy first, my second call.\n00:02:18 - mark sweet (3)\nvoice hasn't warmed up yet.\n00:02:22 - Dan Ryan (danddcompany.com)\nIt's my second call and mine has because I already got excited about nerdy numbers. There you go.\n00:02:28 - mark sweet (3)\nSo this convention was interesting, the lawyer one. Everyone is just super, super, super excited about AI.\n00:02:37 - Dan Ryan (danddcompany.com)\nOh, God, what don't they know that that ship was already sailed for about two years late? The K guys ship already sailed and sank.\n00:02:48 - Tina Marie (profitdriversinc.com)\nYes.\n00:02:49 - mark sweet (3)\nWhat's in heaven and has it?\n00:02:51 - Dan Ryan (danddcompany.com)\nhere's what saying, not like it has.\n00:02:53 - Tina Marie (profitdriversinc.com)\nIt sounds like how you're talking about it. It's what?\n00:02:57 - mark sweet (3)\nIt's not where it needs to be yet to be. effective. So it's never going to be.\n00:03:08 - Dan Ryan (danddcompany.com)\nIt's it's it's always going to be about the promise. And say it from the beginning, he who engineers the promise wins. But the adoption rate by, you know, the general public is already on the decline. It only ever really hit 5%. And it's on the decline. So they're like, or this 's not, no one's going to use it. Most people don't even know what it is. They don't even know who the vice president is. And now she's running for president.\n00:03:41 - Tina Marie (profitdriversinc.com)\nThey still don't know who she is.\n00:03:44 - Dan Ryan (danddcompany.com)\nShe doesn't know. That's fine. And it's like, but, you know, there's the whole strawberry thing that just went around, right? couldn't count the R's and strawberry. It got it. If you ask Chachi B, Chachi Bt4, how many R's are in strawberry? it will tell you to right now. They haven't even fixed it. It's like, you should probably go fix that one. No, it can't do simple things. But that being said, I was talking to this buddy of mine.\n00:04:15 - mark sweet (3)\nThe stuff that we've done that's really interesting is. I like fixed it. Now says the worst draw right contains three R letters.\n00:04:22 - Dan Ryan (danddcompany.com)\nThere you go. It literally didn't work yesterday.\n00:04:24 - Tina Marie (profitdriversinc.com)\nOh, is it for me?\n00:04:26 - Dan Ryan (danddcompany.com)\nReally?\n00:04:27 - Tina Marie (profitdriversinc.com)\nYep.\n00:04:29 - Dan Ryan (danddcompany.com)\nSee, it's not trustworthy. But if the stuff that we've done that's interesting is giving it the data set. So I think it's called RAG. I think the three letter thing is called RAG. And it's like, you're basically giving it a data set and then using it for its large language modeling against the data set that you trust, that you've said, hey, this is the thing. So it's good at that. And then if you, and if you then have it, you're updating that data set and or you're creating an application with it so that it remembers things and all that good stuff, then you're on another level. Then it can work. But what most people are doing is just like API and into chat, GPT. And it's like, yeah, not great.\n00:05:25 - mark sweet (3)\nYeah, the training the models were people are missing the huge problem. I agree with you, but it's time consuming and boring.\n00:05:32 - Tina Marie (profitdriversinc.com)\nWell, but most people second communicating and the way to make chat GPT work really well is to give excellent parameters. It's not just the prompting. It's the parameters of the prompting. Here are the boundaries. Also, here is the level of effort that you need to apply. So like if you ask at a basic thing, it puts forth basic effort. If you say, I want you to apply it as though you're this person using this logic, there's parameters, right? Completely different type of output. So like it said, there are two R's and I said try again and instead I apologize, there are three R's. So the other thing is you need to build in a check and balance system. So like I just told Fuji, I said go do your reports. I said, but then, because he's like, I'll use chat GPT do this. I said, okay, but then you need to go validate the data and make sure that what it told you is correct. And you can offer it for formulas and things like that. But the other part is most people aren't building in a check and balance system. I mean, have it in our government and not that it works, but whatever. there are also need to be something and that the problem is, and it's the same problem in every kind of business as people don't delegate. They, the hell is the word? You just give it off to people and you forget about it. My brain, I know this word is driving me nuts. Abdicate, people abdicate. So as soon as there is somebody that they think, can or will or something handle a problem for them. It isn't delegation. They just stop thinking about it. That's how embezzlement happens. That's how a lot of things happen. It's because people advocate, oh, this is my person for this. This is my system for this. It works. But we all know nobody and no thing works the same all the time. Life happens, human error, system error, economical error, whatever. So whatever system they build, there needs to be a quality assurance kind of check and balance system that gets built into it and whatever. It's not just about chat TBT and why I'm going off about all of this, but this is the thing that destroys a lot of businesses and a lot of more people when they get to the point where I can pay to delegate. Case in point, Mark, you haven't done anything bad, but I'm just saying this is the thing. You need to be a aware of in yourself don't how to keep the delegation right like we've had issues with our complaints and missing a statute because yeah so dealing with it yeah yeah delegating is one thing advocating is a thing you can't ever do and it has to be the most critical parts like why we why you resist the non-attorney model because attorneys have liability right and it's not just you owning all the liability you have somebody else in there that's got skin in the game and that's important because that that keeps a layer of protection against you strategically and i agree with that so the one interesting thing that keeps coming up and dandy you probably know more about this than i do is they're having these bots listening in on the calls for tonal shifts and for I guess voice for lack of very term is the person sound happy to add positive for us\n00:09:00 - mark sweet (3)\nsome of these things. And obviously they're trying to pressure their problem like flags the call for a manager or supervisor to listen to it, whether it's a training issue or potentially an upset client or what happened.\n00:09:11 - Dan Ryan (danddcompany.com)\nThere's no way it's listening to the tone.\n00:09:14 - mark sweet (3)\nNo way.\n00:09:16 - Tina Marie (profitdriversinc.com)\nNo disagree with you.\n00:09:18 - Dan Ryan (danddcompany.com)\nOh, I'm sure. I'm sure. I'm sure they're saying it. It would have to be a third party. They're not doing it.\n00:09:25 - mark sweet (3)\nThey're using something that's already done it. If anything. Yeah.\n00:09:29 - Dan Ryan (danddcompany.com)\nIt's probably more based on stop words than tone, right? Because just think the individual aspect of people's voices in general, right? how people speak differently. whether it's like people can't even pick out sarcasm text. People can't pick out sarcasm voice. Top words. Words of frustration. Words of anxiety. Words of that all day long. can see that being more effective than. and then looking for a tone or trying to identify tone. It could be a combination of the two, maybe, but I bet it leans more towards the word itself first.\n00:10:11 - Tina Marie (profitdriversinc.com)\nI do think it's the word. So right now Chat TBT can tell you the tone of words, text. it does that. don't think it's, and also how much you can pick up sarcasm, especially thick sarcasm. I don't know how good it's at that. But the thing is, if people keep it in perspective, and this is what I think most people won't do, which is actually a benefit to all the other people who are going to be smart, is that you take it as a potential data point to go, like basically a flicker to go say, what's happening over here and go listen to it yourself and go, is this right? than I'm going to go and this is a problem person because Chat TBT keeps saying all their people are angry. angry and maybe it just can't even recognize it right or whatever.\n00:11:03 - mark sweet (3)\nYou be able to figure out something like yelling or screaming.\n00:11:08 - Dan Ryan (danddcompany.com)\nWell, it's it's going to be in this middleware. They're putting a middleware in place. I don't think that's yeah, I don't think that that's necessarily native to Chad GPT. So, I don't know if it's something else. It is. That's all anyone's using.\n00:11:28 - Tina Marie (profitdriversinc.com)\nWell, we'll see it open AI. That's what Chad GPT is, but it's open AI. it's all it's going to be so interesting, but keeping here's what we're talking We're talking and you're interrupting you.\n00:11:45 - Dan Ryan (danddcompany.com)\nThat don't track anything.\n00:11:47 - Tina Marie (profitdriversinc.com)\nYou don't track anything. It's important to keep everything in containers, but that's what to your point of tracking is it's easier to do when they're in containers. Right. Daniel.\n00:12:00 - Dan Ryan (danddcompany.com)\nYeah, I mean, it's just, it's all sizzle, right? It's typical lawyer , right? Those guys are the most easily sold people on Earth.\n00:12:11 - Tina Marie (profitdriversinc.com)\nIt's It's unreal.\n00:12:16 - mark sweet (3)\nYeah, I'm not very excited by Shawnee Ball. And I have no idea how to implement it, what it actually does in the background.\n00:12:23 - Dan Ryan (danddcompany.com)\nYeah, and then they're not going to track it. So it's like, you don't even, if you did it, are attracted to what it is? Oh, yeah.\n00:12:33 - Tina Marie (profitdriversinc.com)\nI mean, I'm pretty sure you got to have a lot of that to be an attorney, period, or just collectively coming from somebody that was one of my career choices.\n00:12:45 - mark sweet (3)\nThere are multiple more to do this. Coquitos, one, apparently.\n00:12:49 - Dan Ryan (danddcompany.com)\nWhat, Pekker? What?\n00:12:52 - mark sweet (3)\na weird name that is.\n00:12:54 - Dan Ryan (danddcompany.com)\nSee you. Yeah, I just thought about it.\n00:12:56 - mark sweet (3)\nYeah. Yeah.\n00:12:58 - Tina Marie (profitdriversinc.com)\nWhat are you looking at?\n00:13:00 - mark sweet (3)\nSo, could you use a real-time AI system to analyze the live phone calls that take customer sentiment provide agents with live cushion and feedback, uses voice analysis, introvert motion, infuse like stress or enthusiasm. There's the observed.ai, does kind of the same thing.\n00:13:16 - Dan Ryan (danddcompany.com)\nI mean, I don't think you need a real time, right? you could just find something that allowed you to download recordicals and mass-analyze those to like help nail a script first, right? Like, you know, they don't need like any or support yet, right? If you got a script that worked and you're like, okay, this script is solid. Now, the only way this script goes sideways is through the execution thereof. Therefore, now layer on something where you know it's not gonna try, it's just gonna sort of try to make them be more successful with the script, but maybe.\n00:13:55 - mark sweet (3)\nMaybe, I mean, the issue, and I'm sure we're coming up is these larger teams, right? Because if you've got, take, for example, and it's alerting you that Marie is not doing a good job for whatever reason, right? You would want someone to listen to it take it over because you could potentially have a large case, right, your hands. Doctors office was calling in super frustrated. You want to know right away rather than after the fact, after the problem.\n00:14:24 - Dan Ryan (danddcompany.com)\nRight, so like, I like the large case, right? But that would be like a word that could be like a stopboard based thing too, right? It's like, hey, if they say UPS truck, 18 wheeler, you know, you're like, oh, those are like, not stop words, but those are like flag words. Uh oh, this could be a commercial, you know, that kind of thing. But that would be the extracted via the script, right? So there's where the script would come into play to then sort of like was Tina was saying, sort of like what I was saying, you're not writing a prompt, you're just making making data available to the prompt, that's the prompt will say, hey, I can use that. Hey, that's something that I'm supposed to be looking for, and then it does its thing.\n00:15:11 - mark sweet (3)\nYeah, no, I mean, that was one big one. The other big one is, you know, even up does AI demand writing, which I don't know.\n00:15:18 - Dan Ryan (danddcompany.com)\nWell, that I can see for sure.\n00:15:20 - mark sweet (3)\nMakes sense.\n00:15:21 - Dan Ryan (danddcompany.com)\nBut you would do it, you could do that right now, but it's just a matter of you having a self, I mean, it seems like the, and this is what I literally was doing yesterday because, you know, I'm a loser. But I'm like, okay, I can just have the data in the Google sheet in like a row. And I just say, hey, this row. And I keep telling chat GPT, like, I don't need to build the database at this rate, but I need to someplace to store the data and say you're using this. Then it's a matter of like, you give it a demand. Let's say you get, let's. it's a demand for a dog bite or whatever, whatever it is, it's a car accident.\n00:16:06 - mark sweet (3)\nThat's what we do.\n00:16:07 - Dan Ryan (danddcompany.com)\nYeah, yeah, yeah, do a car accident. But like, give me an example of one where you'd be like, it's a tip, like the setup where like, this is the demand is based on these four or five things. Like, is there a scenario like that?\n00:16:24 - mark sweet (3)\nYeah. So you're generally going to have liability. Number one, like, how did it happen? Who's that fault?\n00:16:31 - Dan Ryan (danddcompany.com)\nOkay. So you're saying, yeah, injuries and injuries is the part you spend the most amount of time on.\n00:16:37 - mark sweet (3)\nYeah. Three state specific, which state did it happen in? And four is the rest of the board of plate template, quite frankly, you know, the terms and conditions and kind of the opening and just the boiler plate template.\n00:16:51 - Dan Ryan (danddcompany.com)\nRight. So you have the first one probably has a fault, not a fault, right?\n00:16:56 - mark sweet (3)\nit just binary or is there a third? No, there's a third. Okay.\n00:17:02 - Dan Ryan (danddcompany.com)\nSo you, it's one of the three. And then the next one, so the injury would be the most complicated one, right? You'd have to then go through your database that you have, and litify like, Hey, here are all the possible injuries.\n00:17:15 - mark sweet (3)\nAnd then you'd have to build like a sort of matrix, which I can totally see with. Hold on. So when I say injuries, it's pulling from the medical workers of that specific client with what they had.\n00:17:29 - Dan Ryan (danddcompany.com)\nYeah. Right. So, but you'd say, like, Hey, had an MRI. They had this. had that. So what is the number more based on the treatments than the actual injury? Like, Oh, it was their neck MRI. you build like a matrix and say they had MRI, this, this, this, this. And then maybe, and then the prices or whatever are included. So it's like, if you could dynamically say, Hey, like imagine, filling in a form and you're like, it's, it's not at fault, it's MRI, that, that, that, right, select checkboxes. And then it's whatever, whatever the next one is. So they submit the form, that goes in that then temporarily updates the set of fields. then the prompt go, then it hits the prompt and the prompt set, the prompt is written to say, Hey, you're going to look after it's half fault and you're going look at this and you're going to look at these injuries, then go look at this data set that has the injury pricing or whatever, or you're including that price. You're saying it's MRI 5000, it's this, blah, blah, whatever it is. And then the prompt is just waiting for you to give it those parameters. And then it goes and looks at your ideal demand, let's call it, which there's probably an ideal one, right? then boom, you'll write it and then the quick ideally you would write all this and you'd have a demand that's done well to compare it to. You say, okay, if I feed it this data, does the demand that spit out come out like this? Yes or no?\n00:19:09 - mark sweet (3)\nyou see how to train it, like the ones already being written first, hey, mean, this information, no, here's a better example.\n00:19:15 - Dan Ryan (danddcompany.com)\nThere's no way you could train that. Then you just start massaging that prompt in the middle.\n00:19:21 - Tina Marie (profitdriversinc.com)\nThat's like what we were having Fuji work on with his reports is feeding the data and the analytical process as much as possible. But then the other thing is the system for sure that should be built in is human approval.\n00:19:42 - mark sweet (3)\nYeah, yeah, no, doesn't just get sent out on and so.\n00:19:46 - Dan Ryan (danddcompany.com)\nWell, well, and you could human score it at the end to go, now that's of three or the lawyer scores. Somebody, somebody that you trust their scoring.\n00:19:58 - Tina Marie (profitdriversinc.com)\nThat right there. Mark's score basically for a while, and then train somebody that scores according to your approval. That's the thing for, okay, so going back to the application conversation and just the pace of the technology and the evolution, the innovation that is available right now is leveraged, all of this is AI stuff is leveraged if it's used right, but all of it has to be something that you learn firsthand, everything has to be. For example, okay, so Dan, the foundation of basis really is numbers tell the whole story, so we need to be able to have the numbers. When it comes to online businesses, most of those numbers come through the website, so the analytics. So he's diving into GA4, which is Google Analytics 4, right? It's a whole new beast. We've been using Google Analytics. I've been using it since 2002, probably. I think it was out. Maybe it wasn't that old. Maybe a few years after that. Let's see, 2008, I was getting into split testing. So anyway, we'll say maybe like 2005, people were already starting to use Google Analytics. And now it's an entirely different kind of thing. It's this whole host of a suite, basically, of things that you used to have to get somewhere else. But Google owns all of it. And because it's so new, even the experts are still just kind of figuring out how to use it. So he has a massive leverage opportunity to be an innovator right now, which is a business owner who understands how to tap into Google Analytics. And so he's doing it. He's been studying it for weeks. From an expert who I know personally and I've met and he that's all he's been doing is this this whole time So he's been going growing with it But Dan can't delegate this to anybody right and If he could it would cost it wouldn't it wouldn't be worth it The only one he could delegate to would be another expert. So for you with the marketing with the with the AI but also The business the culture all of these things coalesce into Something very unique for you specifically and subsequently sweet law, which does have its own Unique identity and culture, but I'm just saying The things that interest you If it's innovative and leverage the more you spend time on that and getting real data Talking with Dan. I'm kind of helpful with these things Sometimes he spends more time in it. But anyway, um, there, there's a lot of opportunity to at least figure out how we can shave a little time here and there. So we've been talking about the path to growth is optimization and leverage. This is it. If you can improve the script through analysis data, right, with AI, if you can improve, and not just the intake script, but the attorney's want to script two for certain types of scenarios so that they can be handling things more consistently. So like Lorenz for Mike or the case managers, actually, basically everybody, certain scripts for certain scenarios, they feel like they could be trained better to handle specific types of people and scenarios. Because they know their job that people handling is not what their best at knowing the law and case handling is what their best at people handling is a necessary part of managing the case well so like we've been talking about call control scripts or just I brought up the phrase a few times but when I brought it up to runs sorry hold on and when he brought it up to his team they all want training I need to tell you this by the way it was the last last week conversation but so using AI to kind of help us find scripts if you are listening somehow to all the calls in sweet law and can identify who handles inside the team already the best types of people like if we were able to and that we're not here yet I don't think with the AI but something to keep in mind about like best case scenario best use cases would be okay who handles um specific death cases who handles any type of thing or any type of person and they could label it by the language that's used um and then say okay this person does a really great job of handling this type of person like Mike with distributions. So what Mike does that Lauren said that stand out is Mike doesn't take it personal and he kind of scapegoats the the law firm he's like my hands are tired I can't this is just the rule like I'm I'm not the one deciding that this is what we're gonna get paid this is policy but for whatever reason the way that he says it diffuses the situation and then he can get the full attorney fees more often than other people without people being odd and so that's a skill right but is there a teachable not not necessarily scripts but maybe a logic so is there a verbal cue of some but he says this, respond this way, and the result is this. This kind of analysis, which you'd have to listen to so many calls to be able to do that, but if we could get to the point where I think we can, probably in the next year or two, AI could do that really well, and you could identify, you read the book switch, right? Do you remember the phrasing, bright spots? Okay, so they are the anomalies where everything is bad and then all of sudden you've got something that's just amazing, and a lot of times it was something that already existed, so it was a resource that you already own. I'll give you the example and I'll throw this in for you Dan. So there was this guy, he had to go to some Asian culture, I don't remember where it was, where the children were malnourished, and he had about six weeks in a very minimal budget and had to overhaul it and improve their nutrition. And he was a college, something that was funded through college and so you know he had to succeed with all these limits but what they did is they calmed all the data and they found out that there was one location where the children were actually doing really really well and so they went down there and they observed their daily life and they noticed that the mothers when they were working in the rice fields that they would take the shrimp that they found in the water and added into the kid's rice and so they were getting protein and so the kids were healthier and that actually was available to everybody else in the culture but it wasn't a practice across that that area I don't even remember where it was I wish I did I read it like 10 years ago anyway so that resource was available to everybody but only one person was using it so they didn't need a new budget they just needed to tell people use what's in front of you put it in the rice give it to your kids they'll be better you may boom right so it already existed so my point is that if we can get better data, even more deeper data stuff that we've never even thought about really looking into, because it was a pain in the and Mark doesn't like pain in the is data. I just had this conversation with the other person like I don't want to do that. Anyway, um, friends go figure. Anyway, um, then we can figure out where are the bright spots in sweet loss. Like, is there something that Samantha does on calls that makes her even better? Um, I think that there's going to be more that we can figure out. And if we can figure out how to safely, ethically reliable, reliably get AI into, listen to these calls and give us some kind of info. That would be, we could really improve and up level all of your existing people. with feedback from what's already happening inside this route. I wore myself out talking too much. But anyway, hopefully that was useful. Dan, you're quiet. Are you in a rabbit hole?\n00:29:18 - Dan Ryan (danddcompany.com)\nNo, I'm like sitting here going, I think I could build a demand rider right now with high level. I think because you don't need, you don't. So right now we, for the AI bot that closes people into appointments, we've trained it. So it has this massive prompt that it's always referencing, but the prompt is in a document. So that's the data storage example that I was getting earlier. Here, it's just, I don't know if it's a text file. can't remember. But, and then we let it round. And then we massaged it based on the outcome, we said, oh, don't do that, do this, don't do that. So now I'm like, okay, we just sort of mapped out the parameters. Obviously, it's not exactly right, but it's in the neighborhood. There's not that many. So it's like, okay, you had a form and then you, the form had these elements in it. And then you said, you just have someone fill out that form. Again, it's just all going to be about the prompt. So if I fill out that form and I send it to the prompt, what do I get at the output, right? And that's a very, like, we don't need a production ready, passable, blah, blah. What's the point in doing all that if it doesn't work, right? are around the sizzle. Hey, we're going to go build a business around this sizzle. But... If the stake is no good, I don't care how easily it is. And that's, what are the odds, right? That, I mean, I can tell you right now, I'd be willing to bet a lot that none of these companies have a pre-lit lawyer at the helm saying that's a good demand, right? And let's face facts. What do you need at the end? You need a good demand. What's a good demand? The one that gets you more money than the demand, right? They don't even have a comparative, but they don't know good from bad. It's like, well, I met with the absurdly guys and they were telling me, which we need to talk about them later, they had what might be another Arizona firm backed by P.E. Money that they sold a thousand leads to. But let's say their leads are $250 a piece, which they may or may not be. can't remember their present. So they dropped 250. Yeah, they drop this, this firm, whoever they are, drop $250,000. And then they were like to add sardly. How do we know this is working? Come again. You guys don't know what to do. So then the ads are like, well, you know, you're going to want to look at how many you convert to a retainer, like, what is that blah blah blah. is over the course of like two or three months, and then they pulled the plug and they said, okay, we're going to stop and we're going to evaluate and see what the outcome is. Pardon, your outcome is not coming for about six more months.\n00:32:41 - mark sweet (3)\nFYI.\n00:32:42 - Dan Ryan (danddcompany.com)\nIf you're lucky, if you have lawyers. So clearly, nobody in that project was an actual personal injury lawyer, ever worked in a law firm, any idea how these things go. So they just see, oh, sizzle, can have non lawyer. partners. Let's go. Woohoo. Then they would say I stuff, right? So all you really need to do is just, it's all about the prompt. The prompt will be is the ultimate piece of IP. It's not chat TPT.\n00:33:15 - mark sweet (3)\nAnyone can access that.\n00:33:17 - Dan Ryan (danddcompany.com)\nIt's the piece in the middle. And having a good demand as an example choose to say these guys even know what a good demand is. And then your point, that demand might need to be financed by state, right? You can't just have a demand demand demand demand demand, right? They're not all the same yet. That's how they position it. And then they just slap this huge price tag on it.\n00:33:40 - Tina Marie (profitdriversinc.com)\nNone of the sites have pricing on it, which is always a digital way. If you build anything, that's AI related, Dan, and it is prompt related. What I want you to do is build a dummy test scenario that you run through regularly because my experience is that the output is changing. For example, I have a game that I like to play, and I like to get some photographs, and I have a group, whatever. It's my little, it's my little unwind thing. But I noticed that the output of the group was kind of low, so you help people, so you don't have to buy boosters and upgrades to get through things, and I like to do that, whatever. So I started giving stats, and we went from 200 helps a week to 2,000 to 200 helps a week in a matter of like a few weeks, because they gave people stats. But anyway, I use AI to screenshot all of the players and their rankings and their helps, and it did it really well in the beginning, and now I'm having an issue with the same exact prompt and the same exact data, getting it to give me the same kind of report. So what that alerted me to is that I need to have a test prompt and a test result, right? So if I ask you to do this, I expect a specific type of output. If I give you the same exact prompt every single time, I should get something within 99% of the same kind of output. Because if you're building, let's say, a demand writer, and you give it the parameters, and all of a sudden the algorithm in the background changes. And now, or, and this is what I actually think happened, more, what's the word, the law changes, and they just can find what it can do? If the parameters change in the algorithm, if anything changes in the algorithm, then it would change your output. So, but they're not going to tell you that this happened. Even if they tell you there's changes, whatever. or people are going to pay attention to it. So what I think that you should have, if you have anything that's AI based, is a test that says, you know, if I give you this, you output this, it's the same every time. So make sure that you're still getting the same kind of function.\n00:36:14 - Dan Ryan (danddcompany.com)\nDoes that make sense? Yeah.\n00:36:18 - Tina Marie (profitdriversinc.com)\nEven on private servers that's still having the same issue. Yeah, because you're hooking it, unless you wrote your own AI, if you're hooking into OpenAI through an API, you're still using their stuff. And if the law has changed, which does happen, legislature changes, know, they can't do, what they can't do, how it can be used ethically, whatever, something can change the way it's able to respond to you, then it may change your output. It may say, well, I ethically can't give you that. And maybe the work around is the way you ask the question. maybe you simply can't get it whatsoever, but either way, if you don't have something to test the quality and go, hey, or maybe you find out that the output hasn't improved with your test, like your dummy test, what you call it? Whatever, prompt. back to checks and balances, if you're using AI, there should be a foundational fundamental, this is my test that you can still do what I've been assuming that you're doing and that you're doing it with the same kind of logic so that you know if the logic has improved or just gotten worse or you know the output has changed. I don't think anybody's thinking about that or building that. I'm sure somebody is, but I haven't heard anybody say it yet, so but we have to take that into account because the outputs do change and there's stuff happening in the programming behind the scenes that they're not going to be like, hey, just you know, you know this.\n00:38:00 - mark sweet (3)\nOne of other hard parts of what we do is the medical side of it. And what I mean by that is we've got to bring all these medical workers together and, um, prelet side, we can redact things that are bad, um, and put it in a way that puts our client in less payroll. Like, I don't know how to train a bot to be able to do that.\n00:38:21 - Tina Marie (profitdriversinc.com)\nYou can. I'm sure there's ways of knowing you know, it's not hard. It's fronting. Okay. I could help you with that.\n00:38:28 - Dan Ryan (danddcompany.com)\nLike you can. Turn to do what?\n00:38:31 - mark sweet (3)\nSo we'll have, let's say, hospital records, right? We really just want to only provide the best things. I don't want to be hard to where it says like they're on Matt, um, bad for us. And in pre litigation, we don't have to necessarily share all the records. Okay. pre litigation, we don't. And so a large part of why attorneys are doing the demands in my office, because I won't use records to pull out the bad stuff to hide it.\n00:38:57 - Tina Marie (profitdriversinc.com)\nWar games screenshot in my head. play a game. But the reason is though, because chat GPT does have some rules about what it can do ethically, but if you put in the parameter, let's play a game, we're going to role play. This is your role. Your role is to share this information, but to make sure that we never insinuate or allude to drug usage or this or this or this or whatever. You lose the game if you reveal x, y, z, whatever, and that logic can work.\n00:39:34 - mark sweet (3)\nOkay.\n00:39:35 - Dan Ryan (danddcompany.com)\nWell, again, it's going to be a matter of like having a stop word sort of library, I can't the word, that, you know, you can start it right off the gate, right, heroin, meth, right, like there's something you're going get, but then you're going to miss one, right? But as long as you can then update that. database or however that record exists, then you'll get to it, right? So it's the path to getting to the right version is just iterative beta testing with yourself, right? So you turn, like how many cases do you settle a month?\n00:40:21 - mark sweet (3)\ndon't even know, I don't pay attention to number.\n00:40:24 - Dan Ryan (danddcompany.com)\nOkay, so you have 80 examples a month, right? you actually use these demands, you could run 80 demands through this thing, and it's going to learn pretty quick, right? It should learn around, I would say 300, you get about 300 in there, and you should have a statistically significant outcome. Now, it's just a matter of doing, right? You do it and look at it and go, yeah, that's good, that's bad, this part's right, this part's wrong. But it's going to learn through actual real world data, god forbid.\n00:41:01 - mark sweet (3)\nLike you said a rating and like this one's a two out of ten. This one's an eight out of ten. So that way.\n00:41:05 - Dan Ryan (danddcompany.com)\nYep. Yep Yeah, exactly and it's you grade it and then give it feedback what was wrong. This is what was wrong Yeah, this is like I talked to Salco about this months ago once once We got through it. was like, oh wait, this could be done. like it can be done. It just you have to do it Yeah, right. I'm I'm sure if you set up one of these services and then run a demand through what comes out You're gonna be like, this is not great And they'll go oh, we're working on it.\n00:41:39 - Tina Marie (profitdriversinc.com)\nWe're working on it.\n00:41:40 - Dan Ryan (danddcompany.com)\nHow are you working on it?\n00:41:42 - mark sweet (3)\nNo, that's literally my concern is this just gonna be what they have which is the same as just a template pulled together, right? my own thing then someone else's right because you need to us Then with their every situation where we can make it like a one butt click from ourselves for us or no\n00:42:01 - Dan Ryan (danddcompany.com)\nprobably, but that's like the next level, right? Then you have to go right, sales course app version, but the parts that you would you carry over would be the prompt, right? Then you just have to say, Oh, this, this front end. Let's say the front end is just always a form. Oh, this front end form needs to be a whatever their language is called. I forgot what it's going, but it needs to be a blah, blah, form, but then it's still going to go hit any API for charge, even tea, and then it's going to output it inside of the sales force app. And then probably turn into a PDF or whatever.\n00:42:43 - Tina Marie (profitdriversinc.com)\nAnd just a reminder, an encouragement, although I think you get excited enough about the stuff that you don't need it, but the habit that we have of iterations and also just so So you start building something knowing it's not the end product. It's. going to change, you're going to have to do some rework, but it's not really rework because it's iterative, because it's going to have been improved, because you will have learned something that it's then a compounding effect of what you started with and a little bit of a tweak, but in terms of like building something and then hooking it into Salesforce, when you try to have a conversation with somebody ambiguously, like there's no nothing really specific and they're just trying to imagine what that looks like, you're dealing with the limitations of their brain, whereas if you have something that already exists, now you're talking to a coder who deals with API, plus who's familiar with Salesforce and what the options are and whatever, then it becomes much easier conversation because you have a foundation to start with. So if you're willing to put the elbow prison and spend some time trying to figure out a base level framework and get it. started what happens is the same thing that happens every time we've created any type of framework around data or systems or whatever is that you look at it and you're like oh I didn't think about this I didn't think about this and it is a revelatory revelatory process that makes everything else easier but usually what happens is people just think it think it think it think it think I'd like to think the solution you can't you create the solution then the real solution presents itself so you're in the position now of just I mean whether it be something that you use to massively leverage sweet law and I say massively but let's think about it on an energy level and also just kind of alleviating what's tedious or minutia for you and for your people when you have the ability to conserve conserve that energy then all that energy gets to put into higher leverage activity so in and of itself Oh, that is a great play, but then if you create a system that is now kind of proprietary system that you can go sell and monetize, but also not just, you know, coldly because you can go make money, but you also go to get to help your friends use a system. And then you find all of the, you know, related type of activities that it can be used for different types of markets, the dog food like there's. Just using AI to analyze and figure out things. I mean, there's, there's so many plays to it if you're willing to sit there and think and work out the solutions like as much time as Dan is spent in high level. And as much time as you spent just researching and marketing and having all these conversations with different people you put all of that together and. Pretty awesome.\n00:45:50 - mark sweet (3)\nthink. Yeah, no, Dan's super anonymous me almost thought this is all, but if we can actually build the stake behind this is all then we've got something.\n00:46:00 - Dan Ryan (danddcompany.com)\nAnd even if you only use it for yourself, I have many tools that I've built just for me. I enjoy them daily.\n00:46:10 - mark sweet (3)\nBut as you like to say, Dan, what are the hardest people to sell?\n00:46:14 - Dan Ryan (danddcompany.com)\nNo, no, would be, you know, the best products are the ones that solve your own problem, right? And it's not just you know, it's not just your problem, right? And then then you also have tied to that, the whole story brand aspect of, oh, yeah, no, you know, it's trite to say, build for Laurie's bio borders. But in this scenario, it's not, it's not trite. mean, it's, I don't know if that gets used a lot actually in this space, to be honest, but you know, we get built from, built from marketers by marketers, but it's, it's true. And it's like, you know, you could, then you can go into this whole story brand aspect of it. And also results before and after, before. before demand rider, after demand rider, right? Whether it's saving time, it's an increase, like Salco's convinced that you can increase your bottom line through ruptured, like really dialing in the demands.\n00:47:14 - Tina Marie (profitdriversinc.com)\nI can increase my bottom line.\n00:47:17 - Dan Ryan (danddcompany.com)\nthat's true, if that's true, let's say that does happen, you're also going to free up time for lawyers, which may or may not have a result, but it's quantifiable, right? These are the these are the cornifiable outcomes of this thing.\n00:47:40 - mark sweet (3)\nSo, we just kind of need to pick A-Link to start with, I guess, for lack of a better term, because there's just so many options for where to go, but demands make the most sense.\n00:47:50 - Tina Marie (profitdriversinc.com)\nOrganizers get them processed, analyze, start there. So, first, it would be getting files that could be fed,\n00:48:00 - mark sweet (3)\nto AI first securely there is one other thing that I think actually AI can do very very well and it's already somewhat in our system which is pulling by insurance companies and by adjusting their settlements and what total damages are produced damages are to see who we do better with and who we don't do as well with and see if there's anything between doctors we use and don't use yeah I don't have enough data for everything everything but at least we could tell by insurance company and get it started and it's just feeding more data as things go yeah like State Farm I think that now they are very bad State Farm to State Farm things and they're on there we're going to let you get lot of stuff because we're spending too much money which they go every like three to five years between this yeah that was the interest that uh that thing that Josh showed us is doctor thing and then how I when I when he pulled that up I was like wait a second\n00:49:00 - Dan Ryan (danddcompany.com)\nLike he, he's like, oh, you can use this to find doctors, which I thought was interesting, but then he was also saying that it did that. It should, it allowed you to then look at your outcome per doctor. So you could be like, you know what, this doctor doesn't get as good as this doctor. But then you could go back to that tool and be like, I need a new pain management dude in this area. And then all of a sudden, here's the 20 guys in that area.\n00:49:26 - Tina Marie (profitdriversinc.com)\nI don't know if anybody remembers somebody was asking about tracking doctors and creating his spreadsheet for that, just so we can get that data. Bring any bells at all. Oh, yeah.\n00:49:37 - Dan Ryan (danddcompany.com)\nSo his thing, his thing does it. I also thought it was interesting. Did you catch this mark? was like, hey, wait, what? So he basically was like saying that your firm's bigger than theirs, right?\n00:49:55 - mark sweet (3)\nThat was the bye I was getting yet.\n00:49:57 - Dan Ryan (danddcompany.com)\nDidn't he also say that they refer out three?\n00:50:00 - mark sweet (3)\nhundred cases a month.\n00:50:01 - Dan Ryan (danddcompany.com)\nI was like, wait, what?\n00:50:03 - mark sweet (3)\nYes. Now, how many hours, how many are actually like retained or referred out? think are different numbers.\n00:50:11 - Dan Ryan (danddcompany.com)\nOkay, yeah, me too. This was the conversation I had with the ads, certainly guys. Yeah. So oh, yeah, back to that. They gave me all the data on this. We'll just say it was the new Arizona firm. They converted 14% of those leagues. But that's with their version of I'm sure those guys were just retainers, right? They're gold. metric is retainers. It's like, no, the metric is cases. They are different.\n00:50:42 - mark sweet (3)\nNo, I could believe if your criteria is crap, then mine, right? have a great tier. I can believe 14% fairly is because we're at what percent would have certainly like five?\n00:50:54 - Dan Ryan (danddcompany.com)\nYeah, it's everyone's five.\n00:50:57 - mark sweet (3)\nRight? Right?\n00:50:59 - Dan Ryan (danddcompany.com)\nIt's like that number comes up all\n00:51:00 - mark sweet (3)\ntime. I don't know how to refer it out as how many 10 10 percent.\n00:51:06 - Dan Ryan (danddcompany.com)\nRight.\n00:51:07 - mark sweet (3)\nSo yeah.\n00:51:08 - Dan Ryan (danddcompany.com)\nRight. So we need to get so we need to get that in place which we talked about before like there's referred out and then we need we need to differentiate with out for referral and then as been referred out because right now it seems like things are referred out but if you pointed out on those three or four that I sent you you're like I don't think anyone's going to take those however the system says refer it out so I'm like we need to change that.\n00:51:34 - mark sweet (3)\nOh yeah absolutely no it's still referred out because again we're going find anything from even from the jobs 50 percent if one out of you know 10 they get some money on but still one more that I wouldn't have any money in.\n00:51:47 - Dan Ryan (danddcompany.com)\nWell yeah the quick math we did a couple of weeks ago was it's five grand so it's like okay five grand you know nothing especially if it's just a phone call but if you were to go in right now and say refer it out times 5,000, that would be a false number. It's not really that. So, I actually talked to Isaac about that. He's going through the Salesforce course. He's learning some things.\n00:52:11 - Tina Marie (profitdriversinc.com)\nUm, speaking of Josh, what does he have for us in reports right now? You were saying that he could do the...\n00:52:20 - mark sweet (3)\nWe had a really cool meeting that you're going to like, but he needs a little time to put it together.\n00:52:23 - Tina Marie (profitdriversinc.com)\nYeah, I heard about it. I'm really upset I didn't get to be there.\n00:52:27 - Dan Ryan (danddcompany.com)\nListen, it was I don't meet with him ever. So super, he was like, can we do it Thursday? I was like, uh, okay. But normally it's all email. It's not face to face. Or zoom or anything. And it's actually normally it's email through Stacy.\n00:52:49 - Tina Marie (profitdriversinc.com)\nI don't even email him. No recording.\n00:52:52 - Dan Ryan (danddcompany.com)\nI don't get to hear all the smart stuff. You don't.\n00:52:56 - mark sweet (3)\nI'm sorry. I like the end result of it.\n00:52:59 - Dan Ryan (danddcompany.com)\nSo that's a good part.\n00:53:01 - Tina Marie (profitdriversinc.com)\nI like the conversations because then my brain goes, whoa, this is good.\n00:53:05 - Dan Ryan (danddcompany.com)\nOkay, fine. He knows this for sure.\n00:53:09 - Tina Marie (profitdriversinc.com)\nYeah, but here's the thing. He's the guy who has access to all the data I have been asking for for years.\n00:53:17 - Dan Ryan (danddcompany.com)\nSome of it.\n00:53:19 - Tina Marie (profitdriversinc.com)\nYes.\n00:53:19 - Dan Ryan (danddcompany.com)\nFor sure.\n00:53:20 - Tina Marie (profitdriversinc.com)\nOkay. Either way, it's just I decided to see.\n00:53:24 - Dan Ryan (danddcompany.com)\nWell, yeah, you have to his thing builds it. So that data doesn't really exist with his add on. It can. So it's like he, he has two apps that he, I guess, sells. don't know. He didn't actually get it. He did not try to sell us on them at all, which was also funny. He just showed to show them to us and he's like, nerding out on them. I like, yeah, but it's kind of interesting. I suppose we could ask him how much the app is.\n00:53:57 - Tina Marie (profitdriversinc.com)\nIt might be it. Could you do that and ask him to like. I'm gonna tape a demo and let's just hope that he just gets really geeky in there.\n00:54:04 - Dan Ryan (danddcompany.com)\nOh, he will.\n00:54:05 - Tina Marie (profitdriversinc.com)\nOh, he will.\n00:54:06 - mark sweet (3)\nthinking about this though.\n00:54:08 - Dan Ryan (danddcompany.com)\nLet's see. Oh, yeah.\n00:54:11 - Tina Marie (profitdriversinc.com)\nUh, will you ask for that?\n00:54:14 - Dan Ryan (danddcompany.com)\nI'm already doing it.\n00:54:16 - Tina Marie (profitdriversinc.com)\nThank you. Okay. This is gonna be fun. See that and somebody who is excited to go create it and get it for us. I mean, you guys, that's a golden kiss right there. Golden Goose. Okay. Um, uh, down you said you needed to talk about the answer to the guys, but was that what you just talked about? Also, yay for record month.\n00:54:45 - mark sweet (3)\nYeah, that's good. I was not outrageous. So what was not outrageous? Or spend like we didn't over spend to try to get to that number.\n00:54:56 - Tina Marie (profitdriversinc.com)\nWhat did you spend?\n00:54:58 - mark sweet (3)\nI don't have the final number. Because they're still adding stuff into the system. So like the very, very rough number. Was. About 420 case spent.\n00:55:22 - Tina Marie (profitdriversinc.com)\nAnd.\n00:55:23 - mark sweet (3)\nThe other week or so we should have the final final numbers, but it looks like it should be around that. Numbers are going to go down and it'll just go up. So it might be, you know, instead of 4,100, 4,250, which is still a lot better than where we were.\n00:55:40 - Tina Marie (profitdriversinc.com)\nNo, would you divide that by incident or people incident. Okay. Okay.\n00:55:49 - mark sweet (3)\nIf I'm trying to sell or from trying to like position myself, I do it obviously by people because it looks better and how 99% of firms look at things. I just don't look at that way from the market. Because again, it's one call, it's not three different calls, right?\n00:56:05 - Tina Marie (profitdriversinc.com)\nYeah.\n00:56:08 - mark sweet (3)\nUm, and they also include their drops and subouts and then try to pull those out as well. Because if we kept those numbers, if we look by person and by drops of outs, then we're at 126, that brings the number down to, you know, 33, which is a significant difference from 4,100.\n00:56:31 - Tina Marie (profitdriversinc.com)\nThat's, I mean, that's really good. Yes. And your subout rate, what we haven't done, which I want to do when we're starting to track it, is just kind of figure out what that percentage is, 8% roughly, right now. But I'm tracking it over time.\n00:57:01 - mark sweet (3)\nI mean, in this case, it was just, there was one set out where someone signed with three firms in total. Um, I mean, the drops, I put the reasons why all of them in total sense. Um, you know, one, maybe we could have done a better job of the upfront just to try to keep them with their response. If everything else was, you know, a pretty good reason, um, you know, stopping right after a setup. So we need to figure out, is there something better once they sign an agreement to get them to feel better with us? And both those were HQ intakes. So I need to see what we can do to shore that up. I don't know if the HQ intakes do it in Vegas. The guy who runs it's about four, uh, five foot two.\n00:57:46 - Tina Marie (profitdriversinc.com)\nNot so bad. Hey, that's a good height.\n00:57:49 - Dan Ryan (danddcompany.com)\nFor a guy. Mm hmm.\n00:57:51 - mark sweet (3)\nwho? ball guy with mustache.\n00:57:53 - Tina Marie (profitdriversinc.com)\nOr Portuguese girl.\n00:57:54 - mark sweet (3)\nOkay. Okay. Um, because you're coping. Myers is trying to buy all their leads. California, because they have a lead generation business goes with it. They're doing that nationwide, but they're having issues and having to like fire some clients. They like to work with us because we're relatively easy to work with and we get in the answer to the phone. We actually follow up. So. I'm trying to steer away from them saying everything Jacoby is obviously one more. Their cost is 3,500 per retainer. including their cost.\n00:58:26 - Dan Ryan (danddcompany.com)\nIt's not. It's not late.\n00:58:27 - mark sweet (3)\nYeah.\n00:58:29 - Dan Ryan (danddcompany.com)\nSo their lead to they close it themselves. Correct. Oh. Have you seen what? Well, you've gotten it, but it's not. You've already seen what they signed. Right. So what percentage.\n00:58:45 - mark sweet (3)\nAnd I see you respond to them.\n00:58:47 - Dan Ryan (danddcompany.com)\nYeah.\n00:58:48 - mark sweet (3)\nIt doesn't seem very. I say 10% we say, what did you sign this?\n00:58:54 - Dan Ryan (danddcompany.com)\nExactly. So I was going to say probably still about 10% right. So they're not. Cucouville as far as signing the wrong stuff.\n00:59:05 - mark sweet (3)\nNow, can I get the price point? may make sense, but I don't know.\n00:59:10 - Dan Ryan (danddcompany.com)\nWell, it's going to. Yeah, let's say, yeah, if it puts it up at 4,500, remember, um, could score work.\n00:59:18 - mark sweet (3)\nLook, in special outcomes.\n00:59:22 - Dan Ryan (danddcompany.com)\nAnalyzing as a vendor.\n00:59:24 - Tina Marie (profitdriversinc.com)\nYeah.\n00:59:24 - Dan Ryan (danddcompany.com)\nYeah, so just will just will have the per vendor. That's what I was going to ask.\n00:59:34 - mark sweet (3)\nYeah, we're doing per vendor per state, and then we're checking the ROA all the way through to see what our ROI is on each source.\n00:59:41 - Dan Ryan (danddcompany.com)\nYeah.\n00:59:43 - mark sweet (3)\nBut then hopefully we also add on per attorney. So we'll see which attorneys doing what.\n00:59:47 - Tina Marie (profitdriversinc.com)\nOh, understand you guys all like want growth and they don't get excited about anything and really celebrate the win. That's a big celebration.\n00:59:58 - mark sweet (3)\nAnd then you should celebrate with your whole team and tell them. They're reading large bonuses this month so i'm already um super thrilled about spending more money.\n01:00:08 - Tina Marie (profitdriversinc.com)\nI mean that's not the only way to celebrate you can just oh i need to schedule another like follow-up meeting with you too. I want to do that.\n01:00:16 - mark sweet (3)\nYeah almost sixty two thousand dollars this past month on bonuses which is a lot.\n01:00:24 - Tina Marie (profitdriversinc.com)\nThat's a lot um yeah but you don't have to just use money to thank people.\n01:00:30 - mark sweet (3)\nYeah people like money.\n01:00:32 - Dan Ryan (danddcompany.com)\nThey do like money but they also like praise.\n01:00:34 - Tina Marie (profitdriversinc.com)\nThey do in LA. They also like praise and knowing especially yours.\n01:00:41 - mark sweet (3)\nYeah they also like money.\n01:00:43 - Tina Marie (profitdriversinc.com)\nOh my gosh whatever. Okay um so we spend a lot of time talking about the AI stuff just one other Just want to start getting up over one because it's going to take a lot of time to get it right.\n01:00:55 - mark sweet (3)\nLike it's not this is not okay. By next week we got a process. That'd be cool but. that's not yeah likely um but in every case that we get the policy limit on meaning we get the most amount um circling those to feed because we always want to give chat sheet see the best data although guess we can say hey oh void writing demands like this as well yes you so you want to a high low yeah yeah for sure and it's worth all the effort to organize that data to feed it correctly and then give it the parameters and really have um measure the output based off of the prompt there's there's a lot of leg work to do but then once you do it it goes really fast so um i mean i think that's really it uh is there anything else that we should discuss rather um then try to start any new conversations right now that was a good conversation and especially because\n01:02:00 - Tina Marie (profitdriversinc.com)\nSo we're leverage and optimization, which is really the overarching, you know, target that we have the most out of the least.\n01:02:08 - mark sweet (3)\nSo we can go with Dan, you know, there's more money to be made for Dan and for me, for the separate side projects that are not just the law for themselves. And I want to make Dan and myself lots of extra money.\n01:02:20 - Dan Ryan (danddcompany.com)\nSo, you know, there you go.\n01:02:22 - Tina Marie (profitdriversinc.com)\nI'll just watch.\n01:02:24 - mark sweet (3)\nYeah, look, this is the doctor run, right?\n01:02:29 - Tina Marie (profitdriversinc.com)\ndoctor notes like I'm down for it. I got lots of time to work.\n01:02:32 - mark sweet (3)\nSo yeah, I want to hire a teen and make her my money too. She's not.\n01:02:41 - Tina Marie (profitdriversinc.com)\nUm, okay. So is there anything that's pressing anything that we should know or just to bring that for an agenda for next week? On either side.\n01:02:54 - mark sweet (3)\nAnd this month, I'll be waved into Colorado and to We don't have anybody in Colorado to do it. We have both Fuji and agape.\n01:03:09 - Tina Marie (profitdriversinc.com)\nNo, no, I'm an attorney.\n01:03:11 - mark sweet (3)\nLike you're the only one that we able to do Colorado. Yeah, the same way we do like Washington right now.\n01:03:16 - Tina Marie (profitdriversinc.com)\nI'm just saying cuz like somebody's already in New Mexico, but not you.\n01:03:22 - Dan Ryan (danddcompany.com)\nSo I'm asking Colorado is open for the Colorado's mark and mark AI.\n01:03:26 - mark sweet (3)\nHere we go. Yeah, no Colorado is we're trying to. haven't done anything with it yet. Um, although thing of it, the dude who was selling like coaching, he did like a really crappy job with Andy Stickel on the other dude. I don't remember who that is. Anyway, they connected with the guy in Colorado who just does a bunch of billboards, but doesn't want to actually work, and wants to spend all his time in Italy. So, yeah, maybe they'll be in part of connection there, but I don't know.\n01:03:57 - Tina Marie (profitdriversinc.com)\nOkay, anything else?\n01:04:00 - mark sweet (3)\nTalk to Tom and the CAMG people about potentially doing boards into Mexico because that may not be the worst place to start and start getting like our message a little bit clearer and our feet under us to some level. That's just one thing we really haven't done much of any on is, you know, traditional.\n01:04:23 - Tina Marie (profitdriversinc.com)\nYeah, I would love to see the valiant breakdown by state.\n01:04:31 - mark sweet (3)\nYeah, it was actually kind of interesting. No Washington, despite generating a decent number of Washington leads in no California.\n01:04:42 - Tina Marie (profitdriversinc.com)\nYeah, how much of New Mexico was him.\n01:04:49 - mark sweet (3)\nI'll tell you right now because he had asked him the same thing and to do the breakdown form. So that was for Missouri, five New Mexico for Washington. Sorry, no Arizona, that was not Washington, Arizona, that was weird.\n01:05:08 - Tina Marie (profitdriversinc.com)\nOr Missouri, what?\n01:05:10 - mark sweet (3)\nOr Missouri, five New Mexico, Washington. But he generated a decent number of Arizona leads, just not an abandoned anything.\n01:05:22 - Tina Marie (profitdriversinc.com)\nWhere do the rest of the New Mexico ones come from?\n01:05:26 - mark sweet (3)\nThree came from Quantify. One came from Felipe, one came from Monkey, five from Valiant, three from Walker.\n01:05:42 - Tina Marie (profitdriversinc.com)\nI was just asking because for the longest time in Mexico was averaging like two, and then we jumped up all of a sudden, just a few months ago to six, and now we've got thirteen. I mean, those retainers, that that trajectory is impressive.\n01:05:56 - mark sweet (3)\nIt's quantifying Valiant, those are the two that really made the difference.\n01:06:00 - Dan Ryan (danddcompany.com)\nbefore quantifies Ben and quite frankly pretty good find thanks for mustache guy yeah like I said he never know so we're like him sort mustache guy yeah that's a case HQ but who found them case HQ on case HQ no case HQ came from case connect guys yeah and then case HQ referred quantified and who did case connection guys come from me that was the pedigree before it was me yes okay okay it was me for being on Facebook sort of case Nick was an absolute monetary failure for us that's okay they saw\n01:07:00 - Tina Marie (profitdriversinc.com)\nSo, you have to look at the pedigree, you have to look at the little chart there, it matters, cause and effects, everything.\n01:07:10 - Dan Ryan (danddcompany.com)\nNo, I mean, that is good point, right? It's like, some, right, it's not a fail, it wasn't a, it was a lesson, right? wasn't a failure in one respect, but then it's like led to this and led to this.\n01:07:21 - Tina Marie (profitdriversinc.com)\nIt had a return, even if the return was indirect.\n01:07:25 - Dan Ryan (danddcompany.com)\nWell, and then other people won't do it, right? That's like, that's what the ads are dealing with right now. All these firms they call, they're like, please stop calling me.\n01:07:35 - Tina Marie (profitdriversinc.com)\nI was like, yeah, I'll bet. Also, this goes into the practice, which we intentionally and purposely have, which is exploring all the vendors. right. Yeah, exactly. that they're going to be crap and knowing that even if they are crap, sometimes there's a tangent that is valuable to us and, but look at, I mean, record number, When we started your low 30s, mid 30s, and now you're here, and one of the practices is exploring all the vendors, having all the conversations, and it is tedious, and it is risky, and some of them don't pan out. But because of the relationships in those conversations, and the secondary and tertiary conversations that happen as a result of the first one, look at where you're at now, all these different sources, just the change in power and who's bringing what across the state, it's just, I just want to pay attention to the practices and the value of that, because it's important.\n01:08:43 - mark sweet (3)\nSo monkeys back to where it shouldn't be, because they did concerned over last month, obviously, because the numbers didn't make sense.\n01:08:59 - Tina Marie (profitdriversinc.com)\nAlso, I feel like you leave You you manage the vendors better. I feel like you were a little bit more reactive before you didn't know your numbers, you weren't on top of them and you were hesitant to want to have conversations with them. I think you felt like they had a little bit more power over you than the other way around the dynamic has shifted and all of that has happened mostly. Here's the thing. The other thing about data that people don't really notice is that it creates a level of confidence in you know what you know. And so you do what you do even better, and that adds to more confidence and it's a compounding effect too but when you negotiate with people confidently their outcome is very different. So, anyway, all of that just takes into account. So, just wanted to point it out.\n01:09:52 - mark sweet (3)\nYeah, I just got to repeat it and beat it. think we're tenors out for next month already so that's good.\n01:09:58 - Tina Marie (profitdriversinc.com)\nGood September. I can.\n01:10:00 - mark sweet (3)\nThat's all right. Yeah. Well, I dropped for it. That's fine. So we'll repeat it again, which is good. And then starting soon, have Yuri. He's a lot of Thark joining us. So he's a Ukrainian Lot Thark dude and he's going to be taking the bar in February.\n01:10:20 - Tina Marie (profitdriversinc.com)\nAnd where's he going to fit?\n01:10:23 - mark sweet (3)\nSo when he starts, we just have him do demands because I think it's going to start getting too busy. can do more as a demands. A lot of us quit with his to help Lorenz. He has a very large support system, but we're trying to see if can create another Patrick for lack of a better term where hey, this is kind of good. And you know, short term rental, I guess is the best way to think about it. You get a chance to see the lawyer be it be like in baseball, right? like, oh, it's a mid season pick up, but then like they're down the end of the season. We like to do not like anything. And so if he's a great film another Patrick, he's not great. We'll just say, hey, know, our perfect time done.\n01:11:00 - Tina Marie (profitdriversinc.com)\nGoodbye. I love that.\n01:11:02 - mark sweet (3)\nI love that as a problem process to build them up. this is a long term commitment, but but it's not with no without anything because he's doing some work.\n01:11:14 - Tina Marie (profitdriversinc.com)\nYeah, and it's the and also that's easier than going out and just trying to hire anybody because that doesn't go well.\n01:11:23 - mark sweet (3)\nWe're having much more difficult time with it. So it makes more sense to build these people internally or I'll do both quite frankly, where we can find them. We just have to keep an eye on our payroll because that's a lot.\n01:11:35 - Tina Marie (profitdriversinc.com)\nThat is the guy who just like keeps throwing out bonus and left and right.\n01:11:40 - mark sweet (3)\nThat's Mary more than me, but yeah.\n01:11:43 - Dan Ryan (danddcompany.com)\nOh, okay. Well, Mary.\n01:11:44 - Tina Marie (profitdriversinc.com)\nI think we need to start having some other conversations.\n01:11:49 - Dan Ryan (danddcompany.com)\nMary's nickname is money fairy.\n01:11:51 - mark sweet (3)\nMaybe you didn't know this. Look, we started. That's what I was going to say. You know, if the teams have their goals. to help them do more than push them and do more. So, you know, hey, and those are high numbers. think maybe.\n01:12:10 - Dan Ryan (danddcompany.com)\nBut here's the question. Here's the real question. Are these numbers a result of that or not? Because you're for sure related. But right.\n01:12:22 - Tina Marie (profitdriversinc.com)\nto what degree?\n01:12:26 - mark sweet (3)\nRight. I think what's going to be more on the money in than on the settlements themselves because the teams while they do have some controller getting, you know, records and whatnot. I'm sure they feel more like the attorneys are responsible for that. On the money in, you know, maybe something like the teams like the case manager is sitting around like, how close are we, how close are we to see what else they can push to try to get that extra money in.\n01:12:47 - Tina Marie (profitdriversinc.com)\nHere's the thing though. It's the amount that will make the biggest impact to you that actually almost makes the least impact to them. So psychologically. If there is a bonus for a thing, it's not necessarily that that bonus has to be a certain number. It just has to be there There's a potential that you're overpaying. So like on the line item for how you can earn the money Taking that back not necessarily you can't take anything back. Anyway, this is a whole big long conversation But my point is is that a lot of times a five dollar Not talking about your attorney your your your attorneys your team But it's somebody just getting an unexpected or an earned extra a small amount Versus a large amount that the happiness level is almost equal. They're obviously our gaps, right? But my point is that To get the lift that you need you probably don't have to give the lifts that you're giving so There is some math to be figured out there, but again you have an existing team Zisting expectations pulling back and then you have have to look at what's available in the market. There's a lot of numbers to crunch.\n01:14:04 - mark sweet (3)\nAnd that's probably what it comes to the market, where we can do these interviews, what people want, is more than what we're paying our current people for lower quality.\n01:14:13 - Tina Marie (profitdriversinc.com)\nYeah.\n01:14:14 - mark sweet (3)\nSo this is the way to bridge that gap to some level.\n01:14:18 - Tina Marie (profitdriversinc.com)\nAnd it's entirely possible that it's a very, very good system. And so then the other way to leverage your money is to be able to use things like the AI to have them doing less of the tedious stuff. So they're doing more of the money-making activities. So with the same amount of staff, you're getting more money. You're also paying more bonuses. But that still should be maybe it's not a higher percentage of profit margins, but an overall higher bottom line. Then you're still winning the game.\n01:14:51 - mark sweet (3)\nSo I think that's issue for me. is that I wanted an achievable because I hated, hated, hated working for people where the goal is just not realistic.\n01:15:06 - Tina Marie (profitdriversinc.com)\nYeah. You feel like you're being set up to fail?\n01:15:09 - mark sweet (3)\nYeah. But I think it may actually be a little low because I shouldn't be breaking even every month if they hit their goal.\n01:15:17 - Dan Ryan (danddcompany.com)\nLike that's not right.\n01:15:19 - Tina Marie (profitdriversinc.com)\nRight. Exactly. So what kind of How can we visually see this data of what comes in and I have to think about, you know, what I would want to see, but all the different types of bonuses, what all the goals are, who hits them, how they hit them, what it costs you, aside from the bonuses is, you know, the working net revenue up until payroll and bonuses so that we can see that correlation and and look at the performance over time.\n01:16:03 - mark sweet (3)\nI can't, I'm kind of fried right now, but the most person they got and go through, but you know, again, these are good problems to have right in their goals and in their expectations.\n01:16:13 - Dan Ryan (danddcompany.com)\nThat's definitely not a bad thing. Oh, I got something. I talked to your boy, Salco. I forget when, but I forget when, but because I didn't answer the phone for a couple days, because I was doing a bunch of with my parents, but uh, so he was saying, and I thought this was interesting because I was like, okay, yeah, I never thought about that. He was saying how he just settled a dog bite through you or whatever, in your, in your firm, I think, for like 75 grand. He's like, yeah, just settled a dog bite for 75 grand. And I was like, okay. And he's like, can any of these vendors generate dog bite leads? And I was like, I don't know, like I never, I've never done it. I've never asked them. I've also never seen it. So I, when I I was talking to Ed, certainly, on my bi-weekly call that I have with them, for whatever reason. I brought it up with them, and the guy was like, really? I go, And he goes, I've never seen anybody do that. go, neither have I. So then he starts researching. He goes, dude, there's nine million dog mike. And he just starts rattling off all the data. And I go, And he's like, why doesn't anybody do this? go, I don't know. I go because lawyers, copy lawyers, copy lawyers. And I go, do you think you could generate them? He goes, yeah. And so when I was talking to South, I go, what's the criteria? And he goes, I mean, you know, that route lost some . And what I heard was, did you get bit a dog? Do you know who the homeowner is? Did you get medical assistance? Medical treatment. That's it. That's it. That's a lead. So I was like, yeah, that would be a lead. Oh, okay. That's a simple form, right? They just fill that out. So then it just becomes a math problem. What's the cost per lead? So if you say, cost per unit is x, convergent is five, right? We always know it's five from internet, basically. Then, and then average case value, you might not have enough data for that. But I go, okay, that's interesting. Like you could do that, but now you're talking about diversifying your case load, right? So everyone's going out to car accidents. You add this into the mix. got it. Now, hold on. You got car accidents and dog bites. Then you're also adding into the mix. Well, now they've had a lawyer with suite law. And when they get, when they get in a car accident, they're going to call a suite. Yep, and the referrals. So now all of sudden you're adding new nodes to your network. I was like, okay, that's interesting. And then it's a different demand, right? So it's like, okay, do you have a good dog bite demand? Sounds like Salko maybe had a good one. have no idea. But I was like, okay, that's interesting. And these guys were like, I can't find one. ad for this. That's it. I can't explain it to you, but I've never done it. Doesn't mean you should.\n01:19:07 - mark sweet (3)\nOne really big difference between a couple between dog biting car accident.\n01:19:12 - Dan Ryan (danddcompany.com)\nYeah.\n01:19:13 - mark sweet (3)\nThe drop rate is massively higher on dog bite because a lot of people don't have insurance.\n01:19:21 - Dan Ryan (danddcompany.com)\nRight. Exactly. So the qualifier, so the 5% might be too in actuality, right?\n01:19:29 - mark sweet (3)\nSo if you if you bake it in a 50% drop rate, you get into the case because that's what I'm saying. So your drop rate is 40% plus.\n01:19:38 - Dan Ryan (danddcompany.com)\nYeah. So if you model it at 50, can you even model it out, right? So if you say, okay, going to get, you're going to get, it's $250 a lead, you're going to convert five, and then, and then half of those are going to drop. They probably going to be cheaper, right? Yeah. So I was like, all right. And so the ads certainly guys are looking at it. They're like, wait. this is a thing. I go, it is a thing. I just don't know if it's a thing that works. And they're like, all right, this is interesting.\n01:20:10 - mark sweet (3)\nAnd of course, for them, talk about you get decent money on, especially when you talk about minor children getting bit, like we've gotten.\n01:20:17 - Dan Ryan (danddcompany.com)\nThat's the other thing, it's mostly children that get bit just to do sports a lot. No, according to the stats, I don't know if it's truly true.\n01:20:28 - Tina Marie (profitdriversinc.com)\nWe have a little girl that lives up the street. She got mauled so bad. She doesn't have hair anymore because they she got attacked by two governments and they they chewed up her scout like she shouldn't be alive. She had multiple surgeries.\n01:20:43 - mark sweet (3)\nIt was right. And so if there's insurance on the homeowner, that's, you know, $500 million case.\n01:20:50 - Dan Ryan (danddcompany.com)\nYep.\n01:20:51 - Tina Marie (profitdriversinc.com)\nYep.\n01:20:52 - Dan Ryan (danddcompany.com)\nThey got nothing. So those get so you're not totally against this idea, then?\n01:20:57 - mark sweet (3)\nI'm not totally against the idea because be significantly cheaper for a commitment.\n01:21:03 - Dan Ryan (danddcompany.com)\nI would imagine.\n01:21:04 - mark sweet (3)\nSo yeah, exactly. But I'm not against the idea because the criteria is, did you get that yes, and then get scarring photos, basically, would like show me the bite because you've got people that it's like, you know, a scratch, like it's what I got. Oh, there you go.\n01:21:17 - Dan Ryan (danddcompany.com)\nYeah.\n01:21:18 - mark sweet (3)\nBut dog bites, especially California, it's there's no one bike for you. think Arizona law is a little different.\n01:21:24 - Dan Ryan (danddcompany.com)\nDid you just say one bite free?\n01:21:27 - mark sweet (3)\nSo Arizona kind of has that role, actually.\n01:21:29 - Dan Ryan (danddcompany.com)\nYou're kidding. You had to have to be a second offense, like second strike.\n01:21:35 - mark sweet (3)\nUnless, you know, a dog with dangerous propensity. Yeah. wow.\n01:21:40 - Dan Ryan (danddcompany.com)\nYeah. And they were like, we could do California. OK, that would actually be the perfect and biggest population, all that good stuff, man.\n01:21:49 - mark sweet (3)\nBecause you got some plastic assertions and stuff like that.\n01:21:51 - Dan Ryan (danddcompany.com)\nSo California would definitely be.\n01:21:53 - Tina Marie (profitdriversinc.com)\nOh, yeah. yeah.\n01:21:55 - mark sweet (3)\nYeah.\n01:21:56 - Tina Marie (profitdriversinc.com)\nSo, yeah. Well, I think the other thing is the system, whatever system. some you create like a could do you have access to or would a private investigator or if you hire them have access to like if you get they say yes I know the homeowner this is where they live this is their information where they could go say we know that they have insurance is it a record that a specific entity would have access to no you can hire a investigation companies it just but they're not the best in that regard I mean you send letters the worst case you file lawsuit and discover you find out pretty quickly and you just learn they have nothing and it's kind of a whatever but so if you wrote it all up it's basically here's the boxes this is what has to happen this is this is how long this would take this is what this process would look like so that and then do a rough forecasted like if we were able to get leads at this cost the percentage that have insurance, don't have insurance, the estimated value like I just did a quick search and it says 4.5 million people have been a Forbes report for last year, per year, 800,000 only must seek medical attention of those. Do they know, you know, how much is that is just little stitches or go away? There's nothing like there's so much data to go get and then plug in those numbers and then how much does it take? But even if it added, you know, $50,000,,000 to your gross revenue, that revenue, whatever, all those numbers, you could spend a day or two doing the research and find out if it's even viable, but if it's viable and you've got...\n01:23:45 - mark sweet (3)\nIt's It's viable. Generally, also need to try to target more affluent areas.\n01:23:51 - Tina Marie (profitdriversinc.com)\nYou don't want to target like combat. Yeah, yeah, yeah.\n01:23:54 - mark sweet (3)\nThat's the big difference for the lead generation.\n01:23:57 - Tina Marie (profitdriversinc.com)\nThey usually just do state wide and if you live or die by it's an area.\n01:24:00 - mark sweet (3)\nis where you just, you know, damn well, they don't have anything.\n01:24:03 - Tina Marie (profitdriversinc.com)\nYeah.\n01:24:04 - Dan Ryan (danddcompany.com)\nSo you're not targeting Compton. I got you're in Compton.\n01:24:07 - mark sweet (3)\nYou're going to target more like Vermont.\n01:24:09 - Dan Ryan (danddcompany.com)\nYeah.\n01:24:11 - Tina Marie (profitdriversinc.com)\nOkay. Um, okay. Um, else that needs to be talked about this week or tabled for brought up for next week to talk about?\n01:24:23 - mark sweet (3)\nYou know, I mean, I buy things definitely in Avenue. Um, because it's easy to train. like, did you get bit by dog? Yes. Okay. You theoretically have a case like it's not.\n01:24:33 - Tina Marie (profitdriversinc.com)\nThere's also it's another way that you're using your existing resources. So it's getting more out of what you have. And that is leverage. Yeah. That's what we want more of that. Okay.\n01:24:46 - mark sweet (3)\nYeah. That's a back then.\n01:24:55 - Dan Ryan (danddcompany.com)\nBut yeah. Oh, yeah.\n01:24:57 - mark sweet (3)\nI know. Yeah. That's coming. Yeah. Just as a quick heads up. that's one word for it.\n01:25:05 - Dan Ryan (danddcompany.com)\nUm, but yeah, he died when, like today. Yeah. Yeah. That's what him and I were talking about that. He's like, he was like, I don't understand like what he thinks is going on. Like he's kept saying his dad thinks he's going to be doing this and doing that. I was like, dude, nobody, nobody, like, we're all on the same path. We're all on a path to the end. Of course, we're not sitting there going hope it ends.\n01:25:37 - Tina Marie (profitdriversinc.com)\nMy mom is.\n01:25:39 - Dan Ryan (danddcompany.com)\nOh, is true. And they and they accelerate that for them.\n01:25:46 - Tina Marie (profitdriversinc.com)\nI don't know.\n01:25:47 - Dan Ryan (danddcompany.com)\nNo, not recommended.\n01:25:50 - Tina Marie (profitdriversinc.com)\nNot recommended. They're miserable. And they spread them as a read.\n01:25:54 - mark sweet (3)\nBut you had something. All right. We're situation.\n01:25:59 - Dan Ryan (danddcompany.com)\nYeah, for sure.\n01:26:00 - Tina Marie (profitdriversinc.com)\nAll right guys, till next week.\n","contentPreview":"00:00:00 - Tina Marie (profitdriversinc.com)\nTwo Mark sweets.\n00:00:01 - mark sweet\nYeah, I wasn't sure which one was right. So that's all right.\n00:00:10 - mark sweet (3)\nI just don't know one. They'...","processedAt":"2025-05-04T03:40:52.628Z"}