{"fileName":"Done Transcript for D&D Co & Profit Drivers - Weekly Review(1).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Done Transcript for D&D Co & Profit Drivers - Weekly Review(1).txt","type":"transcript","priority":"medium","content":"00:00:04 - Tina Marie (profitdriversinc.com)\nCan you hear me? Oh, wait, it says you're muted.\n00:00:13 - Dan’s iPhone (danddcompany.com)\nMight be a problem.\n00:00:15 - Tina Marie (profitdriversinc.com)\nUnmuted now.\n00:00:17 - Dan’s iPhone (danddcompany.com)\nHey.\n00:00:18 - Tina Marie (profitdriversinc.com)\nHey. is Dan today?\n00:00:22 - Dan’s iPhone (danddcompany.com)\nOh, Third meeting. We're just rolling right, rolling right through him.\n00:00:27 - Tina Marie (profitdriversinc.com)\nOne, two, three. Let's go. What was that?\n00:00:35 - Dan’s iPhone (danddcompany.com)\nLet's talk to the dog. She's looking at it. What are we doing? We're not doing anything. Nothing is happening.\n00:00:43 - Tina Marie (profitdriversinc.com)\nIt's not for you.\n00:00:44 - Dan’s iPhone (danddcompany.com)\nCome down. I'm just, I'm just standing up. We're doing stuff. doing stuff. It's like when she's home alone with me, what's really funny is when the cleaners come, they know. She's always like, are we going outside? Is this it? I know we go outside when they're here. Is this it? What? She'll be like, run to the door. Look back. I'm not going outside yet. I don't have cleaner day, perch day. That was yesterday. Yeah. So she knew. She's not running. She knows she's not even going near the door.\n00:01:17 - Tina Marie (profitdriversinc.com)\nI need a replacement because my moves, but it took me so long to get comfortable with having hard hair. Because yeah, I just don't like people. That's so funny.\n00:01:30 - Dan’s iPhone (danddcompany.com)\nIt's like, I literally put a post it note on the window outside the front door and then go outside before they even get here. So they just let themselves in and do the thing. They're on an app. So the app says they're on their way and then when they're done, they're done. But actually those go to Denise. don't go to me. Denise just said in screenshots. Of course Denise is like, oh, the cleaners are coming later. He's out, going to Costco. like, wait, what? I could go to Costco. I could do the Costco trip.\n00:02:09 - Tina Marie (profitdriversinc.com)\nWe've got homes going, so dad adds a whole new layer of stuff.\n00:02:14 - Dan’s iPhone (danddcompany.com)\nOh, yeah. Oh, yeah. Yeah, when they're home, they all bale. They all, but they all scatter and like, really?\n00:02:21 - Tina Marie (profitdriversinc.com)\nYes. Yeah, I'm, but I, I'm starting to interview and look for people. I think I found some I might like, but it's taken a while.\n00:02:33 - Dan’s iPhone (danddcompany.com)\nAnyway, check wherever the convinced Denise even knew it.\n00:02:37 - Tina Marie (profitdriversinc.com)\nYeah.\n00:02:38 - Dan’s iPhone (danddcompany.com)\nWhat? Picture this. Cleaners.\n00:02:46 - Tina Marie (profitdriversinc.com)\nI don't think I would have even tried it with kids at home until it just happened to be that one of my friends did it. And I was like, okay, we can do this. Like I didn't know. And then there's the whole friend. issue, right? So like, making it feel like there's a weird dynamic or whatever, but we, so she did it for like 10 years for me. And then she moved and that was last year. And I'm like, everything's fine, everything's fine. I'm like, everything is not fine.\n00:03:22 - Dan’s iPhone (danddcompany.com)\nI'm gonna have to replace everyone. Like, nobody's gonna take care of me like her.\n00:03:27 - Tina Marie (profitdriversinc.com)\nShe like actually loved me. Anyway, um, man, it's such a busy week, a short week, but it is a week. And I want to make sure I'm not late to you. So my daughter got her GED. This is her junior year, but she's like, with these people, basically. I'm like, well, you know, I rather than watch you destroy yourself emotionally, why don't you just get done? And so anyway, Yeah That's right because what she wants to do anyway tattoos air nails and she's already got those skills down and She's she's my very free spirit my rocker my you know, and I'm like she does she does Make a partner One of them one of them. Yeah. She's did I ever show you avatars makeup Thanks. yeah Yeah, she's the one that did that so You know, I'm like this is not They're not even doing anything. That's really useful for you You need to know math and you need to know it well I mean you need to know something and you also need to learn how to put up with people, but oh I'm gonna teach you another name. Oh, well not in this one not in this one anyway Yeah, so anyway, but she wasn't gonna go through any of the you know the event type stuff Because the GED program is different. It wasn't all people she went to school with. It's not her class because she did it a year early blah blah blah. And then she's like, well, I'm doing it. And there's a walk and would she tell me Tuesday, I think. I'm like, all right then, we are rescheduling everything because whatever experience you want to have, we're going to have. Anyway, okay, so last week we went over the orgs part and man, that was a massive reduction of refinement. And my question is, did it cause any percolation? just sometimes that happens. do something you percolate. Nope. And you're like, I already knew this. I already knew this. We just actually put it on the page.\n00:05:47 - Dan’s iPhone (danddcompany.com)\nSo I'm not related to that. The only thing I was like, like, I don't know what's going on with Eric. Like, I mean, I already told Norio, hey, dude. this isn't working by the end of the era. I'm out, which still holds true. And then I still want to do that reduction thing with him. But like ever since ever since that issue with Eric and Dibba, like when they blew up on that dude back in December or whenever, it's like things have never been the same since. And there's just this weird, it's and it's not coming from me at all. There's this weird thing with them. And I think I predicted this. I've like, I predicted I'll be next, right?\n00:06:43 - Tina Marie (profitdriversinc.com)\nBecause when they're target, like do we target them?\n00:06:47 - Dan’s iPhone (danddcompany.com)\nYeah. And it won't, it won't, they won't target me. But they are, right? so they're probably talking all kinds of about me when they're together, because it's this, this, like, Like, I dubbed them the toxic twins the other day. I was like, they're like the toxic twins. They're bad for each other at the end of the, or really give us, I think bad for Eric is probably the better way to say it. But it's like, I can feel it. And it's like, it doesn't bother me really. But I'm like, okay, why do I have to put up with this ? I don't, flash, I don't, I told Stacy on Monday, like, give has been working on sweet love stuff and some other stuff. So the sweet love stuff, like we got all caught up on and he was just like super overwhelmed by it, which I understood, because I went and looked at it and I was like, God damn, this is a lot. And, and Gert's system isn't great, not a fan. I'm like, I comment on stuff and I'm like, okay, would you comment back? How do I know? Because as far as I could tell, it's not notifying me. And then I have to go find the that I commented on and I'm like, this is no. so we whittled it down to where like, Giba has five tasks. Eric has won. gave one to Eric. And it was was like technical. But then I told Stacy, it's hilarious. told Stacy yesterday, hey, if he doesn't have a story done by the end of the week, he's done. We got to find somebody else because I'm not I'm not putting up with this anymore. And then I was talking to Eric yesterday, who was like, I'm annoying about like, oh, he's doing such a bad job managing Munir, and he was just getting all on his head. I'm like, bro, the dude, now we don't know if this is true or not, but I'm going to go with the guys telling me the truth. His kid is sick. He's got some family issues. happened. So yeah, and how Oh, and then it happened to Eric and Norio several times over the year? Right. I'm like, and I'm like, don't care, like straight up, I am, I am not empathetic to that at all, to be totally honest. Like I'm not sitting around going, Oh God, that poor guy. I don't know him. I don't know. I mean, like, here's what I know. There's that we need to get done. So I go rather than turn it into this big thing. I reached out to Munir and I was like, I fall on game and out. I was like, Hey, look, if you can't do this right now, I totally understand. You just got to let me know. Right. And if that's the case, if there was a developer you could recommend, I would appreciate it. If you cannot do that, totally fine. Let me know. And he wrote back, I do not want to stop working on this. I apologize. Yeah, I'm still going through this deal with the stuff. I just can't he's like he just is like I can't get on a meeting with Eric and those guys Can you just send me a task and I'll just do the tasks and I go bye. Yeah, totally It's just whatever's going on with his family right so he does I think he just he's like I just can't block out an hour to get on the phone with those guys Which I 1,000 percent understand I was like, I'm right I have to get on the phone. I don't So he's like could you can you just tell me what needs to be done? And can we just work with the three-mail for now because he's like I know I can't I can't and I go Yeah, totally we can do that so then I turn around I go to Eric and I go hey Talking to me near and then he just launches into this whole thing about like I can't handle this and got to time like okay You're not handling any I know I'm like So he's getting all in his head although this did bring up the org chart Funnily enough Gina. I'm in my head. I'm seeing the org chart.\n00:11:04 - Tina Marie (profitdriversinc.com)\nI'm like, okay.\n00:11:05 - Dan’s iPhone (danddcompany.com)\nyeah, you you are sort of supposed to be managing this thing. And if you can't like it. I'm like, are you managing it or you know, you're not really managing it because you're waiting and you're waiting and you're waiting and you're waiting, like, manage it. You don't wait. You go. Okay, I got to get this thing done. like, okay, he doesn't really understand like. Okay, we can work with this guy. I'm like, or we have to figure out if we can. He says he wants to. This is what he wants to do. So I explained to him. I go, okay, here's, here's what I need to know from you. XYZ. He literally is just not answering what I'm asking. And he's going on and on and on about how I'm this guy's ghosting us. I'm like, focus.\n00:11:54 - Tina Marie (profitdriversinc.com)\nWait, so Eric is not answering you?\n00:11:57 - Dan’s iPhone (danddcompany.com)\nNo, no, he's he's having a bomb and.\n00:12:00 - Tina Marie (profitdriversinc.com)\nBut I was just trying be like, because you're going between Eric and the earth.\n00:12:03 - Dan’s iPhone (danddcompany.com)\nSo I was just trying to make sure that it was Eric and Eric.\n00:12:05 - Tina Marie (profitdriversinc.com)\nOkay.\n00:12:06 - Dan’s iPhone (danddcompany.com)\nTotally. He's not. I'm like, Hey, this is what we need to do. Can you tell me, like, give me, because full on, like, I don't understand the breath of what's going on. So I'm like, okay, you need to tell me. I need to understand what's going on exactly. So I'm going to, you know, ask a bunch of questions to figure it out. like, all right. So is this where we're at? Is it, is it X, Y, C, look like this? And he's like, yes. It looks like that. I go, okay, great. So we're dealing with like bugs and then sort of tweaks and then full on new features. Yeah. Okay. Great. What do we need to launch WolfArt? Do we need features? Do we need bug fixes? Do we bug fixes and tweaks? we need it's bug fixes and tweaks. I go great. No features. No features. Great. I need you to give me a priority list of whatever it is from those first two categories that will allow us to launch that site in any subsequent sites, knowing that the rest is going to get done, you know, additionally, right? And whether we catch the features part or not, it's irrelevant. Because I'm like, if we don't need the feature, we're not going to do it. Can you do that? Yeah, but oh my god. No, no button. No button. I'm like, so then I'm expecting like, I talked to him and this is, well, why didn't he say that to me? I'm like, you didn't ask. And it's because Eric's like super nice in his emails. And I'm like, you're not. So yeah, in a way, you're not managing this. And I wasn't totally expecting you to, but I sort of am, but I'm so right, whatever. So you get through all that. Yeah, I mean, ultimately I'm in charge, right? that's why I hit up here was like, all right, if you need to go, then you need to go. And then I need to figure out the alternative path, which was my chat GPT, whatever. And then it's also getting me like, all right, these guys going to learn how to build blocks, which there's tons of resources out there. just going to find the resources. found one yesterday, sent it. was like, I won't go watch this. So yeah, that I was dealing with all that. And I'm like, OK, I think we got they should have a list to me today. And then I hit up Moonie again after your response. I said, OK, here's what we're going to do. I'm going to say your priority task and allow us to launch sites, blah, blah, He asked there was an issue with bugs getting reintroduced. I don't know if you're aware of this, which he wasn't because Eric just knows that it happens and then ruminate on it. And I'm like, it doesn't help.\n00:14:53 - Tina Marie (profitdriversinc.com)\nI don't have this stuff.\n00:14:56 - Dan’s iPhone (danddcompany.com)\nYeah, I think you found the old habits. So anyway, there's that and then there and then you add that into I'm like dude I don't really need your weirdness and then this I Don't need both of these things right now, right? Sorry And apart, you know part of me sitting there going I mean do I just I've thought it many many times I'm like I just go to me like hey, man. Here's 50 grand.\n00:15:25 - Tina Marie (profitdriversinc.com)\nYou got six months upon a job like It's the best I can do I Mean that's kind of and nobody does that so And it's why you keep in mind. mean think about what it was like when you got rid of Evan when the Francesco is gone When Glenn was gone, right?\n00:15:47 - Dan’s iPhone (danddcompany.com)\nOh, it's it's nowhere near that level Don't don't get it wrong like it doesn't it's no weird near any of those. It's just I'm just looking down the road going where where am I just like like, I've resolved to this too. I decided so Friday, it was supposed to be. Hey, we're going to go in and we're going to do the vocals on this song or whatever. And then nobody, I mean, Stacy was there, but I was like, I'm not going to record just Stacy. But it was supposed to be Giba, Eric, at least one of them, Jenny, and then Stacy. So Eric, Jenny and why would you lie to me and then text the person right next to me? how dumb are you? Giba lies and says, oh, I can't make it in today. And then Jenny's sitting behind me and she goes, Mike is, Mike said he's almost at our house. Can he get in?\n00:16:52 - Tina Marie (profitdriversinc.com)\nI'm like, so you drove past here. Wow.\n00:16:57 - Dan’s iPhone (danddcompany.com)\nTheir house is south of where we are. You lie and say you can't make it in, but you're going to their house and you guys are all meeting up after which is fine.\n00:17:06 - Tina Marie (profitdriversinc.com)\nI get it. Your friends. That's all good. Right.\n00:17:07 - Dan’s iPhone (danddcompany.com)\nyou lying and then yeah, I know and it's like it's like just whatever like don't you don't want to come in. Don't come in like whatever. And so I thought that was funny and then so then they're like they got to go meet Mike at their house and I go all right. So I guess we're not doing the vocals today. And they're you know, they brought they had like their puppy or whatever, which is very cute. So in that moment, was like, oh, yes, super cute. So So in that moment, I'm like, you know what? I'm not I'm not gonna work on those songs at all Unless they unless they say they want to do it and then I'm gonna be like, did you practice? And if you didn't practice, then I'm not we're not doing it because I'm not I'm not wasting my time sitting around listening to you Croak into a mic like it's not happen. And they'll never, they'll never, you know, I'm gonna predict the future here. They're never gonna ask it, but they're gonna talk about the fact that I'm not doing it endlessly. And that will be that's like the seed of what it is, which I think is super ironic, because it's like, you're, you're, you're not gonna do the thing, but you're going to criticize me for not doing the thing. But it's, it's your thing. I'm not doing anything. I'm, I'm just gonna record it. Like you're, you're supposed to say, it's the, what's holding it up is you. Yes, we started this in November. FYI. So I'm gonna go work on my Dan Burke song. And then that's gonna really bother them, because then I'm gonna release that and they're gonna be like, hey, whatever.\n00:19:01 - Tina Marie (profitdriversinc.com)\nWhat drama sounds like being dead aren't allowed.\n00:19:05 - Dan’s iPhone (danddcompany.com)\nIt's it's it's it's pending that's whole thing It's not really yet, but I think it's going to be real We'll see Well I'm telegraphing right exactly. It's my intuition thing.\n00:19:22 - Tina Marie (profitdriversinc.com)\nThis is what coming down the pipeline Yeah, but it's it's yeah, I don't I think that it's partially there You're just like it hasn't hit a threshold. So I don't think you're projecting and predicting I think you're interpreting and it's you're Probably on point and it just hasn't hit a threshold.\n00:19:46 - Dan’s iPhone (danddcompany.com)\nI think it's just a threshold Yeah, I think the problem With it is It's not real. It's not true. So they they they can't i mean it could be to a degree i mean maybe i'm wrong here but i can imagine eric talking about me to jenny and jenny being okay with that or or give the same about me to tracy and trade like tracy came down for my birthday specifically to hang out and because i don't i want to right so i'm like all right this is if this is the path we're headed down then let's see what happens you never know so um they could have some personal awakenings we'll see yeah um especially if you you have any luck anyway i've got multiple thoughts about it but all of it is speculation and speculation is just speculation so it's kind of a right Wait, we're in a wait and see.\n00:21:02 - Tina Marie (profitdriversinc.com)\nYeah, my speculation is a way. You're sharing what's happening is Is the just the beginning is an observation observation to me and speculation are very different things? So anyway Okay, so well, let's see That's good Well, let me open my nose for a quick. It was not and I guess for the first thing that I was trying to Make sure I was ready to walk out the door for my girl Newsflash Okay, almost set a record yesterday Not a lot like just a score release like we set this record in December, but it was because the BEC exam was ending Right, right.\n00:21:56 - Dan’s iPhone (danddcompany.com)\nOh, yeah, there's gonna be this huge flood, but the first real score release of 2024 was, well, it actually wasn't supposed to be until next week. then out of nowhere, they announced it that it's Monday, his past Monday. So then Monday, we did like 80. And then yesterday, we did like 94. And I think our record was 98 back in December, because of the EC, and I was like, damn, new order. That's new subscriptions. So not, yeah, new subscription, not new customers.\n00:22:34 - Tina Marie (profitdriversinc.com)\nWhat were the numbers again?\n00:22:37 - Dan’s iPhone (danddcompany.com)\nYes, today was 94. I think Monday was 82 or 86, we're going to, unless we change the current. we're averaging 30 a day, we should cap out. Well, now actually, it's stuff like this that will alter it, we're going to cap out in 120 days. So I did this whole thing, the glass ceiling, calculation that I've always, I figured it out at one point and I forgot about it because we were going through all this weirdness. But I realized when Bobby was like, oh, release. Wait, wait, we're now returning to normal. This is the first normal since COVID, right? We had all this crap with COVID and the exam changed. went out of this normal, went away for almost 40 years. It's like, holy , we're returning to normal. Granted, it's not totally normal because the score early schedule for the rest of the year is slightly altered. But for all the purpose, it's pretty frickin normal. the score release windows are a little broader. Don't ask me why they don't. at this, but they are. I'm like, how that actually probably works in our favor, because the time between score releases mean they might hang on, whatever. So I'm like, that could play in our favor. But that's not a metric we really look at. When we look at it, but it's LTV, it's like, huh, LTV, because that's great. But really, it's like, okay, we're still going to hit this 30 a day, or we are hitting this 30 day. So I did the class ceiling calculation, which says you'll get 3600 total subscribers based on the current new per day in the churn. So in 120 days, we'll hit that or sooner. So I told those guys yesterday, I was like, hey, this is happening. And then I went and figured out, I'm not done yet because I'm going to get one more number. figured out our CAC, which I've never done before. And that is $16.\n00:24:55 - Tina Marie (profitdriversinc.com)\nSo we make back the cost to acquire a customer.\n00:25:01 - Dan’s iPhone (danddcompany.com)\nSo most SaaS, yeah, but it costs to require customer and SaaS, they use CAC, don't I say why? Okay. So usually your CAC is whatever and then the calculation of the CAC is this other formula which I can show you but I don't remember, I can't explain to you about the phone. But ours is $16 and I'm like, well, okay, we make our money back in two weeks. So, which is ridiculous, because usually with SaaS, your CAC is much greater. takes months to get it back. So your CAC and LTV sort of interact with each other a little more than here. Then I was like, okay, so if we have 7,000 new customers, the CAC is being calculated by me taking all the ad spend ever for 2023 and then dividing the total new customers into that. So now I'm like, okay, I need to. figure out how many of those 7,000 customers can be directly attributed to ads, but I'm saying they're all result of that, but I know they're not. But if I could go figure out, if I could go figure out, if I could source them and say, well, actually, know, 2000 of those did appear to come from Google or they're coming from Facebook or whatever, then it would be, all right, can I, can I go now, which is something I've also never done? Can I now actually go spend money and increase customers and know that that's what's happening? Because I've never, I don't believe that's what's happening. But other than with the CPA exam, I'm like, I know that that works. So can I go to a source and a starting site and then go, okay, well, our CAC could be $67 like but if even if it's 16 like can I go buy a new customers at 16 can I move that 30 to 35 or 40? Ultimately 40 would be the number I shoot for. I don't know. I don't know to do that yet though. I'm to drive around.\n00:27:24 - Tina Marie (profitdriversinc.com)\nI think also that you know the end of Q2 and end of Q4 would be a good time to take a post on market share. I mean once a year is probably okay but I think twice a year just kind of taking a post on it and see how we're going.\n00:27:46 - Dan’s iPhone (danddcompany.com)\nAnd the Q3 is the yeah end of Q3 is our best time to do it because summer season which I learned last year is so we're heading into peak season which was the other reason I did this. It's like, all right, we're returning to normal right at the beginning of our high season. So I'm like, I need to figure out what's going on so I can spend money and do whatever. Like, we got to go at it for the next three months because, and then it dips off and August sales will dip slightly in September, always get a bunch of cancels in December and people that we rebound in January and then we go into the season, very March, April, summer, May. So it's like, okay, we've got to figure this out right. Just like I also said, hey, we need to launch the new product now, ASAP. What are we doing? Like that, that kind of bugged me a little like, he's like, oh, I'm going to have the notes done in January. I'm like, no, you're not. When I June, they're still not done. I'm like, why didn't we use AI for the, the, um, the notes, the audio? like, why didn't we use AI for the audio again? And we could have like, Opted like my whole thing was like let's do it and then we can switch it out later, but let's get the products done But no Chad GBT 40 So to all these calculations work like a charm I was like, oh my god, this is great.\n00:29:21 - Tina Marie (profitdriversinc.com)\nI It's I'm just like so the day I was talking to Maria Chad GBT for okay now and that same day Some old clients who there are husband and wife marketing agency But when we were working together, worked together for two and a half years and then COVID hit it But what they mostly promoted was yoga studios. So COVID says about it and they're like we can't afford you anymore Well, they reached out and they're like we once or help, we can't afford you yet I'm like well, you know what? How about you work on this, you know little thing for me cuz I just need somebody else's brain energy to plug into momentarily because I've got all of this for the most part figured out I know what to do. I just want somebody just to be like take this part. Anyway, so the same day I talked to Maria Those two things happen. I was like, Hey, Hey, chat to you before oh, so Jeff. No, I get that they are something who's recording Oh, Yeah, okay, so but there's the ever written part done He's yeah, but he is freewheeling the audio That's that's his argument.\n00:30:38 - Dan’s iPhone (danddcompany.com)\nlike well. not doing a literal. I go well. What if it were? What what if it were just your voice? He's like he's doing an audible and changing things like on the fly and he thinks it makes it better and maybe it does But it doesn't matter now. He's literally almost done, but I'm like, okay I like why didn't we because it when I I put those pieces together, I texted Bob, like we just met with the Infusionsaw people and they sent it around all their tasks and the bottom of the list was getting new products ready. go, no, we need to flip that. We need to get that done now. We're crazy if we're not launching this right now because we're going to get maximum amount of data. It's our high season. So we're going to get the most sales, the most people, like this is the prime feedback loop. We need to get this ready now. And so we're doing that. I'm like, I almost don't care if the product's ready. I really don't care if doesn't affect this. The lower end product doesn't, like, well, actually does have audio. So, we'll see.\n00:31:46 - Tina Marie (profitdriversinc.com)\nWell, Sarah, hold on next week. Do you have what the new product new offer is going to be, like, the price and what? What did all entail them like bullet points? Could you put that out to me really quick?\n00:32:03 - Dan’s iPhone (danddcompany.com)\nYeah, we're launching a supplement product that's notes, audio, MCQ for 67 bucks a month. we're raising the price on the course, the number of supplement and course.\n00:32:16 - Tina Marie (profitdriversinc.com)\nYou're going too fast.\n00:32:18 - Dan’s iPhone (danddcompany.com)\nNo, it's.\n00:32:20 - Tina Marie (profitdriversinc.com)\nOf course, 97.\n00:32:24 - Dan’s iPhone (danddcompany.com)\nThe course will be.\n00:32:25 - Tina Marie (profitdriversinc.com)\nIt was. It was 67. Yeah. Okay. So now it, the course is went from 67 to 97, but in addition to the course, you can have the audio notes for 67 a month. So the course, but the course is a subscription of 97 and they can access the different parts according to whatever they want to write.\n00:32:53 - Dan’s iPhone (danddcompany.com)\nYeah, they're both subscriptions.\n00:32:56 - Tina Marie (profitdriversinc.com)\nOkay.\n00:32:58 - Dan’s iPhone (danddcompany.com)\nSuppling. Okay. No, so the supplement subscription. Get your access to those three products and then the course subscription gets you access to everything. Oh So if so you wouldn't get ninety seven and sixty seven it's ninety seven or sixty seven Correct because still Happened last week happened every week Do I buy the supplement or do I buy the course like what are you talking about like there's one product?\n00:33:26 - Tina Marie (profitdriversinc.com)\nSo there's this confusion persist and I'm it at the worst case scenario is Everyone buys just the supplement for sixty seven bucks and we that's why part of me is like we should make it 77 77 in 97 You should split test that because we know that Choices create friction period even if it's just two options Somebody might look at that go and I don't know which one And then in that hesitation they get a new notification Complete the order and they look at it and they're like, I still haven't decided. I'll come back later Do they even do it or the an advertiser problem?\n00:34:08 - Dan’s iPhone (danddcompany.com)\ncompetitor come in The problem now I believe based on I mean this was on reddit. It's like oh my god The problem now is they go to the checkout page and they think there's another product. There isn't I'm like, what are you talking about? There is no supplement But because our brand is associated with being a supplement They think there is one and it's like they don't know where it is. I'm like, there isn't one What how much more do we need to explain this? So I'm like, okay, so if we put it there then there is one So my argument is that we're gonna get more customers by resolving the confusion The only way to resolve the confusion is to give them the binary choice and go here it is and it's laid out so clear. Here you go. Um, and that was the reason to like, it has to be at least 67 bucks. It can't be lower. Jeff is like, let's make a point. said, I'm like, no, we cannot lower the price. We can only raise it. I'm like, we should make it 77 and 97 to close the gap between those two. And if people, if everyone just starts buying supplement based strictly on price, we lose at 67. We've done, we've gained nothing. But if we make that 77, then we're gonna, we will increase our, our revenue, that percentage, whatever that increases, 10% or whatever makes sense to me.\n00:35:40 - Tina Marie (profitdriversinc.com)\nAnd the price jump from 67 77, I doubt you'll lose hardly anything.\n00:35:46 - Dan’s iPhone (danddcompany.com)\nNo, you will not. And then the getting, having the gap between the two only be $20. $30 is 50%. 20 is not. 20 is like, Oh, for $20 more, I can get all of that. that there's not to. And then ultimately we're just tracking new customers because the new customer number doesn't matter. I don't care what they buy. Does that number stay the same or go up? Period. Doesn't matter which one they buy. It's a new customer. Done.\n00:36:20 - Tina Marie (profitdriversinc.com)\nAnd you have on-page chat support, right?\n00:36:25 - Dan’s iPhone (danddcompany.com)\nNow that was a cool done.\n00:36:29 - Tina Marie (profitdriversinc.com)\nEven that, they would ask that question back then.\n00:36:32 - Dan’s iPhone (danddcompany.com)\nAnd what we didn't have is all my questions.\n00:36:35 - Tina Marie (profitdriversinc.com)\nBut with an AI chat box, as good as GPT-40 is, I wonder if that test would be worth doing again.\n00:36:46 - Dan’s iPhone (danddcompany.com)\nEspecially with that question program. Well, with the one that we dealt for Mark, mean that thing works great. So I could look at that.\n00:36:56 - Tina Marie (profitdriversinc.com)\nEspecially because you're trying to increase market shares. just the technology, not okay, but there are two major things that have changed. The technology has changed, but the people have changed a lot. Because, like since COVID, post COVID, and with AI, all the end users are more open to it. Even grandparents are aware of AI and chat talk now. Like, the whole community has changed so drastically that it would be a completely new test, no matter what.\n00:37:32 - Dan’s iPhone (danddcompany.com)\nWell, we did it before. I mean, this is what I know from before. It literally did zero, zero, no improvement, right? it was costing us $2,400 a month. So I was like, why are we doing this? Why are we paying these people $2,400 a month? it cost nothing to run anything out of chat. So it's like, okay, if it doesn't, and we have much more stable numbers, Now where it's like, oh, yeah, we would know exactly and if we launched that prior to the new products Well, don't know. There's some weirdness happening none of us saw yesterday happening Bobby was like what the hell I'm like what he does look at the numbers. Holy What's going on? I did turn on some Facebook ads, but I don't think that's it. I Mean it was me.\n00:38:27 - Tina Marie (profitdriversinc.com)\nThanks everyone Oh Yeah, okay, so I have a lot of other questions as usual, but I can't ask because I have to go Well, I wanna I don't want to be wait. I'm like Okay, another call I need to go to the office Well, I'm gonna bug you more about another 71 on and off while we talk about all the other things just cuz You're in development mode and and it's fun and it's cool and I want to see you and I sent all that stuff to the I sent all the stuff to those brokers too that's some quite I gotta send this more stuff but I finally did that and they wrote back and they're hey can you send us this and what about oh I finally don't ask that question and then on a second okay so what do they call like founders uh oh yeah uh I always forget the second word now founders partners but it's found or something yeah oh you always can't say founder guys or something like that yeah or that's what I have it's founders for sure founders partners no all right um cool well then you enjoy your drive and your next call and have a great weekend and I will bug you on Monday.\n00:40:03 - Dan’s iPhone (danddcompany.com)\nAll right, cool.\n00:40:05 - Tina Marie (profitdriversinc.com)\nTake care, bye-bye.\n00:40:06 - Dan’s iPhone (danddcompany.com)\nAll right, ya.\n","contentPreview":"00:00:04 - Tina Marie (profitdriversinc.com)\nCan you hear me? Oh, wait, it says you're muted.\n00:00:13 - Dan’s iPhone (danddcompany.com)\nMight be a problem.\n00:00:15 - Tina Marie (profitdriversinc.com...","processedAt":"2025-05-04T03:40:52.613Z"}