{"fileName":"prologue.md","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/prologue.md","type":"written_content","priority":"medium","content":"**Version One**\n\nPrologue\n\n\"The tree that never had to fight  \nFor sun and sky and air and light,  \nBut stood out in the open plain  \nAnd always got its share of rain,  \nNever became a forest king  \nBut lived and died a scrubby thing.\"\n\nThis is not your typical business book. It’s not a step-by-step guide to hustling harder or grinding longer. It’s not about mimicking someone else’s success or sacrificing your soul for a paycheck. This is a book about transformation—of you, the entrepreneur, and the business you create. It’s about building something meaningful, sustainable, and aligned with your deepest values. It’s about becoming Good Timber.\n\nWe’ll explore the fundamentals of business and reveal the simplest, most leveraged ways to apply them for maximum impact. But more importantly, we’ll awaken the entrepreneur within you—the one who has struggled to stay focused, to believe in yourself, and to build what you’ve always known you were meant to create. This is not just about success; it’s about growth, resilience, and freedom.\n\nGood Timber  \nby Douglas Malloch\n\nThe tree that never had to fight  \nFor sun and sky and air and light,  \nBut stood out in the open plain  \nAnd always got its share of rain,  \nNever became a forest king  \nBut lived and died a scrubby thing.\n\nThe man who never had to toil  \nTo gain and farm his patch of soil,  \nWho never had to win his share  \nOf sun and sky and light and air,  \nNever became a manly man  \nBut lived and died as he began.\n\nGood timber does not grow with ease:  \nThe stronger wind, the stronger trees;  \nThe further sky, the greater length;  \nThe more the storm, the more the strength.  \nBy sun and cold, by rain and snow,  \nIn trees and men good timbers grow.\n\nWhere thickest lies the forest growth,  \nWe find the patriarchs of both.  \nAnd they hold counsel with the stars  \nWhose broken branches show the scars  \nOf many winds and much of strife.  \nThis is the common law of life.\n\nI first heard this poem during an LDS General Conference in a talk by Thomas S. Monson titled “True to the Faith.” At the time, I was pregnant with my third daughter, trapped in an abusive and toxic marriage. I had no real friends, no family nearby, and no roadmap for how to build a happy, healthy life. I was a convert to the church, trying to find my footing in a world that felt like quicksand. My home was a battleground of rage, and I was desperate for a way out.\n\nFive years later, I finally found the strength to leave—under threat of my life—with four daughters in tow. We moved to a home I’d never seen, with less than $600 to our name and a pending restraining order waiting to be served. It was the hardest decision I’d ever made, but it was also the beginning of my transformation. I was determined to grow into Good Timber.\n\nAs a single mother of four, I built a business from home amidst the chaos of parenting. I coached soccer, hosted family game nights, and somehow managed not to lose my mind (most of the time). There were moments when I stood on the precipice, staring into the abyss of overwhelm, but I never let it consume me. And then, one day, I unlocked the secret to building a six-figure business while working just 15–20 hours a week. I began teaching others—men and women—how to do the same, helping startup clients grow their businesses to seven and eight figures.\n\nBut this book isn’t about flaunting testimonials or overwhelming you with proof. It’s about something far more valuable: leverage and freedom. I’ve seen too many business coaches working 60–80 hours a week, sacrificing their health, their relationships, and their sanity for success. Many of them don’t have children, or their kids are grown, or they have partners to share the load. If you’re trying to follow their blueprint while juggling the demands of parenthood, a full-time job, or other responsibilities, you’re setting yourself up for frustration and failure.\n\nHere’s the truth: You don’t have to work harder. You don’t have to sacrifice your values or your well-being. You can build a thriving business on your own terms. I know this with the same certainty I know the sun will rise tomorrow. I’ve lived it. I’ve taught it. And I can help you do it too.\n\nBut I’ll be honest: It takes time. The changes happen subtly, almost imperceptibly, like losing two ounces of weight every day. Six months later, you look in the mirror and realize you’re 20 pounds lighter, two dress sizes smaller, and radiating confidence. It’s not magic—it’s the result of mindful, consistent effort. Small, leveraged actions compounded over time create extraordinary results.\n\nRemember when you used to believe in magic? When you thought anything was possible? Can you try to believe like that again, just for a little while? If you do—if you stick with this book, complete the exercises, and reach out to me or my team when you need help—you’ll find it’s worth every ounce of belief and effort.\n\nI promise.\n\n","contentPreview":"**Version One**\n\nPrologue\n\n\"The tree that never had to fight  \nFor sun and sky and air and light,  \nBut stood out in the open plain  \nAnd always got its share of rain,  \nNever became a forest king  \nB...","processedAt":"2025-05-04T03:40:52.648Z"}