{"fileName":"Transcript for Chona(3).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Chona(3).txt","type":"transcript","priority":"medium","content":"00:00:03 - Chona Sweet, DNP ( wspainclinic)\nOkay.\n00:00:07 - Tina Marie (profitdriversinc.com)\nOkay.\n00:00:10 - Chona Sweet, DNP ( wspainclinic)\nI just literally just finished. Just now.\n00:00:16 - Tina Marie (profitdriversinc.com)\nOh. Can you get some water?\n00:00:22 - Chona Sweet, DNP ( wspainclinic)\nNo, I just, it's just coughing. I have a bunch of medication here.\n00:00:31 - Tina Marie (profitdriversinc.com)\nAll right. Hold on. me fix my zoom.\n00:00:35 - Chona Sweet, DNP ( wspainclinic)\nI was like, I'm pretty sure it's too 30. I was like, look at my, like did I missed it?\n00:00:41 - Tina Marie (profitdriversinc.com)\nYeah. No, I just was on a call and I had to jump over.\n00:00:45 - Chona Sweet, DNP ( wspainclinic)\nIt was an early day for me.\n00:00:51 - Tina Marie (profitdriversinc.com)\nWhat time did you start?\n00:00:52 - Chona Sweet, DNP ( wspainclinic)\nUm, I, I start, I was there at six, 15. I was early today, 6-15, and because I have an 8 o'clock to 12, it's like new in the hospital like new doctors and these orientations, even though I'm not an employee, I have to attend. So I rounded first, and then so I can go home and finish my telemedicine. So I'm calling them while I'm driving, and it worked out, so that's good. I finish all the time.\n00:01:40 - Tina Marie (profitdriversinc.com)\nSo how long have you been, have you kept up on it? It's been at least a week, right?\n00:01:46 - Chona Sweet, DNP ( wspainclinic)\nYeah, I think I'm kind of, because the hospital is at 21, so right now I have, I think I have I just want to tell you. exactly the number of patients I have. I have about 24, 26 telemedicine. So I kind of gauge between charting and calling it. It's the same. It's pretty much the same. The hospital calls it's about two to three hours for 20 patients with phone calls. mean with conversation and charting. So it's about that I can like, you know, because I'm like trying to gauge how fast, how, you know, the how fast I'm like, I know I'm getting faster. So that's kind of like how I look at it. But I pre chart meaning like the hospital is easy because it's follow-ups. So I kind of pre-chart, kind of populate the chart and I just have like two, three liners I have to update and obviously the orders I have to update if need be but majority are quick follow-ups so I it kind of even out new patients are always takes a longer time but it kind of evens down so because I was quick I was I started at 6 15 then I finished by 7 it's actually just an hour and then I finished my charting like 750 so it's like about yeah it's about two hours on 20 patients so which is a good yeah yeah so I but I don't know if I heard the answer when I was asking was how many days consecutively since class is it like over to we\n00:04:01 - Tina Marie (profitdriversinc.com)\nIt's thinking around two weeks.\n00:04:03 - Chona Sweet, DNP ( wspainclinic)\nYeah Yeah, I just you know like yesterday. I was actually kind of I'm feeling tired because dr. E. have a like I texted you I have a I'm training someone So, you know, I'm trying my best to make sure that that person is Learning something but so I'm just letting her do on her own and at the same time The teaching is just takes a little bit more time But I'm conscious is that the one that I'm seeing I chart I finish the charting So the one that she saw she just saw three people which takes her, you know, she's new so it takes her for three people about an hour or so So I finish that When I got home because I wanted to just see, you know, what she's writing because she's writing on mine And so I need to give her feedback and stuff, so, and Dr. E was like, he had to run to the OR so he had me cease some of these patients, so, but I feel tired and he's like, you don't need to go to the hospital, you can just call. said, well, my patients will miss me. It's like this is the owner show the patient see me every day and I'm seeing them during the hospital. I just want to make sure that, you know, they can there's like face to face. I could have said no, but, but I guess what I'm trying to say is I could have just gone home. It just doesn't feel right.\n00:05:45 - Tina Marie (profitdriversinc.com)\nSo, after the fact, do you feel like you should have gone home or do you feel like you did the thing that you wanted to do?\n00:05:51 - Chona Sweet, DNP ( wspainclinic)\nI think, I think I was a, it's, you know, it's the routine that I did. Again, I was a little bit hungover with this man. occasion right here Which I didn't take that much last night.\n00:06:04 - Tina Marie (profitdriversinc.com)\nThat's why cuz I said I have to wake up early I said codeine.\n00:06:08 - Chona Sweet, DNP ( wspainclinic)\nYeah, I need to I need to wake up early. So I I woke up I left around five. It's like 20 minutes. It's like five forty five So again, if I really really want to I will be able to do it, but it feels good on just finishing The tasks last night and I wanted to finish the charting in the hospital But I'm feeling the tiredness. I thought I would rather drive drive 30 minutes and then chart at home So I finished So It's kind of like adjusting. I'm so adjusting. I'm trying not to be so hard on myself Like I need to like finish to like but at the same time just the time management and yeah but i think it's overall good because after you i have facial but i'm trying to you know the carousel yeah so i'm talking about facial and then tomorrow i need to start early again because my mom's have a appointment i need to help her and what else i'm doing i have eyelash appointment tomorrow so i guess what i'm trying to do is like if i really start early like what i'm doing right today i have a lot of time in the afternoon good i i think that that's great um there will be times when you end up sleeping in late or get a little bit um you know off-track but as long as you remember what things that you do give you the most energy and give you ultimately the most freedom so it doesn't feel like\n00:08:00 - Tina Marie (profitdriversinc.com)\nlot of freedom when you get up early in the morning and you're doing that work. But when you have the whole rest of the day free without stress, without anything like on top of your shoulders going like I've got to do this, that's pretty liberating. And to also know that you showed up really well for your patients, you showed up really well for Dr. E for the clinic for the hospital to know that didn't just show up, but you completed the task and well. you took great care of the patients and you made the rest of the work that has to be done. Those charts are important for everybody else's take care of them.\n00:08:37 - Chona Sweet, DNP ( wspainclinic)\nlike that's got to feel so good that you not just did the job, but you how do I say this? Like I judge myself harshly at times like it's very hard for me to really say oh good job. So I even though I feel like oh, I did a good job. I will kind of rate myself mid like I'm not It's very hard for me to come like myself although, you know again, you know The validation from patients it's good the validation from other providers like I will read their charts like pain With good pain control, you know, that's what they were and appreciate, you know pain management So, you know things like that. It validates, but I Need to have it more from myself. I think that's the That's the key and I was telling mark. Yes, and he's traveling I was telling him that I need to really have This bread and butter under control. So I have more energy to do things because I feel like month I think Monday Tuesday on the clinic. That's all I have Wednesday Thursday Friday I don't have any because initially we talked we talked about removing the true state clinic to give more time, but also actually having that clinic patients is where I get patients as well for the KIKI. So like for example, I see a patient of ours that got into an accident, and then actually I can refer the attorneys I'm working with. Or Dr. E doesn't, he's okay with whatever I do with this patient. So that's actually good thing. I don't know if I told you this, but I got two patients referred out because of the clinic patients I saw, the regular patients. So because they're from insurance, for example, they're up them, we don't necessarily gain a lot because it's confusing for the patients to receive treatment through lean. T.I. versus the insurance. So even though I don't make good money from it, but it's kind of solidifying the relationship with the other lawyers. So that's what I'm trying to get out of them.\n00:11:15 - Tina Marie (profitdriversinc.com)\nSo I heard something really, really interesting today and that is the tactic of the number one sales person, car salesman in the world. And the thing was that he didn't work so normally going to car sales live and sales person asked themselves, what can I do to make sure that they walk away with a car today? His goal was, what do I do to make sure that when they're looking for a car, they come to me and they think of me and they think, okay, I know I'm going to buy a car so you establishing these relationships with the with the attorneys, but also with your patients. To me, that kind of seems similar to that strategy is, you know, you just got great relationships with them. So when the time comes that they need something that you offer, PI help, then you're the one that they want to go to, does that make sense?\n00:12:17 - Chona Sweet, DNP ( wspainclinic)\nRight. And I have to get over like, feeling shy, like, oh, I'm taking up their time. I'm getting over that hump because it's, I'm not a, you know, the kind of person, it's just not who I am. I'm not two sales person, but I can definitely develop that. Like I message Tyler, the, the case manager who I'm waiting for the approval for a procedure. And that was last week before the Thanksgiving or two weeks ago. And then I greeted her with half a Thanksgiving and then she responded back Monday, but I didn't mention about the procedure because I tell Mark, I know she's just coming back to vacationing. I'm trying to not be too pushy. That was Monday. And she didn't respond in. It's about, it's about holiday. She said, thank you. Hope your family have a happy holiday. And then I said, yours, yours as well. And then I said, I eat a lot. And then that's it. She didn't respond. And then I didn't ask about the case. So that's two days now. So now I messaged her. I said, let me know when I can call to just get an update. That's it. Because we're leaving next week. And I wanted to make sure that that patient is taken care of. I know that it's holidays, everyone is kind of getting, you know, busy. There's also one thing that I wanted to share with and it's the same number. right?\n00:14:00 - Tina Marie (profitdriversinc.com)\nYeah, same phone number.\n00:14:02 - Chona Sweet, DNP ( wspainclinic)\nTina, um, like I can't find you.\n00:14:05 - Tina Marie (profitdriversinc.com)\nI don't know. Let me see.\n00:14:11 - Chona Sweet, DNP ( wspainclinic)\nI just wanted to share you what, well, I was on the orientation. My mind is, is about, you know, making, doing it for my business. I was paying attention. Okay. Okay, it's a non-request accept. Okay. I wanted to share with you that this is what Mark shared with me. How do I? And then while I was doing the, um, while I was on the orientation, I did this and I wanted to share with you, um, sorry. Okay. He sent me this one. think he was in, um, I forgot which event he was on. So I guess this is the pain management or the pedic. I don't know where he found this if this isn't a card or in a paper, but it's like an ad. It's like an ad, right? So I was looking at that, I this is actually very good. So I try to kind of copy it for us, what, how I can do it. And this is just my handwriting. This is like rough jobs because I was not bored, but I was like, my mind is in this. Well, on the orientation, I'm trying to see my handwriting.\n00:15:35 - Tina Marie (profitdriversinc.com)\nSo it's not worse than mine, I promise.\n00:15:39 - Chona Sweet, DNP ( wspainclinic)\nSo I'm trying to kind of get inspiration from that. I don't know how I can do this, but I have a lot of ideas. I'm going to start reaching out and have to do the lunch and learn.\n00:17:00 - Tina Marie (profitdriversinc.com)\nIt's first of all, to grab attention, second of all, to keep attention and then to be memorable. So, those things make an impact on how effective any kind of marketing campaign is, like even this, right? but all of these things, one of my favorite words is compounding. And every experience that you have, everything that you do, has a compounding effect on your confidence, has a compounding effect on your network, like the relationships that you have, they grow, they expand. You know, like, I'm sure you've seen the visual of what it's like when we make a new neural connection, which I love that. Every time we learn something new, like, we've got these little synapses and these dendrites reaching out to another one and like, linking up. I'm like, that's what happens when we, when you take care of a patient, or maybe the patient's there and their husband's there. And, you know, like we're making this network and it's powerful, but it doesn't really degrade if we continue to nurture it and maintain it. And then the more that you get comfortable in performing these things and the more people that you talk to about PI specifically. So you've been doing pain management for a long time, but PI and there's a lot of nuance to that and there's a lot of things that you had to learn. So first wrapping your head around learning it and then your ability to communicate it and teach people, this is what happens, this is what you're going to experience, this is what you need to do. And then, you know, there's the conversation that you have with the attorneys, there's a conversation about Dr. E, there's a conversation that you have with your patients. So every type of thing that you're doing, you'll get better at it. And when you realize, because you are very smart, Chona, I don't play Kate, I don't, I don't paint her eyes. I wouldn't tell you something, be like, she's my client.\n00:19:12 - Chona Sweet, DNP ( wspainclinic)\nI'm gonna make her feel good. it wouldn't be useful to you.\n00:19:16 - Tina Marie (profitdriversinc.com)\nBut you, you are very smart. And you, to me, you have an innovator's mind. If you see that something should be improved and could be improved, you're looking for a way to do that, and then you're doing it. And so what that also tells me is that you're above average anywhere that you show up. So you're going to be above average, even among attorneys, among doctors, among nurse practitioners, because most brains don't work like that. Most brains are not so problem-solving and action-oriented. You know that, you probably don't give yourself the credit for it. But if you ask yourself, do most people operate that way? What would you say? Yes, right? Most people are box tickers like, what do I need to get done by? And you're like, wait, wait, wait, this could be better. Let's just make it better. So you have a lot of value to bring anywhere you go in life. Okay. Because of that, being able to be comfortable talking about these things and talking about it with people would be good for you, but it's also a good service to them. Because of the way that your brain works. So it makes you a good leader because you're a doer, but also because you comprehend it, and then you comprehend the way to improve it. So keep those things in mind. And if you're going to keep doubting yourself, don't worry because I'm just going to keep telling you how awesome you are.\n00:20:51 - Chona Sweet, DNP ( wspainclinic)\nYeah, I think it's really interesting how I'm still like this, even though, like you said, I... did. I held leadership positions. I, you know, I don't know why I'm still like this. It's like, um, like, um, what's that syndrome? Yeah, imposter syndrome.\n00:21:17 - Tina Marie (profitdriversinc.com)\nOh, yeah.\n00:21:17 - Chona Sweet, DNP ( wspainclinic)\nI, I, you know, I've talked like with doing my doctors and I talked whatever on seminars, like, I still don't comfortable, but, but when I become comfortable and it comes the way time, like you said, like the more compounding, the more I do it, the more I get comfortable. I'm sure I will, I will get there. It's just out of time.\n00:21:43 - Tina Marie (profitdriversinc.com)\nWell, I think that God also gives us humility. And sometimes we think of that as imposter syndrome, but maybe it's just a little bit of humility, knowing, um, staying teachable and remembering that there's already somebody better and smarter than us, but that doesn't negate our about you. And that's the thing to keep in mind. If you're smarter than average, if you have something to contribute that the average person doesn't know, it doesn't matter if you're not the best or the most polished or the best grammatically or in written word or anything like that. The question is, do you have something of value to contribute? So, rather than try to quantify or qualify what that value is or compare to other people who you might think is more polished or whatever, just ask yourself, do I have value to bring? And focus on the fact that's why I like celebrating wins, what the feedback have been from you from not just your patients, but also from Docs or E that you've helped them so much. I think maybe even from Cheryl feeling like a little bit lighter since you're around and pay attention to that and Unless something holds true, like unless somebody tells you something and you look at that and go, yeah, I need to work on that, then let any other negative voices go because they rob you of energy and we need energy to accomplish every single thing that we have to do. So if something is a thief of your energy, it's a parasite and you need to treat it like that. We inoculate ourselves against parasites. We treat ourselves against parasites, right? We don't just let them live and ignore them because we know what happened and what they take from us if we let them stay, right? So you need to think about those negative thoughts in that way that they are parasites that will rob you of vitality, vital energy, vital confidence, you know, and that keeps you from actually doing the thing that you're doing well.\n00:23:59 - Chona Sweet, DNP ( wspainclinic)\nRight now. I think my schedule is pretty. I had a good grasp on my schedule and I really need a routine and keep on going. Mondays and Tuesdays are the busiest because I have clinic, telemedicine, and then hospital.\n00:24:16 - Tina Marie (profitdriversinc.com)\nYeah.\n00:24:17 - Chona Sweet, DNP ( wspainclinic)\nWednesday, Thursday, I just have hospitals and telemedicine. So those three days I can do a lot on meeting people or that's something I need to work on is the Washington thing. Once I've started, those three days would be the ones. Monday, Thursday, Friday, would be the one that I can incorporate the telemedicine in Washington. I think we were talking on the phone the other day and he's like, I think he kind of and he said, I thought that the the referrals to you would be more so you know you know obviously Mark is very positive finger like he he may have over tell this to me so um but he did tell me that you I can just open a door you just have to follow up with them you know like for example that's the thing I want to say about where we're at right now is that you're just on the precipice so again we're only 90 days in we're 90 days in yeah big big big deal right there okay the first 90 days is just head wrapping it really is all it is you already got into flow which would be normally the next 90 days you hit that before we even got to the 90 day mark so flow is you've got a good rhythm and a schedule and you understand things and now now\n00:26:00 - Tina Marie (profitdriversinc.com)\nhow you're making the space for actually being able to receive new stuff. you're not only on schedule, you're kind of ahead of schedule. So, and this is something I constantly have to remind Mark of is like, slow down, everything's actually on track. Don't stress, don't get negative, don't, don't anything. Like it's all the way it's supposed to be. So for sure, he would have mentally held back until you had a flow that he could observe, not just for the sake of the reputation of the business, but also just not to cross you with pressure and overwhelm, but the reputation of the business, 100% matters. So if you weren't ready for it, it would have been sabotaging and poor business to try to get things going quickly. So your preparation and you're getting in flow coincided with you being very sick and the holidays.\n00:26:55 - Chona Sweet, DNP ( wspainclinic)\nRight.\n00:26:56 - Tina Marie (profitdriversinc.com)\nSo you have to take that into account.\n00:27:00 - Chona Sweet, DNP ( wspainclinic)\nIt it feel and I'm on antibiotics again, but I do feel I feel that I'm there's something brewing in there my x-rays negative, but like I think after the COVID after the first COVID I had in 2020 where I don't know if I told this where I who I got it from pass away, which is the mom of my best friend.\n00:27:23 - Tina Marie (profitdriversinc.com)\nTell me that part.\n00:27:24 - Chona Sweet, DNP ( wspainclinic)\nThat is before the vaccine.\n00:27:27 - Tina Marie (profitdriversinc.com)\nSo I got it. I got the first one.\n00:27:30 - Chona Sweet, DNP ( wspainclinic)\nAfter that, I've been I get sick very easy.\n00:27:35 - Tina Marie (profitdriversinc.com)\nme too. It wrecked me and if you want to, if you want to. So there's a company called Silver Fern Brand and I love them. I've learned so much from them, but what I ended up doing was basically first of all parasites, lots of parasites and I learned how to recognize what they look like. Yay for stool. Anyway, you're video. Um, but I recognize the symptoms and I, um, the impact also my hormones tanked at the same time, you know, I was paring on a puzzle and my first child moved out all of that coalesced at the same time as COVID. So that was rough. But, um, the hormone therapy has been a lot, but it didn't really work well until I fixed my gut health and I didn't know about the gut brain connection. So anyway, but they, it was, um, basically silver and immunoglobulins have done the biggest thing with a very specific type of probiotic that has high survivability and high diversity, so that I've got more diversity in my microbiome. And there is a guy on Instagram called Kieran Biome that I love to listen to. So he's a, don't know what kind of scientist I can't think of what is it called?\n00:28:52 - Chona Sweet, DNP ( wspainclinic)\nHe H.\n00:28:56 - Tina Marie (profitdriversinc.com)\nI'm cheering. Kieran Biome, K-I-R-A and BIOME.\n00:29:04 - Chona Sweet, DNP ( wspainclinic)\nOkay, so follow him.\n00:29:08 - Tina Marie (profitdriversinc.com)\nAnd then like a biologist. Yes, but he's so good at explaining.\n00:29:14 - Chona Sweet, DNP ( wspainclinic)\nBecause you know, some people take forever to get to the point so that you know, he's so good at getting there so fast.\n00:29:21 - Tina Marie (profitdriversinc.com)\nAnd then Silver Fern Brand and makes some amazing products. But the guy, I mean, they're also very good at teaching things very quickly about why certain things happen. Silver Fern. F-E-R-N.\n00:29:40 - Chona Sweet, DNP ( wspainclinic)\nFriend.-E-R-N. I'll say the other thing, I found it now.\n00:29:43 - Tina Marie (profitdriversinc.com)\nYeah, yeah.\n00:29:44 - Chona Sweet, DNP ( wspainclinic)\nOkay.\n00:29:46 - Tina Marie (profitdriversinc.com)\nthey're also very great at education and they make excellent products. it took several months. of course, when you're trying to change your digestive system that much,\n00:30:00 - Chona Sweet, DNP ( wspainclinic)\nIt's uncomfortable.\n00:30:01 - Tina Marie (profitdriversinc.com)\nIt's sad. Yeah, it's very, very unpleasant, but it was worth it. But I'm also, I take a scientific approach to everything. I isolate my variables. literally eat the same food all the time. I introduce one new thing because I really want to feel great, energized all the time.\n00:30:20 - Chona Sweet, DNP ( wspainclinic)\nwant to age well, and my genetics are not conducive to that.\n00:30:26 - Tina Marie (profitdriversinc.com)\nSo, but after COVID, I have like a lump of my throat for a year and a half. I was in constant pain. I couldn't eat hardly anything. I'm like a diet. There were very few things that I could eat without just being in total pain. I don't have to tell. So, I didn't really have any other options. It was that or just like, I don't know, I, it was terrible. Like I don't, it was terrible. And the brain fog, I wasn't able to think well, the depression on top.\n00:31:00 - Chona Sweet, DNP ( wspainclinic)\nthat and now I can eat almost anything.\n00:31:03 - Tina Marie (profitdriversinc.com)\nI am allergic to dairy but I can still eat it and I just have mild inflammation. Now if I eat it and eat it and eat it and eat it, then I have, know, a lot of inflammation because it is a real, you know, allergic response. I wasn't able to eat garlic. I wasn't able to eat onions. I wasn't able to eat anything. Like I would just eat it. Everything was so bland. It was so terrible. I couldn't even, I couldn't even eat fruits and vegetables, Shona.\n00:31:33 - Chona Sweet, DNP ( wspainclinic)\nOh, that was bad. Yeah.\n00:31:35 - Tina Marie (profitdriversinc.com)\nOh, but it didn't happen until after first round of COVID, which I got in the winter of 2019 to 2020 because it was actually already in Oregon at the time, but we didn't know what it was yet. But I was sick. Almost died. Like it was, it was terrible. That was, yeah. So, so I get it.\n00:31:55 - Chona Sweet, DNP ( wspainclinic)\nAnyway, I feel like after that, I got, it's what we call in medic, it's like COVID long. is what we get the term that they now use and I feel like I got that it's like it's like when you get TD that you get scaring in your lung and that's I think that's what the COVID does to me because I get I told you about the florona early this year oh yeah oh yeah and then I went to the urgent care this weekend finally this mark has been like you know drilling me on it he's like you're not gonna ruin Japan or anything. I was just like worried about me and I said it's fine cuff lingers for eight weeks even after any viral or whatever but anyway so I'm just taking the meds and but even with that I am conscientious that okay I need to make sure that I finish all my charts on the same day please I can addendum it for example like something happened that I need to change I can just add done later. But I just make it a habit. really is a habit. Because last night is one of those days, like I feel tired, but I was able to get passed through them.\n00:33:14 - Tina Marie (profitdriversinc.com)\nYeah, so that feels good. Yes, that's it. So worst case scenario, let's say you don't finish a charting at the hospital or at the clinic. But if you make the rule, I will not go to bed until I finished my charting.\n00:33:27 - Chona Sweet, DNP ( wspainclinic)\nThen you never wake up with any kind of dread and you never allow the negative compounding to happen to you again.\n00:33:33 - Tina Marie (profitdriversinc.com)\nBecause that's when you start to feel the pressure really build and really mount.\n00:33:38 - Chona Sweet, DNP ( wspainclinic)\nYeah, that's the time I feel like I still do feel that I work more. But and maybe I kind of correlated to how much I was getting paid early. So it's hard to it's hard to correlate that. But I definitely have this is probably the first work. that I have that I have a lot of other than the autonomy, it's the flexibility with the staff. Because I mean, I don't have to go in a hospital, I can go whatever time I want, I can go tonight, if for example, or I can go very early. As long as I see the patients, I did it. They can they actually still call me throughout the day. Hey, know, this page, the paging system, Dr. E wants it to go to him, whatever, that's fine. But some of the nurses and doctors have my number, so they text me directly and they hit patient pains still like this. And I make changes throughout the day. And this is kind of like putting out fires throughout the day, not just in the hospital, but in the clinic. So it's, you know, or telemedicine, it's just what it is that I'm so used to it. I think the manager, I need to work on not responding to email. But it's so hard for me not to respond. the email because the Gmail it's connected to my phone. So like yesterday the manager messaged me a lot of patience.\n00:35:09 - Tina Marie (profitdriversinc.com)\nYou can just set up an auto reply that just you know if something is urgent.\n00:35:13 - Chona Sweet, DNP ( wspainclinic)\nThis is what you need to do text me. But it's more of me. I wanted to respond. I wanted to it's kind of like charting my brain is like I need I want to respond to solve this problem right away. This is that and I told her she probably is thinking with my response. It's like midnight.\n00:35:33 - Tina Marie (profitdriversinc.com)\nSo just create some rules for yourself and stick to them because that's the same way that you you did the charting. But first you have to decide that this is what it's going to be and then you have to buy in and commit to it. But as long as you leave the question mark open you're not going to make a consistent behavioral choice because you haven't decided I will always behave this way. If you leave it as a possibility. of these and you're going to keep defaulting to I probably should do it rather than I will do it between these hours and these hours and not else or I will do it via text and text only like whatever the rules are make them then keep them because it creates the most peace for you and it um imagine okay so imagine you have like a hundred million gallons of water if you just that's just spread on the earth it's just basically mist and paper if you had a hundred million gallons of water in a channel this big can you imagine the force of it so it's the same volume but when you channel things you change the force and you change the power so if you now think of that as energy instead right if your energy is spread out all hours of the day and allowed to go this way that way not where wherever you're get called from Gmail from text All hours a day. Your energy is not concentrated.-hmm. That means the force of your energy is diminished You're not going to be resting well. You're not going to be energized. You're not going to be rejuvenated And so your efficacy your potency is going to be diminished.\n00:37:17 - Chona Sweet, DNP ( wspainclinic)\nDoes that make sense?-hmm. Yes, so Was I I think that dr. E or mark, but I think mark is better in Managing that then dr. is just all over the place and I I kind of feel bad, but that's what he wants So Well in the end off like do they you know for some people it's almost like a defense mechanism like it keeps them from thinking about other things or feeling other things and And there's a lot of that especially in men. don't want to feel things and\n00:38:00 - Tina Marie (profitdriversinc.com)\nand we're just kind of forced to feel things so we can do it. And sometimes people simply don't consider potency. I consider potency. want to be powerful as I could be and that requires that I maintain everything in a particular way and organize it with intent. And some people consider that that dispersant as being potent because they're covering more mass right rather than having a larger impact on a smaller sphere. I'd rather have a larger impact on a smaller sphere and not everybody does. So that's why I'm asking you like you have to decide what you want and then you need to be okay with whatever you decide. So if you decide you want to be available at all times and just answer whatever comes in then decide that but then don't say I'm doing it wrong or I probably shouldn't do it because then you create this conflict in yourself and that's not good for you.\n00:39:00 - Chona Sweet, DNP ( wspainclinic)\nI, I agree. Also, I was, there's a couple of things that I, it comes to mind while we were talking. So, this might be, it's like all over. First, my question is, do you think, how do I ask this question? When I went to that lunch and learn with Dr. E and another doctor with the law firm. I dressed up, I put the white coat, but I'm in, I'm in a long dress. And I bought, I have two cars, Mark got me like two cars. I have a Prius that I love that I so easy and I'm in the carpool lane. So, I love that for my everyday dress. But I got that I have a pink Porsche.\n00:39:46 - Tina Marie (profitdriversinc.com)\nI have seen a picture of the pink Porsche.\n00:39:48 - Chona Sweet, DNP ( wspainclinic)\nI love it. So, and, and I don't know in your opinion, are things, the pink Porsche is too much, the Prius is also underwhelming. So, he thinks, but He drives up his daily BMW. So he thinks that's like the perfect balance in between. But I mean, I don't use that. So does it matter? Like, I don't want the law firm to think that I don't know. guess, appearance, like, that's my question.\n00:40:18 - Tina Marie (profitdriversinc.com)\nYour energy will override everything. OK, so this is what you need to understand. So people are always going to inform opinions about you.\n00:40:28 - Chona Sweet, DNP ( wspainclinic)\nRight.\n00:40:28 - Tina Marie (profitdriversinc.com)\nAnd you can't satisfy any of them. There were those who will say, that Porsche is perfect for Tona. I love that. She's a whole package, right? truer that you are to yourself, the better. And that is a potency to you. So you will probably repel more people, the more authentic you are. But the people that you attract will be more powerfully attracted to you, more truly attracted to you. And they will end up being your most potent allies. So to me, potency, authenticity.\n00:42:00 - Chona Sweet, DNP ( wspainclinic)\nI love bags in general. So I remember I have a patient, a PI, a lean patient in Dr. E's office because he and then he saw my bag and then he's like, I'm in a different field. He made that comment. So again, like you said, casting a whiter, like, but this is who I am. But I love his and also that my portion.\n00:42:26 - Tina Marie (profitdriversinc.com)\nIt's like, it's a tiny bit of who you are. You're also person that is like, I want you to not be in pain.\n00:42:33 - Chona Sweet, DNP ( wspainclinic)\nI want you and whether it's Dr.\n00:42:36 - Tina Marie (profitdriversinc.com)\nE or Cheryl or your patients, like, I want to come here and make your life better.\n00:42:40 - Chona Sweet, DNP ( wspainclinic)\nI want to show up and do a great job. Like, Tony, you're all of these things.\n00:42:45 - Tina Marie (profitdriversinc.com)\nAnd you are the pink force of a person. You're not the everyday person. You're shiny. You're beautiful. You're smart. inside out. so it's just a representation of your uniqueness and you're embracing a beautiful things, but those beautiful things are also like look at your love for your family and your loyalty to your family.\n00:43:08 - Chona Sweet, DNP ( wspainclinic)\nThat's a beautiful thing.\n00:43:10 - Tina Marie (profitdriversinc.com)\nBut it's also kind of right like that's not how everybody feels about their family. So it's actually a good symbol how you present yourself, your humility like you don't to me don't come across as arrogant and judgmental. You probably have to like that.\n00:43:31 - Chona Sweet, DNP ( wspainclinic)\nYeah, I don't like those.\n00:43:32 - Tina Marie (profitdriversinc.com)\nYes. So you have to trust that that's actually way more powerful. There's the saying that and I don't remember but I think it was my Angelo who said people won't remember what you said but they'll remember how you made them feel. Right. So you really just trust your energy, trust the way that you show up energetically and that that will override everything else. And then when they do that and they see the pink horse, they'll be like, yeah, that makes sense, because you know, she's done. Yes, it's fine.\n00:44:09 - Chona Sweet, DNP ( wspainclinic)\nBut, um, yeah, that was, that was the first, I forgot my second question too, but that was, that was the first question is about appearance. I don't want to turn off people that, you know, I don't want to, again, I can't please everyone, but at the end of the day, it's just what I can offer. And, you know, some will work, some won't.\n00:44:30 - Tina Marie (profitdriversinc.com)\nSo you don't want to please everyone, but even more, you want to identify everyone. You want to know who you're doing business with. Are they people that can accept you? Are they people that you can show up as yourself? Are they people that you can trust? Are they people who can look beyond what you drive, whether it's flashy or Prius or whatever? So go ahead and give them the test by just showing up exactly as who you are and see what\n00:45:00 - Chona Sweet, DNP ( wspainclinic)\nThey can handle what they tell you about themselves. Right. Right. That's real good. think I remember Mark kind of going through that face too.\n00:45:09 - Tina Marie (profitdriversinc.com)\nYeah.\n00:45:09 - Chona Sweet, DNP ( wspainclinic)\nBecause, you know, especially when you're thinking, yeah, I think in his field, like, the lawyers, just, it's different, but that is, that is a very, yeah, kind of like cutthroat competitive, but also stowie, like, very showy, so happening, it doesn't, it doesn't end up, if you get this from Mark, but he doesn't feel good after he, he, he came from a, like a lawyer's conflict. It doesn't make him feel good. It, it kind of like put him down a little bit and he, because he compares himself to the other lawyers that he, we have that conversation from time to time.\n00:45:58 - Tina Marie (profitdriversinc.com)\nI, I don't really think about it. It's good to pay attention though to when he goes to conferences, but he does sometimes compare himself. I'm like, Mark, do any of them take care of their clients the way that you do? Do they care about them?\n00:46:12 - Chona Sweet, DNP ( wspainclinic)\nDo they work in integrity?\n00:46:14 - Tina Marie (profitdriversinc.com)\nDo they like, so are you, you're not playing the same game? Do you understand that you're not playing the same game? So we do have this conversation. I'm like, so if you're going to judge yourself for something like not being the best basketball player when you're over here playing chess instead, like that doesn't make any sense. Like what? What doesn't matter if they're the best at their game. Your game is respect and integrity and honor and it isn't the bottom line. know, you want to make all the money. I said, but you can do it playing your own game in your way and it's going to look different.\n00:46:49 - Chona Sweet, DNP ( wspainclinic)\nSo you've got to stop comparing with that conversation. Yeah. Oh my God. He's all he is the old AI. don't know if he talked to him already. like he's definitely telling me that you wanted this but that's why he was telling me and I was like you will be changed you know he's like telling me that oh the healthcare will change up like okay so you're telling me that someone will you know be able to have a license to prescribe all these medications like and he said yeah they will be smarter it's like okay did you guys look into the ethical but part of this thing because we're talking about human lives and it's not all perfect and AI can't take a Hippocratic oath like he's like yeah he's all he's definitely but and but he's he's so excited he's he's going home tonight hopefully I don't know what to do he's been really quiet I was like I almost checked on him this morning but I got an email reply to one of our business threads and I was like okay He's okay, but he came, he's in, um, I don't know anymore. I am. I know he went to Missouri today to meet the doctors. So it's a business, um, thing, because he finished a conference. So he went and meet doctors. And now he's on his way back here. So, but, um, yeah. But yeah, no, I, and there's a, um, Christian. I don't know if you, um, he mentioned that name, but he's the PT chiropractor he works with. And that's also another venue for me to get referrals. They wanted to have a dinner, but, you know, with the holiday and, and in busy. So it looks like it's gonna just happen next year. Um, so, and I don't want to, obviously I need Mark. I've met them, but I just feel like I know Mark would want to be there because he, he's, him and his wife are going to be there.\n00:48:59 - Tina Marie (profitdriversinc.com)\nSo, So, because we're getting close on time, want to make sure that we've got a plan for what we're doing. First of all, just keep doing what you're doing, that's amazing. So and keep the pacing in mind, okay, that if it goes super fast, it's not sustainable. So that's really, really important to notice. Now that you have Mondays and Tuesdays and clinic days, you're staying on top of charting and the rest of the week, you know that there's some time. Think about what day or days of the week and what maybe if there's a particular time block that you might want to set aside for making specific types of contacts. So and you could probably do this on a week by week basis. So maybe on a Saturday or Sunday, plan out your week, okay, on Thursday around two o'clock, I'm going to be reaching out to Washington people. These are the list of people I'm going to be contacting or maybe Wednesday, one o'clock, I'm going to be. a working on that document, right? The one that you showed me with like the ad that marks sent to you and like getting a version of that and typing it all up. if you type it up, then I can help you look at, you know. I don't know if that I need to do that in like a card calling card form or in a Google Doc at first and let's brainstorm it together, but if you read it out. So you're having running a little bit rough, but for me, it's mostly because there's going to be words I don't see every day.\n00:50:28 - Chona Sweet, DNP ( wspainclinic)\nSo I'm not positive that they are.\n00:50:31 - Tina Marie (profitdriversinc.com)\nYes, OK, so if you do that, then we can work on it. So what you're going to want to do, first of all, every week you're working on continuing to optimize what you already do, what's existing on your plate, right? Just keep showing up, doing it well, not getting behind, but also just know if there's anything you can do to improve it. It's going to be, you know, micro improvement over time, not big huge whiz bang, like, whoo, that was amazing. Just studying improvement. And then. The other thing is, okay, now what do you introduce each week? What do you do to create the growth and to create some traction and momentum and that begins to build? So one of the things would be to take note of what are the different types of activities you can do.\n00:51:16 - Chona Sweet, DNP ( wspainclinic)\nSo like, are there specific types of people, specific types of events, dinners with, you know, contacts you already have, following up with old contacts, trying to obtain new contacts, like what are the specific types of activities you can engage in and what a point The one that you will, but Mark said that there's actually an advantage to me that he cannot do is for female contacts, I don't know if it's appropriate, I don't know, you tell me, like you guys can set up like spa type of thing, like, you know, for female, for in the, you know, it's an expense obviously for me that it's something that I can do. I know those places. I love and obviously like I like my tea area so I know where to go. So that's, I don't know what do you think about it too?\n00:52:12 - Tina Marie (profitdriversinc.com)\nI think you have to take it case by case and I probably wouldn't start a brand new relationship that way unless you somehow knew that they really just love that. And feel it out like is that something you go okay well maybe we just go for pedicures right as a icebreaker because it's side by side or you know that type of thing. But yeah trust your intuition that's not going to be for everybody. Some women are not comfortable with any of that.\n00:52:40 - Chona Sweet, DNP ( wspainclinic)\nRight but too I do love my friends but I do tea time with my, I call them luck luck luck friends because you know not all people love luxury and yeah we have, I have a very specific friends that love luxury and they're very bougie.\n00:52:58 - Tina Marie (profitdriversinc.com)\nSo yes not everybody. So yeah, so it's, you know, it's, you know, it's a nice experience to have to, but yeah, anyway, go ahead. You just meet them, meet them where they're at, but yes, you can, you can, as a woman have kind of different interactions. And that's the whole thing, just be you, like how do you normally interact with somebody, but meet them where they're at, what they're comfortable with that also works for you.\n00:53:25 - Chona Sweet, DNP ( wspainclinic)\nRight. Yeah. Yeah. I have a, and my, I actually am thinking Mark's like, he's putting all these ideas on me is, you know, he's amazing, you know, not just because he's my husband, but he is, um, he's saying that for your birthday next next year, like you, we can set up something big and you can invite them and that's a business thing. What it like to have like, actually that's not a bad idea, um, by that time we're talking about six months from now, I hope that I will be, I should very you know I should be confident and I know the flow of my routine and it would be a good actually time to do that.\n00:54:10 - Tina Marie (profitdriversinc.com)\nYeah as long as there people you know that you want to spend time with.\n00:54:15 - Chona Sweet, DNP ( wspainclinic)\nYeah but I think I'm excited now I'm thinking because I did I know you're going but it's like last year I have just a I did a Bridgerton type T with my with my friends and I invited an opera singer. Oh my gosh yeah so you know I know I don't know if you know this but Mark throws like Artie. We didn't do it this year but last year it's good so the same person who did that is where I got this person from so it's very rigid and I will send it to you but yes but it doesn't have to be like that I'm saying that I know how to connect to throw up parties when I'm saying yes which is going to be a good for my friends obviously my friends to be there but for business contact would be a good place to kind of look forward to I think well especially if you as a hostess know how to make somebody feel comfortable who's not maybe normally comfortable at events like that if you can make people feel special like they're really matter than being there even though it's full of tons of people that's an opportunity for you to show them you know that that you're someone that they can really enjoy and that they matter so that I was already excited like I didn't do one this year but I am excited for next year I hope you can come we And I'm pretty sure we have a Wednesday next week on the 11th at one o'clock p.m. Okay, I think because my Thursday I put you I'm gonna delete this because I have a alarm on my every Thursday. But anyways, I think this is perfect. Actually just weeks like I need to do every day in the morning and then I helped you and I feel good.\n00:56:24 - Tina Marie (profitdriversinc.com)\nThat's how she started laughing. I feel good anyway.\n00:56:31 - Chona Sweet, DNP ( wspainclinic)\nOkay, thank you.\n00:56:32 - Tina Marie (profitdriversinc.com)\nYou're welcome.\n00:56:34 - Chona Sweet, DNP ( wspainclinic)\nYou're welcome. yes.\n00:56:36 - Tina Marie (profitdriversinc.com)\nEnjoy that. You're amazing. I just love hearing your stories and love watching you just grow and evolve. I'm very glad that Mark let us work together. I know. Thank you. It makes me happy. Okay, enjoy the night. Bye.\n","contentPreview":"00:00:03 - Chona Sweet, DNP ( wspainclinic)\nOkay.\n00:00:07 - Tina Marie (profitdriversinc.com)\nOkay.\n00:00:10 - Chona Sweet, DNP ( wspainclinic)\nI just literally just finished. Just now.\n00:00:16 - Ti...","processedAt":"2025-05-04T03:40:52.518Z"}