{"fileName":"Transcript for Mark Sweet + Basis + Tina.txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Mark Sweet + Basis + Tina.txt","type":"transcript","priority":"medium","content":"00:00:00 - mark sweet\nand then we're talking about do we want to try to find a building when this thing expires or do we want to like keep renting because right now the rental rate that we got for a square foot is actually really good in the other space. Does make sense to take over the entire 6-4 which would double our space and are we going to need that kind of space or we're not going need that kind of space like does it even make sense to go down that route right just logically kind of talking it out and then it became where do we see ourselves in three or five years and yeah that's where it started kind of going off the rails. That would be where the most specificity would be helpful because that's the conversation we have and I've been trying to get as I'm always trying to grow and grow and grow and compare myself to everybody. else and wanting to grow and she's waiting for us to plateau to slow like okay where is the top of it where is it and why are you constantly pushing for higher goals?\n00:01:12 - Tina Marie (profitdriversinc.com)\nNo she has an employee mindset and you have a visionary entrepreneurial mindset that's what that issue is that's going to be an issue that is going to cause problems as long as you consult with her regarding growth. God. So you either need to keep her in an employee role and don't counsel with her as a partner of any type and decision making and growth and you need to compartmentalize her or you're going to need to just not have her which I don't think is what you want to do but something is going to have to change at that dynamic, if you're going to keep growing and evolving, and especially now that she has kids, that that would have existed already. But now she's nesting and that is counterproductive to what you're trying to do. So I had, I'll give you an example. And this is this is not the only thing. It's just the thing that pops in my head, because there's lots of different partnerships and things that pop up. I remember one time, because I worked at a call center, everywhere I worked, even when I was a teenager, I got promoted almost instantly, like within weeks. And so I worked at a call center and I got promoted probably 13 times in six years and ended up doubling my wages and that amount of time. I worked for first it was Apple and Intel. And then I went from Intel call handling to Intel network. working. And I learned how to build networks from the ground up I worked with. NASA at the Pentagon called me for tech support. It was a lot of skills that I had. but the payment like, you know, I was 19, 20, and no college because I dropped out, got rid of I lost full ride scholarships, I had two of them. And but but it was an opportunity without school to get paid to learn some massive skills, which have actually been the foundation for my business skills. And but I would constantly get promoted. So I'd be moving and having new jobs and new training, I got put into management training and certifications and all that kind of stuff. My ex husband at the time, he's like, you're first satisfied. You're never happy. like, wait a minute, where do you get that? I'm, he's like, you're constantly changing everything. Like, when are you just gonna stay in one place? that was really similar kind of thing. Like, how how do you it wanting to grow with not being happy and not being satisfied, they are not the same conversation whatsoever. Like being happy with something and being happy with the same thing next year and the year after and the year after is a completely different conversation, right? but in terms of having people who have had right-handers, know, well, I'm thinking now that that's what you call a Mary but I've had other people where they had somebody who wanted to show up in tick boxes. And this is a conversation by the way I just had with Lorenz and Patrick but it was specifically about Lorenz's team and I told him you cannot have a box ticker in your company that has to be counterproductive to sweet loss culture because those are people who will do just enough to get the job done. And the way that you work for reviews, the way that you work for the reputation of sweet law because of the impact it has on maids, box-taking will never be a powerful magnet for that. So for example, cases that hadn't been touched in two months, which shouldn't have happened, by the way. So I've got to go back and tell everyone's heater off the ball that it could have been gone that long because that's supposed to be getting cotton reviews. But, well, it did get cotton reviews. I don't remember who said they would do it, said they would do it and didn't do it. So that was 30 days ago. And but now I'm realizing he told me they're doing everything every two weeks. So he should have noticed it within two weeks unless he just, you know, what. or let them go, so that's part of it. But the issue was is that there are certain types of cases that people on the team don't touch, or they, here's the box ticking. I called, okay, did anything happen? There's no response. There's no update. Nobody did anything back. Nobody drives this case except for you, you and your team. So if you don't have a driver, it's going wherever it goes. And just because somebody doesn't reply to you doesn't mean, okay, well, I did my job because I took the box. I made a phone call. And so we had, I probably went on a rant for like 15 minutes on it between him and Patrick to make sure that they understood what the concept is and how you identify it, and that what that actually is, is apathy and complacency and cannot be, like I said, be tolerated. So anyway, there's something that you need to be watching for and Mary as well is to see if maybe there is becoming to be some some apathy. How does it show up or is it you know playing small and what can she do where that attitude can't be contagious and infect anything else in the business but you also need to know what can't she do that might infect other places in the business who could she talk to like is she going to complain because this was an issue you guys had in the beginning was talking behind each other's backs is she going to complain about marks always changing growing looking at offices every whatever like it so deciding on where you want to go is really really important and then where you going you need to make sure you've got the right people going with you yeah but first thing is deciding Where you want to go because what we were talking about last week is, or maybe the beginning of this week was, I don't know if I want to go, you know, drive, go, go, go, go, or just, you know, slow and steady or whatever, which, um, you know, I prefer slow and steady with sprints. Slow and steady because it's sustainable growth, but sprints because that's where you get the momentum and there should be some, you know, level up kind of effort happening, but it's not sustainable to do all the time. As a human being and as a company, it just, and you also can't make adjustments. imagine you're building a skyscraper and you're adding a new floor every time you do a sprint. Well, there's going to be some settling and adjusting. weight's going to change on the foundation. You have to allow. for, and this is, I don't build, I'm not an architect, so, but in my mind, right? You're allowing for the settling to take place before, and make sure it's all firm before you build the next thing. And when it comes to changing, let's see, a new system completely changing the phone system is one major change. an intake process, this call script is another thing. Like, you can't observe all the changes and see how well they're doing if you're making all the changes at the same time. So, in terms of like growing really fast, or growing as fast as you can, to grow as fast as you can, and sustainably, you got to pick, you know, one major thing, insert it, you know, implement it, and then see how it's doing, make adjustment, and then that's the new status quo, and then you build upon that.\n00:10:05 - mark sweet\nYeah, and like it's never a straight line either.\n00:10:09 - Tina Marie (profitdriversinc.com)\nNo. Yeah, for sure.\n00:10:11 - mark sweet\nIt is not. Yeah, I thought ended this year would be more consistent in those hundred incidences or not. We've been kind of stuck in that mid 80 range. Yeah.\n00:10:23 - Tina Marie (profitdriversinc.com)\nYeah, and that's the which we know is the reason we try to get as many vendors as we can because other people are pulling your vendors and whether they're doing it with money where they're doing it with negotiations, promises, friendships. don't know, but there's a whole lot of variables that go into how you get those. How good they are at running ads, how much it costs them to run ads. have the ad platforms are doing. Are they, are they improving, you know, their ability to run ads in a costly manner? other deal that you could have, but I mean, that's almost kind of in-house, right? You've got that internal connection, but it's you having conversations around this topic that has been the gateway really to getting more vendors, getting more leads, and that is not something that you do as consistently as could be done. I don't think it's bad at all. don't think it's neglected, but, and I don't know that it could go faster. I don't know that you could do more. There's something that has to be organic about some of these conversations, but I don't know if it's always top of mind for you or if you make time for it on a weekly basis.\n00:12:52 - mark sweet\nWhat do you think? No, it's definitely in spurts, so it'll be three or four hours at one time.\n00:13:00 - Tina Marie (profitdriversinc.com)\nWell, I mean, and that's that's something though those are friends and because of the nature of it and everything we know about it that I don't need to tell you. I don't know that doing it more often would be better, but I don't know that it wouldn't.\n00:13:14 - mark sweet\nYeah. No, I don't know.\n00:13:19 - Tina Marie (profitdriversinc.com)\nI do know that you're the guy.\n00:13:22 - mark sweet\nThat's all I know. No, it's true. And we got to sit through a lot of them. Just even by ones that were falling up with them from there, not all of them are great. Yeah, what does that happen with that magnetic one?\n00:13:38 - Tina Marie (profitdriversinc.com)\nWhat did you say?\n00:13:39 - mark sweet\nRemember that magneto? I don't think that's going to come together.\n00:13:44 - Tina Marie (profitdriversinc.com)\nOkay. Um, that's Mary's husband, right? Yep. That's that's awesome.\n00:13:54 - mark sweet\nYeah.\n00:13:57 - Tina Marie (profitdriversinc.com)\nUm, how much money does he make off of you every every month.\n00:14:02 - mark sweet\nNot very much.\n00:14:05 - Tina Marie (profitdriversinc.com)\nThat's not great. We make more money from him than he makes for my song.\n00:14:09 - mark sweet\nYes and no. I mean, well, we paid like two plus years from the build up this network that does get him money.\n00:14:17 - Tina Marie (profitdriversinc.com)\nMm hmm.\n00:14:18 - mark sweet\nhad coming out of pocket for it. We are paying all the hard costs and everything else. Okay. seats were not in. He is more than free to sell. So like we connect him to issue intake. I don't know what happened to that at the end of the day.\n00:14:32 - Tina Marie (profitdriversinc.com)\nWhat else does he do to our money?\n00:14:34 - mark sweet\nOh, he's a regular job.\n00:14:36 - Tina Marie (profitdriversinc.com)\nHow much does he make at it?\n00:14:38 - mark sweet\nI have no idea.\n00:14:41 - Tina Marie (profitdriversinc.com)\nDo you have any idea where I'm going with this?\n00:14:44 - mark sweet\nYou?\n00:14:46 - Tina Marie (profitdriversinc.com)\nSo what can we do? He clearly has skills because Dan can do three for this month from him. Yeah, I mean, but so far as I know his costs. less than everybody else is other than the whole network set up. And last month it was like eight, like he's been on a roll.\n00:15:12 - mark sweet\nNo, he's, this is the worst month, that's fine.\n00:15:17 - Tina Marie (profitdriversinc.com)\nSo what would it, you know, is there a potential room to explore or having him try to get leads any other way through any other platform is his knowledge transferable to ads on another platform. What would it take to pay him for that? And considering, so let's consider like, what, what if he was a employee instead and got a, just hear it all the way out because this is his first version of this thought, right? Got a salary. Would that salary not be cheaper? And we we know that he can get us some business and and would he not be motivated if like he doesn't have a great job he could work from home he could do it okay he could do it more at his leisure but also he could get side gigs if he just becomes really good at getting ads or whatever you could have him sign a non-compete or something or maybe particular types of whatever but what is another way that we can architect a deal here with him where we get some of what's clearly a good brain unless he's just really lucky but I would not say so no not at this level yeah exactly so where you could make you sweet law more of a priority and buy some loyalty from somebody who I mean I don't know I don't know what his other job is and how much he gets paid and how great it is but\n00:17:00 - mark sweet\nI'm gonna guess he's like 150 to maybe 200.\n00:17:08 - Tina Marie (profitdriversinc.com)\nSo let's, let's go look at Lidify and see how many retainers he sent us this year. Okay. Reports. Let's open, okay. don't want my favorites. I want to start to report. So matters, no, it's matters by state by source status. Maybe that one. Let me shift screen so we look at this.\n00:17:40 - mark sweet\nSo June to September, was doing pretty good. It was a lot of like one, one, one for a while. I'm starting in June, it was 10, July 16, August 14, September 12, 10, remember we're at three.\n00:17:58 - Tina Marie (profitdriversinc.com)\nOkay. numbers to me again.\n00:18:01 - mark sweet\nSo June was 10.\n00:18:06 - Tina Marie (profitdriversinc.com)\nOkay.\n00:18:07 - mark sweet\nJuly was 16. August was 14. September was 12. October was 10.\n00:18:16 - Tina Marie (profitdriversinc.com)\nI'm gonna add in the three. So what is the average retainer worth to you?\n00:18:22 - mark sweet\nFive grand.\n00:18:29 - Tina Marie (profitdriversinc.com)\nSo that math is 325,000 since June. Roughly. That's super dirty math. know. But it's to give you a concept of could we hire him and pay him as a salary instead of by leads and then give him. So it's not free. Right.\n00:18:50 - mark sweet\nSo we look at the voices.\n00:18:54 - Tina Marie (profitdriversinc.com)\nI am. And then so that he's motivated to up his game.\n00:19:00 - mark sweet\nWe're spending about 30,000 a month.\n00:19:02 - Tina Marie (profitdriversinc.com)\nOh, that's a lot. So that was June, July, August, September, October, six months, nine, six. Yeah, and what I, how much did I tell you?\n00:19:15 - mark sweet\nhundred and thirty five, I think?\n00:19:17 - Tina Marie (profitdriversinc.com)\nSo three hundred and thirty five minus two hundred and twenty eight. So that's a hundred and seven thousand. And then you obviously have to have profit. but what if we said, hey, like, if you thought that you get us 20 retainers a month steadily through this and other means within roughly the same profit margins, would you be interested in a salary job with, I don't know if they need benefits or anything?\n00:19:54 - mark sweet\nNo, she, he gives it to her.\n00:19:56 - Tina Marie (profitdriversinc.com)\nSo yeah, and, but with an incentive program. of, you know, if the margins are X and the number is X, then you get this. It could be a tiered performance. So the better he does, the better he gets paid without cutting into the margin. So the tiered should also be built in your favor so that, you know, you're getting more money as he's performing well and paying him better. I have no idea. was just a tangent that we went on. But I get the thought process with it.\n00:20:36 - mark sweet\nnot. It's worth a conversation to have.\n00:20:40 - Tina Marie (profitdriversinc.com)\nThat's really what I'm saying.\n00:20:41 - mark sweet\nDo you think this can do a lot more?\n00:20:44 - Tina Marie (profitdriversinc.com)\nWell, so and the other, the reason I would even consider it is he figures something out. He went from one of these two Z's to the number that he has when we struggled to get roughly that amount of number from. big boy agencies. So something's happening there. And there's no way, and I don't know how to say this diplomatically and not be wrong, but Dan can't replicate what he's done.\n00:21:19 - mark sweet\nI don't have little to do what I would, and I hope he'd be able to do, quite frankly.\n00:21:25 - Tina Marie (profitdriversinc.com)\nSo, because of my situation, I'm just going to leave that at that. But my point is there is a powerful brain. Oh, for sure. But there's a powerful brain at your disposal right now, who is doing something everybody else that you're paying doesn't seem to be doing as consistently. Now we're three, and it's November 21st. So maybe something dropped, but maybe I don't know, maybe something's going on at home. And maybe it has nothing to do with how the market is or whatever. I don't know. It's even more reason to have a conversation because he's been doing great and now just dipped a little bit. I'm a huge fan of capitalizing on human resources in a reciprocal way, right? How can we be a blessing to you and ensure you continue being a blessing here? Also my help Mary's attitude little bit if he's like, I love Mark.\n00:22:30 - mark sweet\nNo, she thinks both of us are stupid.\n00:22:33 - Tina Marie (profitdriversinc.com)\nSo, no. What are the odds?\n00:22:36 - mark sweet\nI'm pretty high.\n00:22:39 - Tina Marie (profitdriversinc.com)\nThat you're both stupid? Really? Are you dumb boys?\n00:22:44 - mark sweet\nYeah, pretty much.\n00:22:45 - Tina Marie (profitdriversinc.com)\nDumb boy things.\n00:22:48 - mark sweet\nI didn't think you were wrong. It's it is what it is. I need to jump in a different way there and keep the money component out of our economy. patients and keep her to think she's really good at which is training people.\n00:23:05 - Tina Marie (profitdriversinc.com)\nA compartmentalizing and keeping her in a job role that works for her. It's not a bad thing when people have employee mindsets. Where would we be without those people who are like, you just want to show up and do the job and then want to go home? I don't want to own the business, don't want all that responsibility. Those are the people that show up and run our businesses without taking it away from us and selling it to the highest bidder. We need those people badly, but you really need to know who they are and you need to, like you say, show up for them and ask of them only what really they can handle well. What we want to do is the same reason people get and stay in bad relationships is because it's comfortable and it's there. It's what in front of you, and it's a lot of work breaking somebody else in, but that is not the way to excellence, that's not the way to growth, that's not the way to even being happy in the end, no matter what it is, even if it's a professional relationship. Yeah, so, you know, there's been, you may have grown out of the relationship you had with Mary, that doesn't mean it doesn't have a place, but I mean your perspective of what she was to you, is to you, whatever your right hand, which Dan and I would both disagree with, but we both know we're not there every day. I don't know if Salka would disagree, but Salka would disagree, he's probably just probably disagreeing no matter what.\n00:24:52 - mark sweet\nRight, with an extremely low turnover.\n00:24:55 - Tina Marie (profitdriversinc.com)\nWhat's that?\n00:24:56 - mark sweet\nThey're extremely low turnover, it's not because we're- Overpaying people.\n00:25:01 - Tina Marie (profitdriversinc.com)\nOh, I'm not saying she's not amazing and great, but but And what it was Yeah, but I mean you go into any corporation and you've got, you know, executive officers doing their job And that's their job. That's that's just all it is It's an executive officer showing up the way that they're supposed to. They're not necessarily the right hand now the vp. Yes but But VP is going to be over everything a VP of just the company right not vp of sales and vp of Whatever human resources that there's depending on how big you get, you know, this structure changes the names change the title change, but you know very rarely Does somebody actually have a right hand and when you do That relationship that they identified in rocket fuel generally is the actual one where you've got a legitimate, real-life, bona fide visionary and integrator and you are not what I would call a bona fide visionary, like I feel like you have a little bit fall on the spectrum of the integrator which is actually really good, you'll do matter that way, but it means that you don't have as much of a need to have a person that can do all the things and so you didn't have to go find one of those. You were able to compartmentalize and find different types of leaders in your organization and even create them not just me. So anyway, like I said, there's a lot more that you and I could be working on but it takes more time and digging into some of these conversations. If I could understand more of the mechanics of what Mary is doing and what Mary it wants, and obviously probably not with talking to Mary, but you and I, you explaining it well, we could probably find the, the, um, hold on a second, I'm just making sure it's not a child messing and messaging me.\n00:27:15 - mark sweet\nYeah.\n00:27:19 - Tina Marie (profitdriversinc.com)\nthe, like the ideal roles and responsibilities really were, um, but then also changing what conversations you have, um, as a result of it and not counseling about certain types of decisions. Now, you would need a replacement who would you counsel with in, in those things and make sure that, you know, who you're going to for that because otherwise, you're going to end up going back to Mary and then, and then you've now kind of encroached on, on what you had tried to create as a compartment. So we need to make sure, All of that is taken care of, but the better place to start is what do you want to build with Sweet Law in the next one, three, five years? And those are separate visions, but I would work backwards from five years. So what would you like it to look like in five years and then let's break it down going backwards?\n00:28:39 - mark sweet\nIt's something I've been thinking about more and more, like where are you trying to get to and do I want to get to and why, by the way, make sure that why is in there.\n00:28:51 - Tina Marie (profitdriversinc.com)\nWhat's your, what is the thought that you come to most often? And.\n00:29:00 - mark sweet\nquestion. in terms of the wire, in terms of the numbers.\n00:29:04 - Tina Marie (profitdriversinc.com)\nPeriod. So anything, like, what is the thought that comes into your head most often when you think about, like, where am I going?\n00:29:16 - mark sweet\nSo this is morbid. I'm just saying that just to kind of brace you for it little bit.\n00:29:25 - Tina Marie (profitdriversinc.com)\nI doubt you're going to shock me because you don't know the thing my head does.\n00:29:29 - mark sweet\nBut it's not my normal, like, thought process. Because if you and my thought process is like, I just want to grow because it's fun. It's exciting. It's way more fun than just running a stable ship, which is just running the day-to-day. there's nothing super exciting about it. more just putting up basic fires, right? Mm-hmm. difference is I think I probably have, I mean, I pray it's all wrong, but around 30 years left until I'm done. And so, More than half my life is gone. I need to do everything I can to just. maximize as much as possible in the short period of time. And. With what we do with what the risk we take. It's not. same trying to double from where we are from where I started.\n00:30:25 - Tina Marie (profitdriversinc.com)\nRight. So.\n00:30:27 - mark sweet\nI know. I know what we do. I know how we treat our clients and it's different than everyone else. Additionally, there's this, you know, book man of. Outside funding BC money, other firms coming in. That's always kind of hanging around out there. If we get to the point where we're a certain size, we have a bit of a built in moat where we can absorb a back quarter or whatever it may be. Does that make some sense?\n00:30:59 - Tina Marie (profitdriversinc.com)\nYes.\n00:31:00 - mark sweet\nAnd it's not necessarily coming from a place of fear. That's not what the goal that is.\n00:31:03 - Tina Marie (profitdriversinc.com)\nSo, hold on. I have to ask this before we go on because you said you need to maximize this, build it as big as it can be or something.\n00:31:14 - mark sweet\nwas that language? Yeah, something like that.\n00:31:19 - Tina Marie (profitdriversinc.com)\nAnd why?\n00:31:23 - mark sweet\nSo, when I die, there's enough to take care of everyone.\n00:31:27 - Tina Marie (profitdriversinc.com)\nWho is everyone?\n00:31:28 - mark sweet\nEveryone.\n00:31:31 - Tina Marie (profitdriversinc.com)\nI need you to be specific because clearly you can't be in everyone in the world. You mean everyone in your family? Do you mean everyone in sweet law? And how, what does that look like? We have to get clear on this definition. Huh? Yes, you both. Okay. What does it look like to take care of everyone in sweet law when Mark isn't here anymore?\n00:31:54 - mark sweet\nI don't have an answer for that yet.\n00:31:58 - Tina Marie (profitdriversinc.com)\nSo. Let's talk some logistics. First of all, second generation wealth is almost always wasted. The people that receive it don't have the discipline and the respect and the knowledge of how to manage the money to keep what is given to them. It's almost never worth what is given to them. What is put in in order to be able to give it to them? That's the truth. Those are the stats. So in terms of providing for Chona and do you have something for her?\n00:32:49 - mark sweet\nYeah, potentially.\n00:32:51 - Tina Marie (profitdriversinc.com)\nOkay, so we go from taking care of everybody too. Yeah, potentially. So this is the purpose though of the question.\n00:33:00 - mark sweet\nsounds with her because I know what's wrong. Sorry, come on, It's very nice, but yeah. So with my dad passing, you know, left money to my mom and everything else and she just does not want to spend any money on anything. So I know what's going to be left from that will be enough for my sister to be okay. You know, her house we paid for. She doesn't have huge lofty goals. She's just kind of happy with the status quo.\n00:33:53 - Tina Marie (profitdriversinc.com)\nOkay, here's what I want you to do. We can either do this. Well done. You're not allowed to and I'm counting on Elon and Elon type brains. Not there really is one to like figure out how to make is like my is failing. I'm pretty sure like my kid is my pancreas like whatever my organs. I'm like, yeah, anyway, I'm in that boat of my body could shut down at any time and I feel it. So I'm not morbid. I'm just realistic, but I'm going to do everything I can to maximize and leverage it. And I'm not going to count on not being here. But every day, I'm like, let me purge this stuff. Let me make sure my files are in order. Let me make sure that everything is organized so that if I die, I'm not a burden to anybody and I leave as much as good as possible. So I'm with you on that. But you really need to define what it would be what and especially for like China because statistically women outlive their husbands anyway. And she's got a family and but I would really like you to write down a list and we can do this together. If you wanted to have a meeting and it's just you and me because this isn't a Dan thing, know. And this is more like what we're doing right now is more what I normally do regularly, anyway. There's just so much that you do. I would really like more time on it. I could do more for you. But sit down and let's make a list of like be specific about the names, specific about the amounts, specific about how you would have it managed like trust funds. What would you do? Like what would be the parameter of the trust funds so that you have a little bit of a specificity in the vision but also some peace and some targets. So then we have numbers that we know. Now, when we have target numbers and we could have target numbers for what happens if let's say something happens and you're gone and so one of the things and this is why I don't think it's morbid I had a client that I worked for and he was very he's Indian and Brainiac and he taught me so many things about numbers but he would always be like what do we do if you get hit by bus tomorrow like how do we know how to do your job and how does the company not suffer because you're not here so what happens if you get hit by bus or marry or anybody else right these are all the scenarios that we we want to take care of and make sure that we're planned for but you know let's say for some reason you're gone in five years let's say you're gone in ten years like what where could we be in five years to say that in in that five years you're in the best place possible and this is what you know you can leave in five years this is what you know you can leave in ten years So and then we kind of reverse engineer. So let's let's go with the 30 year plan, right? And you're, you're what, like 38 or something somewhere on that? Baby. I'm 40. what I'm trying to do. No, no, I know. But but I'm but I'm with you. And you know what your genetics are. There's there's all kinds of things in it. So anyway, so if we figure out, first of all, down who we're talking about taking care of specifically and what do you mean and taking care of them? And I don't mean like a number but a number that has a meaning. Could you live off of this number for how many years? Could you live off of this number and this number has enough money to make you interest for you to keep living off of as income for the rest of your life? Given this type of parameter and this house is\n00:38:00 - mark sweet\nYou know what I mean? Like a full-on plan.\n00:38:03 - Tina Marie (profitdriversinc.com)\nHow much money? What does it look like? How is it managed? And how does the money keep making money if possible at at at a chona like family level? And then what are the other people? And and what does it look like? So for sweet law could be a severance type package that is that has to be like if it goes for sale or something like that. Like what are the ways that you could provide for your team if something happened to you and you didn't have any like runway exit, right? Like you're just gone. There is no I got to chance. So everything is already put in place. And then what we have is just kind of like a baseline number and targets. Then what we do is go, okay, well here's the target, here's the time we're doing it here's the life I want to live during that time. I'm not going to be grinding away all week every week trying to... and for death. Because you should be planning for life. The best thing you can do for people here is not die for them, but live for them, you know, live with them. And so then what we have to do is look at basically effective hourly rate of your earnings. We have to look at how does your money work for you? How does your money make more money for you? Is it just sweet law? Are there other opportunities where you could be getting that money? And I think they can, especially with the people that you know, with the interests you have, with the willingness that you have to work and the skills that you are constantly acquiring. I think that there's a lot of opportunity for you to get that very leveraged income and wealth, but you really have to choose where you're spending your time. and that includes making the time for all the fun stuff that really make it even worthwhile for you. But it starts with the how you want to take care of people and what that specifically looks like so that we can work backwards from that because if that's what you care about most is how do I leave this world. That's what I think about every day. That goes into why I have so few clients but need to get paid so much because how I want to leave this world is first of all having spent the best not crying Tina quality time with everybody that I interact with no matter how it is. And I'm not. spiritually invested into and so that's number one so because at the end of every day like if I die today I can sit there while my eyes are closing and I'm on my way out going this is what I did that was good today and this is the lives I touched I didn't have a fight with anybody I didn't say bad things I didn't put hate into the world I did what I could to organize and to reduce burdens to increase them you know those types of things so it doesn't matter when I go there's not going to be any regrets that's one of the first things so in my architecting it's no regrets make sure that every day is spent in a way that's no regrets so that affects my time my energy who I'm spending it with and then the next thing is the finances like making sure that I'm not first of all never in a situation where I'm worried about money, which you know what I that experience, like I got to handle it because if I'm worried about it, then I'm thinking about it and being obsessed with money. And that puts me in a terrible mood, which means my experience is my first priority, which is the interactions I have with people every day. That suffers because my brain is somewhere else and it's in trouble and it's in stress and so it can't be in love and it can't be in encouragement, you know what I mean? So think about that would be one thing that you could do also. So what is the long term like when I leave this world, if I leave it, you know, years from now, decades from now, how would I like to leave it? But if I get called today, what can I have done today to make sure I'm not going , I wish I had not done this or done this differently. But then no matter what you do Mark is long as you are on that path every day. I Can't guarantee it because I haven't died yet, but I have been on the threshold several times. I Know what it feels like to know that your life can just slip out of your body I've been not close to death with illness so many times and I Do know what it feels like then just to be peaceful and just look like yeah, I did as much as I could up to now so That will help you with and but what I can tell you too is the correlation to how I run my business You can't really even call it that because technically it's just a glorified job If I don't work it doesn't work. There is no money. So it's a job, but But the way that I plan it is around that and not the other way around So, no, I don't think it's more of it. think it's great. think that solving that problem and being clear about what you want that to look like will help answer all the other questions I've been trying to pull out of you with more ease. And I also think that, I don't know, there's something very liberating about being able to look at it that way because, and you're already getting into this. So, think that you've kind of been doing some of this on your own, whether fully consciously or partially, but you can put things in perspective and realize, okay, this is good. I would like it to be better, but here's, this is good. This is good. is good. you know, basically good enough, but I want to do better. Like, there's this simultaneous kind of like, it's not even vacillating back and. between one, but it's like, it's not a hamster wheel, but it's almost like this circular thing of it's good enough for this moment, but it can be better.\n00:45:12 - mark sweet\nSo let's keep going. You know what I mean? Yeah, like, this is fine. I'm okay with this.\n00:45:17 - Tina Marie (profitdriversinc.com)\nOr today. But tomorrow I want more and and not in an obsessive angry. I'm not satisfied with what we've accomplished or like, not I don't appreciate what's been done, but let's not lose momentum. Let's not waste this day. Yeah. That would be a great place to start. So do you want? All right. So next week, we're not having a Monday meeting because I'm flying. Did we reschedule that? I think we said we're not doing it because Dan's not working next week.\n00:45:55 - mark sweet\nIt's Thanksgiving week.\n00:45:56 - Tina Marie (profitdriversinc.com)\nYes. Yeah. But we will meet\n00:46:00 - mark sweet\nSecond, I'm not meeting with you guys. I think the way what? Because I have that AI conference on the third.\n00:46:11 - Tina Marie (profitdriversinc.com)\nOh, yeah. And trying to I cross that off on the 25th. Wait, no, that's Thanksgiving. OK, that's right. OK, so on the second, we're not meeting. Did we move it? We did not move it.\n00:46:24 - mark sweet\nI will be back on the fourth at some point. So the fifth Thursday, the fifth is totally fine.\n00:46:34 - Tina Marie (profitdriversinc.com)\nWell, it'll be a long day. Well, I really hope that Chona and I can move that call permanently.\n00:46:41 - mark sweet\nSo I would be meetings are hard.\n00:46:43 - Tina Marie (profitdriversinc.com)\nBut Thursday, I can do Thursday or Friday that week. And if Dan can't, you and I can dig into this stuff more. You want to pick something?\n00:46:55 - mark sweet\nYeah, that's fine.\n00:46:56 - Tina Marie (profitdriversinc.com)\nOK, December, December 4th. It's my oldest daughter's birthday, and I will have been, roll this into me. This isn't about that. I'm telling you something. Sorry. On December 4th, I will have been a mother for four years, 24 years, 24 years, years. Yeah. Speak to you. Okay. Anyway, especially because I had a miscarriage before every single one of my children. I've been pregnant 10 times. have four babies. I worked for them. They were hard. All right. So Friday or Thursday, the only call I have to do is my 12 o'clock with Dan. And then as of right now, I still have Chona at 6 p.m. Friday, I don't have anything at all. They're totally fine.\n00:47:45 - mark sweet\nThere's an interview before or after Dan, whatever like to keep that open. Yeah, that's totally fine.\n00:47:58 - Tina Marie (profitdriversinc.com)\nOkay. So let me move you. and if Dan accepts then yay and if not he'll just be you and me after that he'll be back to normalcy yeah okay well then we still have christmas week oh i don't think that that's going to be a problem for me actually i don't know about you guys well on december 5th you might have to move and time it later because i'm going have a small time change during the 16th and 23rd but small time change yeah oh we're in japan oh okay yeah that's a big time change well no not for us specific um it's a 17 hour time change oh well but it's it's fine because the new one is like just early morning there and it's fine yeah okay um so december 20 Third.\n00:49:04 - mark sweet\nThe 16 and 23, we'll figure out. The twelve should be fine. If there's some issue, I'll let you know.\n00:49:10 - Tina Marie (profitdriversinc.com)\nThe twelve.\n00:49:12 - mark sweet\nThe sixteenth and twenty third. You mean it?\n00:49:16 - Tina Marie (profitdriversinc.com)\nYeah. Oh, the 12th. M you mean. Yes. I thought you said 12 doesn't like the date. The 12th of my dude. We don't mean on the 12th. Okay. All right. Well, we'll do all of that. as it comes up. Okay, so I'm just looking at some of the stuff that we've been doing. Did you do any more research on the gift boxes since we talked about the monthly subscription thing?\n00:49:55 - mark sweet\nSo yes, I also talked to a couple of different doctors that I'm. fairly friendly with just kind of pick their brains of what they would like. It's interesting that the smaller ones are like, now the doctor makes the decision. The bigger ones are like, yeah, I know the front desk like hands out cards. So, not surprisingly, we're gonna have to think about who gets what.\n00:50:17 - Tina Marie (profitdriversinc.com)\nYeah.\n00:50:18 - mark sweet\nThe one that was like, yeah, look, I would love to just get wine in the mail. Like, I'm stoked for why. No one is like, we eat healthy, like, I would like fruit and then staff would like fruit. The ones like girls in front like, I don't care. So it was helpful, not helpful, but helpful. All of them kind of report the same thing of in the last three years, they've seen the number of things they call unattached, basically unrepresented clients way down compared to what they saw three years ago. And the ones that they are seen that are unrepresented are not cases we would. Take.\n00:51:08 - Tina Marie (profitdriversinc.com)\nThis is doctor's offices.\n00:51:10 - mark sweet\nThese are chiropractors.\n00:51:11 - Tina Marie (profitdriversinc.com)\nYeah. Okay.\n00:51:15 - mark sweet\nAnd those are the ones who really target me. Like I love Fuji, right? Like we love working with him, but the chance that he comes across the case that doesn't already have an attorney attached to it is super low unless it's a personal friend.\n00:51:29 - Tina Marie (profitdriversinc.com)\nSo where are there other doctors that might. Yes. Okay.\n00:51:39 - mark sweet\nBut there's a lot of them that will want things for that. Yeah. That I am not getting near. I understand it's legal in Arizona. I'm still getting near.\n00:51:55 - Tina Marie (profitdriversinc.com)\nLike ER doctors?\n00:51:57 - mark sweet\nYep. want another super fun car? and somebody will pay that. Oh, yeah.\n00:52:05 - Tina Marie (profitdriversinc.com)\nSo you can't really compete with that or won't compete with that. Okay. Well, Dr. Rufundrels want a huge thing. They're not, but I don't just need things. Sorry, what?\n00:52:27 - mark sweet\nI would love to find a way to increase that. mean, we're at one Dr. Rufundrel, this one, that's low. And so if we're sending so much business out, I mean, there's plenty of people who say, you know, look, for every two I send you, I'm expecting to get one back. But the quality of those cases usually aren't aren't there.\n00:52:50 - Tina Marie (profitdriversinc.com)\nYeah.\n00:52:55 - mark sweet\nSo I'm just trying to find other ways to generate cheaper cases. a lack of better term.\n00:53:02 - Tina Marie (profitdriversinc.com)\nYeah.\n00:53:03 - mark sweet\nAnd there's, you know, other benefits that the doctors always like you're going get your bills and reports faster, we can ask for certain things like, hey, can you squeeze in this patient or whatnot, you know, things that if you don't have a good relationship or, you know, we didn't pay them well. I'm sorry, I can't, you know, put that person in say we're full.\n00:53:23 - Tina Marie (profitdriversinc.com)\nYeah.\n00:53:26 - mark sweet\nSo it's more just constant process and constant ups and downs. And it's always how it's been with these different, you know, providers and vendors, but we've talked about it before, we've gone, we've done stuff, we haven't done stuff with how can we keep putting it.\n00:53:42 - Tina Marie (profitdriversinc.com)\nif you found somebody like an order we are downer that worked? I don't know if they could do this or not. Worked at the hospital and paid them to rock their car with your stuff.\n00:53:56 - mark sweet\nSo it's a little little tricky. Because you are not supposed to solicit clients at a emergency scene, if you will, directly. And directly is the key word, because the TVs that are on an emergency room have lower ads on them, right? Right. There's bus benches outside the hospitals, which have lower ads on them. So it's not impossible, but it's, uh, it's right. It's online and it could work. I'm not saying I can't, but, you know, what's the difference in hiring a jam to do that or just, you know, buy a junk car and just park you there every day?\n00:54:38 - Tina Marie (profitdriversinc.com)\nWell, it's going to get towed and, you have, it has to have a reason to be there parking is usually not right out from where you'd be able to see it. But, like, depending on what the major hospitals are, is there a fast food place or something? where you could pay one of their employees and to wrap their car and so it gets seen frequently by people in the vicinity who just visited somebody who were in the hospital and got in a wreck and like it's really just top of mind and where are people from the time they get in a wreck to the time they get represented but represented where are they wherever they're at that's where you want to be but it doesn't have to necessarily be the same places that everybody else is like how can you think outside of the box a wrapped car like thoroughly wrapped could say a lot could catch a lot of attention and you do that at times a few around hospitals not in them not on the parking lot but in locations that are close to it where people might even be stopping or people visiting might be stopping like you know what I mean like is in a high-pop We did area. The fact that the chance that that doesn't get you a case from time time, know, buildings, you know, why else would you be doing that? Right. Yeah. So, I mean, and that wouldn't cost that much. Really, like somebody's driving their car anyway. And you pay for the rap, whatever that costs, you know, maybe $1,000. And then you pay them to drive it and say, well, I'll pay $500 a month to have your car wrapped. And then how many times could you do that? And basically have a walking advertisement that's going everywhere all the time with your ads on it. And it's moving. And if you're talking about a fast food worker, guess who they're around all the time. The poor people that need representation if they get in the break. And probably the ones are likely to get in Iraq, lower income, more drugs, working later nights, driving while exhausted or intoxicated. It's just it's the status quo. It's just that's that's just the reality of it. I'd try it. I put my knee in it.\n00:57:25 - mark sweet\nYeah, no, it's worth trying. We tried the LED trucks. I don't know if you know it at all.\n00:57:31 - Tina Marie (profitdriversinc.com)\nIt's an LED truck.\n00:57:33 - mark sweet\nThey're a box truck covered in LED TV.\n00:57:36 - Tina Marie (profitdriversinc.com)\nOh, I'm going to go around sporting events.\n00:57:40 - mark sweet\nHuh, never generated. But I keep doing it. So that way, someone said I saw you in the billboard or saw you when I was driving. And they really maybe thought someone else that has a similar name hypothetically. I got to do those. I don't know where they saw it. Right.\n00:58:04 - Tina Marie (profitdriversinc.com)\nYeah, but in terms of like where to run ads, where to put ads with their physical or digital, where are people going from the time they get in a wreck to the time they get represented? Yeah. And is the time of representation window decreasing? Probably is based off of what you just said. What was that window? What is that window? we know? And what does that mean? Why did it decrease? Are people more aware?\n00:58:44 - mark sweet\npeople? Awareness has definitely gone up.\n00:58:48 - Tina Marie (profitdriversinc.com)\nFor sure. And it will, and in this, because we live in an information world, right? social aspect of it means people are telling their stories and other people are learning from other people. stories and so they you know maybe they didn't know a brother or uncle or somebody in their immediate family but because of Facebook they know somebody that they don't even really know but now they're like what I know how to handle this because um but even being I mean driving how many billboards now or ball from billboards well can you can you run ads in and on podcasts are there podcasts like true crime podcast that freaking so many people huh yeah the geotarget the what target do you target you wouldn't want to add right no right but big podcasts might do geotargeting ads geotargeted ads that um you can get multiple platforms too so you know we have not talked about that that's not traditional radio I wouldn't consider it traditional radio because of the the social aspect of it. And I think most people aren't going to skip a really short ad like that. don't think you can in podcasts. Yeah. Are your competitors doing that? You know, I don't know if they are, but I would imagine the majority of them aren't yet. I don't think that podcasts have been topped very well, but they're going to keep growing. So that's something to look into. If you know what is the highest, you know, time, like when do the most accidents occur? What time of day? What day of the week? Run ads then or right after those times.\n01:00:45 - mark sweet\nYeah.\n01:00:47 - Tina Marie (profitdriversinc.com)\nI don't got we haven't. I'm going to put this on that list.\n01:01:03 - mark sweet\n2020, which is pretty outdated at this point, found that lawyers spent 400 million on just TV commercials.\n01:01:13 - Tina Marie (profitdriversinc.com)\nOn just TV commercials? Yep.\n01:01:18 - mark sweet\nAnd then data from sensor towers, so take all that with a large grain of salt, and Morgan and Morgan spent 40.3 million on digital ads in 2023. Oh, sorry. 240 million was just what Morgan and Morgan spent.\n01:01:49 - Tina Marie (profitdriversinc.com)\nWhat's? I'm sharing, you know, the thing is, what should I... spreadsheet. I showed it you. was working on earlier this week. just shared that with you. Identify what the time accident to represent.\n01:02:43 - mark sweet\nLook, everything's worth a shot. We tried the radio thing. That didn't work. Radio clearly works to someone, but didn't work for us. Things are worth trying. I know podcasts usually are\n01:03:14 - Tina Marie (profitdriversinc.com)\nYeah, so I shared this talk with you just so you can just, like, if there's ideas that you have and we haven't talked about it, you can put it here, put it in the parking lot, and if we're, I'll put things in progress if we're working on it, but we'll get a little bit more organized and structured and then think about whether not you'd like to meet one more day a week so that we can just put, we can just be more structured, that we can get more results, there's a lot of things that have to be solved that only you inside of your company can solve, you don't have another person that's there doing this. There's just a lot, like, you have a big organization there's a lot of opportunity, there's a sufficient amount of risk, there's enough systems, there's enough departments, like there's a lot to be done. And I don't think you really have anybody leading any of it super well. think Mary does her part. I don't think that's nearly enough. So another hour a week, you know, if we did that for six months, we can make them significant momentum, I think, towards things, but it really should start with first. What does it look like to take care of everyone? Who is everyone? They need to have names or a very distinct description, right? And if it's everyone at Sweet Log, if they're all the same, if Mary is her own, you know, be really specific about the people and the categories of people because how you take care of them should look different, right, for all of them. And then we can like, okay, what does that number look like? Where are we at now? What's the gap that we have to bridge? How long would it take us to get there? And then we run every decision that we make through the filter of does that slow down our goal? Does that speed up our goal? Does that get in the way of it? Does that aid it? Take us off track? Any of the things? So start there and this is a good time of year to really be pondering that type of stuff. Naturally, people become more introspective this time of year. So, which is probably what's what's already happening with you it just it just does winter that you guys don't really have it but but it does it we have less sunshine that's a real impact um but the holiday is coming the end of the year closing you know there's there's a lot of different signals that we have that we may not have personally and purposefully given energy too but we're affected by them anyway so anyway it's just a good time to capitalize that while you're on some walks maybe um and if you get some thoughts maybe you can leave yourself an audio recording or you can drop me uh audio message or something like that and just kind of bring down to a text or signal or wherever or and no not signal if it disappears uh audio text though and uh let's let's do some planning and reverse engineer from the things that matter most at the life level because business is just a vehicle to get you there. Yep. I need to wrap up because I gotta go check on my little pole and get some stuff going but what's that?\n01:07:22 - mark sweet\nI'm gonna head home, it's only office.\n01:07:24 - Tina Marie (profitdriversinc.com)\nOh yes. What it was like a baklava hamburger.\n01:07:29 - mark sweet\nWhat was that? Uh, so I just got followed up so they make like maledo cups.\n01:07:35 - Tina Marie (profitdriversinc.com)\nYou did that? Mhm. Did you just tell me you did that?\n01:07:41 - mark sweet\nI didn't eat followedo. I bought the pre-made followedo and I made ground beef with.\n01:07:46 - Tina Marie (profitdriversinc.com)\nYou cooked?\n01:07:47 - mark sweet\nYeah, I can cook. China can't cook. I can cook.\n01:07:51 - Tina Marie (profitdriversinc.com)\nNo, no, We know that like this has been since day one like this is not a surprise. Not like I thought she could cook like. Yeah, no. Love that that's funny though. Okay. Well whenever I come with me you guys you guys are you're making me dinner. So there All right, well head home, and I I'm not worried about it, I do think you know she's in a new season and Mike and And It's important to take that into account two kids changes you two kids and settling down with a man changes you and But I think those differences were already there that it's just the gap is getting bigger and it's okay we just need to create the the proper dynamic and then encapsulate it and let it let it stay there and It will create happiness for her and you and she'll still be useful, but I I do think that the the The way that you identify it probably should shift a little bit. I really can't speak until we have a much more in-depth conversation about the logistics. With the one hour that we have and how much we share of it with Dan, it's really hard for me, again, with the size of your organization and all of the moving parts to basically I get half an hour a week with it and it's just not enough to be really effective. So that's, I'm not going to be looking for any new clients, I've got all the things that I'm working on, but I would give more time to sweet loss.\n01:09:39 - mark sweet\nWere you able to hire that one person that you were trying to hire?\n01:09:43 - Tina Marie (profitdriversinc.com)\nNo, but she was just not able to be consistent and reliable anyway, but what I did do is partner up with a lady who's been around as long as I have and so it's really kind of fulfilling and satisfying. I'm home by myself all the time, and I'm waiting. social for that. getting to have her has been has been helpful too. I'm still not in the surplus that I want to be, but I don't think I'm very far from that. So I'm glad for that. But yeah, that was just another reason I just I don't want different people. I got so blessed with the amazing people I have. If there was somebody just, you know, a magical fit. I'd work with them, but like I really particular about my people and I've just kept them a long time and I'm not looking for anybody new, but to be able to serve better and definitely be down for that. And and I have not been able to do what I wanted to do here anyway. So when you're ready for it, I want to do I think that there is so much more structure that we could put in place. And I also think that I could help with the mental load that you have and help you do than things more consistently, because we do have so many things that you're doing constantly. I don't think any of it is getting done as well as it could be because you're so divided.\n01:11:16 - mark sweet\nYeah, no, definitely more the key directions.\n01:11:21 - Tina Marie (profitdriversinc.com)\nPlus, Mark calls make me smile. So I like how I would have more of that in my life. I think it's a thing. No, you always make me smile. You also make me annoyed sometimes.\n01:11:32 - mark sweet\nThat's OK.\n01:11:33 - Tina Marie (profitdriversinc.com)\nI do the feeling is mutual. You don't have to.\n01:11:40 - mark sweet\nI just to just want to bring it better. that's what everything just comes down to. And you know that about me when I get frustrated with my reality.\n01:11:48 - Tina Marie (profitdriversinc.com)\nBut I wouldn't want it to let like if you were not, if you were any way, it wouldn't be real and I have no interest in that. Like if you don't get frustrated, that means you don't. about it. So I don't have no interest in that either. think you do great. I think that you're awesome. think everybody that works with you is lucky. I think your chona is lucky. think you're lucky because she's sweet and smart and funny and feisty and she'll keep you on your toes. your kids.\n01:12:24 - mark sweet\nLet's go home. All right. Have a good night, Mark. Okay. Bye.\n","contentPreview":"00:00:00 - mark sweet\nand then we're talking about do we want to try to find a building when this thing expires or do we want to like keep renting because right now the rental rate that we got for a s...","processedAt":"2025-05-04T03:40:52.466Z"}