{"fileName":"Transcript for Chona(4).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Chona(4).txt","type":"transcript","priority":"medium","content":"00:00:03 - Chona Sweet, DNP\nHello. Hi. I can't hear you. muted. Okay.\n00:00:08 - Tina Marie (profitdriversinc.com)\nI'm so bad about that.\n00:00:09 - Chona Sweet, DNP\nHi.\n00:00:10 - Tina Marie (profitdriversinc.com)\nHow are you?\n00:00:13 - Chona Sweet, DNP\nI'm just heating up my my chat. were I started early because I started early today so so that I can make sure I'll be here. And do my I went to work early. And then I'm just I have six more patients to call. I'm trying to call it before I meet our meeting but it's not going to happen.\n00:00:43 - Tina Marie (profitdriversinc.com)\nYou're in hustle mode, baby.\n00:00:45 - Chona Sweet, DNP\nWell, it also gives my family a year so I wanted to make sure that you know I can so obviously that means I can really do it if I really want to.\n00:00:55 - Tina Marie (profitdriversinc.com)\nI was about to point that out but look, you just got there all by yourself.\n00:01:00 - Chona Sweet, DNP\nI know I've been really, yesterday it was a little busy because the NP is shadowing me and I'm like trainee her and it just definitely slows me down but I still finish my note that like I don't have, I may have one note that I didn't sign it's completed but I just didn't sign because I'm waiting for the staff to put the pharmacy information but it's like it's not my fault it's just it's complete so I feel good like I don't I know it's it should have been this like this the default anyway from the beginning but that's a point I thought to have yeah it's a point I mean to the extent that if you find yourself in a situation again and you want to ask yourself is this something I could be doing better could I be showing up better but you have to remember that the biggest issue was the\n00:02:00 - Tina Marie (profitdriversinc.com)\nand the calculations you were making in your head, and a tug of war between decisions. So first of all, it was the stress and anxiety of the unknown. So stress and anxiety always cloud our judgment, right? Then when you add on top of it, when you're learning so many new things, exhaustion kicks in. And we know that exhaustion inhibits judgment, right? So you've got both of those things kicking in. And then the calculations are, this math doesn't add up. I made way more money over here, and it was less stressful. So then what you have to do is realize that the goals are different, that the opportunity and the potential is different. That's a process that had to be worked through. Almost nobody would immediately be able to\n00:03:00 - Chona Sweet, DNP\nfigure all of that out.\n00:03:03 - Tina Marie (profitdriversinc.com)\nBecause it takes experience and it was a new experience. So that was the whole point of all of it. We talked about how once you get bought in, the buy-in makes all the difference. You weren't bought in in the beginning. It was a good question mark. That is really what it was about. So the first thing that and when we realized and when you actually were able to realize that the issue is I haven't made the decision because I don't know if I want to make the decision. But when you gave yourself permission to just say that, it's like you were doing it for you for the first time for real. Like the originally it was supposed to be your choice, right? But when you got into somebody else's office and somebody else's space, it started to feel like not so much yours.\n00:03:58 - Chona Sweet, DNP\nRight.\n00:03:59 - Tina Marie (profitdriversinc.com)\nthat Confused things and so you had to work through that but then when you decided and you're like wait I don't have to work there that much like I really can drive this flip to complete switch last week Now the one thing I will say is that I don't take anything as being the new normal until it's been several weeks And we've repeated that habit, you know, and we stay on it for months roughly about six months People say 21 days on like six months if you can hold a pattern for six months. I'm thinking we might be onto something Right. So let's see how it keeps going but I think that the biggest issue chona was just the evaluation process the learning the fatigue the exhaustion and then the Why are you really doing this?\n00:04:50 - Chona Sweet, DNP\nRemember we had that question Right, you're like because I have to I'm like, yeah, but you don't really have to Right like I I got um know that he's busy but wait what did he say he would do that he didn't want for example like he said that even if you know we're waiting for the insurance to kick in for my pay you know for each patient because that's that's why I get a higher pay because right I'm gonna wait till the insurance get paid or he gets paid you know before I get paid he told mark that he's still gonna pay please minimum 15 provided and then it didn't happen and then you know there are times where there is a patient in the clinic in the hospital where I made the decision it's a it's I'm gonna try to not be technical but it patient has a morphine implanted pump and it's empty and I told him you need to feel this because I'm not like privileged in the hospital to do it so you need to do it he said he will that was Thursday he didn't do it till Sunday and the hype the doctor doing the treatment is so pissed at us. And I have to talk to I don't know if you have four days to wait for that. I told you remember that doctor that was so mad that I pacify it. I talked to him for now. That was a difficult doctor who was so mad at us. But I talked to him for over an hour in person just to pacify him. And cannot control what he does. The thing with Dr. E is I think he's a good person. He just overextend himself. He's like super busy. Like he's in the OR doing OR case because he's an anesthesiologist. he's doing you know, he's like all over the place, you know. So the integration I'm getting a little I'm trying my best not to, you know, because we don't have a contract. I mean, we have a rip. I don't think he's gonna do that to us. But who knows, right? We don't mark an eye because, you know, Mark, we've known each other for a while and then Mark and him talk. I don't think he's gonna. You know, do something. I'm trying not to think of the negative or think in fear, but think of Let's look at the facts But anyways, um, I'm doing I feel good when I see a Intention like a PI patient whether it's his or mine I saw the patient now. thought the patient today. turn in I emailed the note today Like that's and I feel good like we send this to the attorney. recommend this procedure So I felt good at that.\n00:08:29 - Tina Marie (profitdriversinc.com)\nI think that's what he he wants me on board to kind of help with his part of the lean two but and yeah, that that's really it but so something to consider and this is These conversations work best with Strategy and diplomacy and it'll probably be best coming from you rather than mark but When you feel strong, but not angry and strong, but not overpowering, but peaceful, strong, but peaceful, have a conversation with, like, I just want to make sure that we are on the same page. So first of all, the arrangement that we have is unique. I'm coming here not just as, you know, to be a nurse practitioner, but to run a business, and to be a business partner. And we don't have a contract because we have mutual respect and trust in one another.\n00:09:41 - Chona Sweet, DNP\nWe need a contract, sorry, but we didn't sign it yet.\n00:09:44 - Tina Marie (profitdriversinc.com)\nSo, yeah, regardless, regardless, have, at the very least, a verbal contract and a draft written one with the expectation that I would be paid X. Now, as far as I know, I've met all my requirements. I fulfilled these tasks. Nothing that we specified has not been done. So I'm talking, I'm referring to, you know, there's probably an expectation that your notes were done on time. But if that wasn't specified as a contractual issue, then it's moot. That's the truth. Especially if you weren't said, if you weren't pulled aside and said, hey, look, I promise you 15,000. But if you don't do this basic, then I'm not going to do that. So contractually signed or not, you have not been paid, you know, 25% less than what, hold on, that's not 25. It's like 33% less than what you expected. And I would, it would be your best interest, Jonah, to practice having these types of conversations. So again, when you feel very strong, but peaceful. And for me, I don't feel For my faith, I'll just use my examples so people can believe whatever they believe and hopefully you're okay with it. For me, Jesus is the Prince of Peace. So like everything that's peaceful comes from Him, comes from God. Nobody else can give that. So if I feel peace, I know I'm aligned with God. And I know that I'm not being contentious and I'm standing in goodness. It doesn't mean I'm perfect or anything like that. It just means this thing right now, I'm doing my best to be in integrity. And honest and true. So if I can feel powerful but peaceful, I know I'm in a really good place and I will choose my words carefully and I will read the room. And if somebody gets angry, I'll work to diffuse it and just say, hang on, I'm just trying to make sure that we're on the same page. And then the other tactic that I use is I ask questions. I'll ask a question like, did I understand incorrectly? Did you not say that you were going to pay me $15,000 even before insurance?\n00:12:00 - Chona Sweet, DNP\nand kicked in and that's where you have him because he's either going to lie I don't remember or no or he's going to have to admit that he said it and didn't do it and I love questions right i think i think this is mine being very how do i say it's passing i don't want um on confrontation yeah i don't want confrontation i think he may have told me is it okay if i tell me that so it's two months in it i thought he's just going to do it on the first month so it's two months in a row so Mark's opinion is well you know technically this last month is where you really see the patience on your everything on your own it's interesting maybe so mine but this last month is where it's like a very consistent hospital so he said let's see how this goes for next month that's like he said that when when did you say that mark just two days ago and i told him that i get paid so that when the doctor e asked you if it was okay if he could pay you ten who uh last month i mean uh last month when he paid first pay me and did you say did you ask him at the time like do you mean instead of 15 000 period or just i did not that's the thing i was not very clear and so mark things that the third one the third the next one next month should be more consistent right you know again mark reminded me that this is the thing you know we requested for you to have a higher pay we negotiated for you to have a higher pay for the insurance to kick in and so usually insurance doesn't kick in till 3060 days after so you know so one one way that you so going back to you there is a business partner um so and i would say i was a little caught off\n00:14:00 - Tina Marie (profitdriversinc.com)\nguard with the, can I just pay you 10,000? And it's not in my nature to be confrontational. So, you know, and I didn't feel like, you know, I was really fully embedded into the company, and so that felt okay. But I want to know what the expectation is moving forward. And I just also want to let you know, full transparency, that I made a lot more money going over here. So this doesn't make sense for me unless I'm more profitable. And maybe it doesn't make sense for you either. So go ahead and give them room for an outfit. But when you say that, then you say, but I think that this really is most lucrative for both of us once we get going. But in the meantime, you know, I've done this, I've done this, I've done this, go ahead and list off all the things, all the things that you've felt you've given him a relief in. And so I, rather than have an offer. the cuff, you know, renegotiation, that's two to two and a $5,000.\n00:15:04 - Chona Sweet, DNP\nAnd I think we should just have a conversation one more time about what the expectations are until insurance kicks in or something like that. Okay, got it. But overall, I am feeling like the routine is there. You know, I have more routine. Like, I feel like I like what the schedule is. I actually realized that the Monday, Tuesday afternoon clinic is not a lot. I think it's just me not catching up on my notes. That's what it is. That's what I feel. A burden of being behind is tremendous, like it's a compounded way. it's the weekend. Because I feel like I have to do it on the weekend. But now I feel like this weekend we watch football.\n00:15:47 - Tina Marie (profitdriversinc.com)\nMark's here.\n00:15:48 - Chona Sweet, DNP\nI want to let him in. Okay. Yeah, I watch football and I, you know, like, hi, Henry. Oh, there is. Hi, Han. Okay. Yeah, we watched football and I feel so relaxed to the point that I just want to don't bother me. I just want to read Martina's stuff. That's what I did on the weekend.\n00:16:14 - Tina Marie (profitdriversinc.com)\nYou okay?\n00:16:16 - Chona Sweet, DNP\nalready know you destroyed your immune system with antibiotics. Yeah, I didn't even it's three days more than that's it. Mark always flew in the past.\n00:16:31 - Tina Marie (profitdriversinc.com)\nWell, in about 10 years from now, you're gonna have lots of regrets.\n00:16:36 - Chona Sweet, DNP\nTrust me, but it's, it's, you know, it's, I, I know myself and I still work. Like, when I know I cannot get out of bed, that was bad.\n00:16:46 - Tina Marie (profitdriversinc.com)\nLike, yeah.\n00:16:47 - Chona Sweet, DNP\nAnd I know how that feels. Like, I remember getting, they tell her did I go on? Louisiana. Hey, this year, my friend had a, they have a ranch, and Mardi Gras celebration. So I went there and then went back next day, because it's oh my gosh, it was bad.\n00:17:16 - Tina Marie (profitdriversinc.com)\nThat probably hits you super fast, right?\n00:17:19 - Chona Sweet, DNP\nLike, like from the time you first noticed the sentence, you were out. Oh, yeah, my throat is on fire. Like, I've never, I said, what is this? Maybe I have a strepto, and the next day, I would, I unpack my clothes, and I cannot get out of bed. So Mark changed my flight, picked me up, because the ranch is like an hour and a half away from the airport.\n00:17:45 - Tina Marie (profitdriversinc.com)\nWhen was this?\n00:17:46 - Chona Sweet, DNP\nFebruary, this year.\n00:17:48 - Tina Marie (profitdriversinc.com)\nOh my gosh.\n00:17:48 - Chona Sweet, DNP\nAnd then I got home here, and then Mark was like, go to the urgent guy. Went to the urgent here, they did the swab. And then the doctor come in all on full.\n00:18:00 - Tina Marie (profitdriversinc.com)\nIt's like, oh my god, is it that bad?\n00:18:04 - Chona Sweet, DNP\nLike, it's like, you probably feel work, Sarah, and you probably feel work, what did he say? And it's probably still really bad, huh? said, yes, I do, what do I have? Well, I don't see this often. I actually don't treat this often. He said, you have two, like the flu and COVID.\n00:18:23 - Tina Marie (profitdriversinc.com)\nLucky tone.\n00:18:24 - Chona Sweet, DNP\nI know.\n00:18:25 - mark sweet (sweetlaw.com)\nto hijack.\n00:18:26 - Tina Marie (profitdriversinc.com)\nSo what's up? We're just talking about, talking to Dr. E about this discrepancy in the original contract money and where she's performing right now and how to approach that until insurance kicks in.\n00:18:41 - Chona Sweet, DNP\nI told Tina about what you said, honey, maybe next month.\n00:18:46 - mark sweet (sweetlaw.com)\nmean, that would be my assumption because he doesn't get paid by health insurance for usually 30 to 60 days. And part of the whole conversation was, I trying to pay when he had paid the situation because obviously, she's a patient today, isn't\n00:19:00 - Tina Marie (profitdriversinc.com)\npaid today, right? But the other part of the conversation was he would give our minimum of 15,000, right?\n00:19:07 - mark sweet (sweetlaw.com)\nThat was my understanding.\n00:19:11 - Tina Marie (profitdriversinc.com)\nSo my issue is that if you're going to do business, then you need to have clarity. And she said that he approached her kind of with how about I just pay you 10,000. And so that wasn't really, you know, a thorough negotiation that was just approaching children when she's not feeling the strongest anyway at the time, in terms of like performance and everything else. So I think it should be revisited because that's 33% less than what was agreed upon originally off the cuff, probably positioned on purpose as a result of how he was feeling about performance maybe. I don't know. But either way, I think that it would be who her and both of you to have a conversation to make sure that he's\n00:20:00 - Chona Sweet, DNP\nwhere of who he's doing business with not people who are just going to be like oh yeah you know pay me whatever yeah and also today like I went there early at the hospital this is the earliest I've been to the point that this is so funny I haven't told you the nursing staff's like oh you're here early because they used to seeing me at you know after clinic so I go to the clinic person and then which actually works for me I'm an nighttime person I'm not a morning person that's okay that my peak like you said you have a peak time is this time from one to nine to ten is like I can like think anyways so yeah and then I came home and it took doing telemedicine and they called me and said that there's a doctor in Long Beach who apparently they're having issues with and that didn't come in and they're asking for me to cover I see And you know, I already I'm already home. went to the hospital early because my family are here. I adjusted my schedule. I said, I can help. I can do telemedicine on those patients. Yeah, I did. I said the boundary on that one.\n00:21:14 - Tina Marie (profitdriversinc.com)\nGood. How'd you feel about that?\n00:21:17 - Chona Sweet, DNP\nI still feel bad. So I did. So that's why I texted her and says, and then I did hold her the managers. Like, I feel bad. I'm sorry. I can't help. But I went there early and I'm already home. I'm doing my telemedicine. And then I texted her. said, you know, I can do telemedicine on those those patients that are on their day in the clinic. Same thing. I just talked to them on the phone and he's like, it's okay, Dr. E. because the initial reason was Dr. E is in the OR and then it changed to now he's available.\n00:21:48 - Tina Marie (profitdriversinc.com)\nHe can go because I can't.\n00:21:50 - Chona Sweet, DNP\nYeah.\n00:21:51 - Tina Marie (profitdriversinc.com)\nOh, that's not something good. Yeah.\n00:21:54 - Chona Sweet, DNP\nBut yeah. But yeah. Now I feel, I feel good with the. facing now. I feel more even in the hospital, even in a clinic. I even hear myself, like my conversations with my patients would be, I know I am comfortable because I'm joking with patients. Like I'm making it very light, you know, and then I hear them laugh. Like I know they're in pain. It's already a pain clinic, like everyone's in pain, like why not just make it I hear myself like I have an NP that's shadowing me.\n00:22:32 - Tina Marie (profitdriversinc.com)\nSo I'm a teacher.\n00:22:35 - Chona Sweet, DNP\nit's good to hear myself relax. Like you said, like, what's that term that you said? Peace, but you're at peace, but powerful. So that's how I feel now, mostly. Like I don't, I mean, always see there's here in their situation where I feel like I just have to maneuver, but most of the time I feel there.\n00:22:58 - Tina Marie (profitdriversinc.com)\nI want a knee. to understand this because this will have applications everywhere else in your life. This is actually kind of my favorite thing about doing business the way that I do in the holistic approach is that when we learn certain perspectives, tactics, strategies, they have universal applications, they show up in other relationships, they show up in other places in life. That shift in how you feel is because you owned everything. You owned the schedule, you owned the contract, you owned the path, you owned the purpose and so now you're owning time in the clinic. Like the the fact that clinic experience became similar to hospital because like you were happy there and whatever in this short of time and the only thing that happened, it was not external, nothing else happened, is you just bought in and decided for yourself, I am going to be the architect. That was the conversation we had. know that that resonated with you, like you get to create what you want as an experience. Now, what I expected was, you know, maybe less time or something like that. just, you're blowing me away with how fast you're having this switch. I know that it's possible, but most people don't learn this this quickly, Jonah.\n00:24:27 - Chona Sweet, DNP\nSo I know myself that it's the consistency that I know I have to work on every day. So I just need to like really be consistent. But innately, I feel better. I feel like more in control. Like I, that's the switch I think, because obviously three, I kind of like, remember you told me, like give yourself three months, six months. So I'm kind of giving myself, okay, three months this week. So I feel better, like I can.\n00:24:57 - Tina Marie (profitdriversinc.com)\nThat, it's that first 90 day. It's so weird. that it's almost magical around these like three months type of intervals. But okay, so you you said, Oh gosh, what was the word? Because I want to say, I want to add in accountability.\n00:25:14 - Chona Sweet, DNP\nYou talked about ownership and accountability and ownership are kind of the same thing, but it's not necessarily people can own things and not really act accountable.\n00:25:23 - Tina Marie (profitdriversinc.com)\nBut that's really what you did is you were accountable for the outcome for how you feel. And rather than, because remember I asked you a couple of weeks ago, why are you doing this? you're like, even last week, I'm starting to track up time. But you're like, because I have to. I said, but do you really have to? That that was the switch is that you don't have to. So it's the acknowledgement that I'm choosing to. And then you decided to choose, are you're going to show up? But for it to have the emotional impact that it has, that is awesome. And you talked about you just need to be consistent. So the best way to be consistent is to remind yourself of what the opposite felt like. Contrast is my favorite teacher, because you have kind of a before and after you have a this, then not type of anything.\n00:26:24 - Chona Sweet, DNP\nAnd the same as when you told me, like, how would it feel?\n00:26:28 - Tina Marie (profitdriversinc.com)\nRemember this feeling? Yes.\n00:26:31 - Chona Sweet, DNP\nLike if it's not, how would it feel if it's not like this?\n00:26:35 - Tina Marie (profitdriversinc.com)\nOr how would it feel to go back to like, running this?\n00:26:39 - Chona Sweet, DNP\nRight.\n00:26:40 - Tina Marie (profitdriversinc.com)\nBecause I was really, I don't know if I wanted it.\n00:26:42 - Chona Sweet, DNP\nRight. I was definitely driving the charting. But the moment except that, especially the clinic one, the clinic one. But now I am just, you know, I do it at the same time with the patient and definitely being more efficient. It's a balance. being present, making the patient feel that they're seen, heard, know, all these things, it's a balance and not just in the computer me typing and I can type without looking.\n00:27:11 - Tina Marie (profitdriversinc.com)\njust thought of something and I want to point this out too because it has been a few weeks since you've mentioned anything about a language barrier or feeling like you can't write properly or anything. hasn't even been part of the conversation and I want you to notice that because in our lives and we all do as we we look for excuses that we can make to make ourselves feel good about why we're not doing what we can and it doesn't mean that they aren't real reasons. When we use them as crutches friction points valid issues. But when we allow them to become the thing that prevents us from getting to what we want to get to, then that's when I would call them an excuse and a cross for why we can't do things.\n00:28:11 - Chona Sweet, DNP\nAnd you haven't mentioned that for a few weeks. I mean, I still do, especially when I do lean, and especially if I let Mark lead it and Mark would say, honey, tenses, this tenses, you know, but it's what I needed to know to get better. So, and like I have, I was actually telling you last night, I was reading the notes that the N.P. that I am training. And she also have a lot of, you know, tenses problems. And I am, I need to identify that that's good, I'm getting better. And hopefully I can like help her too. But. Americans are the same as you trying to learn other people's languages because it's so Yeah, no, I feel good that it all there's a lot of feel good and, you know, experience. ends and I take that the negative ones I just let it just go like I have a patient today she's grumpy and he's asking me I don't he's she's mad because I decreased her medication because she's embarrassing she had an episode that she stopped breathing because she took all the in the hospital so and I told her I have to decrease this medication and I found I noticed myself that I'm more assertive not necessarily aggressive especially with narcotics I have to be I cannot you know yes you can make that decision too but I have unfortunately for narcotics like we have to start coming off of this because you're going home like that's the line I have to tell them so I feel I'm comfortable with that because it is my experience that's kicking in but anyways the patient told me that the answer is like the of any constipation I just want to make sure she's not constipated with the right he said you know you know I have Crohn's right yes and Crohn's could be both constipation and diarrhea. Right. Yeah, it's like, because that's a stupid question. That's what I showed. So again, I did not knew, like I've had patients like this. In the past, yes, it was bothering me, but now it's like, OK, well, I will leave everything the same. OK, you have a good day. So I just left, and it doesn't, and the ones, the when ones would be like, the patients would say, I want to follow you or your clinic. So I would give them my card. it's a good feeling, like, but you live in North Ridge, like, it's far. It's like, that's fine. I will see you in Huntington, fish. Like, it's a good feeling to have. So yeah, definitely the ego booster, like, OK, I'm I feel good, like, somewhere else.\n00:30:43 - Tina Marie (profitdriversinc.com)\nThat's, that transition is amazing, that you were able to get something similar to how you felt about the hospital with clinic patients. I mean, but that, all of it was you. Every single part of that was inside of you. You made that happen. So remember,\n00:31:00 - Chona Sweet, DNP\nwe also talked about probably a couple months ago just you being the author of your own story and you having the power like we've used architecture but author and it's important I think sometimes to just kind of visualize it just just to remember how powerful you are in creating everything around you the way that you want to and especially when it's you know when you're looking to be of service rather than just like then as if everybody but like right not to get what you want but also give I think that that's amazing so yeah giving something and getting something because I'm giving it the best feeling because I know that I'm helping with their pain but I have patience that the other day was crying because I'm really really grateful is like yes I take that yeah before I'm like oh and I'm worried about I'm like yes yeah I am they give it like in my head like give it to me yes I will because we need that we need to know that we're a value more useful and we need to know that the\n00:32:00 - Tina Marie (profitdriversinc.com)\nwork that we do matters that it's recognized that and it's reciprocal you right probably like look how you're so kind to me and you're so like thank you so much I appreciate you so much like I need that we we all need that so you give and you get right even reciprocity is huge right so I think that in terms of just like how you're showing up on a technical level please keep reporting the wins because that means that I know that you're observing it right thinking about what you're doing why you're doing it how you're doing it so it's a very simple system to keep us on track of growth and evolution on on a technical operational level right so then now we can start kind of getting into what is the system for getting new clients and starting to work the business angle of things because I know that well let's see the the the marketing kind of growth angle of things and operationally, functionally, you're on that and we can just kind of keep massaging and nurturing that as we go. So, and I don't know how much Mark can be here for that type of conversation.\n00:33:13 - Chona Sweet, DNP\nI mean, Mark introduced me to a couple of people, really the only thing that have a, what's the term, not a return, but after the meeting, after the Mark introduced me, is really have us. He gave me two clients, but other than that, I didn't, I don't have any, but again, I think it's too early. I don't know. I know Mark says that he is holding on to Christian, group, right, honey, like, you're supposed to reach out to Loretta. Yes, yes, that one. So, okay, I wanted to ask this because this is something new, well, new-ish to me. Reina is a chiropractor that worked with Mark, right? Are Reina, he has a wife that also they're, would you say, the office manager? Is he the office husband and wife with the car. Jaden and I have become friends because I met them through Mark. It's hard, I'm having, again, this is the business and switch that I haven't really familiar with. I don't know how to kind of navigate with her that hey, give me a client. But at the same time, also because with the friendship there, I feel a little weird about it, especially we haven't seen each other since April. And we keep on planning on seeing and it doesn't happen. And I know, you know, she would say, oh, I'm seeing you like, I just don't know how to approach it. Like, I feel weird about it. When did the business say, like, I know, like, ask? Mark, ask. He's her husband, Aretha, the chiropractor, and Aretha said yes, but I have to also reach out because it is my business.\n00:35:08 - Tina Marie (profitdriversinc.com)\nSo, there's some things that you can consider and you'll learn different approach tactics and styles, and you'll learn them according to the different relationship dynamics that you have with people. But one thing is, if you have a friendship with somebody, don't we always want to do nice things for our friends, for the most part? Right. if you know you're going to be taking very good care of people, it's not just a favor to you, it's something good for their patients as well. And something that their patient is going to thank them for. Hey, thank you for referring me to Donna because she is so sweet and funny and made me feel comfortable and all of that. to remember that you're not asking for a favor or a handout, you're asking for something that serves everyone. And so approaching it could be, hey, you know, just updating her in the way that you're operating now, like, this is the thing that I'm doing. I'm really getting into pain management and well, you've been in pain management, but into personal injury and taking care of these patients and you feel like you're hitting a stride and you have a goal of really focusing on personal energy or injury. And, you know, just let me think about the words because my brain just went on the door. But, okay, so what is her role?\n00:36:52 - Chona Sweet, DNP\nIs it her husband or her or her husband and the chiropractor? And she, would you say, I'm the office manager?\n00:37:00 - mark sweet (sweetlaw.com)\nSo most of his are small like just a couple of people and it'd be okay, so they work she works with them Operations he's the actual like position. Okay, a lot of those Providers.\n00:37:14 - Tina Marie (profitdriversinc.com)\nYeah, so and how do they choose who they're gonna send people to visit a location like proximity?\n00:37:21 - mark sweet (sweetlaw.com)\nSo there's a couple of different ways Some attorneys will say you need to send it to this doctor because they have whatever relationship or you know reductions worked out Others they can just refer it out to So usually you're gonna pick doctors that are nearby you or we'll get them in sooner Okay, so one thing one of the pitch could be you know, hey if you have any patients that are you know in this area Also know that like I've got lots of room in my schedule so I can see people quickly especially if you've got something urgent Or I can do telemedicine too, and when they need procedure then I can bring them\n00:38:00 - Chona Sweet, DNP\nin to the clinic.\n00:38:03 - Tina Marie (profitdriversinc.com)\nYeah. And so, um, I would just say, like, look, I'm just looking to, to grow my client base, but, um, I also really enjoy doing what I'm doing. And I enjoy how, like, I really care about my patients. I'm having fun, but, um, you know, it doesn't grow if I don't put some effort into growing. So I thought I would let you know. And if that's something you'd be interested in discussing or there's a way that I can serve and help you, then let me know. But also, aside from that, still would love to visit with you and catch up and this, know, just, just to be aware of, like, hey, this is not the only reason I have any interest in you. Right. know, so you have to, I don't know how much of that is true, not true, whatever, but those are the things to think about is, is remember that there's real benefit. And it's benefit to everyone. So there's no reason not to ask. Um, if we don't ask, the answer is no.\n00:39:03 - Chona Sweet, DNP\nYeah. And also, like, I'm thinking, I realize, as you, you were talking, I think I need to dedicate one day a week, doesn't have to be this year or like next year. I don't know. I need to have something where I dedicate to visit the lawyers or the chiropractor that is in the right hand.\n00:39:27 - mark sweet (sweetlaw.com)\nwhat you're doing.\n00:39:28 - Chona Sweet, DNP\nYou're seeing them in person.\n00:39:29 - mark sweet (sweetlaw.com)\nAnd so you need to go and meet the people, you need to go make the phone calls and only do introductions. And if you don't follow up, if you don't go to events, if you don't do these things, then there's only so much a red engine in will send you everything they possibly can. All you have to do is ask and tell them what to do.\n00:39:47 - Tina Marie (profitdriversinc.com)\nRight. Your personality at events like that, like he's talking about, it'll, it'll happen pretty quickly. What you have to show up. Yes.\n00:39:56 - Chona Sweet, DNP\nThat's what I need to do. are me not to show up on that. That's a recent event. We have to tell Tina about that recent event.\n00:40:04 - Tina Marie (profitdriversinc.com)\nWell, okay, so even regardless, you're still new, like you just hit your strike. So you don't want to grow your marketing when you haven't stabilized your permit. And you basically just got there.\n00:40:21 - Chona Sweet, DNP\nSo anything in the past that's not concerns on the choy group that I feel like, in a way, Mark is kind of threading lightly in the doctor pain doctors in that group because I think he's concerned. Why don't you say Han? Can you just say?\n00:40:51 - mark sweet (sweetlaw.com)\nI mean, the issue is with part of chiropractic groups, like the choy group, there's a lot of pain doctors.\n00:40:57 - Tina Marie (profitdriversinc.com)\nThere's more every week.\n00:40:58 - mark sweet (sweetlaw.com)\nAnd so obviously, It comes to us, you know, mind our business, like, aggressively coming to us wanting our business because Okay, so it's an intermingling of a particular thing that's really strong me because I just say, look, we don't send our cases to China, which is mostly true. We really don't unless there's a really good reason, but, you know, it makes those doctors a little bit more in the fence, which makes me think, be directly and personal hit.\n00:41:27 - Tina Marie (profitdriversinc.com)\nOkay, so not every event is applicable, not every group is fine.\n00:41:32 - mark sweet (sweetlaw.com)\nYes, but go to anything you haven't showed up to stuff then.\n00:41:36 - Chona Sweet, DNP\nYeah, because they might think that Mark is gonna send all the cases to me, to our group, because I'm his wife, but there's a conflict of interest, but he has to, I feel bad in a way that Mark has to explain that to No, everyone, like, you first of all have to get out of the habit of feeling bad for things.\n00:41:58 - Tina Marie (profitdriversinc.com)\nYou're a big, you grown up people doing it. Yes, so it's okay.\n00:42:03 - Chona Sweet, DNP\nI don't know how to approach that. And because we have a toy call every so often in a week and they know that a toy already said, you know, I mean, pain management.\n00:42:13 - Tina Marie (profitdriversinc.com)\nSo, well, I mean, are there other events and things that you're not doing business with Mark?\n00:42:18 - mark sweet (sweetlaw.com)\nThere's a low hang fruit, which means she's already, there's already these patients coming through from Dr. E stuff or whatever else and part of the deal with Dr. E is he's like, I'll just pay you on everything instead of trying to figure out who's I don't even know if that's true, by the way.\n00:42:36 - Chona Sweet, DNP\nWell, that's what you heard.\n00:42:38 - mark sweet (sweetlaw.com)\nmean, you to have a conversation, but let's just put that for a second. You have access, generally speaking to see what lawyers are attached to what cases. And that Dr. E does not see. And that is a really, really easy area to potentially reach out and grow that relationship of. We're going to get you reports and bills and 48. Of course, we're going to do these things that help separate you a little bit.\n00:43:04 - Tina Marie (profitdriversinc.com)\nSo one thing that we have Fuji doing now is he's spending two hours a week reaching out to people who have sent him cases in the past and we are ranking them. We talked about this last week, I think, ranking them according to. So we track all the doctors, all the cases that have been sent, the date of the most recent case and the date of the most recent contact with them, sending them, he's sending door to acting like that. Well, my point is creating, first of all, you have to establish the network, right? having a conversation and maybe it's something, maybe you attend events by yourself without art, maybe you take somebody else with you as a wing person, you know, if you don't want to go by yourself or whatever, because it's social, but- I can, you know, I'm introvert, but I can, I mean- I would say you're probably more ambiverr.\n00:43:58 - Chona Sweet, DNP\nYeah, no, I can.\n00:44:00 - Tina Marie (profitdriversinc.com)\nand do it. It's just maybe not too hard are not doing all these things that you're doing. it could be like, I'm all on, but then I don't want to talk to anybody for three days.\n00:44:08 - Chona Sweet, DNP\nBut that's what I was saying to you is that's exactly what I was thinking. I just you just say it. Like, I was thinking of dedicating one week, one day a week or a couple of hours, for example, Friday or something.\n00:44:22 - Tina Marie (profitdriversinc.com)\nI don't know.\n00:44:22 - Chona Sweet, DNP\nI don't know.\n00:44:23 - Tina Marie (profitdriversinc.com)\ndon't might find that it works better to do like an hour, two or three days a week or like a couple hours or hour and a half, whatever. At minimum hour, throughout the week, because what you'll find is that there's a rhythm to other people's schedules and you'll learn to tap into it, then you know, maybe it's around lunchtime, maybe it's around the end of the day, maybe it's a Tuesday or a Thursday rather than Friday. You know what I mean? Like, you'll find a rhythm. But if you're not moving your call and contact times around, you won't find what that kind of good thing is. Also, you can pay attention to intuition. because I really believe intuition is powerful, like if you get that feeling like, you know what, I should have reached out to so-and-so, reached out to so-and-so.\n00:45:06 - Chona Sweet, DNP\nI don't know if I told you to have a case manager, apparently his right hand, and her right hand. I think he's very nice. So I told her I wanted to go see her in the office, and she said, oh, you going to our Christmas party in December, something I forgot? And I think it's a day that we're leaving. But yeah, no, I think I'm trying, really think, I mean, no rushing that relationship. I would text her and say, hey, can I call it? So every time we talk, it's very like this, it's very like we, you know, we talk about, but here's, hey, that's what remember the trigger point I did for the point that's theirs. That's awesome. And then I did it that day, and I turned it in less than 24 hours.\n00:45:48 - Tina Marie (profitdriversinc.com)\nYeah, so like Mark said, the way that you stand out, first of all, is going to be your personality and your energy. It's awesome. Not everybody is awesome. Most people suck. I'm just kidding. Right. That's just how it is. But when on top of it, you communicate clearly, you set expectations of this is how I'm going to take care of you. And then you do what you say you're going to do. And you actually take care of them according to those expectations. Then there, know, it's a Pavlovian response, right? I talked to Chona, number one, I feel good, two, I know my patients are going to be taken care of. And three, I don't have to worry about any of that. So you're going to train them on that response. But the thing that you have to remember is that has to be consistent. The first time you break that habit, you lose that Pavlovian response that responds to you. But you can engineer it. It sounds manipulative and bad, but it's not. It's like I just choose to be this type of person and show up at this person. I'm conscious of the reward for showing up as this kind of person. So,\n00:47:00 - Chona Sweet, DNP\nYes you remind me like I want to message them like happy holiday.\n00:47:04 - Tina Marie (profitdriversinc.com)\nYes. Yes. And so something that you might do is like set a note for yourself or a reminder for yourself because it's very easy for that to not be top of mind and then for you to remember at a time when it's not really a powerful time, right? they're personal time and you don't want to do it then or it's too late at night or too early. You know what I mean? Like you so so make sure that you have some kind of reminder system when you get a thought in your head. This is who I need to reach out to and nurture but aside from nurturing with the amount of contact you have right now being so small, you need acquisition as well as nurturing, right? So look, have conversations about events, about places you can go where you can meet people and kind of balance both of them out. So new people can get very overwhelming. It's very difficult. to manage a lot of new relationships well because you really have to get to know people. There's a lot to remember. And that goes back to the same thing as how difficult it was just getting started in the clinic. was new people, new patients, new processes, that stuff fries your brain. So you want to kind of put everything in certain boundaries, right, so that you're not exceeding your mental capacity for learning new things because you're still going to be learning new things operationally. Don't learn too many new people too fast.\n00:48:34 - Chona Sweet, DNP\nPace yourself. The terminology, like I honestly, the defense, know, like the terms of money. There's a lot of personal injury term. I'm still trying to understand. I know the limits. I'm learning that and but still.\n00:48:52 - Tina Marie (profitdriversinc.com)\nYou may also want to keep like a little spreadsheet of terms and what they mean. And so when you ask them, just put it in Google Docs, which you can open up from your phone or a note, but I would use Google Docs because it's really easy to just write them. It's the kinetic effort in memory that's just going to help you retain the memory better so that you understand it. But also, if you put it in your own language, it's the same reason why they had us write out vocabulary words because actually doing it, you know, retain it better. So, if you want to have to struggle less mentally, right? Less mental fatigue, less mental lag time, effort, drain, whatever, you know, use little systems like just writing key things down. If this word comes up and it's important to know and it might stall you in how you have to handle something because you don't fully understand it, it's for taking the time to write down to get clear on. For me, if I have to get clear on a new concept, I got to ask like a question this way, this way, this way, and this way and kind of triangulate what it means because the scenario will show up differently at different times where the same world applies, but maybe I didn't recognize it because it showed up a little different. So I asked questions from multiple perspectives when I'm learning something new so that I really wrap my head all the way around it.\n00:50:26 - Chona Sweet, DNP\nI will, you know, again, I know I have bouts of energy and I know that the consistency, I just need to be consistent, but I have a lot of ideas and I, not ideas, but plans, but it's just, it just have to follow through, like I need to make sure that I attend events with or without more, probably better without because I know that I need to just be able to just do it on my own. I just don't know how to, I don't know, but should I introduce like I'm new or no, I don't\n00:51:00 - Tina Marie (profitdriversinc.com)\nI feel when I say new, I already feel my confidence coming down. No, no, no. So I'm growing. I'm growing a business or something like that. No, what advice?\n00:51:14 - mark sweet (sweetlaw.com)\nYou guys are now opening your practice to take PI where before you.\n00:51:17 - Chona Sweet, DNP\nThere you go.\n00:51:18 - Tina Marie (profitdriversinc.com)\nOkay.\n00:51:18 - Chona Sweet, DNP\nPerfect.\n00:51:19 - Tina Marie (profitdriversinc.com)\nSo I'll make sure to do that and then or expanding rather than opening.\n00:51:24 - mark sweet (sweetlaw.com)\nEither one. Yeah.\n00:51:25 - Tina Marie (profitdriversinc.com)\nI think actually expanding specifically just doesn't necessarily make it feel so new.\n00:51:30 - Chona Sweet, DNP\nOpening could still feel new.\n00:51:32 - mark sweet (sweetlaw.com)\nYeah. The reason for it is to underscore another one of the special things, which is they're clean because most of their experience has been with health insurance. Yeah. And from everyone else.\n00:51:43 - Chona Sweet, DNP\nLess than 10 percent.\n00:51:45 - mark sweet (sweetlaw.com)\nthese from them like last night, like this is what I get slammed at three, four or five times a day from like pain doctors of we can get you in this state where you're gonna have reports in two or three days. Like this is what everyone's doing. So how do you stand apart?\n00:51:58 - Tina Marie (profitdriversinc.com)\nSo.\n00:52:00 - mark sweet (sweetlaw.com)\nGrowers it's this is what you think about me.\n00:52:03 - Tina Marie (profitdriversinc.com)\nYes, so to that point though and to the point of getting fluid with it this might sound corny but role-playing and just kind of having these conversations with Mark a few times and he's smart enough to be able to switch it up and you know play a different persona, ask you some different questions, you up or whatever but same thing with driving right it's that experience of that muscle memory of your lips forming those words and brain doing that if you practice it several times when you go get there you're going to be more comfortable doesn't matter that it's not Mark the scenario in the conversation will be familiar enough that you will be able to flow through it and that confidence is a huge selling factor when you can speak clearly with confidence and you can hit all the points that he's talking about that makes a difference to them it will resonate. with them powerfully and also clearly which means they will probably remember it and remember you and then the other thing is you always want to wrap it up with a call to action like something specific here's what I want you to do and that might sound like that's pushy that's whatever like so if you have a patient in this zip code right or if you have a patient that needs to be treated in 24 hours or whatever call me here's my number I will get to them with an X amount of time right so first you gave them who you are what you do what the benefits are working with you why you're different here's what you need to do when you need me here's how you get a hold of me and a reminder this is how great I'm gonna take care of you right right now I'm yeah because imagine you're that person and you've got a need that comes out from time to time and somebody hits you with that and they told you All the things that you want to hear about what you're going to need when that time happens and then they tell you Reach out to me. They give you their contact info, and then they remind you like how great it's gonna be you're gonna be like You're thinking about that person.\n00:54:15 - Chona Sweet, DNP\nThey're on your mind So did I tell you that when um, I don't know I just remember On that lunch event with the attorney, did I mention that to you that I was able to get the phone the contact info of the office manager the case manager, right? And then the I really milk on the fact that it was Filipino. It's like another Filipino There's two of them so I reach out to them and I talk to them for a long time and they gave me that info and and the Filipina says So you're marketing for them. It's like no, not I'm I'm an expectation, was like, oh, okay.\n00:55:03 - Tina Marie (profitdriversinc.com)\nThey thought I'm marketing. So I feel like, no, this is my business, I'm partnering with Audrey, but this is my business. And that ownership, especially if you're talking about to people that you have any kind of bonding with, whether it's nationality or beliefs or it's another woman or whatever.\n00:55:23 - Chona Sweet, DNP\nI'm a person, I will not to manipulate, but in a way, yes, but I genuinely wanted to kind of.\n00:55:32 - Tina Marie (profitdriversinc.com)\nI don't think that that's manipulation. Yeah. I mean, I think that that's the nature of camaraderie, like when you, you're, you're, you're another country that's technically, you know, American, but still like, yeah, I'm happy, I am happy, especially not in the hospital, because all of us are, they're they're so nice. Do you like Joe Corey?\n00:55:56 - Chona Sweet, DNP\nOf course.\n00:55:57 - Tina Marie (profitdriversinc.com)\nOh my gosh. He cracks me up.\n00:55:59 - Chona Sweet, DNP\nSo he's like everything. but he's a nurse or a doctor laughing that's why when I see the um I see the um what to call that when I see in another field like in a lawyer like I'm happy I feel happy but yeah no I'm well and they feel that way so I just I just don't want you to feel like you're being manipulative you're that's true joy that you had I am sure right no I'm happy to like we're talking our language right away right let's talk a lot right yeah I really pick someone right why not you it's not manipulating it's going to pick a doctor why isn't yeah yeah if they don't like you like it it didn't like you whether you're Philippine or not they're not going to go with you so yeah yeah right yeah but you're very cool I just very I just really need to you know like you said have doctor how doctor for just doing like foster nourish that what's that time that you like that relationship, I need really need to know.\n00:57:03 - Tina Marie (profitdriversinc.com)\nSure, you could think of like just massage, but manage like just being intentional about it and but scheduling time and being intentional about it. So what I would like to see you do, you know, this is holiday week, so whatever, but when you're thinking about it, I want you to talk to Mark, you know, figure out what events you might be able to go to and go to separately, or one of you, but whatever. Something that is for you. Okay, so I want you to think about these two tracks, one acquisition and two nurturing, right? that's more like retention, but it's also just getting as much out of each one as you can. But I need you to always remind yourself so that you don't feel icky about it, because it's very easy, especially for women to feel icky about marketing or selling themselves. that you care about your patients, you take good care of them, you show up in a timely manner, you're watching out that they're not abusing their drugs, you're watching out for drug interactions, you know that not every doctor is looking for drug interactions. Some of them are out there killing people because they're not paying attention to their records, you're paying attention, they're, you bring everything to the table, Jonah.\n00:58:25 - Chona Sweet, DNP\nI just realized that I can actually do the luncheon on my own, right, hun? I know I'm not the anesthesiologist doing the procedures, but I can do the lecture that they're doing because I can actually say I don't have my anesthesiologist here to do procedures because they're working and you want that in a doctor to make sure that they're busy. I don't know, that's how I'm going to play it because they're not going to be there in the luncheon, I can be there and I can give the lecture, right hun?\n00:58:56 - mark sweet (sweetlaw.com)\nI don't think they care enough whether it's the anesthesiologist or you. We drink with you.\n00:59:01 - Chona Sweet, DNP\nYeah, they just like the food.\n00:59:02 - mark sweet (sweetlaw.com)\nThey just like that.\n00:59:03 - Chona Sweet, DNP\nI don't know what the luncheon learn is. So I'm just the lunch and learn is like we like what we did with this attorney we just law firm. We get we have a provided them lunch at that one is Persian food. It's a Persian firm Persian white firm.\n00:59:19 - mark sweet (sweetlaw.com)\nIt's an upper.\n00:59:20 - Chona Sweet, DNP\nArmenian?\n00:59:21 - mark sweet (sweetlaw.com)\nNope.\n00:59:22 - Chona Sweet, DNP\nYeah. Then why do we order Persian food? Well, anyway, that's Dr. E who ordered that. But lunch and then while they're having lunch, then we talk about our practice and say these are what we offer. These are the procedures that we can do for your patients. And I can answer those questions. Like I'm not the one who do it, but I know it. I know it.\n00:59:45 - Tina Marie (profitdriversinc.com)\nSo I can do that. That's all they care about.\n00:59:47 - Chona Sweet, DNP\nCan you get them the information they're looking for? Yeah, so I can do that. I don't need Dr. Eda because he may or may not show up anyways because he's always busy.\n00:59:56 - mark sweet (sweetlaw.com)\nThe things I care about is can I get my building records quickly? Are you Commending procedures and how hard are you to deal with on the back end. Those are their three. Yeah, our buildings We don't have other was that term that you send you don't sell But the reductions have to come quickly and make sense.\n01:00:14 - Chona Sweet, DNP\nNo, it's not our lean. What is that thing? We don't have a third party.\n01:00:19 - mark sweet (sweetlaw.com)\nWe don't sell your papers.\n01:00:20 - Chona Sweet, DNP\nWhat it is. Okay, so we do our own billing Again all the time when you get that stuff from him write it down. Yes You you need to have some note cards anytime.\n01:00:32 - Tina Marie (profitdriversinc.com)\nThere's a conversation or on your phone like an iPhone note with a clear title These are the benefits of working with us. So anytime mark says this is what they need to hear and they want to know write it down This is the difference between taking six months to a year to getting really good at pitching delivering getting those referrals growing your business It's the details of how well you capture and You and memorize and then master the delivery of the points and the benefits of working with you. And then that's how you leapfrog their faster. It's just really good at understanding and then communicating it clearly, confidently, powerfully, and then following up with exactly what you said you'll do. The thing that will gain you and lose you business the most is whether you do or do not do what you say you'll do.\n01:01:33 - Chona Sweet, DNP\nExactly. In this doctor and in this law firm, one of our assistants surely says, we give you the notes in 24 hours. In my head, it's like, that's not the practice right now. That's not how you guys operate in my head. And the doctor followed it by, this is why we all the playing patients. So, I mean, I only see what they give me and Dr. E. So I'm in charge on that and that's what he needs right now. He needs someone to because he's super busy.\n01:02:10 - Tina Marie (profitdriversinc.com)\nBut remember that your focus is showing up to be a business partner rather than an employee and a helping right he can hire an employee.\n01:02:21 - Chona Sweet, DNP\nSo just remember that you're always aware of dynamic and the partnership and what you're really therefore you're not really there to be Dr. E's right hand and support person right or there to grow Chona's business and make it kind of feel like that it feels that way every every issue with that for example new doctor he cannot prescribe yet through our system. I'm always included in that email like they and they will ask me to can you find I can help people once in a while but I can't be reason why I'm not in for you best.\n01:03:01 - Tina Marie (profitdriversinc.com)\nI was just wait, wait, what did you say because I want to make sure I heard it right?\n01:03:05 - mark sweet (sweetlaw.com)\nFor right now, that would be a good reason to apply to increase what he's paying her per month.\n01:03:11 - Tina Marie (profitdriversinc.com)\nRight. that's exactly what I was going to say. Like that level of responsibility, leadership, the value that you're bringing. Where's my 15,000 on me? You earned it. You're earning it already. So that's the thing I've said a few times, but you really need to understand what is the value that you bring to the table? What doesn't exist without you? You've already brought a lot of that and it helps his reputation, but it also helps his stress levels and it's confidence knowing that it's being taken care of. So you need to remember that and you need to know that there's a real monetary value, number one that he's obtaining from it. And then you can obtain.\n01:03:58 - Chona Sweet, DNP\nSo, yeah, you'll have that.\n01:04:00 - Tina Marie (profitdriversinc.com)\nconversation and let me know how it goes.\n01:04:02 - Chona Sweet, DNP\nRight, we'll do. I mean, yeah.\n01:04:06 - Tina Marie (profitdriversinc.com)\nAll right, we're in holiday mode and I've got a child that's waiting for me. So, thank you so much. Happy holiday. You're welcome.\n01:04:16 - Chona Sweet, DNP\nHappy next week.\n01:04:18 - Tina Marie (profitdriversinc.com)\nYes. Um, can we start meeting in the daytime?\n01:04:22 - Chona Sweet, DNP\nYeah, I think so. This Wednesday, you want to do it on a Wednesday? This is like the good time for me.\n01:04:29 - Tina Marie (profitdriversinc.com)\nYes. Um, I'm pretty sure that it works for me as well.\n01:04:33 - Chona Sweet, DNP\nHoly crap. No, no, I was just realizing next next Wednesday is my Oh, I'm sorry. Next Wednesday. I am. Yeah. Next Wednesday. I, um, I have an orientation at the hospital. I already started like all the new doctors come in. It's like the orientation.\n01:04:56 - Tina Marie (profitdriversinc.com)\nIs there a time that works for you next Wednesday after like 12 o'clock?\n01:05:00 - Chona Sweet, DNP\nYeah, after 12 o'clock. Yes, cuz there are orientations at 8 30. I think it's just the morning. I 12 30 one o'clock. Yes, one o'clock should be good. Okay, so I'm gonna move this Oh, this one is eight o'clock to 11 30 so What I Just want to make sure 30 It's two o'clock to eight for you.\n01:05:36 - Tina Marie (profitdriversinc.com)\nThe reason why I said I plan to round with my patients out there So it kind of depends cuz okay, I might be picking up daughter from school at that time I Okay, bye Mark. Happy Thanksgiving.\n01:05:58 - Chona Sweet, DNP\nDon't you hear me? Do you want this six?\n01:06:02 - Tina Marie (profitdriversinc.com)\nIs it two?\n01:06:04 - Chona Sweet, DNP\n11 Oh, I'm sorry. I'm sorry. We're talking about Thursday. What is the day today?\n01:06:12 - Tina Marie (profitdriversinc.com)\nToday's Wednesday. Yeah the Ford I have a Orientation in the hospital from 8 30 to 11 30 And I plan to round on my patients worth these one and a half two hours You know what so 230 I could do because if I do go get a school then it I'll be home by then okay to 30 30.m.\n01:06:38 - Chona Sweet, DNP\nSo December 4, right?\n01:06:40 - Tina Marie (profitdriversinc.com)\nYes, and I will I'm saving it so it should Okay, perfect and then the week after that do you want to make it for Like one o'clock and then if we have to move it we move it or do you mean you mean for wish day?\n01:07:00 - Chona Sweet, DNP\nWe'll be forward on Wednesdays. Oh, but on Wednesdays, let's see. So that would be the 11th.\n01:07:08 - Tina Marie (profitdriversinc.com)\nYeah.\n01:07:09 - Chona Sweet, DNP\nOkay, 11th. Um, we have dinner that afternoon. Yeah. I mean, do you want to do it at the same time or?\n01:07:16 - Tina Marie (profitdriversinc.com)\nYeah, well, I'm asking, um, if we could do one o'clock because then I'm done. her up.\n01:07:22 - Chona Sweet, DNP\nThat's okay too. Because I'm going to try to. Hi, I really, I want, I know I'm an after person, but I get so much things done if I start really like today. I just, and I feel better like, Oh, okay, I'm done.\n01:07:40 - Tina Marie (profitdriversinc.com)\nSo, and that'll be a good way to finish your day because you'll be mostly through the week, you'll have lots to report, but then you also have a little bit of time before the weekend.\n01:07:51 - Chona Sweet, DNP\nSo any like assignment I give you about some time to think about it. I know we're leaving for Japan. know that 11, 12 is our marks Christmas party for the staff, so we go we leave for Japan 14 till the 29th.\n01:08:09 - Tina Marie (profitdriversinc.com)\nOkay.\n01:08:10 - Chona Sweet, DNP\nUm, so yeah. Okay, so we, I, I, by the way, I asked them to give me telemedicine.\n01:08:16 - Tina Marie (profitdriversinc.com)\nOkay.\n01:08:17 - Chona Sweet, DNP\nI want to, I mean, if I'm, you know, rather make some money while I'm, I mean, I just have to wake up and that's how Mark is over there too. Like he's awake at 5 a.m. I know working and I'm fine with him.\n01:08:30 - Tina Marie (profitdriversinc.com)\nI've been working with him for three and a half years, so I know he doesn't really take weeks off.\n01:08:35 - Chona Sweet, DNP\nOkay. So yeah, I would rather earn, make some money too. Like I, that's fine with me.\n01:08:42 - Tina Marie (profitdriversinc.com)\nDuring those weeks, um, since you're not going to have like a crazy schedule or anything, we, we, um, we might be able to meet and talk. Otherwise, let's just do making a strategic plan for events and.\n01:09:00 - Chona Sweet, DNP\nanywhere. That's what I was thinking, like I really want to. I don't like social gatherings, especially, you know, but I can talk enough. I'm comfortable talking to people and them talking to me.\n01:09:17 - Tina Marie (profitdriversinc.com)\nSo put it in the same perspective as you don't like getting up in the morning, but it's an end means to the end that you want, right? And it's like this, right?\n01:09:27 - Chona Sweet, DNP\nThere's just this small chunk, you've gotten through it, and then you get what you want out of it.\n01:09:31 - Tina Marie (profitdriversinc.com)\nSo nurturing those conversations once you've made them is not as difficult, right? Because mostly that can be done and it's not big gatherings. It's more personal, more intense.\n01:09:41 - Chona Sweet, DNP\nAnd even if it's like big gatherings, like, you know, I've been, you know, being with Mark, I've been with gatherings, although we always joke that I'm his accessory.\n01:09:53 - Tina Marie (profitdriversinc.com)\nI mean, kind of cute.\n01:09:55 - Chona Sweet, DNP\nI'm an expensive accessory. So yeah, no, I get to do that, but I know that I I'm definitely feeling more. I'm not just confident. I'm feeling more what's a term. I don't know that I cannot think of the term, but I'm more motivated to we need to I want to make I not one. feel like I need to make this work. Like I want to I want to make, you know, good money too.\n01:10:27 - Tina Marie (profitdriversinc.com)\nYes. Yeah. okay. So for me next week and then you'll be on vacation for a couple of weeks.\n01:10:35 - Chona Sweet, DNP\nthen what was you?\n01:10:36 - Tina Marie (profitdriversinc.com)\nSo the next Wednesday is January 1st, which is not the first day.\n01:10:42 - Chona Sweet, DNP\nOn that week, if you want, we can move it to like, I'm okay doing my first, but I know you're, you know, you need to spend time with family.\n01:10:51 - Tina Marie (profitdriversinc.com)\nUh, yeah, but my kids will sleep in a lot and it's it's nobody deal holidays are they're they're kind of mellow not the\n01:11:00 - Chona Sweet, DNP\ngirls are bigger.\n01:11:01 - Tina Marie (profitdriversinc.com)\nThey're teenagers and they sleep a lot.\n01:11:03 - Chona Sweet, DNP\nYes.\n01:11:04 - Tina Marie (profitdriversinc.com)\nOkay, so we've got a plan and thank you so much. Happy Thanksgiving. Happy Thanksgiving. Bye, Tona.\n","contentPreview":"00:00:03 - Chona Sweet, DNP\nHello. Hi. I can't hear you. muted. Okay.\n00:00:08 - Tina Marie (profitdriversinc.com)\nI'm so bad about that.\n00:00:09 - Chona Sweet, DNP\nHi.\n00:00:10 - Tina Marie (profitd...","processedAt":"2025-05-04T03:40:52.517Z"}