{"fileName":"Transcript for Maria & Tina🪄(9).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Maria & Tina🪄(9).txt","type":"transcript","priority":"medium","content":"00:00:00 - mariagudelis (Maria Gudelis)\nHi.\n00:00:01 - Tina Marie (profitdriversinc.com)\nHi.\n00:00:02 - mariagudelis (Maria Gudelis)\nHow are you? I had to feed the animals. The animals. Yes. Oh, my God. My nephew was so amazing. He went back to Guelph, which is about two hours away. He just got back from two months in Europe. He graduated, and he took a year off before applying for a master's program. But he's going to do his little side business cleaning people's eaves troughs. And he was so cute because last night he was asking me all these questions so we can rank on page one of Google. So I was given everything to do. They said, I'm going to clean your e-shirts. Well, I'll pay you. You said you're going to charge $150 per house. No, you gave me so much free information. I'll do for free. So he came over dinner for free. I took all these pictures and videos of them so you can use Google Business listing. And then when I left and I came back, he had also filled up five bags of leaves because we have lot of leaves from the fall. So I sent him a hundred bucks. Aww.\n00:00:56 - Tina Marie (profitdriversinc.com)\nHe's a good kid.\n00:00:58 - mariagudelis (Maria Gudelis)\nHe's a good kid. Yeah. How are you feeling? you've had lot of meetings and you were gonna grab something to eat before our call.\n00:01:04 - Tina Marie (profitdriversinc.com)\nI grab something to eat. feel like I have something and my teeth is driving me nuts but I'm good. My kidney hurts a little bit but I have kidney pain a lot so deal with it and that also goes with diabetes so um and I've always had hypoglycemia and had issues so that makes sense but you're going frustrating and moving on.\n00:01:30 - mariagudelis (Maria Gudelis)\nWell um it's Halloween night are you giving up candy?\n00:01:36 - Tina Marie (profitdriversinc.com)\nYou don't really clap. I live on a hill so I can just eat the whole city which is wonderful but you don't really like climbing up there so.\n00:01:43 - mariagudelis (Maria Gudelis)\nOh no it's good. If the drug oil rains here it's because I have to go give out some Halloween candies so it's like all right.\n00:01:48 - Tina Marie (profitdriversinc.com)\nOh yeah you're later than me.\n00:01:50 - mariagudelis (Maria Gudelis)\nWell it's 4.36 it's not bad but it's supposed to rain tonight so if I were a parent I'd probably take my kids out earlier than 11 later so we'll see now.\n00:01:59 - Tina Marie (profitdriversinc.com)\nAll right. You ready to get into this?\n00:02:01 - mariagudelis (Maria Gudelis)\nLet's go.\n00:02:02 - Tina Marie (profitdriversinc.com)\nOkay, so let me screen share. I want to go floss my teeth by now is what I want to do.\n00:02:10 - mariagudelis (Maria Gudelis)\nAre you okay? can come back if you want.\n00:02:13 - Tina Marie (profitdriversinc.com)\nUm, I might take you up on that in a minute, but let's see. All right. So we were talking, I'm getting my bringing together. Um, first we were formulating the rocks for the. Yep. I'm not going to call it Q4, but really, to me, it goes into the first two to three weeks of January. Um, because trying to end things just at the new year, like the last two weeks are not, yeah, and really productive at all. Yeah, by middle of December, then it's going through my January, especially when you're talking about offers. Oh, I'm just review this. I didn't get or anything, know, that's what I think it made me one. Okay, so this is just going to be the one thing I didn't put in here is that this we will be organic organic. If it comes, it comes Q1 of 2025, we can consider actively marketing. I'm going to move this to the top because really actually, you know what I'm going to do is I'm going to take all of this and make this Q1 block, a Q1 rocks. Can I say this? I don't want to call this. And then add a card. here one in there. I just want to edit it. Oh, one card. There we come. Okay, we'll set that. And we're going to move this up here. Meeting agenda. That's not what I want to do. So I want to. I don't know how to do this. It's just is this card. would just want a new board.\n00:05:07 - mariagudelis (Maria Gudelis)\nI would be on the left hand side where it says boards and I see it says your boards and it's a plus sign.\n00:05:13 - Tina Marie (profitdriversinc.com)\nYeah.\n00:05:14 - mariagudelis (Maria Gudelis)\nWe prepared our boards of this.\n00:05:17 - Tina Marie (profitdriversinc.com)\nYeah. We'll see. This whole thing is considered a board because that's a workspace and this is a board and this is a list. It's not a, it's not a board that I need.\n00:05:30 - mariagudelis (Maria Gudelis)\nIt's a list. Oh, okay.\n00:05:33 - Tina Marie (profitdriversinc.com)\nSo, um, no, that's not right.\n00:05:36 - mariagudelis (Maria Gudelis)\nSo what I can say, um, get rid of the menu on the left, hit X.\n00:05:40 - Tina Marie (profitdriversinc.com)\nHold on a second, because I've got the, um, not the right, sorry on the right, hit X. Yeah, which I don't even see because of zoom and got it.\n00:05:48 - mariagudelis (Maria Gudelis)\nI think the new list will be behind there, like after your last list, you can probably hit a plus. So keep going. Yeah, to the right.\n00:05:56 - Tina Marie (profitdriversinc.com)\nThere you go. It's you. The Atlas name. And so I'm going to call this quarterly rocks and I'm going this list right over here. Good job. Thank you so much. Quarterly rocks and I'm going go queue for rocks and okay. And so this, I'm just going to move it into here even though we've got the image, there were some comments that went into there. And so meeting agenda of the E Queen. So one, three, high level done free clients. We're not talking about that right now. That can go. Let's see, quarterly rocks. that's the list. And the to-do items. We think about how any of this part of part of what we're going to have to do is figuring out. how to structure things as we go, but you'll, it'll be beneficial because you'll see, you know, like how I'm thinking about it because you're here with me while we do it. We'll also, I broke my nail earlier and I have to fix it. popped off because my hormones are like, so normally my nails don't pop and come undone. So I have really good stuff, but when my hormones change, one of the indicators is they don't stay sealed. so they pop more often. So anyway, we've got all these different things that tell me my hormones are whacked. But it also takes a little bit longer because I have to figure that out, but it, while it takes longer on the front end, it makes everything go smoother once we, and we get traction faster.\n00:07:48 - mariagudelis (Maria Gudelis)\nYeah.\n00:07:50 - Tina Marie (profitdriversinc.com)\nI feel like this was something that, oh, okay, that's because it was business HQ. So I'm going to move that list to my business HQ. I don't really know where I want to put that because we have a few different things.\n00:08:16 - mariagudelis (Maria Gudelis)\nIs this what you do for a lot of your clients?\n00:08:18 - Tina Marie (profitdriversinc.com)\nJust kind of set up something like this? Not anymore. Not for a very long time.\n00:08:22 - mariagudelis (Maria Gudelis)\ndon't do ops for anybody anymore. Just consult. Right. Gotcha.\n00:08:28 - Tina Marie (profitdriversinc.com)\nEverybody has project managers. so we do that. But I don't have a project manager. We will do this for ourselves. But it also is a great. And most people don't. And they don't have anybody good at it.\n00:08:44 - mariagudelis (Maria Gudelis)\nAnd the ones that they have, I trained.\n00:08:46 - Tina Marie (profitdriversinc.com)\nYeah. It's good too. It's a sharpening. My soft kind of thing. But also. This kind of structure, people need it.\n00:08:57 - mariagudelis (Maria Gudelis)\nSo.-hmm.\n00:08:58 - Tina Marie (profitdriversinc.com)\nMm-hmm. It's. Rained up it's getting all the ideas out and having a place to be and then it's being able to put things and I say taskify which is not really a word but put it into a task an actionable item but then when you see it you can look at it go there's a logical chronological way that something needs to happen and then you can also start to see dependencies well chronologically these could happen simultaneously except this is dependent upon this is dependent upon that and normally people aren't looking at things like that especially if that's not the way that brain works which most people don't yeah so if we can train them to do that even though we can't give them like I can't give you them my brain to be able to process the way that I do but the visualization kind of leads leads them through it and so they can start thinking. It's, there's a saying that it's not believing or seeing is believing, believing is seeing, it depends on who you're talking to, whether not they think one is the other one is about faith and one is about whatever. But seeing sometimes is understanding and knowing. And so anyway, the visualization is really powerful. So project resources, I don't even know what this is. So we've got a master plan. We'll update that anyway. For us. So let's do what's happening now. So in progress, you are a live masterclass for you to I mean, that's a long thing, but it really is super clear. Yep. Yeah. And I use the ampersand for that. All right. And it would help if I could type things correctly. So let's just talk about this here a little bit. Last class. Where are you hosting it?\n00:11:31 - mariagudelis (Maria Gudelis)\nZoom. Time. What date? This Saturday, 10 a.m. Two to three hours.\n00:11:41 - Tina Marie (profitdriversinc.com)\nRemember. Second. Second. Easter time.\n00:11:49 - mariagudelis (Maria Gudelis)\nYeah. It typed in November 3rd. It doesn't.\n00:11:52 - Tina Marie (profitdriversinc.com)\nSmall minor. Okay. Okay.\n00:11:55 - mariagudelis (Maria Gudelis)\nI shouldn't have any. 10 a.m.\n00:11:59 - Tina Marie (profitdriversinc.com)\n10 a.m. Okay.\n00:12:00 - mariagudelis (Maria Gudelis)\nI'm.\n00:12:00 - Tina Marie (profitdriversinc.com)\nand Eastern time.\n00:12:03 - mariagudelis (Maria Gudelis)\nOh, you said three hours. Two to three hours, yeah. And then on core repeat of it live for the people that can't make Saturday and also because I'm sharpening my saw and learning more on this, getting feedback Wednesday at 12 noon. So that the day after election day. You know, as a Canadian, I totally forgot about the election. Yeah.\n00:12:38 - Tina Marie (profitdriversinc.com)\nThat's a time to have it depending on the I think a lot of people could not hear less. So it's interesting. The world is very different right now. Like, I think a lot of people care and a lot of people don't. think a lot of business owners don't. They're like, the best thing that I can do is more my business. It might be even more of an incentive for them to like take control of their lives. who knows, I would not not do it because of that. So yeah, statistically Tuesdays and Thursdays still Tuesdays Thursdays and Sundays are the best days for they're the most downtime type of days. So for webinars, like Sundays at 6pm, people are in their emails and they're buying stuff and that's been true for years and then it was still true. It is still true.\n00:13:36 - mariagudelis (Maria Gudelis)\nThat's why some people have a lot of their end of like sale Tuesday night because then they have Sunday and Monday Tuesday. But let me tell you my thinking here. I actually prefer not that many people show up live, right? Because I only wanted to sell like minimum 10, like a grand just to cover it. But it looks like I might make three grand because there's like two grand now already sold. So more people bought today. But my concept of this is just without writing it down, which is explained, and this is kind of how I do things with us while teach this right sharpen the saw like it forces me the deadline to get all the curriculum together the SOPs together the checklist templates, but the final version is and this is what I told them all the emails they will get one year, Compton to all the upgrades to this program. So when this becomes or if this becomes $1,000 or $500, whatever, they don't pay anything more. They get one year access and that I will be creating a members area. And these will really be a sort of one three hour long video. They'll be like more like 10 videos, 10 minutes each, you know. So really, this is going to become a more, you know, what you call it easily to digest? yeah, consume course plus. I'm buying time because\n00:15:00 - Tina Marie (profitdriversinc.com)\nwe just had the meeting yesterday to determine what is the big rock we're up selling this to eventually and we'd agree to be more of the CM pocket CMOCO offer and then also I think it was also like a maybe a group watching thing maybe or is it more just the but anyway so when I know what the end result is then when I record videos and stuff I can indoctrinate them into that other offer right so here's what I think you should I think everybody should keep this in mind all the time if you're going to be in any kind of coaching I think you should have top middle bottom tiers and the and there's multiple reasons for that but I'm going to touch on them super fast sure top tier higher money higher effective hourly rate but also higher level energy coming back from your clients when you work with high level people they teach you as much as you teach them you learn from them it's also higher energy and just higher value so it kind it it financially energy basically and intellectually fuels everything else that you do, the high level tier, okay? But you can only do a little bit of it. It also takes a lot of you energetically and intellectually, okay? The mid-level tier is to me, so we're talking about the 10% that not going to do a lot, the 10%, they're going to succeed no matter what you do, and then there's that 80%. And this is the impact-making group. This is where you make a difference in the world, the greatest difference in the world. These are the most influential, influential, influence-able group of people that you're going to be working with that need you the most that are most primed because they have the money, because they have the understanding, because they have the ability and the willingness to act upon what you're doing, and we're gauging that by the things that we've set out. to attract them as well as the things that we've set up to filter out those who don't match this particular group set really well. So but they also give a significant enough amount of money that they that we're earning from them and they help fuel you know our lives and what we're doing in our business but they're also the bigger pool where we get feedback because it's hybrid coaching right so we're getting some feedback in real time on what we're doing and so it's the biggest pool of it's the biggest feedback loop that we're going to get about how our stuff is working in the marketplace how what we're teaching is helping people or not helping what we need to do to improve what we're doing. Then the lower tier is kind of our give back but it's also the most scalable it's the most hands-off so it doesn't cost a lot anybody that wants it can probably afford it. by skipping McDonald's once or twice a week, if they can't, you know, if they need a leg up, this is where they're going to get it from, but it doesn't take a lot out of this, because once we build it, it's done. It doesn't require a lot from us, but it does don't give a lot because they're getting essentially almost all the knowledge, at least all the knowledge that they're going to be able to use anyway because of what we've already predefined that they're able to do. So, anyone coaching and teaching should have all of these tiers for all of the reasons that I just said, they need the center group for the feedback loop and to make the impact, because anybody who's coaching wants to make an impact. That is part of what made them go into it in the first place. The high level group is needed because of what I said, because you need to have that high energy, you need to have that high earning power. Um, you also want to have high level connections in case you ever need it in the world, but also be a high level connection. So that's important. And then the lower level thing, again, is just the super scalable, um, low, low impact. And if it continues to do well, that's also a market signal saying that this market still exists. Um, it continues to deal with lot of impact. So a lot of touching on it and everything that you do feeds each other. So everything that you do to serve your high level clients should, should come down. So you create, um, the things that you need to really support your high level clients. And that becomes something productized for each of the lower tiers. And so there's not multiple efforts, but there's three levels of entry points. Three levels of earning power three levels of energy, you know what I mean, um, so it can be That you have those three levels for YouTube, but I wouldn't do that because The to be a high level YouTube creator and coach almost really feels like you've got a high level in video production and Yeah, in their minds probably yeah, and that seems like a lot of work Because there's a lot of skill involved. We're talking about huge processing power Yeah, time suck. So having a top middle and lower class for YouTube itself does not seem like a great idea as YouTube as a channel inside of marketing inside of a marketing Operation business hybrid makes much more sense to me as you are such a generalist and I am as well even even in my systems operations that if we're going to have an and you can't the bandwidth required to do more than one high-middle low level type of offering as a coaching consultant would take too much more than I would be willing to give more than you would probably be willing to get so to me that is the offer it's business sustainable um business growth um profits however you want to call it through a marketing systems and operations right and obviously it needs a sexier name but but that's it and so hopefully that gives you some clarity does yeah yeah so yeah um one of the things I'm going to do is put in um to uh\n00:22:00 - mariagudelis (Maria Gudelis)\nUpwork just like an example looking for someone who can like here's the here's the problem you go you go to Fiverr to hire someone to do video editing for you and Because everybody's mind thanks to Helix permosi is on shorts They're charging like twenty five dollars for every minute because I think you're gonna do a 60 second short, right? From the scripts like well, yeah, well, use Veed and or cap cut myself But that's the first thing I want to outsource and so there's no I'm gonna pay twenty five dollars times ten minutes Right, so I'm just gonna go to upwork and offer twenty five dollars per, know Five to twelve minute video promise. I'll give you like, you know one video a week But probably more right because maybe share that VA with my students.\n00:22:49 - Tina Marie (profitdriversinc.com)\nI've got a girl you could try Oh, it's not amazing. She's good and she's trainable. She's very smart and she loves to learn she communicates. Well, I think she's from Pakistan.\n00:23:02 - mariagudelis (Maria Gudelis)\nHold on a second. Yeah, I still want to post the thing when I work because that's part of the training, like how to hire a VA as well, you know, but yeah, yeah.\n00:23:11 - Tina Marie (profitdriversinc.com)\nThat was a work. Hold on a second. All right. Messages. She does Canva too. See if I can get her profile for you. I don't want to be a profile. No. Copy and then chat. I'll put in chat for you to open up. Thank you. You can look my carpet. Oh, so I posted a job. I can always tell from a cover letter of somebody's and be good if they're going to be exceptionally good. I'm trying to see where her first thing. Yeah, so I was needing somebody to do some combining for me and I posted a job, let me see, actually I'll job post. I'll show you because I wanted to show you like how just my process with it. So data organization virtual system. View job posts. Looking to combine several Google Docs into a large document, these docs are transcripts and the time stamps and other speakers removed before adding to the master document. Some are already in Google Drive folder and some will need to be extracted from note taker as at least 100 recordings. It's a simple task but I'm looking for a quality. send who communicates well is prompt, ask questions and as needed and cares about the quality of work. There are options for added opportunities for more work if you're interested to communicate well and are reliable. If you're interested, please send a cover letter explaining what interests you and let me know why I should hire you. Also, let me know if you prefer short-term clients or long-term clients, your attention to details required in order to be considered. So when you hire these low-cost people, generally speaking, you're not going to get a very articulate response and they're definitely not going to tell you how to solve the problem. But if you did exactly right, honestly, this is her reply, I'd suggest using Google Docs find and replace for you to locate and remove time stamps. I did this with AI so I ended up not doing anything and she says I've used this approach before when working on a project where I managed several interview transcripts and it saved me a lot of manual work. extracting records from a recording from Father NoTaker, I can ensure that everything is downloaded and efficiently. See, into the Google Drive folder you've provided, here are some other virtual assistant jobs I've done. And then, I'm genuinely interested in this job because I enjoy working on Google Docs and I'm well organized. My previous experience and handling somewhat transcription tasks as well as my attention to detail, notice the Oxford comma makes me confident I'd be a great fit for this role.\n00:26:21 - mariagudelis (Maria Gudelis)\nalways ask questions when necessary to ensure I'm meeting expectations. mean the Oxford comma?\n00:26:28 - Tina Marie (profitdriversinc.com)\nWell, I guess that's not really the Oxford comma because that would be the list.\n00:26:31 - mariagudelis (Maria Gudelis)\nNo, just never heard of it. I'm just curious what you mean by that?\n00:26:34 - Tina Marie (profitdriversinc.com)\nIt's writing. was in key writing classes and things like that. The way that she uses the commas are extremely, this is very good English writing. Gotcha, She just did incredibly well. then we followed up and had different stuff. I ended up not needing her for that. So I asked her what other skills you have. And she does Canva and videos. Let's see, she shared a Google Drive with me. And like I said, these are not amazing. But because of her video response, her video, her emails, think that she could do really great if she's just trained and given instructions. She's very smart so she could do well. Let me show you this. Do you feel overwhelmed and anxious when it comes to taxes? All those laws, regulations, credits, Okay. And she's definitely got some interesting clients.\n00:27:53 - mariagudelis (Maria Gudelis)\nIt's a big business hydroponic towers.\n00:27:56 - Tina Marie (profitdriversinc.com)\nYeah, I want to get into it too. We do. just giving a huge like so good music she shows good music I think she was probably provided all these video clips so anyway but she is I think I hired her at like eight dollars an hour what was the contract view contract yeah eight dollars an hour so she could get those videos within your budget is what I'm saying mm-hmm if you're interested in that yeah so yeah okay so thank you for that time too you're welcome um every really really good I don't know experience whatever that's not the word a good track record for hiring good people through work and long term. It lasts for like years and years when I placed them with clients.\n00:29:06 - mariagudelis (Maria Gudelis)\nI was going to say, shoot, I lost my turn thought. Oh, do you use that scribe? I remember that tool you're mentioned for me to use.\n00:29:16 - Tina Marie (profitdriversinc.com)\nI haven't, there's nothing I've wanted to do with it. But no, but I do think it'd be very cool to check out and try if we had. Well, like if you're going to break a process down, which is what you do a lot, you know what would be really good is like your video where you doodled. I think you had a few of them, I know you had at least one. I would put that through scribe and see what it does just to get an idea of what it can do. Yeah, I'll start breaking the process down.\n00:29:48 - mariagudelis (Maria Gudelis)\nYeah, I'll start playing around with it for sure.\n00:29:49 - Tina Marie (profitdriversinc.com)\nOkay, so what can I do to support you in this and making sure that this goes well? let you get this recorded. I think, and once we get some feedback on how that call goes, there will be a lot that you and I can break down and then put into tasks and really start building something around that. But before you get there, how can I support you?\n00:30:26 - mariagudelis (Maria Gudelis)\nI think probably once I get the, like I said, high level in my head how I'm going to teach it, maybe when I just get the high level curriculum kind of put together, which will be tomorrow. I'll just shoot it over to you and look, you don't have to reveal because it's not going to make or break Saturday, right? But if you get a chance to review it, I think next week, the support will be more my thought process to make this a killer product, the final product, is going to be like, there's a part of it that and actually it's not going to be able to to be done next week because I want to get feedback from them and do a survey and all that stuff, what the challenges are. But my nirvana is for one aspect of it, and if it goes into a low ticket funnel, this will be up to one or up cell two, and is like ability just to hand off the SLP's to VA to do some work for them, like whether it's the research method or whether it's the video editing method or this the upload to YouTube method because I don't feel, hold on, I need to make sure I understand for you to hand off to a VA or them to get instructions and them to hand it off to a VA. Yeah, this is for the higher end product, right? me give you a better example, context. One of my friends has the organic group method put into a little ticket funnel. His upsell one that converts for $97 like crazy is called the automated growth stack, where hey, I will give you all the SOP's you need to hand off to a VA to an or to build and manage your Facebook group, only $97. Yeah.\n00:32:05 - Tina Marie (profitdriversinc.com)\nOK, and so it's a $1 one time, not a $97 subscription.\n00:32:11 - mariagudelis (Maria Gudelis)\nCorrect. Unless we make this, remember, we're still deciding whether to sell it by a on demand webinar funnel for like $197 or $297, or whether we put this all into a low ticket funnel with the traditional $7 thing order bump of so one upsell too. Yeah.\n00:32:31 - Tina Marie (profitdriversinc.com)\nSo one of the things that I'm just thinking about this, let's see what you get out of the training and get all the feedback that you can. would love to be there and watch.\n00:32:54 - mariagudelis (Maria Gudelis)\nYeah, you're welcome to.\n00:32:56 - Tina Marie (profitdriversinc.com)\nObserve and support.\n00:32:58 - mariagudelis (Maria Gudelis)\nAnd.\n00:33:00 - Tina Marie (profitdriversinc.com)\nBut I don't know what the because they do have girls this weekend.\n00:33:06 - mariagudelis (Maria Gudelis)\nI don't know what's going on. But I'm repeating it on Wednesday, remember that. And remember, this is my warm audience. I could just prepare, prepare nothing and get on and get some and love me, you know.\n00:33:19 - Tina Marie (profitdriversinc.com)\nSo, yes. was I going with that? Oh, yeah. So just seeing seeing seeing the feedback, seeing what gets excited. So you're going to do it on zoom. Zoom doesn't have analytics does it?\n00:33:35 - mariagudelis (Maria Gudelis)\nWhere you can you can measure engagement or does it? Um, I don't know if it does, but it'll be too small of a pool, right?\n00:33:43 - Tina Marie (profitdriversinc.com)\nTo really look at that. don't. Yes, it'll be a little bit different. It's definitely something to look at in the future. And you could probably get a pretty good temperature by how people are commenting or asking questions.\n00:33:56 - mariagudelis (Maria Gudelis)\nYeah. Yeah. Yeah. I. You know this to be like you're just as good at this. I've been doing webinars since 2006 So I I orchestrate the engagement to a lot, right?\n00:34:09 - Tina Marie (profitdriversinc.com)\nYeah, well what I what I'm trying to get at though Is that um what I'm thinking is that whatever we can do to you know make it a a product stack that has All leads Anything that we can do to make them self-liquidating leads, right? So and honestly if it's all coming from YouTube, then that's a moot point because they're free You just putting anything but to to be able to convert as many people as we can into buyers Um, but I think that there's a stop point here, which is just like because we already talked about it We don't want to get into long-term YouTube by itself You know one-on-one Poaching time slot with Maria or you can get into our business growth stuff or YouTube marketing is a conversation that we have Because marketing Is something that we talk about often and YouTube marketing is what we're really loving right now So the only upsell beyond whatever this package is there is no Monthly subscription unless you join the the business growth one But really do you not need it because are you not trying to grow your business? Are you not trying to do it smart? you not trying to do it leverage? Are you not trying to do it optimize and Instead of just getting YouTube, you're getting all these other things So that's kind of what what I was thinking is like whatever the stack is that gives them everything that they need to follow your system On top of that if they want support Community access whatever it's either by maria's one-on-one time or\n00:36:00 - mariagudelis (Maria Gudelis)\ninto our group that's bigger than YouTube but definitely includes lots of YouTube conversations because I can't imagine you going week like not wanting to talk about hey guess what's happening you know right right right and there's a whole other aspect that's not going to be covered on this part of the course but I think if we're now making it for offer owners and affiliates I think a huge aspect of it is branding personal brand right um so uh yeah and I've got um a friend of mine who's that life coach Melanie Childers she's gonna either pop on then or just do a separate call to help specifically the people that mess to be that said they're little scared to get on camera so that's just gonna be a bonus recording your space this YouTube accounts that that do really well so if you wanted to go do some research on that you'd be able to provide answers to those those people they can do really well yeah yeah yeah It's funny because I I I I've been in the last few months of faceless YouTube school community and she's she's made six figures herself with a fitness faceless thing um which is kind of cool and she just bought PLR to some fitness videos and created a youtube channel and think I mentioned this to you called five minute exercises or something but yeah go ahead.\n00:37:19 - Tina Marie (profitdriversinc.com)\nDid you know that less than two percent of youtube creators uh you you tubers create their own content that less than two percent of youtube accounts are actually create their own content less than two percent.\n00:37:33 - mariagudelis (Maria Gudelis)\nwhere'd you get that stuff from?\n00:37:34 - Tina Marie (profitdriversinc.com)\nThat's huge.\n00:37:36 - mariagudelis (Maria Gudelis)\nLook at it.\n00:37:38 - Tina Marie (profitdriversinc.com)\nYeah because it's um it was um it was comparing tiktok which is even lower it's like 1.5 on tiktok and then two one percentage of you tubers create one and four of those creators and create video content. So that's 25% still.\n00:38:08 - mariagudelis (Maria Gudelis)\nWow, it's very low. It is not what people would think you would. So, so is that meaning the rest is faceless?\n00:38:14 - Tina Marie (profitdriversinc.com)\nIs that kind of what? No, it's it's saying that it's curating content.\n00:38:20 - mariagudelis (Maria Gudelis)\nLike, like, clips, somebody else's clips and you add something to it. Oh, got it.\n00:38:28 - Tina Marie (profitdriversinc.com)\nGot it. it. But it's not their own original content.\n00:38:33 - mariagudelis (Maria Gudelis)\nSo, first of all, what I mean is that the opportunity out there for people who have something to say is huge.\n00:38:41 - Tina Marie (profitdriversinc.com)\nYeah, but also for people who don't want to be on camera, if they're following your strategy and creating the content according to your style, so they could do whiteboard drawings and have a picture of themselves or no picture. But as long as it's First of all, it's not all have to be visual, but if they're following your plan, let's say they get 25% less results than you do because it's faceless.\n00:39:11 - mariagudelis (Maria Gudelis)\nIs it still not amazing results compared to nothing? Right.\n00:39:16 - Tina Marie (profitdriversinc.com)\nYeah. So it's still tapping into YouTube. Maybe you're not getting full power of YouTube because of this. But YouTube is a content provider. It's not just a face of your video, you know.\n00:39:34 - mariagudelis (Maria Gudelis)\nSo I know, I think I mentioned this to you. I know one guy I consulted a few months ago. He was just buying the master resource rights and private label rights to faceless videos on Etsy. He bought them, then he created a frickin funnel. He's making 30 grand a month selling them via ads to his funnel. Here's a thousand faceless reels and he has a little died on how to do faceless reels and TikTok videos and YouTube shorts. And he's so doing so well, I haven't heard Boo from him for the last two months.\n00:40:10 - Tina Marie (profitdriversinc.com)\nThat's how well he's doing. Do you more help on this? So I wanted to get into that for a long time too. So we can do a case study where I'm following everything that you're doing. And they're following me while I create some content that is around. So like I got a, I told you about domain, videoprofessor.ai. So I'm like, what if I just teach all my stuff, but I don't, it's not about my face, it's about the content or whatever, what kind of results does it does it get? So and I'm a huge fan of leading by example. So for those people that have those questions, you could say, look, worst case scenario, you spend $97 and you learn that it is possible or it isn't possible. But regardless, you're going to learn, is the knowledge worth the $97? This is what this is so so this is what I teach people all the time They want to think that their money has to get a specific kind of outcome like that has to be money I'm like, but when you go to college, you're not guaranteed a job. You have a degree You paid for the education.\n00:41:17 - mariagudelis (Maria Gudelis)\nOh Consider yourself paying for the education.\n00:41:21 - Tina Marie (profitdriversinc.com)\nYou're coming here. There's no way you didn't learn something There's way you didn't know what you didn't hear something now you have to ask yourself And I'm going to pay Maria for teaching me that so I had a new thought that's going to lead to a new thought That's going to lead to a new thought that cannot be measured the thoughts. So here's another thing Anyful can count the number of seeds in an apple, but only God can count the number of apples in a single seed Because in that seed very tree the tree bears apples those apples bear seeds those seeds bear trees and so on and so on and so on When you teach somebody a new thought and a new idea that is the seed that will bear. So it's important to use that. think you teach people and say when you're looking at this investment, like I'm going through a course right now and it's $2,000 and I found somebody way better. And he's got a refund and I'm probably not going to finish this course and I'm thinking, do I ask for a refund because I found something better? like, well, no, because I learned from him.\n00:42:24 - mariagudelis (Maria Gudelis)\nRight.\n00:42:25 - Tina Marie (profitdriversinc.com)\nYes, I found something better.\n00:42:27 - mariagudelis (Maria Gudelis)\nBut if I go buy a dress and then I go find that dress, I'm not going to go return that dress.\n00:42:32 - Tina Marie (profitdriversinc.com)\nSome people would.\n00:42:33 - mariagudelis (Maria Gudelis)\nSome people would like.\n00:42:35 - Tina Marie (profitdriversinc.com)\nBut not if I've already worn it and tried it on and I go find another one and I never wear that dress ever again. You know, that's just part of the buying experience. But I'm not going to take away from somebody who moved me through and gave me some new ideas and thoughts. Maybe they weren't one, which is another one. The last I will say, when I market things and talk to people, I'll plant the seed of business karma. do you want to be a chronic refunder? Because you reap what you sow. If you don't want people doing that to you, don't be that person to other people.\n00:43:14 - mariagudelis (Maria Gudelis)\nYeah. Yeah. no, I'm from believing that too. $2,000 course was that you bought?\n00:43:22 - Tina Marie (profitdriversinc.com)\nDay trading.\n00:43:23 - mariagudelis (Maria Gudelis)\nOh, okay.\n00:43:25 - Tina Marie (profitdriversinc.com)\nOkay. I love it. I've always loved, like, I feel bad about now because I know more about horses, but the first time I ever went to a horse track, I picked the winners all but like two races. I'm just really good at stats and processing.\n00:43:40 - mariagudelis (Maria Gudelis)\nlike, I don't like to see how that goes.\n00:43:42 - Tina Marie (profitdriversinc.com)\nAnd I also want to understand the stock market a lot better than just the economy and how that goes. anyway, I did that. then I was like, man, this other guy is like way faster because the one that I'm learning from, he's so slow.\n00:43:54 - mariagudelis (Maria Gudelis)\nAnd he doesn't go linear. It's not well organized.\n00:44:00 - Tina Marie (profitdriversinc.com)\nHe is he just brain dumped everything that he knows and it's good and it's useful But he isn't the best teacher Yeah for learning, you know, if somebody's better at teaching, gonna learn so anyway.\n00:44:13 - mariagudelis (Maria Gudelis)\nYeah. No, it makes sense Got it. Yeah. So anyways, um, yes to to that and it is on the rise and like You know, obviously there's gonna be so many Aspects of future changes of how AI is going to play a role in this, right? Cuz do you want to go like you and I talk about this the other day? Hey, Jen, right to create a duplicate of you and and to create videos for yourself, you know But I will tell you what you just said though that very few create their own stuff. That's probably why some of my videos Do so well because the comments are like you're so authentic like it because I think it comes across versus if it was just crowdsourcing what other people say. look, I'll admit, some of my videos is kind of crowdsourcing bit because I'll look at what's top and ranking stuff. Oh, this guy did a video on how to combine chat should be T and create an ebook.\n00:45:11 - Tina Marie (profitdriversinc.com)\nWell, I've done that before, so I'm just going to teach it too. So there, there is another thing. And I wish I could quote it for you, but I've heard it from two people. But because there's so much information, it isn't about content creation so much as content curation and distilling. So what people need isn't all this information. That's what we've been selling as info marketers for two decades. Yeah, yeah. And we all know that it's paralysis by analysis and overwhelming all of this stuff. The winner is the one who can take the complex all these things and break it down. why I get paid so well, but also what I've seen you do is you break it down to small strategic steps. If you're talking about creating a list that they can go outsourced, you don't get more simple than that. I would say a few reasons, but I would say the biggest reason that you're being successful and will continue to be successful is because you have the ability to distill complex and and big quantity down into small things, but then you add your personality and your love on top of it. But that's difficult to replicate, so but if you can teach people that if they can do that, so they don't have to have the same personality or necessarily articulation, but whatever they know, if they can take what they know into the simplest actionable steps, people will love them also because it saves them time.\n00:47:00 - mariagudelis (Maria Gudelis)\nand mental energy and their brains are tired. Yeah, and I was going to start the the the off of drawing a big circle and saying this is all the information about YouTube and how you can make money with it monetize it. I know this much about it. I'm not saying I'm the expert on all things YouTube but I know that this little bit that I've been able to do has produced results and that's I'm going to teach you this a little bit so you're not overwhelmed and you can choose to learn all the other stuff if you want later but just do this as your foundation and you will get results.\n00:47:30 - Tina Marie (profitdriversinc.com)\nKeep it simple, you know. I'll add one more thing to that. Is your goal to learn everything that there is to know about YouTube or is your goal to have YouTube help you get be the vehicle to the life that you want to making the amount of money that you want because if that's your goal you don't need to know everything about you. You need to know just enough to get to the results that you want to get to so it doesn't matter that I only know this part because I know the part that gets me the amount of money that I want in the amount of time that I want. That's what you're teaching.\n00:48:05 - mariagudelis (Maria Gudelis)\nI love that. That's it in a nutshell.\n00:48:09 - Tina Marie (profitdriversinc.com)\nBecause people don't quantify. They don't ask themselves this or that. So they go in and I think I need to be a YouTube expert, which relates to I need to know everything there is about YouTube. How many times have you heard somebody say I got to go study and learn everything there is to know about this? Yeah.\n00:48:25 - mariagudelis (Maria Gudelis)\nYeah. I wrote out the books this year.\n00:48:28 - Tina Marie (profitdriversinc.com)\nOkay. What did you and part of that's buffering though too.\n00:48:32 - mariagudelis (Maria Gudelis)\nThey're feeling busy because they're learning but they're actually not doing and making money and getting proactive avoidance. That proactive avoidance, that's the words you use all the time that I love proactive because I'm writing this down so don't forget and that because there was a guy yesterday that asked me what makes your YouTube course different than the others right and I'm going to write this down proactive avoidance. I just said because you're not going to have to spend tens of hours like in other courses to actually try to figure it out. I'm just going to give you a simple system that's worked for me and got results.\n00:49:03 - Tina Marie (profitdriversinc.com)\nand I would say further, here's how I can prove it. at how many videos they make and look at how much time they spend on YouTube. And look at me, you're not seeing these about hours and hours and hours and hours of video. I'm putting out.\n00:49:16 - mariagudelis (Maria Gudelis)\nIt seriously is like three hours a week, they can do it.\n00:49:19 - Tina Marie (profitdriversinc.com)\nYeah, and you can ask that, do you want to live on YouTube or do you want to live?\n00:49:24 - mariagudelis (Maria Gudelis)\nYeah, yeah, yeah. Can't wait to get sales page rock and so you can add to it. All right, on that note, candy people are going to start coming, the little kiddos.\n00:49:37 - Tina Marie (profitdriversinc.com)\nI know I keep seeing you go like this, so we'll let you know.\n00:49:40 - mariagudelis (Maria Gudelis)\nbecause well, I don't know how well you can see it, but that's the the outdoor. So I'm waiting to see kids walking by because sometimes they have already been some people walking by. And so it's getting dark as you can see. Yeah, yeah.\n00:49:54 - Tina Marie (profitdriversinc.com)\nmy daughter needs to be done, lock the door for me. All right, she's got back. Okay, I will talk. See you soon. Have a good weekend. Have Halloween. Thank you. you. All right.\n","contentPreview":"00:00:00 - mariagudelis (Maria Gudelis)\nHi.\n00:00:01 - Tina Marie (profitdriversinc.com)\nHi.\n00:00:02 - mariagudelis (Maria Gudelis)\nHow are you? I had to feed the animals. The animals. Yes. Oh, my Go...","processedAt":"2025-05-04T03:40:52.468Z"}