{"fileName":"Transcript for Chona(2).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Chona(2).txt","type":"transcript","priority":"medium","content":"00:00:03 - Chona Sweet, DNP ( wspainclinic)\nHi, hi, I was just gonna see if you're coming. Yeah, sorry. I don't know how to make a decision. I'm in Mark's office. Okay there. I think it's charges. Okay. Oh. Okay.\n00:00:23 - Tina Marie (profitdriversinc.com)\nI hear you.\n00:00:24 - Chona Sweet, DNP ( wspainclinic)\nOh, it's connected to like his entire thing. You see me? I don't know where to look.\n00:00:34 - Tina Marie (profitdriversinc.com)\nI know you're probably on the laptop.\n00:00:37 - Chona Sweet, DNP ( wspainclinic)\nOkay. It was kind of crazy. There's a lot of things. I just need to tell you because I'm just gonna have a verbal guy. We are here in moment.\n00:00:48 - Tina Marie (profitdriversinc.com)\nI'm ready for it.\n00:00:52 - Chona Sweet, DNP ( wspainclinic)\nWell, it started Sunday. I feel like slipping fall in front of. Starbucks, like literally. My knee buckled and I don't even know what happened. It's like it happened so fast and then actually it's like too mucha and it just, it could have been worse, right? could have been worse. So my knee still hurts from that. It happens that Sunday and and um the matcha I saved though. It had the core. It tore me in my mom and I would say 95%. Can you imagine? And I fell flat on my face right here but oh thankfully the face for some reason didn't have abrasion but my knee is anyways. So I would mark how his IT band is hurting, right? A pair of this. Yeah so I actually did trigger point injection to him two days ago. is it two days ago And I was on my way to work. I got shaken up. I, you know, we have to bring by the police report and bring my car to the chop. So I, you know, I just basically, I feel yesterday. I did my telemedicine, but I'm on my way to the clinic, so I didn't go into the clinic. And I was kind of really shaken up. And I just feel bad in the way, because I didn't see my hospital patients yesterday.\n00:03:33 - Tina Marie (profitdriversinc.com)\nWell, a patient.\n00:03:35 - Chona Sweet, DNP ( wspainclinic)\nYeah, I saw them this morning. They're so, I was busy already starting this morning. I started at six thirty. I was busy because I saw the patients in the hospital call my phone calls. It's done. The notes is not done, but I finished what I needed to do for the orders. And then I went and visit one of the law firms that. gave me cases. So kind of solidified that I gave them cupcakes. just to kind of thank you. And then I met the main lawyer, which I never met him before. He's the owner of the group.\n00:04:14 - Tina Marie (profitdriversinc.com)\nAnd, you know, is this three James?\n00:04:16 - Chona Sweet, DNP ( wspainclinic)\nNo, no, it's not six James.\n00:04:17 - Tina Marie (profitdriversinc.com)\nIt's Havas Law. Oh, okay.\n00:04:19 - Chona Sweet, DNP ( wspainclinic)\nHavas. So he introduced me to Mike, which is the brother. But this is the main lawyer, the owner, the lawyer, the group. And, you know, we talk a little bit and he's like, you know, this is Mark Sweet's wife. we talk and said, okay, we'll send you more. So that's a good, I bought like four dozen cupcakes. There's apparently there's four to five of them. like, I hope this is enough. And then I pick up my mom because she had an epidural done. And I'm here. So I promise it's 30 till now. And like, I need to like, And then neighbor stopped me because he's like, because I was busy and so we tried for a moment, but then he caught me and so it's like I need to go to have an appointment, zoom. far it's that, but my notes have been like on time, it's just that yesterday I got I know I have four notes, I got a little bit derailed. I'm already in pain from Sunday, the thing happened, but I show up today to whatever needs to be done and then tomorrow is the sweet James. But still we have dinner back to back today, tomorrow, but I still go into the hospital and my phone calls, I still have my patients and I just got a new one. So it's kind of. I'm getting there. It's getting busy. The good thing is Dr. E hired a PI coordinator full-time like for his, you know, for the practice. It's not going to be remote, but he's full-time, which is really what we need is phone calls, patients, calling lawyers, you know, that's what we needed. So, I mean, that's good.\n00:06:29 - Tina Marie (profitdriversinc.com)\nYeah.\n00:06:30 - Chona Sweet, DNP ( wspainclinic)\nBecause, honestly, at this point, I do not know what, I mean, I know, but because it's not, it's still very new and I'm tracking the cases that's coming specifically through me, but I'm also taking care of his. And per mark, apparently, it's going to be all throughout the percentage for all PI. you know, take care. just feel a little bit frazzled because of the back to back kind of incident on me.\n00:07:05 - Tina Marie (profitdriversinc.com)\nYeah.\n00:07:06 - Chona Sweet, DNP ( wspainclinic)\nAnd it's just um I'm in pain like I um I will have my hair done later for the dinner. So I don't know what I'm like. feel like kind of all over a little bit like I can feel it but that's but there's something that happened yesterday and today that I was really other than the business side. I was telling Mark. Mark has multiple wins too on his on his yeah. Yeah. good. Um so he's balancing out what's happening with us. We're both in pain. But anyways I was telling this you know trying to do the positive and what happened and I message him that I was supposed to message you too yesterday. and then of course the accident happened and I got derailed. I'm just I just stayed on home and I just and this is the one week I didn't check on you I was thinking about that today because this week has been nuts for me and but not in your way oh yeah I was like I suck I did not check on Chona at all today and then you tell me this and I feel even more it was it was no anyways I wanted to tell one win I think that makes me again makes me feel that it's really really nice to make money obviously you know I would want to make more and fine for next year so really big busier and make more but like I have a patient that's an addict and got in the hospital it got into an accident while he's high he's my age and he had surgery so now he's in rehab so he's taking this specific medication pain medication that we give for patients who are addicts and it's called buprenorphine and it kind of hitting two birds with one stone in a way so and you know he's homeless you know he's just so there's a lot of issues right and then two nights ago he was like from his heart I was like I don't want to go home because I'm in the hotel and I'm surrounded with people who are eating drugs and I don't want to be on fentanyl because I don't want to die you know you know these things it's like and I talked to the manager I ordered case management social work to have sources resources for him to go home this is going home either today or tomorrow and apparently they don't have those resources so I research on my own and I found one this was yesterday before I go to morning and I was able to find one and it's a perfect quick match program that I was talking to that doctor I said I already started dissipation on this but I can only give five days word of medication. Anyways to make the story short I told the patient this is the number you call and he called yesterday and I talked in today and he was very very thankful yesterday and today and I was just these are the reasons why I do this. These are so so much better the idea of helping someone maybe obviously identifies up to him but to hear it from someone like that asking for help is literally like crying and in the beginning actually he literally could save his life. Yes so that he's like crying and he's actually hard to deal with not a lot of people wanted to because you know there's addiction component there's pain component and you know and he felt like I'm not listening to him you know all those very difficult type of personality it would since I've used in the end to tap back. So, you know, I was telling him he's like, thank you so much, he's just like, and I was telling Mark that this, this is why I do what I do because it, and it just, it just feels so good. And again, I'm not the type of person that would linger on a compliment, but I was telling Mark, this is like, this is why I do this.\n00:11:24 - Tina Marie (profitdriversinc.com)\nIt's not about compliment. There is, so Nick Frankel, man starts for happiness, right? We, as human beings, need meaning in our life, we need purpose. of us are satisfied to our souls without purpose. And that purpose I have without exception, never seen anything where that purpose isn't tied to the service of other human beings. And so, it makes perfect sense. how do we perceive the success of those goals? How do we perceive that purpose? It's through the signals that we receive from other people which generally look like gratitude, expression of gratitude, for the service that we've rendered. So, you know, there's this whole weird thing and I think and I have to say this because I don't know how to separate the spiritual element from, you know, the life element, but there is real good and there's real bad, there's real light, there's real dark. And so, you know, God wants us to do good, but the real enemy to good wants us to not do good, but rather than be overt about it, he's very subtle. And so he'll do things like make us think like, you shouldn't talk about the good that you did because that's being arrogant and you're doing things for the wrong reason. Or like, for instance, I'm going through a battle. for my children right now and some things are happening and they're happening publicly and I am amazed that the lack of people speaking up and standing up and they're like yeah but I don't want to offend and I don't want to do this but you'll allow for wrong to be done and you'll allow for that hurt to be done but you don't like you don't want to take part in it like so you are taking part you're watching and by not standing up you're doing something and so that's like what the adversary does is he calls good bad and bad a good and and anyway so it's it's good for you to notice that it's not about a compliment it's a signal of a successful thing that you did you didn't just serve him you served him in your heart right there's a time you know maybe a month or two ago when you were kind of judging yourself for wanting this to be all about money and you're like it's just about the money and you like you're That's how you had seen yourself for a moment. I'm like, no, it's that but It took very specific instances for you to even acknowledge that in yourself you had to have this a signal like this right going to the hospital and Having a specific experience that you can recognize and that was so clear to you That you had joy for being able to take care of them that you could speak honestly and go Actually, this is really what matters to me because I can't you Jonah Like if you saw somebody in pain and they're on the street and you're there I can imagine you walking by and not trying to help them and you're not gonna get paid It's not about the money It's just that you have gifts that you purposely received like you you went to training To be able to heal and help other people you chose that And then you give it so I think it's I think we can be humble and it's still acknowledge the the goodness in our\n00:15:00 - Chona Sweet, DNP ( wspainclinic)\nBecause I don't think it's right to deny our goodness.\n00:15:04 - Tina Marie (profitdriversinc.com)\nRight.\n00:15:04 - Chona Sweet, DNP ( wspainclinic)\nYou know what I mean? Right. And, to be honest, feel, I mean, technically it's not, it's not really my, like, my job. already put the orders in, get a referral, and then the case manager or the coordinator is like, we don't do that. We don't have that here. He needs a primary referral. I said, that is actually a good idea and good practice for regular patients. This is not a regular patient. This is a homeless patient who is an addict who is asking our help, like, you know, there's a, there's one of my favorite scriptures and it says, um, if a man asked for a coat, give him your jacket also.\n00:15:51 - Tina Marie (profitdriversinc.com)\nAnd if he asked you to walk with you in a mile, walk with him, twine, walk with him too. Basically, whatever somebody asks you for, give them twice what they ask you for. or because that's what God would have us do. So like, anyway, just, it's, I think it's good.\n00:16:07 - Chona Sweet, DNP ( wspainclinic)\nDo you already? reeling on that high. And then, because I talked to him yesterday, I said, I just talked to these people in this program. I'm giving you this number, call them right now.\n00:16:19 - Tina Marie (profitdriversinc.com)\nwas happy to talk. And then I will come see you this afternoon.\n00:16:23 - Chona Sweet, DNP ( wspainclinic)\nAh! That's why I told him, then I didn't come. And then I'm glad that he's still there today when I saw him. And he, you know, I said, but it's the car act of conversation. And he was very, very thankful, you know, that's a good resource. He was already thankful yesterday. He's very thankful today. So it's good. It's a, I'm definitely holding on to that. And I told him, you know, I told him good luck on, you know, because again, the end of the day, it's his choice, but I'm just, I'm hoping the best for the best. is really, really hard. It's a disorder, so it's like, yeah, and then for him, for an addict to ask for help, that's like huge. Well, and it's come morbid with several other disorders, generally speaking, so yeah, so it's when I talked to the, and then, you know, I'm a little disappointed with the coordinator. I talked to her too, and she said, it's kind of natural on about it. I'm sure she's seen that a lot, but sometimes that's why actually I think it's good that I'm doing clinic and hospital and different because it helps me to sensitize a little, I mean, since it's that sensitized, remove myself, because I remember when I was an ICU nurse, death had become so common, like I remember taking care of a patient, like this was a lot. gosh, how long have I been a nurse? Been long time. So I was in, I have a patient that's homeless and dying and I'm right there in the room because he doesn't have anyone. I just feel like he needs, there needs to be someone with him when he's dying. And then outside the nurses are laughing. It's like, that's the time, honestly, that I said, going to go back to school because I need, I don't want, you get, is that the right time? So I need to step out and do other things.\n00:18:34 - Tina Marie (profitdriversinc.com)\nYeah, desensitize or dissociate. And I actually think it's more dissociate because it depends. So for me, when we're desensitized, we're just kind of numb all the time. Whereas if we dissociate, like, I can disconnect from pain without numbing myself to other things. can also choose to allow it in and allow myself to feel. Whereas I think when we're desensitized, you just don't even notice you're not aware Anyway, it's probably semantics little bit, but either way. Yeah, that you have to be able to compartmentalize What's happening and It's a lot.\n00:19:19 - Chona Sweet, DNP ( wspainclinic)\nI don't I don't see how trauma workers could do anything else and yeah, there's definitely trauma right right um But yeah, so far I was still able to look again. I just dug the rail this Two days. I have even with that. have four notes Yeah, that's it. I'll compare exactly come here. Well, except for today.\n00:19:43 - Tina Marie (profitdriversinc.com)\nI'm talking about yesterday.\n00:19:44 - Chona Sweet, DNP ( wspainclinic)\njust hope you But that's pretty amazing. That is that's what I thought told too.\n00:19:50 - Tina Marie (profitdriversinc.com)\nIt was two weeks ago.\n00:19:51 - Chona Sweet, DNP ( wspainclinic)\nYou were 99 Behind the You got 99 problems in a wreck wasn't one Yeah, it's a Monday Hey, I finished mine. Oh, it's definitely good. And there's, I just have another case that come in and I'm, I just need to make sure to have a plan next year to, because it's sporadic. Like, I, I need to be more a little bit more flexible in terms of, oh, have a patient can be see, you know, this patient like last week I did that for Mark's case. He told me at 4.30 at Thursday. I said, we have a patient that lived five hours away. We're setting up transportation. Can you do procedure? Can you see the patient do procedure tomorrow and then have an order consult? And we were able to make that happen for that patient. The next day, which is, you know, we just did a telemedicine orthopedic consult, but we did two procedures so that it feels good. But I just want to try to say is, There's a lot of flexibility that I will need to have, which I think I do have on a Wednesday, Thursday, Friday. Monday, Tuesday, I have clinic time in the afternoon. But again, the hospital is very flexible. I can either go in the morning or late. Night. That's why I can do this. Bye. Sorry. Stay safe. Yeah. you have some downtime coming for the holidays that you can look forward to? So I may have told...\n00:21:53 - Tina Marie (profitdriversinc.com)\nI know you're going to Japan, but I don't know like if you're going to be...\n00:21:56 - Chona Sweet, DNP ( wspainclinic)\nWe're going to Japan, but I told them. like I thought I liked the idea of having a little bit of you know work like phone calls it's all telemedicine and then I was looking at the sketch I told them you can give me telemedicine so so far there's like 10 which is really not much which we'll see this is the first well actually it's not the first time because when we went to New York I have a few telemedicine too so we'll see because Marcus is the same he's awake early work doing phone calls and he works and I was like I can hear him so I thought just like what am I gonna do yeah so this is like yes and then we're leaving Paris January so I also already notified the office I'm out of the office you can give me telemedicine on this date um but there's gonna be downtime you know because we just have you at least won't be community\n00:23:00 - Tina Marie (profitdriversinc.com)\nthing. So that's got to add some rest to it.\n00:23:02 - Chona Sweet, DNP ( wspainclinic)\nRight. Yeah, definitely. And it's two weeks in Japan. This is the first time that we're doing Christmas, you know, by country and just family. Right. So we set up my mom to go to my brother in Kentucky. So she will leave Monday. That way she's not alone. Yeah. My mother is here, but you know, they don't really celebrate Christmas like that.\n00:23:31 - Tina Marie (profitdriversinc.com)\nSo I just don't.\n00:23:32 - Chona Sweet, DNP ( wspainclinic)\nThey're Jewish, right? They're Jewish.\n00:23:36 - Tina Marie (profitdriversinc.com)\nI always tell them because his sister decorates Christmas tree. They're not.\n00:23:43 - Chona Sweet, DNP ( wspainclinic)\nAnd then on stage, well, Easter, his mom decorates. Like they're not very, you know, obviously I didn't have to convert. And our wedding is a fusion of our tradition. Yeah. So yeah. So, you know, it's not. I'm Catholic. Yeah, we have a fusion of that. Um, I'm excited. I'm excited for next year. I'm ready to I have, I'm ready. Although I know I have to voice it out and admit I have self-insecurities, whether I'm a human physical or like how I present myself. I feel I'm not that experienced and lean. I don't know the lingo, but you know, like Mark said, the opportunity knocks that you just have to just just go and then figure it out. So, which is what I've been doing and Dr. E is, you know, now we have a full time full time person that's going to be so that is good. Um, yeah, I'm, you know, I still I wanted to make sure Oh, oh, I wanted to give you feedback. So I the haba slaw, which is Marc Andrews me.\n00:25:06 - Tina Marie (profitdriversinc.com)\nthis is who I visited today.\n00:25:09 - Chona Sweet, DNP ( wspainclinic)\nAnd my haba is the partner or the brother of the lawyer introduced me to Tyler, which is his his main person. He's a he's manager. So we definitely click. And we talk. And I asked her like, I wanted to make sure that, you know, that we're flexible. Obviously, we're doing for the patient, but you know how it works, like trying to, because I'm also navigating this as I'm new. just told her what our practice is. And I asked, you know, based on the two patients, you know, and she said, no, you're, I like you have your notes is because I do don't want them. And he said, it's very simple to the point. So, she likes it, said, if there's anything, know, I'm flexible, we'll always get a total worth possible with the price range, know, we can talk about that. So, again, this is a new thing for me because it's, there's that business side. I feel like I can, I can be, I can like, I feel like I'm likable in general. Like, whoever it's up to, like, that's okay, but it's just, I'm not- You're almost impossible to unlikable, but there are those people you can't please no matter what, so we just throw them out. I just feel like I'm navigating, so I say this. I'm navigating this, the business side, and I'm trying not to delineate it too much. Oh, it's business.\n00:26:51 - Tina Marie (profitdriversinc.com)\nLike, I have to.\n00:26:51 - Chona Sweet, DNP ( wspainclinic)\nBecause I asked her, like, ah, because Mark said that's, that's my advantage because I'm a woman. I can ask those things.\n00:27:00 - Tina Marie (profitdriversinc.com)\nNeither like for business stuff, but well, think about it this way though. No women, I think we all have mother hearts. Maybe there's a few exceptions, but I think of women as the moms. It doesn't matter if we birth children or not, we nurture, we do it everywhere we go. So, but we are stewards and we're, you're just, so think of it as your business also as like your house, your family, your rules. If somebody comes into your house, you lay down the ground rules, like this is what it's like. And you choose, you know, if you go into somebody else's house, same kind of thing, you respect their rules, but you also have your family standards. the point of the rules and the point of the values is this is what we think will take care of our children, our family, our stewardship best. And so, you know, we let's say you're having somebody who's babysitting or coming in to clean for you like you're coming into my family this is my expectations of you and so when you think about taking care of business think of it in terms of that like i'm just negotiating the best outcome for those people and those things that i take stewardship over now if you don't get paid you don't have the resources that you need even if so let's say that energy is part of the resources right because it is so for me to have maximum energy i need to be making way more than the average person i because i i'm going to be hiring help um my experiences my travel things like that those things energize me but when i take that energy back to my stewardship back to what i'm managing my mood and my energy is contagious so if i'm low energy everyone around me and they're like what is wrong with you and they can't even focus on it because they're like, I'm so used to you being bubbly and a battery pack, basically, people literally just take energy from me and not from me, but grow it from me. So anyway, these, these, these are all kind of currencies that we exchange. And again, there's that negative voice and I had to try to tell us certain things that we do are wrong, or they're not altruistic or they're not good or whatever. But the truth is, in order to manage your stewardship, well, you have to make sure that everything's optimized, including your mood and your energy. We already know that if you're thinking you're not getting compensated enough, you're checking out because you don't think it's worth it. So there's nothing wrong about that. If you don't have the energy to show up as your most amazing self, you're not going to be able to be there to bless those people in a way that the average and they see is not going to do. So just see each person that you're negotiating with, especially if it's another woman like, hey, we're the ones taking care of everybody, what do you need a care of your family that I can give to you, right? And that includes the payment negotiations because their family is business oriented as well. And here's what me and my family need, right? stewardship. And so if you think about those financial conversations as just another part of the, you know, family exchanges, like what we need to take care of then you can remove that stigma about, you know, whether it's kind of dirty or not right or whatever, like there's just these things about about adding the financial element to it. And just know that that's what enables you to be able to show up at your, at your fullest and as your best self, to give all these gifts, to show up for that man that you showed up yesterday, that you would have done, even if you hadn't. got paid, but because you get paid well and because you manage things well, you have more in your tank to give to him, even with all the things going on for you right now.\n00:31:10 - Chona Sweet, DNP ( wspainclinic)\nYeah, yeah, I just have to really, it's a way we thinking, and it's a perfect example, not today, because one, like I said, that case manager, when I asked if he likes spa. And then second, actually my friend who I become friends with through Mark, because her husband is a chiropractor and she kind of just her husband. So anyways, now we're going to be in a different, not different, but in addition, I guess, to our friendship, Mark asked him then if they can send cases to me now, because I'm in Pete, a management, and she just called me. So he just told me she has a case for me. I told her, But I'm just being honest, like it feels weird as talking business because her demeanor changed too when we're talking, but we were friends begin with it. then now we have to like be on this level. It's really interesting how how that and I'm just hoping that this will not affect.\n00:32:24 - Tina Marie (profitdriversinc.com)\nI'm going to give you a perspective because it it may be, but like my fiance and I both have this habit in his daughter called it his business voice. So he's very just kind of like gentle giant. I love his deep voice and it's just calm and soothing. But when he talks business, anything that is any kind of leadership or like something he's passionate about his volume like triples. And the intensity and the energy completely shifts and I'm like, like he is in a different mode. completely and I'm probably the same way because like I have a down here kind of thing but it's not necessarily business. It's anything I'm passionate about. I'm in Sunday school, I'm like raising my hand. I'm a nerd. But I was the same way in biology class, on the same way in business, on the same way about sports but I definitely have modes of like this is just kind of chill and hanging out with my friends and then there's although even when I hang out with my friends when I go crazy. So I guess I'm pretty much crazy all the time.\n00:33:35 - Chona Sweet, DNP ( wspainclinic)\nNever mind. That's bad. Yeah, no, it's just and we more talk about it. And the thing is we haven't seen each other since April. We've just been busy and and I was since I started this in September. I haven't seen hers and now we're doing this. But you know, it's just something that I guess I just have to navigate. you know and be okay with it and not weird about it and be open.\n00:34:06 - Tina Marie (profitdriversinc.com)\nWouldn't you rather do business with friends?\n00:34:08 - Chona Sweet, DNP ( wspainclinic)\nYeah I mean I don't know again this is the first time I'm doing it. Mark has done his still do business with his friends and he I don't know if again because it's new but I you know we have there's like not a saying but you hear people it's not good to do business with your family your friends so maybe that's why I have that negative kind of connotation about it.\n00:34:38 - Tina Marie (profitdriversinc.com)\nThere's a lot about that but I'll tell you having been in the business world for a long time there's a you know don't mix business with pleasure whatever you have to ask yourself who is the they that say these what are their values um but in in small communities everybody's doing business with each other they're all related so you know. there has to be a place where that's not true and that means there has to be people in value. So if you think about it, what kind of person would say that? That would be somebody who wants to take advantage of other people and not about about it. That's who would say that. Or that's the kind of person who isn't willing to have a difficult conversation with somebody else who's crossing the line and needs to be managed. Some people will want to take advantage of friends and family and things like that. But that's true in all of life. So the solution for a leader isn't to avoid that. It's to be conscious of it and make wise choices with who you do business with and make sure that everybody that you do business with is qualified for the level of access that you give them. But you should be doing that in all areas of life. When we share details of our lives, we should only share it with people who are safe with that level of access. When we show details of our business, we should only share it with people who are safe with that level of access. And so just because somebody's a friend doesn't mean that they should not be somebody that you do business with, but you should ask yourself, are they qualified? Can they handle this type of conversation? Can they, and one of my favorite kind of litmus tests is, are they a consistent person across the board? they show up the same everywhere they go? Like, I am as either nice, obnoxious, feisty, whatever you want to call it, everywhere I go. Doesn't matter if I'm at church, doesn't matter. I sometimes will say bad words and sometimes they're places I'll never say bad words. But the type of language, the values, the energy I have shows up across the board the same. So anybody can do something with me and I'm going to show up the same. So when you evaluate people and you with your psychology background will be good at this and you probably were naturally, probably why you gravitated towards it, just reading people. But if you can tell, there's something behind somebody and they're not sharing it, then I proceed with caution, whether they're it's a professional or a friend relationship. Yeah. one of the other things, Shona, I will leave you, well, we're not, we're not ending this, but I really would love to share with you as a woman. And something that I've noticed is that it's not just as a woman, it's just period, that the kind of worldly perspective, whatever it is, the general rule of thumb, I almost always can throw it out because I am an exception to most of the rules. And the reason is, is because I'll tolerate more pain than most people will. I'll, I'm willing to be more truthful than most people will. I'm willing to, and those two things go hand in hand, because sometimes the truth is really, painful and I can sit with it. But I wasn't always like that. I had to learn that and I had to choose that and the reason I chose it is because not telling the truth could cause more pain than telling it. Whether it's just telling somebody I don't like a particular thing or I don't want to be somewhere and then making an excuse for it instead of just saying, yeah, I'm not really interested in that and just letting those burdens go. But most people will mask and they'll put on kind of a show. those are the people that are making the rules and the adages that we live by. so you have to ask yourself, do you want to follow the rules of the people who are not really happy, who are not really living authentically, who are not really living in alignment with the values that they have or who don't are value less, right? Or do you want to live according to your value? and according to the dictates of your unconscious. if that's the case, you're probably going to zig when everybody else is zagging. You're probably going to do something different anyway. And so trust your conscious, trust if you're a praying person and you talk to God about things, trust what you get, trust when you feel peaceful about it, and be willing to be brave and learn from experience. So one of the other things that I've learned a lot is being willing to be wrong, but get the answer for myself. So, so-and-so says this, I feel this, I actually don't know. The only way I'm going to know is to try something. So I'm going to try my way, and if I'm wrong, I'm going to deal with the lesson of being wrong. But then I'll know, and I can take that knowledge and apply it to everything else moving forward, rather than trying to find this zig spot in between and avoid any kind of pain, which is what most people try to do. I'd rather get to the painful part and have the certainty, then try to avoid it.\n00:40:06 - Chona Sweet, DNP ( wspainclinic)\nDoes that make sense? Yeah. Yeah. That's how we learn.\n00:40:10 - Tina Marie (profitdriversinc.com)\nAnd I think that that's what you're doing. I think every type of growth that you've had so far has been, I'm just going to deal with the pain and I'm gonna make this decision. I'm gonna see how it feels.\n00:40:21 - Chona Sweet, DNP ( wspainclinic)\nAnd then you come out like, yeah, that was awesome. Yeah. So far, it's, you know, so far, it's challenging with the balancing. And to be honest, like, I'm trying, I know me as a person, I get easily there with what happened to me back to Rachaeli. It's very, I can, like, yesterday, yesterday, Sunday, I was, I'm not working. So, but yesterday, I was my work day. I was definitely derailed on that one, but I make sure that I get up today and do what I need to do.\n00:41:16 - Tina Marie (profitdriversinc.com)\nIt doesn't seem direct to me at all.\n00:41:19 - Chona Sweet, DNP ( wspainclinic)\nYeah, I mean, to be honest, I started the process on the Washington and even that I have yet to finish that. Like, have to go to two universities and to be honest, I haven't.\n00:41:33 - Tina Marie (profitdriversinc.com)\nSo this is the thing. This is why we will talk about pacing lots of times. There is there is a divine kind of pace that is so much bigger than us that's happening all the time. I have this conversation frequently and because I have strong energy and I'm powerful and I can make things happen. have, you know, there's obstacles or whatever, I've tried had to power through and push through, and every single time it has backfired. So sometimes it's just I needed to grow and I wasn't what I needed to be. And God just kind of like, just, I'm going to give you these obstacles. chill out because I'm trying to teach you some things and some of those things are just subconscious. Some of them are experiences. Sometimes it's because God is doing work with the people that I'm going to be doing business with, and he needs them to be changed for me so that when we already the work together, everything is aligned. And I only know this because through long conversations, we're like, wait a minute, if this had happened sooner, we wouldn't have been ready because of this, because of that, because of this. And so there are things that are happening that are outside of my control. You got in a car accident outside of your control. There are different things and we can look at that and clearly say I had no control over that. It happened. Then I will go, okay, well, maybe, you know, I'll keep doing the things that I'm control of but I'm not going to try to compensate for the things that are happening outside of my control and just allow that slow down or throttling to happen and continue being consistent showing up at the pace that I'm doing. Now in terms of like keeping on top of charting to me that's the showing up consistently and sometimes you have to compensate for that but when in terms of like marketing right the growth oriented so there's maintenance level work sometimes you have to you know compensate for the person to keep up with the maintenance but the growth type stuff sometimes that just needs to be throttled and paced back because all of these other things come in and so when that happens instead of like feeling bad about it or like I should have done this it's not going to grow as fast we understand that whatever it's going to be it's already It's kind of predetermined. You basically show up to do the thing, right? There's something bigger than you because it's not just you. It's all these other people involved, right? And they're all belong to God too. They're all his children too. And so he's kind of helping us. And all we have to do is show up. So as long as you're still showing up and you're doing the work and you're pondering it, and if you feel like, okay, I should be doing this because you've got the energy, the motivation, you can do it versus the guilt, right? Because God doesn't use guilt, Satan uses guilt. We got to think about this. God gives us good feelings. So just kind of like check that and just be like, you know what? It's the holidays. I have done all of this work, which is one of the reasons why I think pointing out the winds is really big. Right. We can't have all the winds all the time. We'd be burning out. Like if that was happening, you'd be burning out. So if you can look at yourself and look at every day and go, I'm, I did good. This was good. enough and just let that be enough and then just keep keep working on inserting the growth on top of the maintenance because if you try to go faster than that you will burn out but also there will be other things that won't be ready for you to get there because we're all kind of working together even if we're not aware of it there's synergy that would exist for a reason it's that there are these ethereal kind of tethers to other people and other things in life that we can't even we can't even wrap our heads around and we can't touch and we can't see but we can tell there's something happening that's why we have that word is this this alignment that can't be explained otherwise so just you know take all of that into account measure how amazing your growth has been how much you haven't allowed things to derail you how when you made a choice to like keep up with charts\n00:46:00 - Chona Sweet, DNP ( wspainclinic)\nother amazing things happened and I think we need to get in a habit of just started like writing it down like maybe I just have a document of like all the wins that you report to me so we can go back and go and this is what happened in the last 90 days of just like that's amazing yeah yeah because it really has been amazing Jonah right I mean it's it's I feel like it is definitely that right and you saw me as like feeling defeated and then oh there's that money component but then I'm trying to again look at the bigger picture not everyone will you know other things not not everyone will have this kind of like partnership that died for me with Dr. E and obviously paved that way for me and which what you can only do is you can just do But at the end of the day, will still be up to me to take this work, which I'm very grateful for. And I think he can also see that we're ready. And I'm getting a little nervous with James because I don't know how busy we will be and the holidays and everything. But I just have to, it is what it is and this is what we wanted.\n00:47:29 - Tina Marie (profitdriversinc.com)\nActually, that right there is probably a very good reason why you don't want to be pushing for Washington stuff. You already got one type of growth that's about to hit you.\n00:47:40 - Chona Sweet, DNP ( wspainclinic)\nI would just brace yourself for that and not think about anything else. Yeah, especially today too, like when I met Havas, and I was kind of engaging how big they are, how busy they are. I was talking to the case managers, how many attorneys tell we have 18? Oh, yeah, that's a lot. I know Mark has, I don't know. Samantha, Lorenz, Tyler, Hank, Patrick, Patrick, Patrick, cutest if I had a boy like he'd be about Patrick's is like, mean, just the door, then, um, well, Michelle, who is a, it hurt his chief financial officer, but also a lawyer, but none taking a lot of this is 18, and so I guess, and I know Mark refer cases to him, I guess the cases that they don't like, so they handle volume. Yeah, what I understand. So, and then it's a blessing because I'm supposed to meet Mike, which is the brother of the lawyer, the main lawyer, and then he passed by and I was introduced and he said, okay, we'll start meeting. I kind of like, try to throw it out there very quickly. Like we have four officers, so I'm learning on how to just be very quick, say what's the most important things to say for in a short amount of time. So that is what we came to management. So we have four officers that's really, okay, we'll start feeding you cases. That's what he says. Like, we have that. That is amazing. That is a good, really good meeting, I think, and relationship with Tyler, which is the right hand case manager. Tyler is apparently like Mark's Mary.\n00:49:35 - Tina Marie (profitdriversinc.com)\nBut Tyler's a woman?\n00:49:37 - Chona Sweet, DNP ( wspainclinic)\nTyler's a woman, I know.\n00:49:39 - Tina Marie (profitdriversinc.com)\nI've never heard of a female Tyler.\n00:49:41 - Chona Sweet, DNP ( wspainclinic)\nYeah, and she's tall. Like you're tall. She's like 5'7\", she's like, oh yeah, he's very lovely. So we connected very How tall are you, Tona, that you think 5'7's tall?\n00:49:53 - Tina Marie (profitdriversinc.com)\nOkay, we're just saying.\n00:49:54 - Chona Sweet, DNP ( wspainclinic)\nWell, I'm 5'2 and 6'4\".\n00:49:59 - Tina Marie (profitdriversinc.com)\nHe's tall.\n00:50:00 - Chona Sweet, DNP ( wspainclinic)\nOh yeah, she's 6'4 and her mom is 5'2 and that's why she's, I think she's 5'7, 5'8, he's tall and you know, I like, I really like her so we connected there and I feel very good about her. So tomorrow I'm going to meet Steve and yeah, the person that I'm going to all men tomorrow, I'm the only woman to all. Well, that's what Mark said. Mark said there's Steve, the main partner and there's two people that run place and I told Dr. E, you better be here and you better not be late. But anyway, she will be there and I'm, you know, I think it's, oh, it's at that level that Dr. E needs to be there because he owns a practice.\n00:50:54 - Tina Marie (profitdriversinc.com)\nMy daughters just got home, moms are going nuts. Bob, can you? Aphrodite out, please Is that the new not the new dog, right?\n00:51:05 - Chona Sweet, DNP ( wspainclinic)\nNo next week.\n00:51:06 - Tina Marie (profitdriversinc.com)\nWe don't even speak. I also unpacked ours Okay, so I mean so we're like halfway through December and we've got really just kind of Science and patience especially So what I want you to do is I want you to focus on your health and your energy I want you to focus just on having a consistent schedule and keeping on top of your charting and Celebrating the wins with me whatever they are and and just if you don't have a window report just maybe something you contemplated that day so that we're staying connected and just kind of in the zone and Don't let mark be pushy Letting me anything don't don't let the the kind of like go go go energy and he's like that Take this time tell him look you need to go talk to Tina Just tell him and you can text us in a three way and I'll get on it for you But like take a couple of weeks to just kind of rest because you've been in a sprint mode While yeah, I think that's why I got sick Yes, and so take this time On cue take this time to read be really intentional about rejuvenating and Resting physically and emotionally and just contemplating because there's a lot of power in that Contemplation in that awareness of where you've come from and what you're preparing for because you're going to get into another sprint mode And it will be exhausting it will be difficult and it will be stressful for a while And then it will kind of balance out and you'll be okay If you don't do a good job about disconnecting and giving yourself some space mentally, physically, emotionally, right now, that's going to be a lot harder. You could get more sick, which is going to throttle you. It's going to frustrate you. But it's also going to keep you from showing up for your patients the way that you want to. And they need you.\n00:53:20 - Chona Sweet, DNP ( wspainclinic)\nknow, you, I didn't tell you that they are setting aside PI cases on Thursday afternoon. That's for me. Wow. So that is from Dr. E. I mean, they didn't ask me first before they do this. Although, I think they kind of see the pattern that I'm scheduling PI cases on a Thursday. So they probably thought, I like Thursday, which is fine. But I said, here it is. It's coming in terms of lean cases only on Thursday afternoon. So when It gets bigger. It's going to be I I'm going to say Wednesday, Thursday.\n00:54:05 - Tina Marie (profitdriversinc.com)\nSo yeah, go ahead. I also want you to really just be looking at your calendar and being really intentional and paying attention. Like, do you want to put caps on things? you want to make sure that sometimes or certain like blocked off? don't fill this out. Make sure that you are driving what's coming.\n00:54:31 - Chona Sweet, DNP ( wspainclinic)\nOkay. I didn't tell me that Thursday, but then I realized it actually works out.\n00:54:37 - Tina Marie (profitdriversinc.com)\nYeah. And also trust yourself to be able to do the hard things because you, you know, three weeks ago, this was like, I don't know if I want to do this anymore. And no, but that's not a judgment. That's not a bad thing. It was just you have to make a choice. But my point is that the power to shift.\n00:55:00 - Chona Sweet, DNP ( wspainclinic)\nstop was completely inside of you and it will remain that way but it was you driving what's happening and you owning what's happening that changed everything so don't stop doing that yeah you know i'm yeah and i'm ready i know i already said to myself oh did i tell you i don't know we friday with my friends i we kind of like i think i may have started like let's go around the table what's our goals what the plans are for next year not just look these are my luxury friends so they're you know they're very bougie but you know we talk about but they're like they have careers and businesses so we talk about that and i may have said out loud i don't i don't know it's a and they're like okay I see the like she's kind of crazy type of love but like I said it out loud that's what I said for myself and it's what I'm going to get so yeah yeah I didn't even realize I will do that but yeah here we are there we are so so you have got to manage your energy yes so you need to take these you tell mark if you like you gotta blah blah look have us James they're coming I'm gonna rest so that I can kill it and you're not gonna bug me about it sure yeah I know he introduced me I have small ones chiropractors and other lawyers but again mark said like mark said nothing not everything will work out into James we just don't know But, you know, so far I have a good feedback from Haber's Law because when she told me like, I saw her notes, you know, it's good and you're on top of the patient's, the patient like you, you know, it's like, so it's a good feedback that's just consistency.\n00:57:16 - Tina Marie (profitdriversinc.com)\njust need to keep on. Yeah, because Chona, most of the things I win in life, I win just because I show up. Because very few people just show up consistently. And so I'm telling you that because I want you to understand how powerful that is, how impressive it is. All the other doctors, not all of them, most of them, do not show up consistently. The people they hire don't show up consistently. Very few people get a consistent experience with the people that they work with. So two things about that. one, know that you're incredibly valuable just because of that. number two, when you eat those kinds of people in business, keep them because they're incredibly valuable and rare as well. Consistency is a powerful signal and a delineator really between just about everybody else and these, you know, exceptional people in life.\n00:58:23 - Chona Sweet, DNP ( wspainclinic)\nAll right, let's go.\n00:58:29 - Tina Marie (profitdriversinc.com)\nThat's what I was just going to do, let's go. Look at this, because I know Mark is planning on keeping his calls with me.\n00:58:42 - Chona Sweet, DNP ( wspainclinic)\nWhen are you available? Monday, you mean next week? Yeah. Oh yeah, I'm available too.\n00:58:51 - Tina Marie (profitdriversinc.com)\nWell, I'm keeping, I'm pretty much keeping my same schedule, so that means I don't have like new openings. So can you do Wednesday?\n00:59:00 - Chona Sweet, DNP ( wspainclinic)\nnext week still? Yeah, I, we are time. What time are you thinking?\n00:59:09 - Tina Marie (profitdriversinc.com)\nWell, I thought this was a standing.\n00:59:12 - Chona Sweet, DNP ( wspainclinic)\nSo, so let's see. Um, I just want to make sure because we have in Japan right now, so it'll be this would be 6 a.m.\n00:59:34 - Tina Marie (profitdriversinc.com)\nJapan time next week.\n00:59:36 - Chona Sweet, DNP ( wspainclinic)\nOh, 6 a.m. Yeah.\n00:59:38 - Tina Marie (profitdriversinc.com)\nThursday. Yeah.\n00:59:40 - Chona Sweet, DNP ( wspainclinic)\nOkay. Yeah. So then so 5 p.m.\n00:59:44 - Tina Marie (profitdriversinc.com)\nYeah, because I will be calling my patients. I'm sure.\n00:59:48 - Chona Sweet, DNP ( wspainclinic)\nSo this time or 5 a.m.\n00:59:52 - Tina Marie (profitdriversinc.com)\nour time. So same time basically. Same time in your calendar, your Google calendar, if you're on the update for you. Japan time.\n01:00:01 - Chona Sweet, DNP ( wspainclinic)\nOkay, okay, perfect.\n01:00:02 - Tina Marie (profitdriversinc.com)\nSo but the next week is that that day is Christmas day. So that week we could probably just do, um, like audio messages, checks in.\n01:00:13 - Chona Sweet, DNP ( wspainclinic)\nOkay.\n01:00:14 - Tina Marie (profitdriversinc.com)\nYeah.\n01:00:14 - Chona Sweet, DNP ( wspainclinic)\nthe next one would be the second after that.\n01:00:19 - Tina Marie (profitdriversinc.com)\nIt would be the first.\n01:00:21 - Chona Sweet, DNP ( wspainclinic)\nI'm okay. You're right.\n01:00:23 - Tina Marie (profitdriversinc.com)\nI mean, you guys are probably going to be partying or something, but we're not. I can keep the first because that's not nearly as big of it. I'm always like ready to get back to work, especially with the new year energy.\n01:00:39 - Chona Sweet, DNP ( wspainclinic)\nYeah. No, it's the same way. I'll be back to work on the 30. People working.\n01:00:46 - Tina Marie (profitdriversinc.com)\nYeah. So next, uh, next week, we'll meet normal. The, the week of Christmas, we'll just go ahead and cancel that and we'll, we'll check in though.\n01:00:56 - Chona Sweet, DNP ( wspainclinic)\ndon't want to not communicate. Okay.\n01:00:58 - Tina Marie (profitdriversinc.com)\nI just, just not a. that call and then we're back to schedule starting January 1st 2025.\n01:01:06 - Chona Sweet, DNP ( wspainclinic)\nI actually like that that we're doing it on. I don't know, I have a super state is the least one on New Year's. Like I have to work on New Year's because I feel like I'll be working right here.\n01:01:21 - Tina Marie (profitdriversinc.com)\nYeah, you can be working on accomplishing those goals and yeah, that's how I am. Also after COVID, I keep saying it, I did all the sitting I need to do pretty much for the rest of my life and just like not doing stuff. I'm like, okay, I'm fired up forever. Now let's just go. Yeah, got things to do.\n01:01:40 - Chona Sweet, DNP ( wspainclinic)\nI am going to chart my goal now is after us. I'm going to chart and then I'm going to have my hair done. I'm for it to be ready for to look okay for Mark's dinner. He's always a trainee. I don't know, he does this every year. The day before his both party is Only dead turn these enders significant others.\n01:02:03 - Tina Marie (profitdriversinc.com)\nOh That's that's what we're doing tonight. I'm feel free to send me a picture of how amazing you to look.\n01:02:10 - Chona Sweet, DNP ( wspainclinic)\nI Don't even know whatever fit sick You can't look beautiful and beautiful I know it's just I guess because I've gained a lot of weight and I'm a little bit in here But I was that something that I just need to you know be consistent with you know With everything in life But but you cannot not be beautiful like what you know what you look like before But you are stunning and then you add your personality on top of it, and it's just like heart eyes Thank you. Thank you so much. No, I am taking it all in like oh again, I Think I definitely change this before I don't like I stop it, you know, but now like yes Tell me more\n01:03:00 - Tina Marie (profitdriversinc.com)\nYes, yeah, you need to get all the the good the good guys Oke up all the good energy and take it. I know I used to deflect it to I'm like, you know what?\n01:03:10 - Chona Sweet, DNP ( wspainclinic)\nI'm just gonna just yeah Yeah, I need to go check out my little girls, but um you okay next week in Japan The power of yourself okay That is the only potential issue is because they told me I can get him any time well there We don't know what the date is yet, but the day I'm flexible with anything.\n01:03:38 - Tina Marie (profitdriversinc.com)\nYou just let me okay Okay, I'm on I'm on All right, all right, I'll talk to you soon. Thank you. Bye\n","contentPreview":"00:00:03 - Chona Sweet, DNP ( wspainclinic)\nHi, hi, I was just gonna see if you're coming. Yeah, sorry. I don't know how to make a decision. I'm in Mark's office. Okay there. I think it's charges. Oka...","processedAt":"2025-05-04T03:40:52.518Z"}