{"fileName":"Transcript for Chona(6).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Chona(6).txt","type":"transcript","priority":"medium","content":"00:00:03 - Chona Sweet, DNP\nHello. Can you hear me? cannot hear you. Oh, there's my fault.\n00:00:14 - Tina Marie (profitdriversinc.com)\nYou didn't get to hear me call you beautiful.\n00:00:16 - Chona Sweet, DNP\nI said you're beautiful, Jonah. Thank you. It was pretty. It's Mark. Mark's going to hit me. I don't know, probably.\n00:00:26 - Tina Marie (profitdriversinc.com)\nI don't know. haven't heard anything, but we can start. I, oh my gosh, girl, if I sent you a picture of like the way my glucose levels have been, it's crazy.\n00:00:40 - Chona Sweet, DNP\nI go to Ohio.\n00:00:41 - Tina Marie (profitdriversinc.com)\nThey're low at night, I'm eating good, and then they'll just rise up to like 140 when I wake up. And then I eat, and it goes down to 70. It should go up when I eat and down when I don't. And it does the opposite consistently. It's So I got to figure out like, are you on medication yet or? I'm not going to do it because there's too many issues with it. And also this, like all the diabetes medicines aren't. Yeah, anyway, I need to understand my body first.\n00:01:14 - Chona Sweet, DNP\nI've lost three and a half pounds.\n00:01:15 - Tina Marie (profitdriversinc.com)\nTold me that and like I really could at eating good. My body is just waxed. So anyway, trying to figure out if it's my liver. I need to go get some labs on my liver. And I don't know if there's one for pancreas, but I'll figure out what to do.\n00:01:32 - Chona Sweet, DNP\nMy pace, you know, like, you know, those.\n00:01:36 - Tina Marie (profitdriversinc.com)\nI don't know why I wonder if it's enzymes that I'm taking that are making a difference. Cause I am taking. And I'm including lipase to help with digestion.\n00:01:53 - Chona Sweet, DNP\nThat makes the blood sugar high, you know what you're saying?\n00:01:57 - Tina Marie (profitdriversinc.com)\nOr too low, like.\n00:02:00 - Chona Sweet, DNP\nYou're it's low in the evening.\n00:02:02 - Tina Marie (profitdriversinc.com)\nIt's it's low when I eat most of the time Yeah, yeah, it's 70 is actually normal It feels terrible Mostly it's not that it's 70. It's that it got to 70 from 140 in an hour Yeah, it feels terrible.\n00:02:22 - Chona Sweet, DNP\nYeah, it's the rapid descent right feels terrible You know, I see that on patients who are type one diabetic Not really type two diabetic.\n00:02:33 - Tina Marie (profitdriversinc.com)\nSo that's it's possible that um, so I've always been prone to hypoglycemia So it's totally possible that it's kind of a combo that was made undiagnosed But I've done fasting up so I wasn't officially diabetic, but I've definitely had the A1c 6.5 like on the dog.\n00:02:56 - Chona Sweet, DNP\nYeah, yeah So\n00:03:00 - Tina Marie (profitdriversinc.com)\nI don't know, we'll figure it out, but I'm such a data nerd and I literally have it every 15 minutes plus I track my food religiously and I even time stamp my food and I wear my Apple ads so I've got my activity so we're gonna figure this out.\n00:03:17 - Chona Sweet, DNP\nAre we using the same ID every time this one or no? every time. How do I, because I don't know, I log in on my zoom, but so it's in your calendar events, so if you just click on it from your calendar or it's not showing on my, it's really weird. don't see the zoom meeting that you've sent, it's weird, it's from, it should come from me, so hold on a second, me go make sure, it says you have not accepted the invitation. I'm to add the email, try to tweet at yall.com, right? Yes. I don't see anything, which is.\n00:04:06 - Tina Marie (profitdriversinc.com)\nI will do. Save. That's an all following event. Okay. Send. Okay. now it should come to you from Tina at profit drivers, Inc.\n00:04:23 - Chona Sweet, DNP\nOkay. Yes, it's just waiting. And so I make sure I get it.\n00:04:30 - Tina Marie (profitdriversinc.com)\nAnd then if you get it and you click. Yes, it should show up in your calendar and that link is in there.\n00:04:37 - Chona Sweet, DNP\nSo all you'll have to do is just go straight from your calendar. Okay.\n00:04:41 - Tina Marie (profitdriversinc.com)\nthing is you could just bookmark. link. Save it as in your bookmarks.\n00:04:48 - Chona Sweet, DNP\nOkay. I'm still waiting and wonder if it's going to my. Okay. Okay.\n00:04:55 - Tina Marie (profitdriversinc.com)\nThat's totally possible.\n00:05:03 - Chona Sweet, DNP\nyeah I know I don't get maybe it's just taking some time slow yeah I don't have it yet you have a google email that I can add to it? yeah you can use my work email chona.sweet at wspainclinic.com sorry my mom's here yeah I just grabbed my white coat and cuz she went through clean it yeah I saw it I received the one in Gmail okay so whatever will get it into your calendar so that all you have to do is click on it that zoom link is there okay and you can just click on it Anyways, today's a better day than yesterday was, yeah, but I'm still like charting. I'm here at the other dining area because I remember the mishap that happened. So I have the couch, it's already a big plan, so it's a good thing. But, um, so they cleaned that area, too, so it's still wet.\n00:06:26 - Tina Marie (profitdriversinc.com)\nSo, yeah, that was, yeah, it's probably in the woman, right?\n00:06:33 - Chona Sweet, DNP\nI was like, yeah, no, that was yesterday and it was, it was, yesterday was one of those days, I feel like, um, it's just busy day, but it's not uncommon if that makes sense.\n00:06:47 - Tina Marie (profitdriversinc.com)\nIt's just busy. Yeah, that's all right.\n00:06:51 - Chona Sweet, DNP\nYeah, it's just everyone just keeps them blowing now.\n00:06:56 - Tina Marie (profitdriversinc.com)\nSo, so, um, Let me let me open up my notes here.\n00:07:02 - Chona Sweet, DNP\nI know I feel like I have assignments I need to do and I feel like we haven't. But I'm glad I'm better. I need to work all the way even if I'm sick.\n00:07:18 - Tina Marie (profitdriversinc.com)\nThat's how my sister is right now. She sounds like death and she's a nurse. She works in a methadone clinic. Which has been really good for her because it's helped make her like more compassionate but it's also good for them because she's actually nice and caring and those people always get treated the nicest you know. So let me share my screen. I'm gonna move this now. That's the wrong thing I clicked on. My daughter and I just got done making dinner for a family at church and we made them like this later. taco dip and some fresh pico de gallo and it was so good. And then some onions and chana, smacked the brownies and my sugar still dropped to 89. was crazy.\n00:08:13 - Chona Sweet, DNP\nAnyway, that was weird. Well, how fast did you check your sugar after you eat?\n00:08:20 - Tina Marie (profitdriversinc.com)\nIt's every 15 minutes and um but it peaks around in over 15 minutes and then it starts dropping again and if I walk around because I have bit of pacing, it drops really quickly. So anyway, I've got lots more.\n00:08:34 - Chona Sweet, DNP\nMaybe just predi- you know, I don't know, you can still.\n00:08:38 - Tina Marie (profitdriversinc.com)\nI don't think I'm like organ level damaging but I do not give me pain a lot. Girl, I've got osteoarthritis, spina bifida.\n00:08:47 - Chona Sweet, DNP\nI've got a lot of cataracts since I was seven.\n00:08:50 - Tina Marie (profitdriversinc.com)\nMy body is jacked up. Jesus is like, yeah, you can handle it. I'm just going to teach you how to do it.\n00:08:57 - Chona Sweet, DNP\ngosh, talking about that. Sorry, I'm just- I got distracted. with the dragon out. I have yet to use it because I have went up down up. I guess uploaded it on the laptop. Marga gave me this laptop and it's super tiny. I wish I can show you and I love it because it's tiny.\n00:09:18 - Tina Marie (profitdriversinc.com)\nOh you like that it's tiny. Huh? I said oh you like that it's tiny.\n00:09:22 - Chona Sweet, DNP\nI like the big. I think because I bring it with me. Oh you know everywhere and except when I'm around in the hospital I don't want to wear a bag. I just want to go around and I feel like you know I got as time goes by I have more inside. Like you said like it's just a matter of time.\n00:09:45 - Tina Marie (profitdriversinc.com)\nSo let me see if oh dang it I moved in. I got zoom in my Ah! What's it? here. Because I created a slide kind of chart thing. What was it in? Was it Google slides?\n00:10:12 - Chona Sweet, DNP\ndon't remember. I shared something with you.\n00:10:14 - Tina Marie (profitdriversinc.com)\nI to check my text messages.\n00:10:15 - Chona Sweet, DNP\nI think think I saw it on.\n00:10:21 - Tina Marie (profitdriversinc.com)\nWhere's Choma? There's Choma. I go to just screw it up. Because this was like a couple weeks ago because you were feeling bad. I know it was like, you know, I feel Wasn't it? I think it was slides.\n00:10:46 - Chona Sweet, DNP\nI got it. I got dance message too.\n00:10:50 - Tina Marie (profitdriversinc.com)\nOh, this is the wrong one. I just have to verify, I can't see it yet. No, this was not a file open. Maybe I did not. Okay, so anyway, here's what So we'll start with that and then we'll figure some things out. The first thing is though, because we've got holidays coming up really soon and one of them is on a Thursday, so that's not going to work. I want to check our schedule and see how we're going to go through this. But one of the things I was wondering is if you're starting any later or if there's any day of the week where you could meet during the day.\n00:11:57 - Chona Sweet, DNP\nYeah, yeah.\n00:11:59 - Tina Marie (profitdriversinc.com)\nOh, good.\n00:12:00 - Chona Sweet, DNP\nthat would be awesome. It is so um I yeah we can do that um I think now I kind of know what my schedule is so it's kind of you know getting there so I can tell you what my schedule is and okay um is that something that we could go over now or is that? sure so um Monday Tuesday I have clinic in the afternoon 130 to 430 depending on how fast I finish um and then what I've been doing I just want to tell you what I've been doing recently is I've been after the clinic that's the time I go to the hospital that's why I'm kind of staying later because from Huntington Beach to Long Beach it will take 30 or 40 minutes so That's what I've been doing and usually I'm done at before eight, seven, seven to eight, I'm on an alcohol and then I chart all the way. And then I, you know, we talk about this, send you that message and today I started going to the hospital early. I have a clinic, I don't have, okay, sorry, let me just go back.\n00:13:22 - Tina Marie (profitdriversinc.com)\nIt's probably fine.\n00:13:24 - Chona Sweet, DNP\nMonday, Tuesday afternoon clinic that sets 130 to 430. In between those times, I have to do telemedicine patients and hospital. So those are the two that I need to do. Wednesday, Thursday, I don't have clinic hours. I only have telemedicine and hospital patients I need to round two. during this two days, this is usually where I put, I plan to put my lean patients. you know the lean ones. So today actually I saw two lean patients this morning from 10-30 to like 11-30. So and then Friday hospital again phone telemedicine patients again and then no clinic days. So basically Wednesday Thursday Friday is where it's open for lean patients. That's how he kind of set up my schedule for now. But you know at the end of the day it's when whenever the patient is available right. So that's that's that. Like today I was able I'm lucky I was able to set up two patients today. Two lean patients on one area.\n00:14:52 - Tina Marie (profitdriversinc.com)\nSo any of the in patients I've brought in so far.\n00:14:55 - Chona Sweet, DNP\nThat I brought in is three.\n00:14:59 - Tina Marie (profitdriversinc.com)\nOkay.\n00:15:00 - Chona Sweet, DNP\nYeah. And then I've been just, there's a patient that he told me, he told me I can have it because he's so busy. So I saw the patient. And then I did the procedure myself. So it's like trigger points. So I don't know if I'll consider that as a patient. He told me it will be mine. So I don't know. But he wants me, he told me today, he wants me to do a Google drive where I have to kind of share with him who the patients that I brought in or undermine, I guess, because he cannot track this, all of this. which I have yet to do. Let's be honest, I don't know how to do it. And I'm just kind of, right now it's like survival. Like I'm just trying to do the most urgent ones right now that I'm doing, but I need to do the Google share, shared Google Doc, where in he knows the patients, I'm seeing or I'm going to help you with anything that you need to create to organize.\n00:16:05 - Tina Marie (profitdriversinc.com)\nSo bring it to the call and so so part of our call will be just a download of how was the week, although hopefully not too much because we should be talking throughout the week.\n00:16:16 - Chona Sweet, DNP\nSo that'll help me say up to date and also help just give you some support.\n00:16:21 - Tina Marie (profitdriversinc.com)\nBut that means that we can spend our call really working through key stuff, right?\n00:16:26 - Chona Sweet, DNP\nSo I really definitely need the Google drive for my patient's name. I still don't know what to put in there. Mark told me I should also kind of monitor where which law firm or which pyro this referral came from. That's what he told me. So I need to kind of make this and then you can make a copy and edit it and own it.\n00:16:53 - Tina Marie (profitdriversinc.com)\nSo it has nothing to do with me that I'll start one. Okay, thank you. So what do we want to\n00:17:00 - Chona Sweet, DNP\nI don't know. I guess chona lean because that oh uh lid so um yeah so also the office manager Cheryl have a way wherein if it's my linkation there's a you know it's in the header that's it's mine says she put chona lean yeah yeah chona lean yeah that's that's actually what they what they put so they know that it's mine well let's see do we want to separate them we'll just we'll just make it one thing there's actually formats we can use the separate it probably data i don't know what is important data bread or phone i don't know i guess all of it we're gonna want all of it phone email at least some very specific identifiers there's no confusion about what it is.\n00:18:02 - Tina Marie (profitdriversinc.com)\nSo these things should cover it. Now if you you also have to figure out if it's HIPAA compliant what you're creating so some things might need to be taken out or I don't know um let me delete this row and then we're also going to want to yeah because that will be the one that will you know the how much you know procedure. So do you have an initial visit then procedures afterwards? Yeah so like let's see this initial yeah initial visit eight yeah yeah so we'll go procedure from seed year.\n00:18:54 - Chona Sweet, DNP\ncould be multiple procedures like the patient that marks office gave us I have an initial visit. she'll visit and then I have a follow-up visit and then there's three separate procedure notes.\n00:19:06 - Tina Marie (profitdriversinc.com)\nIs there two E's or one E in procedure?\n00:19:08 - Chona Sweet, DNP\nA one E.\n00:19:10 - Tina Marie (profitdriversinc.com)\nThat's what I thought but I was like but the procedure is two E's so I'm like okay procedure one and we're gonna say procedure date one but one date sorry one day so probably gonna I'm gonna try to make it easy I don't know you know oh there oh so here's um let's see two sorry we just I don't want you to get caught in the trap of trying to keep things too easy this data is important um it's going to be really important in terms of tracking revenue so um so really what I think it's also good to like see I don't know just what we get paid what we get paid\n00:20:00 - Chona Sweet, DNP\neight permits I guess so let's do this we're gonna see I actually marked this game but I don't know I actually forgot have forgotten if it's 20% or 30% honey do you remember if 30% or 20% for procedures oh 20% so uh huh no no oh the bill is not what I get paid yeah got it oh okay cuz I get 250 for each visit so like initial visit follow visit you know yeah so so do we we'll improve this yeah imagine is once you start it he's gonna say well actually I need this I need that that type of thing\n00:21:00 - Tina Marie (profitdriversinc.com)\nright um but once you've started it then you know you took that off of his plate and it's it's really easy just to get some traction and um you could show this to mark two and see if he's got any suggestions about what he need to have okay it sounds good.\n00:21:21 - Chona Sweet, DNP\nGucci has like kill track well he's got different like law firms that are sending him stuff right so that's the thing he mark wants me to also track like which law firm or character it came from so that way I can make sure I build the relationship I'm sitting here because the chairs are what um so so far you know I really just have one I mean mark and then there's have us law that's really The referral can also be anyone, I guess. So it's going to be legal or doffer. Yeah, that makes sense. So that will at least let us know something.\n00:22:20 - Tina Marie (profitdriversinc.com)\nAnd then, but really you're going to want the name of the company and the person and the point of contact. Because you're going to want to do some work with them to like outreach to them and say, hey, you know, you sent us some patients before. We just wanted to thank you. So then your top of mind and have them send more to you.\n00:22:41 - Chona Sweet, DNP\nYes.\n00:22:43 - Tina Marie (profitdriversinc.com)\nSo, but do you want Dr. E having all of that?\n00:22:48 - Chona Sweet, DNP\nDo you want to have two versions of this? I think I would probably want two versions where.\n00:22:52 - Tina Marie (profitdriversinc.com)\nSo one of the things that we can do is we can create one version for you. then one version. for him that instead of duplicating it, it pulls data from yours, but it pulls the stuff that he needs and it doesn't pull who referred it. Right. So let's see, that's the company name, insert, left, person, name, insert, left, contact, email, and then I'll just hover, there's Mark and insert contact on. I don't know if he wants to be here for this, but there's some stuff and my icing from cutting onion to there. wasn't even the one cutting on my I'll cut it and jalapenos. Get that fresh pico. Okay. So. Um, so this will be the lean tracker. We'll call this this for you and the one that you make for him will have a formula that will populate all of this.\n00:24:24 - Chona Sweet, DNP\nSo, um, for right now, okay, so actually that, that works perfectly. this is will be one that we can share between the two of us. Okay. Okay.\n00:24:35 - Tina Marie (profitdriversinc.com)\nNo, just this will be, I'll share this. I can own it. You can have it. And then what we'll do is you'll create a new one and I'll walk you through the formula that you need to put in there. Um, and that way so he doesn't this data.\n00:25:00 - Chona Sweet, DNP\nSo it's like, I have a master list, we're in whatever I put in there will automatically put on.\n00:25:07 - Tina Marie (profitdriversinc.com)\nYeah. And so, and we can modify it as we go.\n00:25:14 - Chona Sweet, DNP\nOkay.\n00:25:14 - Tina Marie (profitdriversinc.com)\nIt's perfect. That's so very helpful. Sure. But we don't want it to be, can you get a Google account that is not your theirs? Oh. Maybe even, no, you can't be, you can't be sweet law.\n00:25:32 - Chona Sweet, DNP\nUm, I, the reason why it's not theirs is because they have access that I can't, we're gonna do it in Yahoo.\n00:25:38 - Tina Marie (profitdriversinc.com)\nRight? Because it's not. Because it's Google.\n00:25:41 - Chona Sweet, DNP\nThat's a Google sheet. Um, let me see. I can make an Google account and I want to share it to you.\n00:25:51 - Tina Marie (profitdriversinc.com)\nWill you remember?\n00:25:52 - Chona Sweet, DNP\nYeah. I'll make a Google account. I think I have old ones, but I just don't know anymore.\n00:26:10 - Tina Marie (profitdriversinc.com)\nOkay, did you, um, remember you told me that you did the timing?\n00:26:16 - mark sweet (sweetlaw.com)\nI don't think you can access it, but we could try.\n00:26:27 - Chona Sweet, DNP\nI can't access the Google account you sent me when you sent me through Yahoo, I was able to access it. This one, right? You sent me this one, the chart, the diagram.\n00:26:37 - Tina Marie (profitdriversinc.com)\nOh yeah, did I said I couldn't find that.\n00:26:39 - Chona Sweet, DNP\nThat's what I was looking for earlier. Yeah, you sent it to me through the Yahoo account. My China suite at Yahoo.\n00:26:47 - Tina Marie (profitdriversinc.com)\nYou're able to find it.\n00:26:49 - Chona Sweet, DNP\nYou want me to send it? Yes, please. Okay.\n00:26:54 - Tina Marie (profitdriversinc.com)\nWe'll find the box.\n00:26:55 - Chona Sweet, DNP\nI just texted it. And you want me to email or to I just that. That you want me to email it?\n00:27:01 - Tina Marie (profitdriversinc.com)\njust fine, because I'm on my Mac, so I have that too. Oh, it's a Google Doc, that's why. I was thinking it was like a slide or something. OK. It's crazy. OK, so can you open this?\n00:27:27 - Chona Sweet, DNP\nWhat you mean, Nick?\n00:27:28 - Tina Marie (profitdriversinc.com)\nI just shared it with you.\n00:27:32 - Chona Sweet, DNP\nShared it to my own.\n00:27:34 - mark sweet (sweetlaw.com)\nYeah. OK, so you can edit it.\n00:27:37 - Chona Sweet, DNP\nI cannot hear Mark.\n00:27:38 - Tina Marie (profitdriversinc.com)\nI don't know why. That's because Mark talks like, yeah, it's just me.\n00:27:45 - Chona Sweet, DNP\nNo, it's not. But I hear him too. He's in the other. He's in his office.\n00:27:50 - Tina Marie (profitdriversinc.com)\nYou get it in surround sound. Yeah, I always have to crank my volume all the way up just to hear him.\n00:27:56 - Chona Sweet, DNP\nBut then usually I'm meeting with him and somebody else and he's very at the. one's very loud. Okay, I can I was able to open it.\n00:28:03 - Tina Marie (profitdriversinc.com)\nGood. Okay. On your phone, not your laptop. Girl, we working. We need a computer.\n00:28:11 - Chona Sweet, DNP\nI know. I need to because this is a new laptop and my Mac is not. I don't want it. My Mac is just too old. doesn't work anymore.\n00:28:19 - Tina Marie (profitdriversinc.com)\nWell, running in a business needs some good tools also.\n00:28:24 - Chona Sweet, DNP\nI know. I mean, I like this stuff.\n00:28:26 - mark sweet (sweetlaw.com)\nvery computer.\n00:28:29 - Chona Sweet, DNP\nWhat? It has a rose gold colored laptop. Yeah, you got me. I love it.\n00:28:34 - Tina Marie (profitdriversinc.com)\nIt's a microphone.\n00:28:36 - Chona Sweet, DNP\nWell, I'm using it. So I could show it to you.\n00:28:41 - Tina Marie (profitdriversinc.com)\nWell, you could can you open up the document on there, though?\n00:28:46 - Chona Sweet, DNP\nYeah, let me. To be honest, I just I'm sure I can. just don't want to. You want me to open it now?\n00:29:00 - Tina Marie (profitdriversinc.com)\nIt would be good so we can just kind of work through this a little bit. No stress, just.\n00:29:07 - Chona Sweet, DNP\nNo, I just haven't opened.\n00:29:09 - Tina Marie (profitdriversinc.com)\nI forgot. don't know what my password.\n00:29:13 - Chona Sweet, DNP\nFor my Yahoo. I just, it's because you know it's automatic on the phone.\n00:29:17 - Tina Marie (profitdriversinc.com)\nDo you use the password manager? You should use, I use last pass.\n00:29:23 - mark sweet (sweetlaw.com)\nMark, what do you use? Google password, which is easier.\n00:29:29 - Tina Marie (profitdriversinc.com)\nYep, just use a password manager app. I like last pass because I can switch it through all of my devices. It works on androids and Macs and PCs. And it has an app and an extension so and it fills things in nicely.\n00:29:50 - Chona Sweet, DNP\nI think it's this one. Let me just. Let's do this for now, what I can do is I can email the link, I can email it through my work, email, because it's attached to it, and the reason, okay, I'm sending that out, okay, there you go, let's let's go, let's go, let's go, let's let's go, let's let's let's I need access because I'm using my work, do you know?\n00:31:08 - Tina Marie (profitdriversinc.com)\nNever mind. Yeah, and we don't want them having access.\n00:31:14 - Chona Sweet, DNP\nyeah, okay. I just don't know how to I cannot air drop it because it's not mapped anymore.\n00:31:27 - Tina Marie (profitdriversinc.com)\nWell, we'll figure it out. We can table you editing it for now, but basically I'd like you to get this filled out as soon as you can. You're probably going to need to have a Google account for this to work well, or we can work in a Microsoft suite.\n00:31:43 - Chona Sweet, DNP\nThat's possible too, but I just think Google's probably, okay.\n00:31:47 - mark sweet (sweetlaw.com)\nYes, particularly, it's just simpler. Just start a Google account.\n00:31:53 - Chona Sweet, DNP\nOkay, okay. I'm putting it in the notes.\n00:31:57 - Tina Marie (profitdriversinc.com)\nOkay. So then, Um, get this filled out and then that, that will just be the start of it. Once you have something to fill out, then we have, then we can create the formula for the person to send to Dr. E. So when will you have that done? So I need a deadline that works for you. So I will hold you accountable to that. And, but then that also lets me know when it's going to be available for me to work on the formula.\n00:32:25 - Chona Sweet, DNP\nOkay. Okay. I think I'll be able to do this weekend. I only have three. Okay, so. Okay.\n00:33:12 - Tina Marie (profitdriversinc.com)\nIt's not really big deal with the contacts for sure, he doesn't need to have that. Okay, so then, um, yeah, and this is this is what you're going to do. I share this with you. Here. Oops, yes, I'm sure. Okay, so I want to talk about this. were telling me what you're doing here. There's 130 to 430 and then after the clinic, you're going to the hospital, right?\n00:34:07 - Chona Sweet, DNP\nWhich I plan to switch, meaning I just have to wake up early and just go to the hospital first. And okay, if I'm being honest, that's what's helpful. Well, it's what I've been doing is I wake up, I would wake up like 9 to 10 and I start calling patients and I'm like just sitting there doing charting and calling at the same time. So I'm trying to do charting at the same time writing prescription that way. I don't have a lot of pending notes, so I'm trying to finish as fast as I can. So I remember yesterday I was feeling really drowning because I have 38 phone calls and I remember from 10 to 12. all 30 I only did half and then the other half I'm not done and then I went to the clinic 130 for 30 anyways while I'm driving it's when I start I'm trying to I guess I don't know if it's efficient or not but I've been calling patients when I drive because that drive is long so I've been but that also means you know I'm on the phone and I have to because there's two apps the apps for the patient where I can see the phone over on top and then there's an app for the phone so I so that way I'm not calling them on my personal number so yeah so I so I just have to go back and forth and the telemedicine is very quick basically unless it's a competition but usually any changes since the last time that we talked to you which is last month they said no any recent falls into your hospitalization so if they say no so you need refill on your medication so at that time i really don't know what the medications are because i'm driving so i'm just asking them do you need refill on your medications they say yes or no and then again while i'm driving i am writing on my notes just write their first name and then say anything like just very short note of oh i went to the er because i got sick or i need refill in this i know but i feel like i just don't have time right a lot of time and a lot of it is because i'm starting late because i'm sleeping in because i recently i've been really staying up late charting late okay so let's go back to the ideal kind of schedule that we were talking about\n00:37:00 - Tina Marie (profitdriversinc.com)\nout and what matters most. So you really want that time with Mark in the evening, right?\n00:37:06 - Chona Sweet, DNP\nSometimes.\n00:37:07 - Tina Marie (profitdriversinc.com)\nBut I missed him yesterday.\n00:37:14 - Chona Sweet, DNP\nfeel like, I know you told me how much you missed him. Yes, I feel like I'm just not, you know, because I've been staying, I was in the hospital seven, eight. I'll be home eight thirty nine. He's already inside and he's walking. I have while he's walking. I'm charting and also I don't really want to walk. It's so cold in my joints. I have a lot of excuses, but at the same time, I just wanted to chart also.\n00:37:42 - Tina Marie (profitdriversinc.com)\nThis is what it comes down to is you have to have something that you clearly want most. But when I ask you questions, there's variation and the answers are on. It's always, it depends, which is real, but what we want to latch on to is the things that aren't so variable.\n00:38:12 - Chona Sweet, DNP\nSo I decided that today would be like the ideal day. I start early because I have to start early. I have I scheduled a patient at like forest at 10 30. So I start I go there and see the patient and then from there I drive to the hospital. And then I was done and then I'm here and then I started charging. So this is this would have been like ideal scenario where in I would start in the hospital. Maybe 10 o'clock, two hours, I'm going to give myself two hours. Just remember my Monday and Tuesday and I have a clinic that one third. So if I start 10 to 12 in the hospital, give myself two hours there, I can go. back to the clinic from Long Beach to Huntington that's like 30 minutes, I could be there at 1.32 o'clock the latest. That would be ideal. And even if I go to the clinic earlier like told 30 or 1, I can start calling my telemedicine patient. You know, so because again, it's like three things. Hospital, telemedicine, and clinic. And one that's constant is hospital and telemedicine. The numbers vary, obviously, the number of patients. But so far, I've been in the hospital for the past, what, three, four weeks now? It's been less than 20 in the hospital. But if it, it, but obviously, the acuity varies if it's a new patient, if it's a difficult patient. But usually two, three hours maximum in the hospital. But the telemedicine patients, sometimes it's the only 11, like yesterday it was 38.\n00:40:10 - Tina Marie (profitdriversinc.com)\nAnd why is there any reason that it was 38?\n00:40:13 - Chona Sweet, DNP\nWere you behind? was a... No, it's just how it was scheduled. think they scheduled it that way because I don't have clinic patients. So usually if I have clinic patients, I would see in my list about 28 to 30 patients, both clinic and phone calls.\n00:40:33 - Tina Marie (profitdriversinc.com)\nSo, the telemed patients are there, patients are not ones that you brought in and control.\n00:40:39 - Chona Sweet, DNP\nNo, no, I didn't bring it. These are just the bread and butter.\n00:40:43 - Tina Marie (profitdriversinc.com)\ncall it the bread and butter because it's bread Okay. So do you have any idea what the volume is week over week instead of day over day?\n00:40:50 - Chona Sweet, DNP\nI don't know about me, but if it's 20, mean both telemedicine and clinic patients are just the time. medicine just tell them so what I'm trying to figure out is is there a way that we can get you a more consistent schedule or is it the way it is or where they scheduled like that and they need to not schedule it like that well I want to because I get paid per patient so ideally I would want 30 to 50 because of the more patient size ideally I would want 30 to 50 across the three medium like across the three sources telemedicine clinic and and hospital a day you said 30 well I would want it to be minimum 30 because I feel like to be honest like if I'm driving 30 minutes to 40 minutes in a long beach and if I'm only seeing 17 like today I have 17 patients times 30 it's like 510 I don't know I feel like it's not Not worth my time, but that's just I'm not even counting on the money anymore. just do it.\n00:42:07 - Tina Marie (profitdriversinc.com)\nI just like Yeah, so this is where the numbers come in and in terms of like how long does it take to do each thing?\n00:42:16 - Chona Sweet, DNP\nBecause if you're talking 30 to 50 a day and if they take 10 minutes each, you know, then Like we really need to do the math right so the one that It's pretty close with what I sent you the average times Of how much how much how fast I talked to the patient and the average time on how Fast I chart so There's a right now the clinic patients is a little bit overwhelming because everyone is new remember the Optum patients that we talk about they're coming in and so like to like Tuesday all my patients are new and new patients it takes a while because i'm trying to chart nicely while i'm seeing patients that way it's easier for me to finish it later if that makes sense because it's my chart like totally one word like yeah it's harder to it's gonna take me what did i mean what did i say yeah so i just try to just chart it as how it is like this is a you know usual charting is this is a pleasant 40 year old female patient with medical history of blah blah blah blah surgical history of blah blah blah he presents today with chronic pain and i just try to like do how i'm how i should chart and i'm trying to basically multitasking yes it's not a super personalized look the patient in the eye type of thing but it's a combination of both I try to not make them feel that I'm going too fast I know it's it's a skill eventually so the way I try well the other day I have a patient and a parent is not comfortable with me it's the first time that someone told me that so I am I'm surprised and it again it but at the same time it bothered me but not really I truly try not to take anything personally now right I just can't so but anyways I try to not talk too fast I think that talking fast is what makes them feel that I'm rushing them so I just try not to talk fast but at the same time I cannot just let them blabber and they talked about what happened 30 years ago, why their pain started. So I just tried to just keep it short. But again, like I have patients that are 102 years old. They're super cute. I'm just just telling Mark about this the other day. But anyways, I try my best, basically to just chart as properly as I can at that time that I'm talking to the patient. And I feel like that makes it a little bit longer, but it saves me time later to finish the chart.\n00:45:38 - Tina Marie (profitdriversinc.com)\nYeah, I'm going to average this at 20, because you said 15 to 25 and follow up.\n00:45:49 - Chona Sweet, DNP\nAnd like, oh, so they give me they give me um they give me more yesterday they didn't give me a lot today if that makes sense i feel like it's just average like averaging i would say i mean i can look right now i can just tell you hello i'm sorry okay i'm sorry uh let's see uh like today i have anyways don't know on my schedule is 16 patients today and out of the uh huh i didn't realize my video went off sorry yeah i have 16 patients today and out of the 16 one two um out of the 16 and I have a couple that didn't answer. So, yeah. So even if it's 38, some people don't answer. So that's not counted.\n00:47:10 - Tina Marie (profitdriversinc.com)\nHow many of them do you think are new and how many are follow-up?\n00:47:15 - Chona Sweet, DNP\nBut those are all phone calls are all follow-ups. So that's why it's quicker. Okay. follow-ups is actually quick. The phone calls, I like it because it's quicker.\n00:47:26 - Tina Marie (profitdriversinc.com)\nSo, here's what I'm trying to figure out is where does the time go in the day? you've got phone calls, you've got visiting the patients, whether it's telemed or in the clinic or in the hospital.\n00:47:40 - Chona Sweet, DNP\nYeah, sorry.\n00:47:41 - Tina Marie (profitdriversinc.com)\nThe phone calls is a telemed. Phone calls are a telemed. charting time though, new patients roughly, you said 15 to 25 minutes.\n00:47:49 - Chona Sweet, DNP\nwant to say 20.\n00:47:51 - Tina Marie (profitdriversinc.com)\nthen you said follow-up charting is eight minutes. And then there's telemed.\n00:47:58 - Chona Sweet, DNP\nAnd which is the telemed chart. and follow up charting the follow up in person charting and tell them it yeah follow up in in person charting is a little bit longer the element is quick because there's really nothing especially if nothing changed so let let's take a whole tell them that visit like all the time per patient roughly what do we think it's taking well like my phone calls with them it sometimes two minutes sometimes 20 minutes there are patients that just takes my time longer but i've been averaging maybe five to eight minutes five minutes maybe um it's really quick you know that's quick and the charting is because the charting includes ordering their medications which is the most important one make sure that their borders are there i'm going to say this is more like eight Because I have a feeling that we're underestimating, that almost always happens, but I think I'm underestimating. Also, like yesterday, I'm also, I get calls from the hospital. So that's why it's so busy because even if I'm not there, I end up in charge of all the patients that's under us in that hospital, which is like yesterday, oh, can you do this? That's, you know, everything. So yesterday is the one that I have so many phone calls from the hospital. And so I'm taking a break. So I'm doing like multiple things. I'm going back and forth to the charting in the hospital ordering stuff, either giving orders or, you know, I cannot, I don't even know what how to calculate that because that's sporadic. Yeah.\n00:49:54 - Tina Marie (profitdriversinc.com)\nSo let's just do some rough math and say, Okay, if we have 30 to 50 patients, let's just start with 30 Bob part.\n00:50:06 - Chona Sweet, DNP\nHow many of them you think are going to be new patients charting with charting that you have to do new charting not tell me by the way that doesn't include the hospital, right?\n00:50:19 - Tina Marie (profitdriversinc.com)\nYeah, I would think clinic and hospital patients. These two, the new patient and follow up are roughly the same or no roughly roughly the same.\n00:50:28 - Chona Sweet, DNP\nYes. Because that the actually a little bit, I feel like a little bit easier in the hospital because in the hospital, I have so many information to take information from not just from the patient, but from the chart.\n00:50:40 - Tina Marie (profitdriversinc.com)\nWe can separate them out later if we want to, but let's just say think it's the same. Yeah, you're right. It's just it's that I'm pretty quick.\n00:50:48 - Chona Sweet, DNP\nThe hospital sometimes I don't actually and don't charge because I want to finish my round and order it at that time. I'm in the patient's room. I open the computer. pain is still bad so I adjust the medication right away. So, and I don't charge because I I just feel like it still takes some time. I've maybe put like the chicken strategy. Oh, I feel better or more worse, constipated. You know, I just like put those blurbs and then fix it. Like right now I'm about to charge right now after this. Like I have 17 patients in the hospital and I have two new ones.\n00:51:31 - Tina Marie (profitdriversinc.com)\nOkay, so look at this. What I'm doing right here and try to help me break this down because we're already almost out of time. I want to make sure that we have something that's workable to do a quick kind of calculation. So, there's the in-person visits, right? this number is going to be in alignment with these two. So, some of them are new, some of them. Do you do follow up in person?\n00:52:01 - Chona Sweet, DNP\nin the clinic?\n00:52:02 - Tina Marie (profitdriversinc.com)\nOn rounds?\n00:52:03 - Chona Sweet, DNP\nYeah. clinic or in a hospital? Either.\n00:52:08 - Tina Marie (profitdriversinc.com)\nIt's in person. Yeah.\n00:52:12 - Chona Sweet, DNP\nfollow-ups are in person. The telemedicine are in the telephone, but they are all follow-up patients.\n00:52:18 - Tina Marie (profitdriversinc.com)\nOkay. So how many people did you see in person today?\n00:52:22 - Chona Sweet, DNP\nI only saw one lean patient today, the one that, you know, come from my, my, okay, and then I, I, I called one and make a video new patient lean. So I, so yeah, two, so two lean patients.\n00:52:43 - Tina Marie (profitdriversinc.com)\nhere's what we're looking for a, for a kind of target scenario of something that we want to go after. the reason we need to do this is because we also want to figure out what your ideal schedule looks like and we need to do it well enough that you are consistent. and actually doing the stuff and that it works for you in your brain because if you don't buy into it, then you're going to have this mental wrestle every time. Do I get up and go do this? Do I schedule it then? Do I get this done? And then at the end of the day, you're glad where your time went versus at the end of the day.\n00:53:20 - Chona Sweet, DNP\nlike, I really should have started earlier.\n00:53:22 - Tina Marie (profitdriversinc.com)\nYeah, that's great.\n00:53:24 - Chona Sweet, DNP\nI'm kind of a good, especially I sleep at 12 and nine and stuff. I regret it starting late, but at the same time, I appreciate the time that I wake up late.\n00:53:38 - Tina Marie (profitdriversinc.com)\nThat's what we've got to figure out and that it's the same time and that vacillating back and forth. You will do better overall emotionally, with sleep, physically, habitually, performance-wise, and just quality of life-wise, if you have a more consistent schedule. the trying to make a decision and figure out what goes best, you would. We just do better with structure.\n00:54:06 - Chona Sweet, DNP\nRight, and I actually like it now. remember when we first started, like, I don't know what's happening, like, I don't know where I'm going today, but it's still, there is still that factor because Dr. E will ask me, oh, so and so it's not, cannot come, can you cover his clinic patient. there's still always that possibility. Of course, I can say no, but, know, because I'm not an employee, but, you know, I would like to have more patients too. So if it's easy, yeah, I prefer if it's between 30 to 50, but that with that comes more charting.\n00:54:49 - Tina Marie (profitdriversinc.com)\nSo, okay, so, so this is what we're going to do. So just stay focused with me for a few minutes, and then this, we're not going to be wrapped up, you know, this is an ongoing process, but let's just\n00:55:00 - Chona Sweet, DNP\nplug some numbers in here and we're we're going to say patient round time roughly how much time do you think you spend patience in person average in the hospital or in the clinic are they that different i feel like the hospital i feel like it's about the same i don't know the new patient though it's more because i'm asking for more but if it's a follow-up is that what your questions are um so it's just different the new ones are always spend time because you know i'm getting new i'm talking about just the visit with them and then i'm separating the charting okay so just if they said in the hospital i would say you want to add\n00:56:00 - Tina Marie (profitdriversinc.com)\nBridge? Yes, that's all we can do for now.\n00:56:03 - Chona Sweet, DNP\naverage 10-15 minutes, because the 17 patients I could be done between like it's about almost two hours for those patients, but the other day I have 17 patients that took me a little bit longer because half of them are new.\n00:56:28 - Tina Marie (profitdriversinc.com)\nOkay, so how different is the clinic?\n00:56:32 - Chona Sweet, DNP\nThe clinic time, the new patients I have, I need to spend more time, the follow-up is quick, less than five, less than 10 minutes. The new ones I'm spending a little bit more, probably 15 minutes to 20 and just...\n00:56:54 - Tina Marie (profitdriversinc.com)\nSo we're gonna call this new patient time for each of these and how much is it for follow-ups?\n00:57:02 - Chona Sweet, DNP\nLike less than 10, less than like five or eight minutes, it's quick.\n00:57:09 - Tina Marie (profitdriversinc.com)\nSo I'm to pop this.\n00:57:13 - Chona Sweet, DNP\nIt just depends because you know some patients are more difficult and you know I don't want to say more needy. I don't like that word because it is they're right to ask what they need. It's just more that needs more of time, I guess.\n00:57:35 - Tina Marie (profitdriversinc.com)\nOkay, so there's we're going to go with this. if we have this is going to be really really dirty math. let's say we had five here, five there, and then this is still They're still the same people because this is charting. And hold on, I'm to move this over here and then I'm going to make these smaller so I can see everything. Dang it. Okay. I need to do this. Oh, forgot the copy of the copy. All right, go away. I'm just trying to make it easy for me to keep track of the song that would cover that was that one. to for make easy for Okay, so this is also, and I have to keep track of this because, so this is new patients, so that's a total of 10, these are the same, so it's still 10, we're going to say 10 here. 10 here and 10 here, so we're going to, that's gonna, so number of patients, and this is going to equal this plus, this plus, this plus, this, this, This plus this, plus this, plus this, and little time equals, this is going to be brackets. I'm going to have to do this times this. Go away. I know what I'm doing. Equals, let's see, this times that, plus, I forgot the parentheses. going to take me a second, sorry. This times this, parentheses, plus parentheses, this times. There's most of them, didn't, okay, that was, nope, that was, nope, nope, don't worry, I'm almost done barring you to tears. No more coffee, you've got to be all better, all right, 630. So that's minutes, and then total powers equals That divided by 60, 10.5 hours. So this is 50 patients, 10 and a half hours. And now this is really dirty data, but I don't think you want to work 10 and a half hour days do you?\n01:02:21 - Chona Sweet, DNP\nIt feels like, yeah, it's all right. Well, you think it's okay.\n01:02:27 - Tina Marie (profitdriversinc.com)\nThis is not even including commute time.\n01:02:31 - Chona Sweet, DNP\nYeah. Right. Hey, there's a.\n01:02:35 - Tina Marie (profitdriversinc.com)\nThis is the reason why we do math. And I almost guarantee you you've underestimated most of this. So you're looking at probably more like 30 patients for an ideal time. And then, so how much do you get paid per patient? You certainly think.\n01:03:00 - Chona Sweet, DNP\n$30?\n01:03:02 - Tina Marie (profitdriversinc.com)\n$30 or $30?\n01:03:05 - Chona Sweet, DNP\nNo, $30.\n01:03:07 - Tina Marie (profitdriversinc.com)\nOkay. So, um, but that's, this is a day. So if we did 30 patients a day times five days, that's 150 patients times 30. That's, uh, that's not okay. We did we did that now.\n01:03:29 - Chona Sweet, DNP\nAnd that's supposed to be better because he's not only, but he's paying them 20, right, honey?\n01:03:37 - mark sweet (sweetlaw.com)\nOh, yeah. He was eight. But it just shows you the leverage of the PI ads over the.\n01:03:46 - Chona Sweet, DNP\nYeah.\n01:03:48 - Tina Marie (profitdriversinc.com)\nOkay. So, but that is, it's not that bad. So, um, let me show you because when you, when you look at it, it's better.\n01:03:57 - Chona Sweet, DNP\nUm, it's 50, 50 was ideal. I would love 50 patients a day. But then again, that also means I have to work very efficiently, like, and that can happen.\n01:04:09 - Tina Marie (profitdriversinc.com)\nBut here's what I'm going tell you, like I tell Mark too, like when you set the target around the money too hard and too fast, then you just set yourself up for failure.\n01:04:20 - Chona Sweet, DNP\nSo that's why I said 30 to 50, my minimum would be 30. I'm pretty sure in a week, I can probably tell you average, like, how many patients I see in a week right now. Or maybe we'll, you know, in the following week or two, we can, I can tell you how many patients I see in a week.\n01:04:41 - Tina Marie (profitdriversinc.com)\nSo if we, if you saw, and this is where it does kind of get fun, equals that, times that. Now multiply that times four weeks and a month, you're looking at $18,000. So nurses don't normally get, practitioners don't get paid like that.\n01:05:02 - Chona Sweet, DNP\nIt depends I guess. That's about because my last work I get paid 750 a day.\n01:05:12 - Tina Marie (profitdriversinc.com)\nOkay.\n01:05:14 - Chona Sweet, DNP\nThen that one I work, honey I work with three hours. Yeah. So and that and I see 40 to 50 patients that they I'm used to volume like I'm not.\n01:05:29 - Tina Marie (profitdriversinc.com)\nSo how long has it been since you did that?\n01:05:32 - Chona Sweet, DNP\nI did. Oh, you mean how long before I start this one?\n01:05:37 - Tina Marie (profitdriversinc.com)\nOkay. So were you working before you did this job?\n01:05:41 - Chona Sweet, DNP\nYeah.\n01:05:42 - mark sweet (sweetlaw.com)\nOkay.\n01:05:42 - Chona Sweet, DNP\nThis job.\n01:05:44 - Tina Marie (profitdriversinc.com)\nHow what?\n01:05:45 - mark sweet (sweetlaw.com)\nThis was right before this job.\n01:05:48 - Tina Marie (profitdriversinc.com)\nYou've been doing volume for a while.\n01:05:50 - Chona Sweet, DNP\nYeah, I don't really amenable. I'm okay. I don't I'm okay. But that one I get paid 750 sometimes I'm like seven feet like divided by three at two fifty an hour it's it's just very sometimes I'm done two and a half hours like I can do like be very efficient but I did that for two years and I was able but it's a psych mark doesn't it also at the beginning you were doing two or three hours you were taking a longer time because I am new so so if it let's say that you were able to do six in general by the way I make more as an RN before I become an NP Wow yeah I got a paid that remember I got a 30 an hour pay cut so this is where the numbers come in and there's lots of things you know kids feeling like you're making a difference feel like I'm sorry I didn't mean to cut y'all but this is the bread and butter and I feel like I'm already tired that I cannot put Extra effort not I cannot but I feel like I feel tired I can't put extra effort on the part on the two and third income stream that you know We talk about because this is number one. This is the red right the second and third which I should be growing and Focusing my because that's where the income is look at 200 to 250 grand base pay for me I call it base because this is the bread butter and I'm bad It's close to what I'm already getting paid But what I'm interested in is the beans in Washington, which I cannot even I cannot finish my license licensing Over there because I have to go to the hospital. I did a to my two universities to fix my Transcript in order to get that and I wanted to start Washington next year.\n01:07:50 - Tina Marie (profitdriversinc.com)\nThat's where the money's at So so there's a couple of things first of all you two just having a conversation now that we're looking at some number And based off of what's actually happening, how long it's taking, but also keeping in mind that it should improve over time, which you already have a historical reference for that. And also, you know, where the actual money is, what do you need to do to get to the money? you need to make this work better? you need to be efficient at this? And in the meantime, trying to be efficient, are you not going to be more efficient if you have a more consistent schedule? And if you are, then do you need to just get yourself to a more consistent schedule?\n01:08:36 - Chona Sweet, DNP\nSo, I think when I start bringing in lane patients and we consistently bring in 25 a week, so that's 100. I'm hoping at least when I get to the 200 patients a month, that's 100, patients a week, that's still low, I can get more. But the max is 400 remember the max is 400 right so that's doable the moment that kicks in I'm not gonna take other clinic patients. I'm gonna focus on the lean patients I'm just gonna focus on hospital and maybe phone calls. I'm not taking any more clinic patients I'm not gonna be able to help with the clinic patients anymore. That's what I'm gonna have to demand and tell him So what will that do with your relationship with dr.\n01:09:31 - Tina Marie (profitdriversinc.com)\nE like he was like that.\n01:09:34 - mark sweet (sweetlaw.com)\nOkay, okay That's more money for him right hand the clean people really happier when that happens. My big question is Are we getting to that point?\n01:09:43 - Tina Marie (profitdriversinc.com)\nThat's what I was just gonna have and what's in the way of getting there Well, we're just starting and like Mark said, it's it's like snowball right and that's what you said.\n01:09:54 - Chona Sweet, DNP\nSo we're starting slowly I Would you know, I think I would like to But I think it's just in my head, Mark, things that we should do slowly. Two things there. I can't hear you.\n01:10:10 - mark sweet (sweetlaw.com)\nI can either.\n01:10:11 - Chona Sweet, DNP\nOh, no, you got to say with her.\n01:10:15 - mark sweet (sweetlaw.com)\nYou got a little over one with just the couple ones I sent you.\n01:10:19 - Chona Sweet, DNP\nI have friends who are chiropractors, who you haven't reached out to. Well, I'm overwhelmed not of the lead. overwhelmed with the entire thing that I'm doing.\n01:10:30 - mark sweet (sweetlaw.com)\nAnd again, part of the logic of this is to nurture the relationships you're building, right? Because that way you can keep having them send you. So we don't have to just keep prospecting and prospecting and prospecting. You have people like today, it's the first day you talk to Hobbes' right hand person, right?\n01:10:47 - Chona Sweet, DNP\nYes, I call her on the phone and talk to her about the two patients that they send.\n01:10:52 - mark sweet (sweetlaw.com)\nRight. And you showed I got them in quickly, which most people can't do.\n01:10:55 - Chona Sweet, DNP\nThat's a very good friend. Yeah, I got them in quickly. I haven't told you that Tina, they sent. Email and then within less than 30 minutes, I called the patient, set up an appointment of alpha, which actually she canceled because she's sick. But Mark reminded me, remember, you can do zoom in. So that's what I did.\n01:11:15 - Tina Marie (profitdriversinc.com)\nThanks.\n01:11:17 - mark sweet (sweetlaw.com)\nBut now I gave you one of those, you couldn't do those things right now because you haven't gone through the system. You haven't thought through some of the stuff. And so before you break our system, let's maybe build it.\n01:11:29 - Chona Sweet, DNP\nFor Washington, I mean, do you think maybe you could get up an hour or two earlier and go to the 100% that I would do? I know I procrastinate because I feel like I'm going nowhere.\n01:11:45 - Tina Marie (profitdriversinc.com)\nSo let's do this though. I don't know what you do to get yourself up, but instead of telling yourself you're getting up to go to work, you're getting up to get to Washington. You're getting up to get to the lean leads, because the only way you're going to get there is to master this system and the things that you have, so that when you get to the people who are business associates rather than patients, you're bringing your A game. But the only way you're going to do that is to get started earlier to get there. Will that help you mentally go, okay, I'm not doing it to go knock out these patients. I'm doing it to get to the business part.\n01:12:26 - Chona Sweet, DNP\nRight, I think I need to think that way, that's not how I think currently.\n01:12:34 - Tina Marie (profitdriversinc.com)\nI just feel like I'm just surviving, that's how I feel, and then now it's like, just But you lit up, you lit up when you started talking about what you're trying to get to, but you have to think about what you're trying to get to when you're waking up in the morning. You have to think about what you're trying to get to when you're operating throughout the day. You need to think about what you're trying to get to when you're charting. Because those are the things where you just start losing momentum And if you're not focusing on the things that enter like your energy completely shifted Choma With when I talk like about the patient.\n01:13:12 - Chona Sweet, DNP\nYeah. Yeah, it's energetic like yeah, I talked to the patient. Oh, that's just energetic Can you imagine I told the patient on the video? It's my I would say it's my first official video New consultation Ever I don't do this ever so my first video Consultation is it's like Fuji when he's doing that's my first time and I was able to Talk to the patient because of her symptoms and the MRI result she needs an epidural which is again the the driver for payment But right it's a balance, right? don't want to think just about the money. wanted to make sure I'm doing it And they're ethically standard of care, so it makes sense. The patient agrees on the video. I guess I was able to do that. And then I talk to have a skates manager and tell her that this is the plan for these two patients, and she agrees. And she actually even made a comment that I'm black, the first patient doesn't need it. He's fine. He just needs sugar point, and then she's like, well, I'm glad you're not just saying, oh, epidural, epidural, because, you know, epidural means money. We're still doing these money. I'm not, because that's not, I'm still looking at it as a standard of care.\n01:14:37 - Tina Marie (profitdriversinc.com)\nI just looked at what time it is.\n01:14:38 - Chona Sweet, DNP\nI got to get to my girl.\n01:14:40 - Tina Marie (profitdriversinc.com)\nNo, it's fine. So part of what we were doing to start this was to see where we might be able to meet during the day instead of at night. Right. Do you have something you, we were talking about Wednesday, Thursday, I didn't get this all filled out. I'll share this with you too, so you can have feel like Wednesday, then Thursday, so.\n01:15:00 - Chona Sweet, DNP\nwould be the one since I don't have clinic days, but then again, it's like an open time for living patients for me to, you know, do.\n01:15:12 - Tina Marie (profitdriversinc.com)\nUm, do you want to think about it and get vaccinated?\n01:15:15 - Chona Sweet, DNP\nSo Wednesdays, um, the earliest that you can do, I guess, that will make me wake up.\n01:15:25 - Tina Marie (profitdriversinc.com)\nwell Wednesdays, I actually have a pretty busy week for you. Yeah. Um, and for the most part, my mornings are already full. Fridays are open, but I just had to keep them open on purpose, but we can try to figure out something. Um, um, is there any time that's not like, I don't know, commuting even? don't know. My brain is kind of shutting down. Yeah, but, uh, I mean, I do have to look at the screen while you're committing.\n01:16:07 - Chona Sweet, DNP\nNo, no, I agree. I just don't. Friday again, tomorrow is Friday. I don't have clinic. My goal is to make sure I do telephone medicine and telemedicine in the morning and rounds. So, that's where my Friday's at at the moment. So, this is you.\n01:16:31 - Tina Marie (profitdriversinc.com)\nNo, that's right.\n01:16:33 - Chona Sweet, DNP\nYeah, and also the reason sometimes Friday mornings, it's my spillover charting too. I mean, yeah, every day, every morning is my spillover charting. So, um, maybe you'll just keep, I guess, I don't know, let's try to figure something out, especially it just evenings are hard because that's\n01:17:00 - Tina Marie (profitdriversinc.com)\nIt's really my time with the girls and Friday is 8 or 9 8 2 early Yeah, I'm not my brain. It's not about not being awake, but for what I do my brain has to be sharp What time are you okay then what time are you gonna clock is I can be like hope This point but you guys have fun tricking stuff Bye I don't know if 10 would be I Think it's okay I just don't want it to commit and then cuz I wanted to make sure it is the time Why don't you take time and think about it and let's try to figure it out And then we'll figure it out. We'll just we'll just make this a Something great and if you can find basically any of the windows\n01:18:00 - Chona Sweet, DNP\nthat would work for you throughout the week and send me all of them.\n01:18:03 - Tina Marie (profitdriversinc.com)\nOkay, then I'll probably be able to give you a few different options because I have, I do have a set schedule and most of it's been set for a really long time. But because of that, there are solid windows that are always available.\n01:18:16 - Chona Sweet, DNP\nBefore you go, I just have a one question that's just lingering on my mind right now and I just realized it when we were talking.\n01:18:23 - Tina Marie (profitdriversinc.com)\nOkay, because right now I'm not looking at money.\n01:18:28 - Chona Sweet, DNP\nMaybe that's why I'm not focused on business. I'm just focused on the task at hand. It's hard for me to first see.\n01:18:36 - Tina Marie (profitdriversinc.com)\nBut the money motivates you.\n01:18:37 - Chona Sweet, DNP\nYeah, doing that. So how should I attack it and guess in a way that it will be in the forefront for me?\n01:18:45 - Tina Marie (profitdriversinc.com)\nSo this first of all, this is it. So I shared it with you. But what we need to do if we can do this next week is an exercise of what does it look like when you're getting more being patient?\n01:18:55 - Chona Sweet, DNP\nYeah, no, I calculated that already. Actually, like if it's a 400k. smacks times 250. That's, that's, that's the basal baseline for lean number two, right?\n01:19:08 - Tina Marie (profitdriversinc.com)\nSo how much is that?\n01:19:10 - Chona Sweet, DNP\nOh, I see. Yeah, you're right. So 400 times 250 times 12. That's 1.2 in a year.\n01:19:21 - Tina Marie (profitdriversinc.com)\nAnd it doesn't... Can you get up for that?\n01:19:23 - Chona Sweet, DNP\nOh, yeah, don't know for you.\n01:19:25 - Tina Marie (profitdriversinc.com)\nWhat I'm talking about.\n01:19:27 - Chona Sweet, DNP\nAnd then there's, it's not, it doesn't even include procedures that I'm, that's the percentage.\n01:19:32 - Tina Marie (profitdriversinc.com)\nIt doesn't even include the bread and So that's what you need to be thinking about all the time.\n01:19:42 - Chona Sweet, DNP\nIt doesn't include the Washington, this is just here.\n01:19:45 - Tina Marie (profitdriversinc.com)\nSo every day you have to ask yourself, what do I have to do to get to this?\n01:19:50 - Chona Sweet, DNP\nOh, yeah. I actually, before I start with you, or when I started this, I said, my goal is to make at least a million a year. That's my goal.\n01:20:01 - Tina Marie (profitdriversinc.com)\nThat's a number though.\n01:20:02 - Chona Sweet, DNP\nguess that's enough.\n01:20:04 - Tina Marie (profitdriversinc.com)\nThat's the answer to my question, I guess. Well, yes. So, okay, but what does it look like to you? What changes in your life if you're making a million dollars that you made?\n01:20:18 - Chona Sweet, DNP\nI mean, I will be able to do, buy and do what I will be like, wanted to buy or what do you want to buy? What do you want to buy? so you need to be really specific. Oh, yeah, I can be specific with you. I know I'm materialistic. Yeah.\n01:20:37 - Tina Marie (profitdriversinc.com)\nI don't care.\n01:20:39 - Chona Sweet, DNP\nI want to buy a lot of things.\n01:20:42 - Tina Marie (profitdriversinc.com)\nWhat do you think about all the time, Shanna?\n01:20:44 - Chona Sweet, DNP\nWhat do you think about all the time? Shanna, I wanted to go. I wanted to hopefully also buy something nice for Mark. Also, he told me he wants me to get him a Porsche. He's like, there already come. the money that I haven't even had.\n01:21:02 - Tina Marie (profitdriversinc.com)\nSo, and what does it feel like if you have those things that you want?\n01:21:07 - Chona Sweet, DNP\nIt's just freedom because it's, you know, it's a freedom of this then option to buy.\n01:21:15 - Tina Marie (profitdriversinc.com)\nSo, you don't have to go to work and you don't have to chart and you don't have to do anything. You're choosing this because it's your choice and because you've got goals that you're working on getting to. So, but you don't obtain big goals, sleeping in bed late, you know, like there's all kinds of things.\n01:21:37 - Chona Sweet, DNP\nLike I haven't had any novels a lot on my phone.\n01:21:41 - Tina Marie (profitdriversinc.com)\nYou know, and I almost never watch TV anymore or read anything anymore, but I'm really happy because I'm doing the things that matter most to me. I gave up a lot of food that I like because it made me tired and sluggish. I can't have dairy if I have dairy. I am tired for two days. face two whole days. So like, and so, like, I don't like going to sleep at night. I get lonely. I'm there. I'm just my brain is tossing, but I'll go take melatonin. I'll do all the things I have to do to make myself go to sleep because I want to have energy the next day. I got things to do. I'm like, I've got major goals that I'm working on all the time. And so I really had to ask myself, do I want this or do I want that and stop lying to myself about that I can have both or, you know, that it's not that big of a deal if I go in late or whatever. Nobody's holding me accountable, but the energy is a big deal. My mood is a big deal. And I, because of my body, the way that it acts, have to be really intentional about what I eat, how I sleep, how I exercise, who I talk to, when I get up, how I get up, like all of these things, because if I let go of any of them, I don't have energy to do. anything and then I get depressed. I get anxious and then all of it compounds because then I eat bad which makes my body even more sluggish which makes me more tired which makes me more depressed like I have to think about everything all the time but I'll tell you what I'm really happy because I'm doing the hard work but I'm getting the results like every day every day I'm at the end of the day am I even though on the really bad days where I feel like I've done nothing I can still go down the list and tell you where I made progress and traction with my family with God with my sweetheart with clients like I can knock out some big even if I only spent two or three hours actually being productive and I wanted to be productive for 15 those three hours were potent and the thing I my girls too is that because I'm not a normal person you're not a normal person my three hours can be somebody else's\n01:24:00 - Chona Sweet, DNP\n30 hours.\n01:24:01 - Tina Marie (profitdriversinc.com)\nAnd so I'll give myself grace for that. But I want 10 of my hours. I don't want 10 of somebody else's hours. I want 10 of my power hours, because like, I can do things other people can do. I'm not trying to compare myself to other people, other people's freedom, other people's lives, other people's goals, other people's anything. Because I'm not basic like that.\n01:24:24 - Chona Sweet, DNP\nThat's good. know, that's good. Like, I really foresee there's a video I saw really quickly. Like, your days is divided by three, like eight hours work, eight hours sleep, and eight hours for yourself to do whatever you want. I mean, that is an ideal, I think for me.\n01:24:44 - Tina Marie (profitdriversinc.com)\nI sleep more than that. need more sleep than that. And also I think a lot. And so, um, like I could be reading books, but if I'm reading books, I'm not thinking. And I have learned that my like, I pace and I'll just walk around doing nothing. So thank you. But it's like the stuff that comes out, man, that's, that's what moves me. So I don't know about the 8, 8, 8, but for sure, we don't have nearly as much time as we think we do. And especially when we did these calculations, which is why, Chona, the amount of money that I make for the amount of time that I work, I don't know anybody that does that in any kind of my business. And it's because I'm always looking for leverage. So I'm always doing the math. I'm always looking for the systems. Like we were talking about dragon. Dragon's part of it. Just you will find the different ways where you can make things better. And also where the optimization is for you. It's liens. It's bringing in your own stuff. So we got to figure out like, what do you have to do to know your stuff so well? That if you get a lead, a lean source, like, you know, one of the law. offices or a doctor, so that when they bring you a patient, you're like, I'm gonna take such good care of you and your patient and they're gonna keep bringing it back to you. That's where the real money is at.\n01:26:11 - Chona Sweet, DNP\nRight? I went in on their party. I said we're going to think, but my goal is I know now that once it comes I need to schedule it right away. I'm handling that myself until it gets much. That's when I need will need help. But like I said, she was like, oh, that was quick.\n01:26:29 - Tina Marie (profitdriversinc.com)\nThank you for, you know, doing it quickly.\n01:26:32 - Chona Sweet, DNP\nYes. And then all of a sudden she sent me another one. Like, this is another one.\n01:26:36 - Tina Marie (profitdriversinc.com)\nSo it's like two.\n01:26:37 - Chona Sweet, DNP\nThat's why it happened like that.\n01:26:39 - Tina Marie (profitdriversinc.com)\nSo be ready for that. And so ask yourself every morning, like, what do I need to do to be ready and open and available to those things coming to me? Right. And what do I need to make sure it doesn't get in the way? So handle these patients, but remember, you know, that you're not getting up because you have to do a job. You're getting up because That is a step towards what you're really after.\n01:27:03 - Chona Sweet, DNP\nRight. Okay. Thank you.\n01:27:06 - Tina Marie (profitdriversinc.com)\nOkay All right, Miss lady you take care Take a look at your schedule. I'll follow up in the text message cuz it'd be really great to get my my evening time Even one day, of course, you know, I'm a one baby left. She's gonna be gone in a few years.\n01:27:22 - Chona Sweet, DNP\nSo I Yeah, no, but I didn't play it. Okay Um, yeah, thank you. I will send it to you and you send me this right you email me this or you Well, I'm like, okay.\n01:27:36 - Tina Marie (profitdriversinc.com)\nBye. Bye.\n01:27:40 - Chona Sweet, DNP\nThank you.\n01:27:40 - Tina Marie (profitdriversinc.com)\nOh, good. Bye\n","contentPreview":"00:00:03 - Chona Sweet, DNP\nHello. Can you hear me? cannot hear you. Oh, there's my fault.\n00:00:14 - Tina Marie (profitdriversinc.com)\nYou didn't get to hear me call you beautiful.\n00:00:16 - Chona S...","processedAt":"2025-05-04T03:40:52.515Z"}