{"fileName":"Transcript for Maria & Tina🪄(13).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Maria & Tina🪄(13).txt","type":"transcript","priority":"medium","content":"00:00:06 - Tina Marie (profitdriversinc.com)\nSorry, was that a good morning, but then I remembered it's not morning for you.\n00:00:11 - Maria Gudelis (Maria Gudelis)\nOh, yeah. Yeah. and let me see if I can switch this story. No, I feel like crap today, I'm back at bad breakfast, and I just had way too much blooming. I made the mistake. There's a new pancake house I got opened up and I had some eggs baking and two pancakes. I only had one of the pancakes, but I'm still feeling like crap. So I'm even sweating, like, and at 70 degrees in the house, it's not even that bad.\n00:00:41 - Tina Marie (profitdriversinc.com)\nI can teach you some things that'll make you feel better, because I have those issues too.\n00:00:47 - Maria Gudelis (Maria Gudelis)\nAnd yeah, I've spent thousands and thousands and thousands of dollars, and my sister says I'm a walking science experiment, which is true, and I'm also cramping really badly today. I wanted my Maria time. So I'm glad that you don't know, of course. Yeah, I know I wouldn't cancel. And but I probably will after this not work because I could listen to my body, too. And, you know, just not work. Just relax. And then, you know what? I'll wake up tomorrow morning, totally rejuvenated, fresh, ready to go.\n00:01:18 - Tina Marie (profitdriversinc.com)\nI'm just, I know I wanted to take tomorrow, because it's the Canadian Thanksgiving weekend starting.\n00:01:22 - Maria Gudelis (Maria Gudelis)\nOh, yeah, I'll just at 1230 go with Amanda and my mom and we'll go to like parks, blueberries, and do a little mini trip in the fall, because all the fall colors are nice and stuff here.\n00:01:33 - Tina Marie (profitdriversinc.com)\nSo it's really cool. Aw, that sounds awesome.\n00:01:36 - Maria Gudelis (Maria Gudelis)\nNow, isn't that like a friend, a sister, who's a mini?\n00:01:39 - Tina Marie (profitdriversinc.com)\nis my partner. Okay. I didn't know that.\n00:01:44 - Maria Gudelis (Maria Gudelis)\nI didn't. Yeah, because I hadn't really talked to you about her when we started and we lived together. And she just got back from Wales. She was in Wales visiting her dad and mom. She's from Wales.\n00:01:55 - Tina Marie (profitdriversinc.com)\nI have loves in my family. A lot. No way.\n00:01:58 - Maria Gudelis (Maria Gudelis)\nUh huh.\n00:01:59 - Tina Marie (profitdriversinc.com)\nThat is wild because I feel like it's like 12 or 14 something.\n00:02:02 - Maria Gudelis (Maria Gudelis)\nAnyway, I'm gonna look it up. Keep talking. Yeah, no because years and years ago I Just enamored with everything Celtic and I traveled through Scotland and that area and bought myself a really cool Celtic ring And I was just always attracted to it like From Welsh area like yeah, yeah, it's very much so well the whole Scott is Welsh area, but yeah The actual original high priestesses like which you really stuff is like from Whales and Merlin Merlin's from Wales Yeah, yeah, the whole King Arthur stuff Merlin.\n00:02:38 - Tina Marie (profitdriversinc.com)\nThere's there's yeah. Yeah, I get goosebumps. Okay.\n00:02:40 - Maria Gudelis (Maria Gudelis)\nLike I I I've always No, did and I even traveled north of Scotland to Orkney Islands where that's like the original human We're found or something really it's just so such I've always been drawn to that area and I know I married Rudy a guy like like While ago, but he also was from Europe. So I just think there's something about the Europe stuff.\n00:03:02 - Tina Marie (profitdriversinc.com)\nAnd my parents were Lithuania and they're born in Lithuania.\n00:03:04 - Maria Gudelis (Maria Gudelis)\nOkay. But yeah, but we typically don't talk a lot about it because she's really high up at the hospital here in Ontario. Like she's in charge of the whole woman's department, like big time. And so she just for her business too, she doesn't really, you know, come out even though she was married to another woman like ages ago. So I'm bi, like I'll just say it on bi. And so it was funny because when I divorced Rudy, lot of my friends like, you you need to be married to someone probably in health care, because everyone just takes so much from you. You need someone who's like a doctor or some kind of conversation. know, I know, I know that funny. And then my friend, my friend, you know, as we're drinking a bottle of wine, me and my friend, Siobhan, that I've known since grade six, and we've been best friends since, and I was her maid of honor wedding and all that. She we she just said, we're going to get you on elite singles, which is a more dating site, more for professionals, right? I don't know if it's in the US, but anyway, it's called lead professionals. Yeah, and then, yeah, and then that was about five years ago, and then we just started dating and like she, yeah, so she's so, she's the opposite of me. quite funny because I come from a conservative family as well, and all my dad and everything, like I vote liberal now, but my dad and family vote total of conservatives, their oil and gas executives, everything. So she even she's like, I never even dreamed I'd be in a family that's more like progressive conservative, like PC, like because she's really, she'd be the one that was out of all the protests, right? And she'd be the one like having with unions, which is younger, you know, because she wasn't a union before. But now, but now yeah, she's in charge of like a $25 million budget, like wow, 50 staff, nurses, you know, and smart and amazing. Yeah, and she's a very strong leader and a really good coach. Like she's just a really good, she's very, her emotional intelligence is off the charts super high. Yeah, so it's good.\n00:05:08 - Tina Marie (profitdriversinc.com)\nHow long have you been together?\n00:05:10 - Maria Gudelis (Maria Gudelis)\nUh, we've lived together about four years now. We met five, six years ago. So yeah, yeah.\n00:05:17 - Tina Marie (profitdriversinc.com)\ndon't know if I'm the one that's supposed to propose or whatever, like, because we're not really waiting stop, but I sometimes wonder if I should. Yes.\n00:05:29 - Maria Gudelis (Maria Gudelis)\nBut we live in a house. We could have our dream house like a couple blocks away from the water. And that's sort of maybe why, thankfully, but I don't ever want to use it as my crutch. I don't ever have to worry that I'm going to be out on the streets, right? she makes like, know, pretty, very high executive salary at the cost of stress, though, too, because so she's, you know, stressed out.\n00:05:52 - Tina Marie (profitdriversinc.com)\nin the hospital world is massively stressful.\n00:05:55 - Maria Gudelis (Maria Gudelis)\nThere's so much beer. Yeah. Well, yeah. and stuff that hurts her heart, too, because if she sees stuff, Being run wrong like it hurts her because it's like I came into health care because I want to help people and When in which you see some stupid stuff happening, then it hurts just hurts our heart, you know, so yeah Yeah I have a new spounce and sadness.\n00:06:19 - Tina Marie (profitdriversinc.com)\nYes. I'm also like on my period. So like everything is extra extra extra Okay, so I'm absolutely 2% wows like they could go through and change it. I'm 37% What you go away? They keep changing it close? I'm gonna share with you my little interesting thing 37% England and North Western Europe 19% Portugal, so that's changed because originally they had that at 12% my father is First generation American on his side because his mother well on his mother outside because his mother was from Portugal and long, you know, generations, but his dad was navy and so met her.\n00:07:08 - Maria Gudelis (Maria Gudelis)\nOkay.\n00:07:09 - Tina Marie (profitdriversinc.com)\nYeah. And then 10% Ireland, 7% Germanic Europe, 7% Scotland, 5% Central and Southern Philippines.\n00:07:21 - Maria Gudelis (Maria Gudelis)\nWow.\n00:07:22 - Tina Marie (profitdriversinc.com)\n4% France, 3% Eastern China. Wait, my African has gone now? That's interesting. 3% Northern and Central Philippines. I have South and Central Philippines is 5% and 3% North and Central Philippines is 3%. 3% Spain, 2% Welsh. used to have 2% Nigerian and 1% Cameron and Congo. So I wonder if that how that got absorbed because nothing here is Africa anymore. That's interesting.\n00:08:00 - Maria Gudelis (Maria Gudelis)\nAnyway, DNA is how much was Scotland?\n00:08:02 - Tina Marie (profitdriversinc.com)\nScotland is 7%.\n00:08:04 - Maria Gudelis (Maria Gudelis)\nOh, that's pretty high. So what's your highest one?\n00:08:08 - Tina Marie (profitdriversinc.com)\nUm, England and Northwestern Europe and then the second one is Portugal.\n00:08:12 - Maria Gudelis (Maria Gudelis)\nGod, I got it.\n00:08:17 - Tina Marie (profitdriversinc.com)\nSo, okay, let's talk about Joe.\n00:08:21 - Maria Gudelis (Maria Gudelis)\nDo you think that?\n00:08:22 - Tina Marie (profitdriversinc.com)\nyeah. Any other like you gave me an update and I was barely coming to consciousness. um, uh, on your, so you haven't heard back from the one client?\n00:08:35 - Maria Gudelis (Maria Gudelis)\nOh, uh, he did. Actually, it was really sweet. And maybe just to give it justice, I'll just read it out. Let me go to Facebook. So you can see what response was. Yeah. Um, he's had a lot of happen to him in the last two weeks. So he just wants about a week to look over everything, but he feels it's the right thing to do.\n00:08:53 - Tina Marie (profitdriversinc.com)\nOh my God, that's so excited for you.\n00:08:56 - Maria Gudelis (Maria Gudelis)\nWell, I'm excited about what we, yes, but I'm excited about what we went through yesterday because I know. If we make a right power pitch and stuff, and even if I make a video of that on my Facebook page, I know that we'll get a couple clients, and maybe we just, if we wanted to, yeah, get a client a month, you know, like, I just told my Samantha, I call her my Samantha.\n00:09:15 - Tina Marie (profitdriversinc.com)\nSo she is, she was Cory Michelle's project manager. She actually lived in a house with Cory Michelle. They called me to see Palace. What? They were so cold. The women that lived there, there were so many women that lived there. was just like, I would have call it like estrogen something, yeah, but Samantha is a little racier than I am.\n00:09:40 - Maria Gudelis (Maria Gudelis)\nYeah, yeah, yeah.\n00:09:42 - Tina Marie (profitdriversinc.com)\nAnd that whole family, but anyway, so she was her project manager and I was Cory Shane's project manager at the time. And so we ended up just like, we're like souls, like, just, we love each other.\n00:09:58 - Maria Gudelis (Maria Gudelis)\nLike, I love you. Like already.\n00:10:00 - Tina Marie (profitdriversinc.com)\nAnd so we didn't talk for a few years, just kind of living life and going through stuff, and then we reconnected a few years ago. And then last year, I'm just like Samantha, my mission is like I've got to talk to women more. I need to feed my legal connections, I need to draw strength from my sisters, and I need to give strength to my sisters. And so we did that, and then I did that with my friend Stephanie and a few other people, and I'm just like, I love when I listen to God, because he loves us, he loves his daughters so much. And yeah, anyway, so I was telling her about the stuff that we're doing, and I'm like, I would be so happy, because honestly, Maria, I don't think business is my lifelong thing. I feel like when my girls are grown, that God is going to have me going to these third world countries. I don't know where I'll be, but I think it will be. And it's interesting, because I'm reading this book by Clayton M. Christensen, who was also So LES that he's passed away, and he was a Harvard business professor, my guy actually has learned from him and done business with him. I feel like weird and dizzy, but anyway, what's it called? Oh, the prosperity... Hold on, complex? The prosperity paradox. So basically the premise that I'm picked up so far, because I'm barely into the book, that most of the time when people have prosperity, they want to impart it to other people, like donate money, but that's not what you need to do. What you need to do is teach people how to be prosperous for themselves. It's the whole give them an edge teaching how to fish kind of thing. And I don't want anything in life. just want to be a service. I want health, want energy, but my joy... it does come from making other people happy and laboring. And I could see myself just going and teaching like you've seen how ideas just come out of my head and I can structure it and create an implement. And remember I told you about patriarchal blessings? Yes. My patriarchal blessing and I received it at 19 told me to study leadership that it was important and that the Lord had an important work for me to do and that it was that I would help people find and follow the path back to him. But it would be through leadership. And I don't care about leadership from an ego standpoint. I don't care about hierarchy or pecking order. I'm just as happy following as I am leading as long as good leadership. But I'm not afraid of it. A lot of people are, you know, they don't want to step on toes. don't want to whatever. I don't want to step on toes. But also I just know the value of structure and getting things done. I just kind of plow through and apologize later. Anyway, but to this point, like I don't have a business I'm trying to build. I don't have something I need to want to sell. just want to take care of what I need to take care of and enjoy what I'm doing while I'm doing it. Like for me, it is the journey. So if you were able to create this offer and I'm able to take care of the families that I'm financing and still be able to have enough money where I can grow for the future in case I can't work or something happens to my guy or something happens to our money, because nothing is guaranteed, especially with our government in their over a few months. I'm like, I would just be, I just think about that. like, that's all I want. I'm very simple. So if I got to spend my days and part of it is working with you and we're blessing other businesses. just think what I'm so simple that would make me happy. I was thinking about that this morning.\n00:14:05 - Maria Gudelis (Maria Gudelis)\nthought I would share that with you. Thank you. Yeah. No, I kind of the same too because I think was it you that I said, after I hung up a few, I don't know I said that to you, but I said, a man, a man, I've had known her four or five years ago. I'd be writing probably a $50 million business.\n00:14:22 - Tina Marie (profitdriversinc.com)\nOh, yeah.\n00:14:23 - Maria Gudelis (Maria Gudelis)\nYou're like, where are you not doing the agency yet? And Amanda looked at me and said, I hope you're not serious about wanting $50 million. And I'm like, no, no, but I just mean all the hard work, all the hours I've worked over the last like four or five years, every single week, giving, giving them a clients. they're the ones that are millionaires. then even how, you know, this has went down with Crena, like I'm just like, I know this wouldn't have happened to me if I had her by my side, know, four or five years ago, she goes, okay, I said, honestly, Amanda, like I'd be happy just with half a million or a million. I know it's not about, I've made a million a month at one time in my real estate investment business ages, but I know it's not about that anymore because that with that becomes such responsibility. Yes.\n00:15:12 - Tina Marie (profitdriversinc.com)\nAnd such like other things. can and they're stressed like because then you've got fake friends like there's so much that has excessive amount of money and temptation because the devil is good at what he does, you know, and it's not necessary like big deal kind of things like but it doesn't matter. It's slippery slope with big things like we're more prone to ego maybe when you have more.\n00:15:40 - Maria Gudelis (Maria Gudelis)\nI'm like, it was really important that God not make me too cute because I definitely have the type of personality that if I was so cute, I'd be all over Instagram shaking my body something like that.\n00:15:51 - Tina Marie (profitdriversinc.com)\nHe needed me to not like think that I'm just gorgeous or anything because I probably couldn't be trusted with such beauty. I love that. And for me, I, I, I feeling appreciated and seen and validated. Yeah. But also to know that I'm with somebody who is, um, like to, to be with a mama bear with a mom. Oh, yeah. So beautiful. Like to get to sort of care of other people with someone else. So I thought I had about Joe, though. Wait, I do want to know a little bit more about your guy.\n00:16:39 - Maria Gudelis (Maria Gudelis)\nYou know, I do that, let's just, yeah, close the loop of my guy, because we're just in the waiting game. So I think I, I'm comfortable with what I said to him. So it should or get off the pot. So he has a lot happened to him, right? Cause he, cause well, on the phone, like he had a good friend of him die tragically a week ago. Um, and he was also in a car accident. So recently, so he's suffering from headaches. So we said, we're on the same page, but I need to spend more time with the doc and note some questions. I'm not sure if I told you, but I'm suffering from headaches from a car accident. My friend died tragically week ago, and I'm in the midst of another super time conceiving stuff. Give me a week or two to merge so that I can give the best of myself to this, my number one priority project. I'll develop questions in the meantime so we can hit the ground running. Does that work? I said, let's move the combo to email. excited to be with you. I was telling my husband, it just feels right. I said, hey, it does feel right. I feel so long if you're off or in future vision. And I guess I should have emailed this to him. Actually, I will after this. And yes, you've been through a lot. So take a week or so to review for sure. One quick question. Can you put a small deposit down to hold your spot with me? I only ask that as there's two others I'm talking to, which is true as well. And my bandwidth is really to take one new client on for this year because I'm not like, I can't take three clients that they said all said yes today. So, you know, just being honest with us, would, would like a one K to positive be okay.\n00:18:02 - Tina Marie (profitdriversinc.com)\nSomething to consider for future is that I wouldn't let somebody take now time even for that. But what I could say is I'll give it to you but what I can say is I can't promise it to you. So you take all the time that you need to and say and I don't mean this as a sales pitch but as you can see I'm making movements right now and it's attracting people and I'm not going to hold a spot open not for a thousand dollars not for anything. If you want to pay and work now we can and it isn't that I don't appreciate everything that you're going to through. It's just that I have put momentum out and it makes no sense for me to pull it back. If he knows it's for him then he will. will come to you quicker. And it but also what you should trust that that the right thing will come, but I don't let people hold me back anymore. Yeah, isn't out of disrespect for what they're going through.\n00:19:15 - Maria Gudelis (Maria Gudelis)\nIt's trust that the timing will align when it needs to align. Yeah, yeah.\n00:19:20 - Tina Marie (profitdriversinc.com)\nSo just something to think about.\n00:19:22 - Maria Gudelis (Maria Gudelis)\nThat's true. Yeah, yeah, Yeah, it's my my sorry, my gut reaction is like I think what we presented was on fire and like I want hell yes people. Like I want him to say hey I've got crazy stuff put on for the next week's but I can put some money down to hold the spot with you.\n00:19:47 - Tina Marie (profitdriversinc.com)\nYeah, yes. So what's it gonna say? Oh yeah, so the thing is that you're in a situation now of you've got an open loop in your brain. And that costs you, it costs you energy, it costs you confidence, because you are now already in a way beholden to him by by your choice and allowance. If other people came in, you would think, Oh, but I have to save space for him. And he hasn't done anything to earn it other than say I'm interested, which is not enough. And so you risk potentially either throttling somebody. But here's what I need you to understand, you will be throttling energetically. Because you've got this open energy attached to him already. He is taking space in your time, in your life, in your brain, even if it's just a little bit, he's getting something from you without putting anything in. And that's what what happens when we have these conversations, like Joe is already be taking from you.\n00:21:01 - Maria Gudelis (Maria Gudelis)\nHe's taking from you.\n00:21:02 - Tina Marie (profitdriversinc.com)\nAnybody else is. Now, it's the nature of the business that you will give to some, but you can only give so much. Yeah. who aren't paying you. So you have to be aware that all of these exchanges are withdrawals from deposits to them without deposits back to you. Sooner or later, you become bankrupts doing that, but you could have discovery calls, don't you, though, to like close people? never have all of my stuff has been 100% word of mouth, but this is the clarity process. It can happen. Yes, you can have discovery calls, but you need to recognize that the way that you handle them is what constitutes and creates a situation. of how much of a withdrawal they can make from you without making the deposit.\n00:22:05 - Maria Gudelis (Maria Gudelis)\nSo if I had the pitch deck ready, they could then keep asking me questions and get consulting from me for free. would say, let me show you what happens when you start working with me when we actually engage in a sacred commerce transaction.\n00:22:16 - Tina Marie (profitdriversinc.com)\nThis what I can do. You see now looking at when I talked about doing your pedigree, because the process of that is, here are the results I get. And then when you put all your different things that you have to offer. Now you're coming up, you showed me the Emily Hirsch, like the calculator image and then the pitch deck and all of that stuff. So when I say that these exercises lead to something, what it leads to is you having clarity about your value, which makes it much easier for you to get clarity to your people about your value. And then, so we've also gotten clear and clear on an offer on you where the guardrails are. We've talked about effective hourly rate.\n00:23:03 - Maria Gudelis (Maria Gudelis)\nthis is taking us weeks and multiple conversations that we can see the pace and the power of it.\n00:23:10 - Tina Marie (profitdriversinc.com)\nSo, yeah, you're on the back to people not being able to do that anymore. He's back to you.\n00:23:18 - Maria Gudelis (Maria Gudelis)\nHe's back. Oh, let me just let me just get this food.\n00:23:21 - Tina Marie (profitdriversinc.com)\nI put his food on the counter. Let me just go get it and bring it down. I'll be right back. No problem. Come on.\n00:23:29 - Maria Gudelis (Maria Gudelis)\nCome on. He's really, um, I couldn't find the cannon food, but I haven't tried it but he's fully ready. Oh, that's fine. gonna tell that to now. I'm be able to find the word you can't do. That's what it's out on the show. Oh, that's a shot. So, that's business. Oh, he brings it on that side. He's okay. So, we're going do the walk. Yeah. I'm gonna do the I'm gonna do the the walk. walk. I'm Okay, I can't remember which is right, which is left on the headphones.\n00:24:23 - Tina Marie (profitdriversinc.com)\nYeah, I never think about that, but yeah, my my bows quite comfort on my. Yeah, they're not cute, but they're very comfortable. I have sensitive ears.\n00:24:34 - Maria Gudelis (Maria Gudelis)\nI can't just use anything. I, I do too. Like I have these other ones. And, but yeah, they feel a little and I have Sony or something. Anyways, I'd like you though too.\n00:24:48 - Tina Marie (profitdriversinc.com)\nLike it's like, I feel like the Princess and the P or whatever. Like, oh my gosh, you gotta try three different ones before I find one that's comfortable.\n00:24:56 - Maria Gudelis (Maria Gudelis)\nLike, ah, anyways, but yeah, no, you're right. Because. I'm not used to selling to totally cold people. guess everyone who's ended up usually hiring me, you're right. It's through for all or through Going through one of my challenges or some of my courses and they're sold on me So it's like basically they're like how do I get started with you?\n00:25:13 - Tina Marie (profitdriversinc.com)\nwas the question, you know Well, and if you weren't charging higher prices for your time That's different also because yep have to persuade people at a different level And they need more structure in the presentation like you have to put more into the pitch when you're Crisis, yeah, yeah, yeah Especially when it's not for Fulfillment or they're dictating your time or all kinds of different things like that.\n00:25:45 - Maria Gudelis (Maria Gudelis)\nknow what I mean this so There's a higher yeah proof Yeah, yeah, yeah um So so basically so there's that so I didn't like how he said he wants to go through the document He has questions for us. I'm like either in your out. That was one thing I was like, that's not a good sign that kind of means he's never going to pull the trigger is my first reaction when I read that actually.\n00:26:08 - Tina Marie (profitdriversinc.com)\nAnd you can always go back and change your message and just say, you know what, really like the conversations I'm having today. Here's what I need to tell you. And you can say something like I'm a big believer in timing and aligning and with all the respect and reverence for your situation. If this is the right thing for you, then we'll be able to connect when the time is right for you. But because I've generated so much momentum and having these conversations, I can't the conscience, not serve others who are ready to go or create space that's for you if you're not ready yet.\n00:27:04 - Maria Gudelis (Maria Gudelis)\nYeah, yeah.\n00:27:07 - Tina Marie (profitdriversinc.com)\nAnd, but when you're ready, let me know. I would love to help you work on this, whatever. And your, your main project business and help it grow. And I hope that your healing and comfort and all that stuff comes, but. You know, So, so you, and then you can say, so disregard the, the deposit. I'm really, I'm really not looking for hold to hold space for a deposit. I'm really just ready to do the work.\n00:27:42 - Maria Gudelis (Maria Gudelis)\nAnd I still to recall it doesn't look like he's read it.\n00:27:44 - Tina Marie (profitdriversinc.com)\nI don't know. There's new setting in messenger that you can set it to show that to not have read receipt.\n00:27:51 - Maria Gudelis (Maria Gudelis)\nSo he could have seen it. Okay. All right. Got it.\n00:27:55 - Tina Marie (profitdriversinc.com)\nOkay. Yeah. All right. You know, some people can see the preview and. So to me, that's just like, okay, well, I'd rather just be fully transparent.\n00:28:05 - Maria Gudelis (Maria Gudelis)\nGot it. Got it. Okay.\n00:28:07 - Tina Marie (profitdriversinc.com)\nSo Joanne, yeah.\n00:28:12 - Maria Gudelis (Maria Gudelis)\nSo it just, I have such unclearness in working with her. Like it's like, how do we want to close the loop? do you want me to do kind of what I suggested on the voxer?\n00:28:25 - Tina Marie (profitdriversinc.com)\nSo can you show me? Uh, hold on a second. Yes, I'm going to hold on. Let me see if my babies need something. Yeah. Um, okay. Boxer where we at. Um, Oh, yeah, you were talking about a limb going over her stuff. So what I was thinking is, what if we, um, do that together? can like take a snippet of this portion. the video or something and go over it together. That way we're still unified and we can edit anything out that we wanted to if like we say something that was just between us or whatever. But that way you don't have to go do it by yourself and have an additional burden, we can just knock it out right now and then you're done.\n00:29:23 - Maria Gudelis (Maria Gudelis)\nYeah, yeah, yeah. So in order to do that, let me see what I wrote to you. would have to just take a quick look at her ads, give her things on that and then suggest the affiliate thing. I think we could open up a word doc and let's see where I put that. email us as just just suggesting something complementary operations team that's where you would talk to. And then do we want to give her the quote of?\n00:30:03 - Tina Marie (profitdriversinc.com)\nSo that's what I was looking at thinking about right now. So, first of all, one of the ways that I would frame it is basically what you're gifting to her right now is an audit. This is something that is something that I would sell an audit. I don't give audits for free.\n00:30:24 - Maria Gudelis (Maria Gudelis)\nNo, no, but Tina, did say like on the call, that three hour call, whatever that night. We should have said, okay, pay us $2,000 an hour to look at business.\n00:30:34 - Tina Marie (profitdriversinc.com)\nBut instead we did say we should charge her for it. I'm just saying let her be aware that there's value in this. Yeah, got it, got it, got it. We're already, you know what I mean? So just saying that's all I'm just framing, just appreciate like hoping that she would appreciate that we're already giving her time.\n00:30:52 - Maria Gudelis (Maria Gudelis)\nAnyway, that's all. Yeah, I'm-framing it so she doesn't think we do this on the regular and take advantage of us.\n00:30:59 - Tina Marie (profitdriversinc.com)\nGot it. Yes, framing the value. That's that's exactly what I'm talking about. Um, and then So going through it and giving it to her and I wouldn't give too much to it like what I would say like if you look at our ads You you might say something like I could see I would tweak Um, there are several things I would tweak about this that I think would give more leverage not this is what I would tweak I wouldn't do like you know what I mean? I wouldn't give away the recipe I would just say I see the recipe in my mind very easily Does that make sense?\n00:31:35 - Maria Gudelis (Maria Gudelis)\nYeah, so just like high level.\n00:31:37 - Tina Marie (profitdriversinc.com)\nYeah. Yeah, um, and then say um And maybe there's two offers so There are two versions of this where we can give you the strategy and the structure and your team can implement or um We can give you the strategy and structure and we can manage it for you And there are obviously different prices. So one, um, you're getting our high-level strategy, but not as much time so we can give that to you for $4,000, $6,000. $6,000 was the original price.\n00:32:09 - Maria Gudelis (Maria Gudelis)\nThat's basically still what we're doing.\n00:32:14 - Tina Marie (profitdriversinc.com)\nOr $10k a month because you're getting your time fully and my time or whatever you feel like. So it could be...\n00:32:28 - Maria Gudelis (Maria Gudelis)\nShe wants us to help her raise the money. What she specifically said is up her raise $5 million.\n00:32:38 - Tina Marie (profitdriversinc.com)\nShe doesn't need us to do that. She just needs the strategy, that's already in my mind. get one of your people to go reach out to like I suggested high-profile black women because that nurturing motherhood in them and she... don't remember who she said. not just tell her to swing up, but she said, there was a, was it Rihanna, like somebody. Anyway, she had mentioned a name and I was like, yeah, there's this whole group of women that would probably help raise that money very quickly. Anyway, it's still mostly strategy, I think, is that what she needs and she can manage a team. That would be in her best interest is just to get our high level minds on it and the clarity and then manage it. If there is organized and structured as she says they are, then that's all they need.\n00:33:41 - Maria Gudelis (Maria Gudelis)\nSo, so what if I share screen here for a second? So what if it's like just kind of, it would give come up better names you want, but ads review, more cash and existing assets, fine complimentary.\n00:35:00 - Tina Marie (profitdriversinc.com)\nThe way that I used to do business audits is, it's a good try on, try it on and see if it's the same. So if we don't like working for her, we didn't even open the door to a long time working, and if she doesn't like working with us, the same thing. So we can let her know that this is the entry offer period, that is the only one. If we do this and she likes it and wants to work with us, then we can have the next conversation. And if not, we are very competent that she will be happy with that work and that investment. And she can either take it or not. Because this is more cash-resistant assets, like if she finds the right company in Philly prior, that should bring in 10k a month, don't you think at least with the size of not only that, all it really has to do is bring in enough to pay what she invested in us. And then she's not lost anything, but the compounding effect means now she's getting that money back on repeat. And so she will have earned money from us.\n00:36:02 - Maria Gudelis (Maria Gudelis)\nDo you know what I mean? Yeah, yeah, yeah, yeah. I don't know if I was going to offer that aligns. Well, with goals of strategy for the doc major film, say doc major document. Film. Film Your goals. So I would just say working with us. Us film projects. Please see.\n00:36:44 - Tina Marie (profitdriversinc.com)\nYou know what I would do strategically is after a documentary film project, comma, doubling the world breastfeeding rate and generating revenue because that's actually Yeah, work me asked with the documentary after film project, comma, leading to doubling the world breastfeeding rate.\n00:37:17 - Maria Gudelis (Maria Gudelis)\nAnd, and increasing your annual sales.\n00:37:20 - Tina Marie (profitdriversinc.com)\nYeah, and. And, yeah.\n00:37:31 - Maria Gudelis (Maria Gudelis)\nYeah, she specifically said 10 million. Yeah.\n00:37:40 - Tina Marie (profitdriversinc.com)\nAnd I would say, I like the way that you wrote it better because the conversation that I would have with her if we do this is like. I don't support arbitrary goals. doubling the world breastfeeding rate to me is not arbitrary. There is real. value in the impact to humanity through that, that could be quantified. There is no real value that you could quantify and really spell out with having $10 million profit.\n00:38:12 - Maria Gudelis (Maria Gudelis)\nFirst of all, it speaks to no profit margin.\n00:38:15 - Tina Marie (profitdriversinc.com)\nSecond of all, what are you going to do with that revenue? That goes whatever, like there is no real value associated with that, but there is with the rest of it anyway.\n00:38:25 - Maria Gudelis (Maria Gudelis)\nYeah, yeah. Got it. Okay. So, I want to at least look at her ads, like just on my own for about five minutes or so, like a boo, unless you want me to do it with me on it. And then that's pretty obvious, like her stuff, like EG, yoga for pregnant moms, what other affiliate products that is good for her?\n00:39:00 - Tina Marie (profitdriversinc.com)\nPro-lapse treatments, like what do you call it, pelvic floor exercises, things that happen, know, after you have a baby. Like our stuff on Clickbank, you think, or specifically, or other? Potentially. I'm sure that there's something there. Or, I mean, I have no idea what exists now, commission junction.\n00:39:30 - Maria Gudelis (Maria Gudelis)\nYeah.\n00:39:33 - Tina Marie (profitdriversinc.com)\nbut also mental health. After you have a baby. Um, there's a lot that that women go through and postpartum I don't use this except for just. I don't even remember the last time I was in Clickbank. What's funny though, is that I have an alarm on my phone to remind me to go back and look at it.\n00:39:59 - Maria Gudelis (Maria Gudelis)\nYeah, woman.\n00:40:00 - Tina Marie (profitdriversinc.com)\nHealth. Coffee Shop Millionaire was like number one in business for a while on ClickBank.\n00:40:06 - Maria Gudelis (Maria Gudelis)\nWow. Parenting in families maybe?\n00:40:10 - Tina Marie (profitdriversinc.com)\nMaybe. Well, you can just search. Oh, wait. That's what you did. Women's Health.\n00:40:17 - Maria Gudelis (Maria Gudelis)\nHi, Score. Yeah.\n00:40:20 - Tina Marie (profitdriversinc.com)\nwould put it like, so what, yeah, anyway, I don't even think you have to go that deep.\n00:40:27 - Maria Gudelis (Maria Gudelis)\nThere will be affiliate offers. Yeah.\n00:40:29 - Tina Marie (profitdriversinc.com)\nOkay. If you go create the affiliate partnership with somebody who didn't even have an affiliate program. Yeah. think outside the boss. She is.\n00:40:38 - Maria Gudelis (Maria Gudelis)\nYeah. Well, yeah. And I have, um, actually have a woman that does do a pelvic floor exercise, no ticket offer. So yeah, that actually probably those two could connect, but I'm not going to do it for free, connect them for free.\n00:40:56 - Tina Marie (profitdriversinc.com)\nThat's for sure.\n00:40:57 - Maria Gudelis (Maria Gudelis)\nRight. That's, that's that brand dealer here. Okay. All right. Alright, so there we go. So digit with the public floor exercise. I don't know what else. Or more stuff?\n00:41:11 - Tina Marie (profitdriversinc.com)\nOh, yeah, for sure. Any kind of self-care, honestly. And it's female community support, like if there are besides breastfeeding, but just like if you have these, I don't know. There's just, there's just so much.\n00:41:48 - Maria Gudelis (Maria Gudelis)\nYeah, I have a minimum 10k month operations team. Do you want to go away for five minutes, 10 minutes to and then come back to me and you want to call her?\n00:41:59 - Tina Marie (profitdriversinc.com)\nYeah. Yeah, either way Like what's easiest like or do you just want to stay on the call right now and hit record I? Don't have any like there's nothing I would go get started for five or ten minutes So I mean and when I'm done with this call I'm done working and I'll go do other things for the day So I'm good to sit here and watch or come back whatever you want Know what I mean Do you know what you're gonna say to her about operations team? Sorry based on what she gave us I'd have to ask questions because she gave us the org chart and she makes it sound like everything works as You know like great. So I Would have more questions About that But operations is hardly all that I do Okay, so I guess we're getting go ahead So I just don't know okay, so do you want me to take this out like No, just as we I don't I don't know. Um, so sorry.\n00:43:05 - Maria Gudelis (Maria Gudelis)\nMy brain is like, sorry stories. I was just thinking because you wanted to have her give us all this information. Yeah, so but she did.\n00:43:15 - Tina Marie (profitdriversinc.com)\nAnd what she didn't do is say how many hours a week everybody works. So she didn't answer that question. But she she constantly talks about how well everything is organized.\n00:43:26 - Maria Gudelis (Maria Gudelis)\nMm hmm.\n00:43:28 - Tina Marie (profitdriversinc.com)\nUm, so there's a disconnect there. And, um, I don't know. I don't have an immediate, like I would make this strategy a suggestion to her. But yeah, there's nothing super clear there. To me, the bigger play is marketing, but, um, staying on the top of the marketing, looking at the numbers and making sure that all of that makes financial. sense, but I don't even know. I don't know. I'm not, I really, um, almost actively repelled by it. Um, because there seems to be too many incongruencies. And, um, so it's basically let's just get this done so she stops bothering us and we're in congruity with at least talking to her. so she has bad mothers.\n00:44:27 - Maria Gudelis (Maria Gudelis)\nThat got it. Okay.\n00:44:31 - Tina Marie (profitdriversinc.com)\nSo let's. Oh, I know what it was. I was going to, I was going to say this and then we talked, we closed the loop with Garrett. What's his name?\n00:44:39 - Maria Gudelis (Maria Gudelis)\nSomething. Uh, Grant Miller. And there's a G and an R there.\n00:44:44 - Tina Marie (profitdriversinc.com)\nMm hmm. The thought that I was having earlier is that, um, you know, there are, sometimes you really are aligned with the mission. Sometimes you really like the person, but sometimes the business model just doesn't connect. And that's this, this incongruency of like how she sees her business versus always getting the results, the fact that she's gone through six agencies in a year, got it. There are red flags and I don't want to wrestle, I'm in no mood to wrestle. And I'm also in, and so here's where the wrestle is. The wrestle is in, she wants to paint this beautiful picture, but she has a messy picture she wants to have corrected. She is, this is cognitive dissonance, right? She's aware it's messed up. She wants it fixed to align with the vision that she has, but she's pretending that that's how it already is. So when somebody is not able to be fully honest about their situation, that causes too much. much mental friction, I refuse to deal with it. That's their mess. I don't want to deal with it. I love the mission. I think she's wonderful. I don't want to touch the business.\n00:46:10 - Maria Gudelis (Maria Gudelis)\nNo, I agree. There's something off about it too that I see too. So, yeah. okay, so do we want to it's recording right now automatically. So, do you want to stop recording, restart, and then get me the recording? do you want me to give you a link to my Zoom and record it on my Zoom and then we just get it done.\n00:46:31 - Tina Marie (profitdriversinc.com)\nBut yeah, so my recording goes to my computer and I automatically stop it and then there's Fathom which does a separate recording and we could always take that and clip it so we could do anyway. We could stop and join your Zoom and then you have all the files and you have the control and you can do whatever you want to do.\n00:46:50 - Maria Gudelis (Maria Gudelis)\nYeah, that's just yeah, that's probably easiest than we don't have to edit or take anything out. It's just like we stop and start one section that we want for her. Okay, so I'll just give you on. Box or my zoom link. Do you want me to do that?\n00:47:02 - Tina Marie (profitdriversinc.com)\nOkay.\n00:47:03 - Maria Gudelis (Maria Gudelis)\nAll right. I'll hang on.\n00:47:03 - Tina Marie (profitdriversinc.com)\nI'm gonna go get some migraine glasses real quick and probably\n","contentPreview":"00:00:06 - Tina Marie (profitdriversinc.com)\nSorry, was that a good morning, but then I remembered it's not morning for you.\n00:00:11 - Maria Gudelis (Maria Gudelis)\nOh, yeah. Yeah. and let me see if ...","processedAt":"2025-05-04T03:40:52.479Z"}