{"fileName":"Transcript for Maria.txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Maria.txt","type":"transcript","priority":"medium","content":"00:00:00 - Tina Marie (profitdriversinc.com)\nOkay, hello. Ah, this visible table for, we're just setting for this. Oh, did I, and I'm going to invite you? That's what I was trying to do, share in Maria. There we go, share. So logging to Trello and yeah, yep, yep, yep.\n00:00:27 - Maria Gudelis\nAnd then we can start setting up.\n00:00:32 - Tina Marie (profitdriversinc.com)\nSo you had a something that you put, okay, so here, okay, um, well, we already have the business HQ. So, and not like all of our rocks, but we can create things that are specific to that project there, or we can just create a board in here. That's about that. We'll see how it goes. The systems and the teams have to be matched up, so it always just kind of depends on.\n00:01:00 - Maria Gudelis\nwhat we have a home to start with so let's let's be in the business HQ and you're okay I'm in that now business HQ yeah yeah you see how I added the graphic yeah I was like she'd be proud of me as I first trailer post I yeah I replied yeah yeah yeah you did yes tagged you in it I love that one here let's discuss tomorrow whoo-hoo hey how come I didn't see that notification should have got an email and also Trello does have an app for mobile yeah I do see that oh you use Trello on your mobile device I yeah because I don't get a lot of stuff with notifications I don't let things happen but if it's work-related I want to know time sensitive stuff yeah I got okay\n00:02:03 - Tina Marie (profitdriversinc.com)\nOkay, so your kind of driving things with the having created this new offer and it having things so it would probably be better to figure out what you want to do, where you want to go and lend support to that rather than we basically are shifting gears. So, we've got to figure out what's happening now. So, you have a master class that you're doing Saturday?\n00:02:36 - Maria Gudelis\nYep, yeah, to Saturday, yeah.\n00:02:42 - Tina Marie (profitdriversinc.com)\nA board? No, that's not what Read the board. The board title. in the workspace, you know, it's a part that I want to create, a list, hold on, table, I don't use this very often, so I'm having to, like, work for setting workspace views, table calendar, I don't want to do that, go back. Oh, add a card, how do I just create a new list, copy list, move list, archive list, is there, like, a list limit? Let just do that. this. Well, I'll just do this. Um, I duplicate it? I card. No, no, I don't see where I can just add a new list.\n00:04:18 - Maria Gudelis\nEach of these things are called lists.\n00:04:20 - Tina Marie (profitdriversinc.com)\nHmm, copy list now. Okay, I've got that. So now I'm just going to Okay. Okay. And So, Big Rocks, we need to change this on a screen share.\n00:05:04 - Maria Gudelis\nYeah, great.\n00:05:12 - Tina Marie (profitdriversinc.com)\nOkay, so Big Rocks, one, three high level done for you done with your clients, hybrid coaching group, DIY coaching. I mean, we could just change this could be the same, but this could be YouTube, but how, how are you envisioning the work that we're doing moving forward? So one of the things that I see as a potential is, so you said, let's just add this as a separate rock building, not this product, but I don't know how much time it takes to build, manage, and support the project, the product. Um, YouTube as a strategy. e to be able to drive traffic to if we were going to, the hybrid coaching group was about marketing and business all together, right? So business growth through, so there's the marketing and sales, but then there's also the systems and the teams and we were merging.\n00:06:17 - Maria Gudelis\nSo would the buyers of the YouTube stuff then be natural? Yes, essential clients for that then?\n00:06:26 - Tina Marie (profitdriversinc.com)\nYes. Okay. Yeah, they would. And the other way around as well. Yeah. So they work really well together and either of them could be first, but you're already talking to people about YouTube every day, so kind of. The biggest thing is I'm concerned, I want to make sure that we stay focused on whatever that we're doing because it was small ticket offers and if it's like, if you get excited about something new or you can spend a lot of time doing that, like,\n00:07:00 - Maria Gudelis\nYeah, because I will get distracted and that will frustrate me and I'll probably have to disengage completely. Got it. Got it. Got it.\n00:07:09 - Tina Marie (profitdriversinc.com)\nBut it does serve everything. So, and you're excited about it.\n00:07:14 - Maria Gudelis\nAnd that's really important.\n00:07:17 - Tina Marie (profitdriversinc.com)\nI feel like there was a lot of just burnt out by the response that you were getting from people that really wanting. Like, like your low ticket, not just that low ticket as a strategy that you're teaching, they were, you know, like Joe and other people wanting you for basement prices.\n00:07:37 - Maria Gudelis\nWell, totally like this other guy right now is like, like one guy was like, how much are your ads and like if you wanted me to do ads for low ticket and I was like 2500 plus 10% which is I think extremely fair.\n00:07:49 - Tina Marie (profitdriversinc.com)\nAnd he's like, well, I know another guy is willing to do for 1500 plus 10%. But I'm pretty standard right now, even for some of the biggest players.\n00:07:59 - Maria Gudelis\nYeah. Oh, then let them hire them, honestly, because that, you know, yeah.\n00:08:05 - Tina Marie (profitdriversinc.com)\nYes, because it's like, yeah, exactly.\n00:08:07 - Maria Gudelis\nYeah, yeah, because like then that person probably 1500 is not doing anything about the offer or anything else is just pure ads. but yeah, I don't want the either or hell, yeah, for you or not. Whereas the real estate guy, you know, he didn't blink at the five K a month and then he seems really happy and had a good meeting with me the day. So, you know, probably having two more clients like him because they're going to need both our services to scale, you know. So I think what happened is you're right. I probably got burned out by all that. I saw a quick success with YouTube. I see YouTube as a superstructure for a low ticket offer or like our mid ticket offer that could scale. I think that's where that came from.\n00:09:00 - Tina Marie (profitdriversinc.com)\nYeah. Well, I think there's more to than that. I think that I think you're extroverted in my opinion. I could be wrong about that. But think that you draw energy from other people. But likewise, they draw energy from you. And I mean, you put a woohoo and everything and people need that.\n00:09:19 - Maria Gudelis\nThere's a lot that you bring to it.\n00:09:22 - Tina Marie (profitdriversinc.com)\nSo that it's around not just marketing, but a marketing channel where you get to connect with people in a full personality, but also video so much more leverage because of the way that you can connect. It used to be that it was harder to fake, but now with AI, and really dumb people who can't tell the difference. But pretty soon, AI is probably going to be difficult to detect for almost all of us. The biggest thing that it will have a hard time replicating will be very outgoing personalities. it can't even come close to replicating me right now. I'm sure that it cannot come close to replicating you right now. But anyway, so what I think that it does is it allows you a reset or whatever audience that you have to, you know, they can either form new opinions or they can just go away because you're getting a whole new set of audience and eyeballs, which is good. I think you do that. like I said, it so I told you before, one of my strategies is I like to do one thing that serves multiple purposes. So YouTube, we just talked about let you socialize and engage regularly at a at a kind of high level, especially if one of the challenges that you do is like do a video challenge. There are so many people who make videos on a daily basis that have huge TikTok followers and things like that, because I did a video challenge like 11. ago. I don't make videos. They make videos all the time. were so shy, they were so reserved, and now they use video as their main, um, image, their, their main traffic source. And because I did a video challenge, and I, I love that. But one of the things you can do too is ask people like, um, ask a question, but have them respond in video. So you're, you're pulling people out. Anyway, one thing that does multiple things, it lets you engage with people.\n00:11:27 - Maria Gudelis\nIt resets and merges your audience.\n00:11:32 - Tina Marie (profitdriversinc.com)\nWe need, no matter what offer we're doing, low cost, highly targeted leads. Exactly. It also gives us a complimentary offer. If we did the whole, you know, business growth strategy, which we may not want to do, you may just want to focus on this. And then we use, um, you know, business and systems to make their YouTube strategy and their business better. Right. So, of just the whole marketing in general. Yeah, when that we do do YouTube traffic strategies. And if you want to upgrade to higher level coaching, we'll also offer you systems and team support, because the more that you grow, the more support you're going to need. So there's all kinds of ways that that it can work out.\n00:12:22 - Maria Gudelis\nWe just need to make a plan and stick to it.\n00:12:26 - Tina Marie (profitdriversinc.com)\nKeeping in mind that there's always evolution. Like there's room forever, but the big rocks, which is the point of the big rocks is they don't they don't really change. Everything that is done supports that. But we're still kind of new in this. And so it makes perfect sense. And like I said, I really do think that you need the purge and the reset very much. Yeah. Like you said, it is very leverage. You've been doing it based off of numbers, looking at the statistics. It's converting to sales. It's not Hey, I'm having fun, shiny object, getting leads and followers, but they're not actually converting to money. And I'd be concerned about it. But it's making sales just something that we just had kind of fizzled out, right? For well?\n00:13:18 - Maria Gudelis\nOh, no, I just never used YouTube for years.\n00:13:22 - Tina Marie (profitdriversinc.com)\nWhat are you driving traffic to right now is making sales. Like you were, you said it, it's made you money. Yeah, into selling.\n00:13:31 - Maria Gudelis\nYeah, a couple of things. So in the description, I have a few links. One is a link just to buy $500 one hour consult with me go straight to a counseling link. And to go about that, I was like, Holy , like, like, like, like, awesome, like, you know, from watching the videos, uh, and then I also haven't gone to the school group. And the school group now is five bucks a month or $25, um, paid for the annual year. people are buying that, like, whether it be one or two or three. today. Like I'm like, wow. Um, and then I have resell rights is something else that's $900.\n00:14:06 - Tina Marie (profitdriversinc.com)\nIt's called, well, it's that digital growth community member, Michelle O'Neill stuff.\n00:14:10 - Maria Gudelis\nAnd so I sent them to a, um, I credit myself 100 free digital offers leave magnet. And once they get that, then it leaves them, Hey, if you're a really beginner at this, this is a fantastic program to join. It gives you resell to a whole funnel. Sorry.\n00:14:28 - Tina Marie (profitdriversinc.com)\nSorry. My brain. I just, I needed to wait. It wanted to come out. So in my brain, my brain had thought my mouse should have kept it shut for a minute. But YouTube profits for offer owners and affiliates. Yes.\n00:14:45 - Maria Gudelis\nYes.\n00:14:46 - Tina Marie (profitdriversinc.com)\nBut that's also very specific.\n00:14:49 - Maria Gudelis\nYeah.\n00:14:49 - Tina Marie (profitdriversinc.com)\nI don't, I'm gonna go google that right now and see what comes up. YouTube profits for offer. One second. Well, first of all, there's no Google suggests. You see this?\n00:15:03 - Maria Gudelis\nYeah.\n00:15:04 - Tina Marie (profitdriversinc.com)\nIf I go to this, YouTube profits for offer, so owners and affiliates.\n00:15:16 - Maria Gudelis\nWas that a good thing or bad? You said there was no suggests.\n00:15:21 - Tina Marie (profitdriversinc.com)\nYeah. Um, well, so there's no, there's no competition for that particular keyword. But if we do YouTube profits, that should be a very broad keyword with how we not see how many pages it is like we used to be able to.\n00:15:41 - Maria Gudelis\nOh, yeah. don't know. I wonder if it'll show up on my Google because on Canada, it'll be different. But you just Google YouTube profits.\n00:15:48 - Tina Marie (profitdriversinc.com)\nThere it is. hundred. It's just the most covered.\n00:15:51 - Maria Gudelis\nA hundred and eighty-four million results.\n00:15:55 - Tina Marie (profitdriversinc.com)\nUm, of course, creative. We'll say we'll see what happens for a course.\n00:16:00 - Maria Gudelis\nThere's a lot of them coming up here, isn't it?\n00:16:06 - Tina Marie (profitdriversinc.com)\nIt's not giving me results again. tools. Oh, there it is. 23,600,000 and for course creators and coaches, we'll say I have to quit tools. Now we're 20 million. How these course creators build profitable businesses. So I'm going make online as a content creator or coach. Let's see. She's quite, not talking to you. So she's got 529,000 subscribers and this has 14,000 views. 41 comments, 703 likes. And it's on YouTube, but it doesn't necessarily say it's about using YouTube to do that. Okay, this is a year ago. YouTube is one quiet. YouTube will start paying creators for course content in 2024. 622,000, 13,000 views, 865 upvotes. Anyway, that particular keyword, I think, it's long tail, but I think it would be really good. And for the domain, it could be IT profits or creators and affiliates or, I don't know, or YT affiliate profits or something like that. I don't know, we'd have to play around chat. TPT is really good about coming up with some descriptions for that. You could also have two domains, right? So you could have the long tell keyword domain. And it's one that you actually do the drive the traffic to. Yeah. Yeah.\n00:18:14 - Maria Gudelis\nYeah. That makes sense.\n00:18:17 - Tina Marie (profitdriversinc.com)\nBecause you don't have Google likes than keywords. And then if everything on the page is relative, and actually, you know, not keyword stuffed, but it's really like, this is exactly how it works. And it's logical flow and things like that. So, um, what time is it? Okay. So big rocks. Um, let's just pretend that we're having a brand new conversation from scratch about what we want to accomplish between now through the end of January, knowing that right now you've got a client engaged. Yeah. Um, and so do we want to have something strategically where you're So putting out and maybe it's once a week or something like this about, hey, just a reminder, we've got this offer going, we're looking for a couple of people, whatever, and see if we attract people or we just ascend them through whatever's happening through the YouTube stuff. That's possible too. just let nature take its course in terms of whether or not we get a higher ticket client that can help fund everything while we build something smaller out.\n00:19:32 - Maria Gudelis\nMaybe, maybe not do that, like let nature take its course on naturally some people might come to us for a bigger funnel build, but maybe more for weeks I would then kind of get back on social media or we could put something together for that only because, you know, I did advertise, hey, only taking one client, right?\n00:19:52 - Tina Marie (profitdriversinc.com)\nAnd I took him, I did say to him, hey, I was being for real, are you going to, you know, pay the rest of this because as I do. I'm on board.\n00:20:02 - Maria Gudelis\nThat's all you need say. Yeah, yeah, yeah, yeah. So he'll make more sense if it's four weeks later than I advertised for another quarter. If I were to do it now, it would make, yes.\n00:20:10 - Tina Marie (profitdriversinc.com)\nSo now we're looking, I mean, because it's end of October, so we could look at not starting that until December or end of November prepping into December. What makes sense to you there?\n00:20:23 - Maria Gudelis\nYeah, I think end of November prepping for December. Yeah, and like the original thing be what we talked about where we're sending them to like a video sales letter that you and I are on and we walk them through the framework, what they're going to get, we'll make it very clear, and then hey, if you want this book a call for us and we make them pay 100 bucks for the call so we don't waste time.\n00:20:49 - Tina Marie (profitdriversinc.com)\nRight, so that really only gives us like two or three weeks to create something like that if we're targeting mid November, or we said end of November, end of November. Okay, so that gives us a few weeks to VSL, Maria and Tina, COOO, COO, CMO offer. Okay. Do we want to change this?\n00:21:23 - Maria Gudelis\nGet rid of it. Hybrid coaching group. If we were to do that, you think that's more like for first quarter 2025?\n00:21:50 - Tina Marie (profitdriversinc.com)\nThat would probably be better timing. Yeah, so we'll see. And then this as well, because it's basically just a lower version, and that will kind of create itself from that, be siphoned off of the higher one, so Q1. So then we're going to bump those two down. So, what, what. do you want to put here? Like, you're already doing a masterclass. If you are going to plan out what you'd like to do through, let's say mid-January, right? Because whatever you're doing, there should be some kind of climax that piques about new year goals, right? So you don't and it's going to last through the first week to three weeks of January. So let's say through the first month of Q1, you've been imagining what that looks like or just kind of talking about it and doing it rather than making a plan.\n00:23:50 - Maria Gudelis\nTalking about it and doing it. I'll be right back just getting the dog is going. Hold on second.\n00:23:57 - Tina Marie (profitdriversinc.com)\nKeep trying. Okay.\n00:24:12 - Maria Gudelis\nI mean, the general idea honestly was just like, yeah, let's just get this done taught, put together of course, sell via on-demand webinar for 197 or that's sort of what the process was, but you mean like talking to other people about new year stuff like that or what do you mean or just no, no, I mean, whatever we're selling, there is going to be a new year correlation that helps us make you've got Black Friday offers. I would imagine you also do a new year offers. Yeah, yeah, usually you speak group coaching, yeah, yeah.\n00:24:56 - Tina Marie (profitdriversinc.com)\nOkay, so sell course via webinar.\n00:25:04 - Maria Gudelis\nYeah, I have to put a pencil on that, like whether it's like that via just a standalone webinar or whether I'm like a low ticket funnel or whether there's a $7 thing and the thing that I'm creating now like this Saturday and next week becomes like the upsell one for $197 to a $7 offer.\n00:25:24 - Tina Marie (profitdriversinc.com)\nTell me I'll add again real quick.\n00:25:26 - Maria Gudelis\nYeah. Yeah. So the two options are, so of course, one by seven via webinar or sell a low ticket funnel. You have any specificity to put here? Yeah, we're $7 that go is front end.\n00:25:46 - Tina Marie (profitdriversinc.com)\nSo let's go F E.\n00:25:48 - Maria Gudelis\nthen OTO one is $197.\n00:25:54 - Tina Marie (profitdriversinc.com)\nSo do you know what the $7 version is?\n00:26:00 - Maria Gudelis\nNo, it could just simply be 101 templates, like video hooks, templates. Yeah.\n00:26:16 - Tina Marie (profitdriversinc.com)\nOkay, and what's this?\n00:26:18 - Maria Gudelis\nThe OTO one is this thing we're creating the, it was the YouTube fast track or launchpad, but yeah, the YouTube profits. Oh, like it, because we changed the name profits for affiliates. Offer owners and affiliates.\n00:26:43 - Tina Marie (profitdriversinc.com)\nOkay. Okay. um, basically, it is. Laying. research? If you could bullet point the things in your process, what would it be?\n00:27:13 - Maria Gudelis\nSo I know the research, I know maybe taking notes, maybe the scripts, like what are some of the... Yeah, yeah, so the research and then the planning, the content, yeah, the script per video, I don't necessarily do a full script, like word for word, but the outline for the video, and then the next thing would be the recording of the video, including the script for the video, that includes the tags, the title.\n00:27:58 - Tina Marie (profitdriversinc.com)\nI'm gonna make that separate. Because that's its own strategy Okay Don't you think like so you write the content and maybe it's Research and then maybe it's tags. What did you see tags and titles?\n00:28:12 - Maria Gudelis\nYeah, and then content planning should be around the tags and title because you're research because those are the things right that get you Yeah, you're right people matched Like the video packaging if you want to call that is yeah, you're you're you're thumbnail The subject like the title of the video and I would say tags as well. Yeah, that the video packaging cuz yeah Tells you goes out YouTube's algorithm What it's about and gets you found in the traffic and what you say in the video If you know some of those keywords if you say that in the video that helps too if you go to I'll put up another tab and go to fast digital wealth.com forward slash yt I have a graphic in there that Shows five phases phases. was intending to kind of just use as a framework to teach the masterclass And again, it's not stuck in stone, you know, because I kind of do these things just to get it going Try um, h to do p s w w w I can shove the link in it already is Maybe it's not h tps Fastest a little Anyway, copy. I'll put it in the chat here.\n00:29:30 - Tina Marie (profitdriversinc.com)\nYou said dot com right?\n00:29:32 - Maria Gudelis\nYeah, it's in the chat there I think I think I have to fix the domain to have it allow the it without the www. think that's just a minor tech issue Okay So if you scroll all way down, there's a graphic that shows five There there's a little further up Yeah, everything with the white like, go, yeah, there, one more, phase one, phase two, phase three. If you scroll a little bit up, you'll see the title, there you go. So, funness analysis, which is, and then record.\n00:30:16 - Tina Marie (profitdriversinc.com)\nI'm going to put this in that. Hello. What do you want to call this? Was that what to call it? So, I'll put this here, oh my gosh, good.\n00:30:56 - Maria Gudelis\nOkay. you.\n00:30:59 - Tina Marie (profitdriversinc.com)\nThank you. you. I have a hundred and fifteen percent of my psychology course so far.\n00:31:05 - Maria Gudelis\nA hundred and fifteen percent?\n00:31:07 - Tina Marie (profitdriversinc.com)\nMm-hmm.\n00:31:08 - Maria Gudelis\nThat you've done?\n00:31:09 - Tina Marie (profitdriversinc.com)\nThere's extra credit, so that's my grade.\n00:31:12 - Maria Gudelis\nAwesome, congrats.\n00:31:14 - Tina Marie (profitdriversinc.com)\nall my scores were perfect, except I missed two on one quiz. Well, two points, one question. Anyway, I'm in... I'll go from the future. Downwinds. Oh my gosh, did I go to desktop? There it is. Oh, hush. oof, Why don't you want that? just want the image. Okay, save. Okay, go. Um, so... Does... Oh, F for IDB, quiet. Let me go back to trouble. Where was it? I'm in it. Don't be dumb. Is that really where I wanted to go? That is where I wanted to go. Oh, I was in big rocks. One second. Hey. Aphrodite. I'm trying to work. Let's go. Get it out. Thank you. This is Barbara. That's the neighbor's dog. Okay. Oh, yeah. Did I not save it? Did it not save? Yes, it did. Okay. I just saved. Okay. to save it now. Okay. Edit. So, YouTube's strategy for getting happy target leads and then weird. and that's weird that um that's like a Skype uh favicon it's weird oh for system IO yeah that's their favicon yeah oh okay yeah i mean i'm normally click on those gal but i'm trying to figure out system IO so that's why i put it there but we can move everything into your go high level if you want i have a go high level as well yeah um let's see phase one address how this is different than all the other okay you know you two courses out there that i've steered you wrong and wasted ton of your pressure to be shocked as how many it's easy to install i mean this is fast ad copy i just slapped it for sure um phase three takes a lot of chaos i'm going look at the traffic and sales save time higher Okay, phase five shows you how to save time, I'll switch into a five dollar VA. Okay, and how many people are signed up to your master class?\n00:34:19 - Maria Gudelis\nI think I've got definitely 10, let me see if there's been more, let me just sign in and look. And like the Friday will be the deadline, so I probably will get more on Thursday Friday. Let's go sales models.\n00:34:38 - Tina Marie (profitdriversinc.com)\nOne thing to consider is that if your offer is about eyeballs and traffic and you have a low attendance on a webinar, that might sound, that might, I don't know, because you're just promoting that webinar to Facebook, right?\n00:35:00 - Maria Gudelis\n10. I think it's 10. Yeah, I think it's exactly. Sorry, I was trying to answer your first question about how many. So, uh, I think one, two, three, five, six, seven, eight, I think it's exactly 10. I think I'm next. Look, 11, 12, 14, 15. Is that me? Is that me? my voice.\n00:35:29 - Tina Marie (profitdriversinc.com)\nI keep forgetting.\n00:35:31 - Maria Gudelis\ndon't know. Or if you're just giving me your PayPal email, I'll just pay you.\n00:35:35 - Tina Marie (profitdriversinc.com)\nIt's not at proffereddriversink.com.\n00:35:38 - Maria Gudelis\nThere you go. email for everything. Okay, okay. I'll send it that way.\n00:35:42 - Tina Marie (profitdriversinc.com)\nBe profit drivers, girl.\n00:35:44 - Maria Gudelis\nYes.\n00:35:46 - Tina Marie (profitdriversinc.com)\nYou're awesome. Um, so that's just the thing is, but, so, but were you only promoting that master class to Facebook? You weren't promoting that on YouTube, were you?\n00:35:59 - Maria Gudelis\nNo, It's to cool traffic.\n00:36:01 - Tina Marie (profitdriversinc.com)\nI think that sales page sucks.\n00:36:03 - Maria Gudelis\nOkay, that's what I wanted to get that.\n00:36:05 - Tina Marie (profitdriversinc.com)\nSo the only thing I was going is like, if you're talking about, Hey, I get lots of traffic from YouTube, and then you don't have a lot of attendance on the webinar, that would be that would seem like weird. But if it's like, Hey, you guys have been following on Facebook and I just wanted to show you what I'm doing. And it gets some sales. But like, clearly, I've only been doing it a little while. And they know that.\n00:36:25 - Maria Gudelis\nYeah, it's something why people know me that I always do a cheap masterclass before launching a bigger course, like in like five years ago, I did the same strategy for selling a course about how to do challenges. So hey, you want me to do workshop on how to do challenges? And I did 97, I sold 30 of them. And then after that, that $97 product masterclass evolved into a $500.\n00:36:49 - Tina Marie (profitdriversinc.com)\nI had a thought. And I'm going to say it. And sometimes things come out sounding rude. And I don't mean it to be, but I just had a thought.\n00:36:58 - Maria Gudelis\nSo I'm not going to filter.\n00:37:00 - Tina Marie (profitdriversinc.com)\nIt thinking about branding because you said this is what triggered it for me is that you said that people know that you'll put out a masterclass in the beginning.\n00:37:10 - Maria Gudelis\nI think what also people know is you bounce around from different things from time to time. That is true. Yeah.\n00:37:16 - Tina Marie (profitdriversinc.com)\nSo here's what I'm thinking about is like depending on who you want to attract, right? the jack of all trades might attract the jack of all trades. There's a difference in in in value perception between a generalist and a jack of all trades. They're the same except for a generalist has a strategy about knowing all the things and they'll still generally put it toward a specific type of thing. So I'm very much a generalist but my my expertise is using that general knowledge towards optimized business growth, optimize sustainable business growth in a joyful business. You know what I mean? Yeah. So that is that is a general view. That is not a general skill. There's so many different things involved in that. So I can be talking about AI, but I'm going to be talking about AI in the realm of growing business strategically leveraged, optimized, sustainable, joyful. Make sense? Yep. So if people hire level people that are want to spend a lot of money that would spend a lot of money, see you as a person who can't possibly be an expert because you're jumping around to all the different things, never really staying and putting in 10,000 hours, you know, per se, whatever's in their brain.\n00:38:50 - Maria Gudelis\nThis is not my judgment, right? But this is that area.\n00:38:52 - Tina Marie (profitdriversinc.com)\nYep. So maybe we consider changing the branding and putting out the language. of hey you guys have seen me be doing you know this thing that thing because one thing that I am is I'm always a student I'm always a teacher I'm always a marketer and in that vein I've done these things in the past but really I'm an expert marketer and it helps you know to state who you are how are they going to know if you don't tell them yeah and and that goes back to the pedigree and the authority post of this is what I've done what you see is what I get excited about because this is social media and I'm being social talking about these things yeah what you don't know is I've done this and this and this and this and clearly this is what I'm focused on and I'm working with you know another systems at like another business growth expert who focuses primarily on systems and teams but is also amazing at market. marketing and that kind of thing so but but I think that you should always think about what are people thinking when they're looking at you and what are your the people that you you're like your ideal clients the ones that would pay the most the ones that you learn the most from the ones that you want to maybe do profit sharing with what are they thinking when they see what you're putting out there just something to think about and if it matters so to me it's a long-term leverage play to always know like what are other the high leverage people thinking when they see it yeah I also am I don't care who thinks what I'm just gonna be me and you know teach and do whatever but I do but there's wisdom that I've learned in considering those things because I have the best opportunity to serve my people when when I'm leveraged, when I'm making good money, when I'm working with very smart, high level people. So I need to make sure that they're aware that I'm out there and that they know what I'm capable of. So those opportunities come so that I keep sharpening my saw and up leveling, you know what I mean? they need to know that I'm out there and what I'm so anyway just something to think about is like who there's an audience that you serve and there's the uh not the stalkers but what are they the the lurkers. The lurkers are the high dollar payers that never say anything but DM you and say hey look I've seen you. I've been like I've got money you know I mean? They they operate very differently but I but I I want you to always think about what are the lurkers thinking when they want to.\n00:42:03 - Maria Gudelis\nYeah, hi dollar lurkers. Got it. Yeah, even Alan's text of the other day. Well, you know, marketing, Maria, like, you know, it's like, yeah, I think just saying marketing expert maybe is is the maybe the brand name, which is very good also the marketing expert or something.\n00:42:20 - Tina Marie (profitdriversinc.com)\ndon't know. Yeah. And and and and that you can be like, I like to play in the different channels. You know, I like to, I like to play with the different, um, I don't know what you would call it. It's not the channel, but the like a VSL versus a landing page versus email. Like that's not really, maybe that's a channel. Not a platform. I third, I don't know. Channels and methods.\n00:42:52 - Maria Gudelis\nYeah, yeah, yeah. I'm a firm believer in that. Like it doesn't doesn't assign me. I know. think you're a firm believer.\n00:43:00 - Tina Marie (profitdriversinc.com)\nto any of these methods work, whether it's low ticket or whatever, it's just how you then attack it and what you're at the end of the day, it's you're offering your messaging, you know, how leveraged it is. So like you you're working and you're focusing on YouTube right now because it's getting super leveraged results. It's free, they're highly targeted and they're turning in the buyers.\n00:43:26 - Maria Gudelis\nYeah.\n00:43:27 - Tina Marie (profitdriversinc.com)\nSo nothing can beat that. Justin Brooke, lots of Dan will tell you nobody beats YouTube for cost for leads.\n00:43:37 - Maria Gudelis\nYeah.\n00:43:39 - Tina Marie (profitdriversinc.com)\nthe last couple of years, nobody has YouTube for cost for leads. Facebook ads. So, you know, just just something to be talking about like why, why YouTube, why are you doing this? It's not a shiny object and maybe even speaking to the elephant in the room. Hey, you might think like I'm a shiny object. like I'm always chasing different things, but really what it is is I'm a marketing expert and I love to study the channels, and I like teach people along for the ride with me. So you're speaking to the elephant in the room, but it's also the lurkers, like hey, yeah, yeah, always a little embedded message for them.\n00:44:20 - Maria Gudelis\nWell, yeah, I mean, I think if we were having this conversation three weeks ago, I didn't think I would have really a YouTube course, but the videos, like, yeah, it's crazy. This one video has now got that I published, I'm looking at the stats here on September 28th. So a month ago today, or two days ago, month ago, 17,784 views and 66 comments, and then another video that doesn't have as many views, but still doing too bad, let's see, scroll down to it. This was from October 17th, so like two weeks ago, has 3,680 views, 39 comments, all 39 Those are good love karma comments like so much value. You're so authentic. And the people that bought the $500 console calls with me, I asked them, which particular video do you remember that you watch? Oh, hang on, I actually saved it. She goes and and looks at it tells me it's the one where he said, you drew on the whiteboards with three circles and everything. And that's the one that has 3,680.\n00:45:20 - Tina Marie (profitdriversinc.com)\nYou should just come visit me and we just just stay here for a week and let's make a lot of content together.\n00:45:26 - Maria Gudelis\nYes, so fun.\n00:45:28 - Tina Marie (profitdriversinc.com)\nBecause I've got the kids, so I can't really trouble. then like, but we could do dual videos like we could use Riverside and like like like this relates to the podcast.\n00:45:38 - Maria Gudelis\nWe want to start to I saw a podcast today, but I thought, Oh, that's the name similar to what we would probably love to have. It had something about I think it had the word success growing your company, but it was it. He no longer has a podcast. He switched it to inputs only. He changed the podcast name to inputs only. But before it, it had something to do with the word success. Um, scaling, but also or growing, but also, like, just living your life. forget, oh, I wish I wrote it down, but, you know, me, a little bit of a podcast geek when I'm driving. I'll just come to listen to various ones, but I was thinking, Oh, that'd be good one for us.\n00:46:14 - Tina Marie (profitdriversinc.com)\nCause yeah, we would have a blast cause I'm already, you know, my energy was people would have a blast listening. I can't tell you how many people are like, you should write a book. should have a podcast and like, I don't want to, but to talk to you, it's just yeah, and even, even just the strategy of how you're analyzing the sales page and the name and the knowledge is like, if we had recorded that, that would be gold for people. Are we still recording?\n00:46:39 - Maria Gudelis\nThat we're, yeah, yeah, we did. We did. We do have a record. I mean, but we could actually just do like, Hey, we know we're going to record it. We could actually just do it like a play by play of, here's what we did.\n00:46:51 - Tina Marie (profitdriversinc.com)\nAnd here's, yeah, so, but that could be repurposed. Even from Fathom, if we ever like, you know, that was old. So we've got the audio. And also, it records to my computer.\n00:47:03 - Maria Gudelis\nalways cancel it and don't do it, but if you go like save that, we want to hide that.\n00:47:07 - Tina Marie (profitdriversinc.com)\nBut you know, we might not be dressed appropriately or whatever. So we can use an image and it can have, you know, how it has the sound thing that's going while the person's talking.\n00:47:18 - Maria Gudelis\nYes.\n00:47:18 - Tina Marie (profitdriversinc.com)\nYou can have that and then we can have like a slide on the back or screen share. So there would be more video editing, but if we get a good video at the that's low cost, that we can just say, Hey, this is what I want you to do. This was the highlight. This was the section. We can pre-preperate in like this script or something like that because then we can very easily edit down to the very specific clip that we want. And then just say, Okay, here's her image. There's my image. This is what we want you to see. These are the screenshots that we want you to put at this time stamp, this time stamp, then it's time stamp, then you've got an excellent video and you can\n00:48:00 - Maria Gudelis\nyou know we could do talking head over it like hey we just wanted to introduce this topic we were talking we did this and then so maybe it's a 20 second clip of us introducing it but we're like on camera and then i love it i love it yeah no i mean because we energized each other like i was my energy was fading you know an hour ago and then now i'm like all excited again that's how i get when i talk to you yay i was already in a good place because i just came from my mission thing but for sure when i'm like and then Maria was like hey hey yeah yeah but also and and also the other reasons for doing this you too i gotta say is that um and i don't know if i've told you this because like we haven't really chatted like this for a while but i think i said this to one of my other friends um who like we've we've been business partners even years ago and she's a good friend for the last like you know 10 years and i just had care like you know both of us have been doing facebook ads for clients since 2000 12 like I think we've because of that and because we're still damn good at it We've had blinders on because I I can't believe over the last you know a few weeks the YouTube stuff that's happening And the sales coming in I mean like it and it just still is growing whereas in Facebook if we do a video You know unless you keep putting ad spent on it. It's dead.\n00:49:22 - Tina Marie (profitdriversinc.com)\nIt goes into a desert of no eyeballs Oh in Hamza Fez He's a cancer survivor.\n00:49:31 - Maria Gudelis\nhe said one good YouTube video live YouTube video will outperform every single Facebook post of an entire year Wow Yeah, and I believe that now and and so crazy because I've been in all this blinders and Even all the groups have been in and more like create your offer do adds to it Like I've been for since 2012 when I started my first maybe it's 11 when I first saw my first Facebook ads Learning from Frank that they had to do ads. So that is like over a decade of just fricking on only one racetrack of traffic. Owen Hemsa. Okay, yeah. Oh, look at that. Even on YouTube channels for high-performance professionals. Oh, here go.\n00:50:17 - Tina Marie (profitdriversinc.com)\nNow people, you know, you remember when QR codes came out and everybody was like, this is not gonna last, this doesn't work, and it's gonna take a while. Now is the time to use them. Now, almost everybody knows how to use them. They're not nearly as glitchy. And without doing a URL, and just with the click of a camera, and especially if they can make them clickable now, that's the biggest thing is, because most people are taking a picture on their phone. I just use my phone on there to go to a site now. Yeah, yeah, I mean, he definitely gets marketing. He's got the charisma. He beat cancer naturally after chemo almost beat him. So he's special. He's out. up there. But he's definitely doing the numbers and knows the stats and things like that and I think that you'll enjoy him. But yes, we can be in an echo chamber, we can just be cutting off the ends of the turkey to make it fit in the pan and we don't know why you've got to do that.\n00:51:20 - Maria Gudelis\nYeah, and hey, listen, I'm on his side looking as a fractional CMO service.\n00:51:25 - Tina Marie (profitdriversinc.com)\nYeah, that's interesting. And without me knowing about him, like, yeah, this does dovetail nice in the pocket CMO CMO service. It does because it is marketing and it's a very specific channel and strategy. But I don't know of one that beats it. So if anybody's going to be doing CMO work for somebody, they should be going about YouTube.\n00:51:49 - Maria Gudelis\nYeah, interesting.\n00:51:53 - Tina Marie (profitdriversinc.com)\nSo you said we're not meeting tomorrow, you have plans tomorrow?\n00:51:56 - Maria Gudelis\nI got my hair cut. Yeah, I got my hair cut in the afternoon. Let me look up the counter tomorrow, what time it's at, that was the only time she's available, she takes forever to put it.\n00:52:07 - Tina Marie (profitdriversinc.com)\nThe only thing I have on Friday is once with a friend.\n00:52:12 - Maria Gudelis\nYeah, but well, the haircut is at 1230. So I can be home right now, our meeting is for 230. Sorry, our meeting is at 130. I could be home, 130. If we were to could push it to one hour later, then I have a call with Dan, then got it. I can do it after my call with Dan. Yeah, we could do that.\n00:52:37 - Tina Marie (profitdriversinc.com)\nSo that's, it gets done at one o'clock my time, and I would need, you know, just a few minutes in between, make sure I eat, keep my blood sugars like crashing right now. And it happens more often because I'm trying to keep it, you know, stable, but it, it crashes.\n00:52:58 - Maria Gudelis\nYeah, yep, yep. Let me get Hold on. Hold on.\n00:53:01 - Tina Marie (profitdriversinc.com)\nOkay. Okay.\n00:53:03 - Maria Gudelis\nSo I'm going to be happy with me, Tina.\n00:53:15 - Tina Marie (profitdriversinc.com)\nWhy? Why?\n00:53:32 - Maria Gudelis\nOkay. So, yeah, so if we could do, then that would be like, a few hours later. Okay. So is that like two o'clock your time or when would that be?\n00:53:49 - Tina Marie (profitdriversinc.com)\nOne thirty my time.\n00:53:50 - Maria Gudelis\nYeah. Yeah.\n00:53:51 - Tina Marie (profitdriversinc.com)\nWe can do that. I will just drag it. And it should have sent you an email.\n00:54:01 - Maria Gudelis\nOh, it didn't just change the English language.\n00:54:04 - Tina Marie (profitdriversinc.com)\nOh, wait, did it do it to all of them?\n00:54:06 - Maria Gudelis\nI don't. I don't.\n00:54:07 - Tina Marie (profitdriversinc.com)\nI hope it did not.\n00:54:09 - Maria Gudelis\nI don't think so.\n00:54:10 - Tina Marie (profitdriversinc.com)\nNo, it didn't. Just that one. Okay. I just like clicking drag.\n00:54:16 - Maria Gudelis\nI don't know if I like that, eh? Yep. I see it now. I'll accept it. Yes.\n00:54:22 - Tina Marie (profitdriversinc.com)\nSo then tomorrow we can put some more bones on this.\n00:54:27 - Maria Gudelis\nYep. That was fun. Pardon the pun, since doggy bone just went away from Merlin.\n00:54:34 - Tina Marie (profitdriversinc.com)\nOh my gosh. So yesterday, ooh, I got to send you this picture.\n00:54:37 - Maria Gudelis\nHold on.\n00:54:37 - Tina Marie (profitdriversinc.com)\ngoing to drive it. I can send it through a voxer. So much easier with text to send images, but you will probably really appreciate this. Don't know what's on top. Voxer. Maria. Oh, yeah. That's right. So let's chat. Maria. I sent that to my sweetheart because we went to Joanne's fabric yesterday because my daughter loves to sew.\n00:55:09 - Maria Gudelis\nOh my girl.\n00:55:09 - Tina Marie (profitdriversinc.com)\nNice. And we saw these guys there. Did you get image?\n00:55:17 - Maria Gudelis\nAnd I... told them to go look.\n00:55:19 - Tina Marie (profitdriversinc.com)\nYeah.\n00:55:21 - Maria Gudelis\nYeah.\n00:55:27 - Tina Marie (profitdriversinc.com)\nThe skeleton skeleton. And then I said, said, I had to make him pay attention. It was funny. I know I love it. And then he cracked up and he's like, you're so goofy. And I'm like, I know I'm freaking hilarious.\n00:55:49 - Maria Gudelis\nI love it.\n00:55:50 - Tina Marie (profitdriversinc.com)\nthen she left it on the couch last night and scared the crap out of me. So I was like, his name is Frank.\n00:55:58 - Maria Gudelis\nFrank. Frank.\n00:55:59 - Tina Marie (profitdriversinc.com)\nYeah. It's in duck and a skeleton dog. Anyway, um, we'll wrap up. So we'll just, um, if you want, we can probably meet Friday as well.\n00:56:10 - Maria Gudelis\nIt just depends on the pace.\n00:56:11 - Tina Marie (profitdriversinc.com)\nIt depends on how busy you are and how much you want to get, you know, the structure going.\n00:56:16 - Maria Gudelis\nYeah. Yeah.\n00:56:18 - Tina Marie (profitdriversinc.com)\nBut we can talk about that tomorrow because Friday is open.\n00:56:20 - Maria Gudelis\nSo let's see what we do tomorrow. Okay.\n00:56:22 - Tina Marie (profitdriversinc.com)\nWe might fry our brains tomorrow. We did a lot today already.\n00:56:27 - Maria Gudelis\nYeah. Are you excited about it?\n00:56:29 - Tina Marie (profitdriversinc.com)\nLike what? Oh, yeah.\n00:56:30 - Maria Gudelis\nI think it's going to be great.\n00:56:31 - Tina Marie (profitdriversinc.com)\nI think it's, um, yeah. So that's the other thing. My, my diet, I don't get to eat happy food and I'm, I don't get sugar highs, which really make me happy. So, um, my, my might wane from time to time. It's definitely not that stuff. Like I'm really hot and dizzy right now and I probably need to go eat.\n00:56:54 - Maria Gudelis\nOkay.\n00:56:55 - Tina Marie (profitdriversinc.com)\nYou we? Yes. I just want to tell you though. I, I love this.\n00:56:59 - Maria Gudelis\nUm,\n00:57:00 - Tina Marie (profitdriversinc.com)\nYou tell me I do I do love this and I I love it for you I love it for everyone from the business thing I love it for myself too because I do need to get more practice being out there and I'll never do it without another person So I'm interested in it. I I not Don't want to be on camera But I love having conversations and anyway, just have self-confidence issues You know that not in me like and I know people don't care. just don't like seeing myself I used to not be able to tolerate hair in my face and I've gotten over that most of just because people say really nice things about it Which is crazy to me But no, they'll be like you can really good at like reading a book We're like I've sang on video a few times in one lady. She's like I could listen to you in the phone book. I'm like Anyway, so we'll get over it and practice. It's it's just Decentatizing yourself to it. So I love that you're doing it great job and have an awesome day and we will talk as well.\n00:58:03 - Maria Gudelis\nright, and I sent the 500.\n00:58:05 - Tina Marie (profitdriversinc.com)\nCheers. bye. Bye-bye.\n","contentPreview":"00:00:00 - Tina Marie (profitdriversinc.com)\nOkay, hello. Ah, this visible table for, we're just setting for this. Oh, did I, and I'm going to invite you? That's what I was trying to do, share in Mari...","processedAt":"2025-05-04T03:40:52.467Z"}