{"fileName":"Transcript for Chona.txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Chona.txt","type":"transcript","priority":"medium","content":"00:00:07 - Chona Sweet ( wspainclinic)\nHi, hi, how are you?\n00:00:11 - Tina Marie (profitdriversinc.com)\nIt's been a lot.\n00:00:19 - Chona Sweet ( wspainclinic)\nI worked, I went to the hospital already. And I didn't plan on going to the store to get the receipts again, but I know Mark needed it. So that's what I've been doing. I went to the Chanel store and get the receipt and Mark's like, can you drop it off? So I came back, I came from his office. So that's where it's at. I definitely feel off. I feel more off than last week, which is weird. Last week, maybe I'm just a little bit in shock still or in denial, but I think the moment we return home from the hotel, I feel more off, which I'm struggling.\n00:01:14 - Tina Marie (profitdriversinc.com)\nI mean, your door's still unlocked and right, it's open.\n00:01:17 - Chona Sweet ( wspainclinic)\nYeah. It's the door had a board and it still hadn't been fixed and the guy came, yes, what is today? Today is what's the guy came, I believe yesterday or Monday, and he's like, oh, they made they did the measure wrong, so I need to order and it's not going to come till Friday, which we're not here anymore. And then the security guy came Tuesday, but, you know, we're not, I don't know if we're going to install it, it's just, I told you about his plane.\n00:01:56 - Tina Marie (profitdriversinc.com)\nYes.\n00:01:56 - Chona Sweet ( wspainclinic)\nOh my God. You know, I was, or I was like. At that point, I was just laughing like that's what he said. He's like, I'm just laughing now Like we I literally just love like this is just What else can you like say or do at this point?\n00:02:13 - Tina Marie (profitdriversinc.com)\nWell, you could choose to be bitter and angry But it won't do it good, right?\n00:02:19 - Chona Sweet ( wspainclinic)\nI think for me Like I'm on the weekend Mark and I went to the Hermes store because you know, they took our pillows and blanket And then So, you know, we got some pillows and blankets just to kind of like bring back the normalcy I guess not to replace them the well We are replacing this stuff, but it's just the Routine the normalcy of you know, those I get a little bit emotional Which is weird for the pillows and the blankets and it just reminded me again you know that I don't know if I told you about my obsession with the Hermes bags which are I think it's more of I think mark and I like it because it's a competition I don't know if I don't know if we we told you that it's definitely like okay we do if I tell it to you real quick because this is definitely my yeah this is your time and also it's it's all like right now processing the things that are happening and the things that you are feeling is a huge part of the work that we need to do right so that you can get back to it so yes anything that's on your heart just let's do it so the Hermes it's like Rolex game day day day master I feel like our mess master is better master the game of exclusivity and you know in the beginning I was like some of my friends have it so it's like Oh, I wanted to, but then, I, you know, as, as I go with it and buy their stuff, their bags are handmade. It's not machine-made. the quality is there. Definitely. What is the term they use? It is not expensive. It is costly. That is the term. They rationalize everything. it's basically, you can, you cannot walk in the store and say, I want to buy a bag. Like, it's not there. You have to quote-unquote earn it. So, by earning means, it's an unwritten rule, but it's a ratio of 1 to 1 or 3 to 1 for the bags, for the value of the bag. So, let's say, if it's $10,000 Birkin bag, then this spend is about around $10,000. So that's how it works and because it's so limited, it's not you kind of months to years to wait and in a year they control it to two bags a year. So now me and Mark being competitive. We have two accounts, one here for my name and one in Vegas. And then when we go to Japan or Paris, we also win quote unquote win the game by getting back. So it's kind of like in a way like it's a win for us. I look at it more like that. The bags is really a plus because they really either return retain their value or double the value. So it is in a way a part of the investment. It's like when we write the assets, it's part of it. moment you walk out the door is double the price depending on the bag. So that's how it How can I I feel like it's me more so I love I like it. I like the lifestyle like products that they offer. I like the bags but with Mark it became obviously he's tolerating me number one and number two it became also like a competition for because you know Mark is very competitive so it became like that for him. He has friends that they do it for their wife's students like it's like it's kind of you know he he he he he found how do I say is he found his support group so so that's where they talk about they talk about what their wives buy they talk about the ridiculous things that are mess and it's like any other luxury brand or like Louis Vuitton have a freaking fifty thousand dollar dog house. I know it's still it's still my like things like That's it. They found the ridiculous things. only difference is her mess bags are really very sought after and so So it's one of those mark is cars his cars are you know, it's super expensive.\n00:07:16 - Tina Marie (profitdriversinc.com)\nThis is mine and I think he forgot he stopped telling me about the cars because I was like Because it would come into the conversations and he he talked about business. Well, we need to make more money I'm like, I don't want to hear about it. so you get the systems down and you focus on these things It's not that I think that the cars are bad. It's just like When I've got an hour a week to figure out like what we're focusing on To make it work like You know, but yeah, he has definitely outdone himself like the plane It's a lot of issues that comes with it, but yeah, he was able to do it with It's very challenging Well, and the What I love about it is that you guys are focusing on things that retain or increase their value. It's one thing to have something and just kind of throw money away on stuff. But when it energizes you and you don't actually lose money as long as we've got the insurance in case anything. Then it's good. When you have leaders and creators and people that create jobs and people that serve other people, energy management is huge and we're all driven differently. you think about most of the innovation that's happened in the world, it's been by people who are considered crazy of one sort or another. They're autistic, they've got antisocial skills, they've got some kind of real quirk, right, that the rest of the world is like airwaco. But if it wasn't for being wired differently and needing different And I don't know, rewards, you know, different things, we would have all of that greatness. And so one of the things I've learned to embrace is that I heard this analogy once that is like, if you pick up one end of the stick, you pick up the other, right? So it's like, let's say it's a person, let's say it's a thing, it doesn't matter what it is, you get the good with a bad, a lot of times it's not even bad, it's just different, right?\n00:09:29 - Chona Sweet ( wspainclinic)\nIt's not.\n00:09:30 - Tina Marie (profitdriversinc.com)\nYeah, so it doesn't help to judge, like there are some things we have to be discerning about, some things that are toxic to us, some things that are toxic to other people. There is a real good and bad, but few things actually fall in that run.\n00:09:47 - Chona Sweet ( wspainclinic)\nRight, we definitely are, it's real good for them. Right, and we're definitely into, on Mark's account, he's super competitive, even between us, like, oh my essay or like my, my,\n00:10:00 - Tina Marie (profitdriversinc.com)\naccount. My sales associate gave me this. What is yours giving?\n00:10:03 - Chona Sweet ( wspainclinic)\nHe's definitely much better and we're waiting for an offer which is to put it like to put the value on it in just terms of monetary value. It's it's worth 30 to 40k but it's being sold in the market for 250,000.\n00:10:23 - Tina Marie (profitdriversinc.com)\nWow.\n00:10:25 - Chona Sweet ( wspainclinic)\nSo that's how we are competing.\n00:10:27 - Tina Marie (profitdriversinc.com)\nI like that game.\n00:10:29 - Chona Sweet ( wspainclinic)\nIt's a very and and the other one is worth 67 to 780 and it's being sold for at least 150 to 200. those are the kind of bags that were after and obviously I benefit for because I use it but I think in a way you know without any how do I say being with the right term without because I do I do What's that that in English? do criticize myself with this but at the same negatively but trying to kind of separate that it's for status yes but it's definitely for the competition like when you hold see someone like hold that that is like either if they bought it at the reseller for 250,,000 or they fought the game in the store which is hard it's so hard so I know Mark was worried about me because I was at one point very obsessed it's kind of coming down actually the last year but in my obsession this year is like make sure my business my how I need to make this much that's what I do get obsessed very easy and my problem is consistency and I know this about myself but I do get very excited, very obsessed. So just making sure that I if the obsession comes down with business, I hope that it just stay at base or sustainable, mentally, physically, everything financially. So that's where I hope to be. But in terms of the bags, I don't know, I'm sure it's very difficult for me, because I remember the money spent the hard work over the years of getting those and some of the bags, you know, I can like one bag, for example, if you search it right now, there's only one bag in resale in the market and it's like worth 76,000 and we got it for 42.\n00:12:51 - Tina Marie (profitdriversinc.com)\nWow.\n00:12:52 - Chona Sweet ( wspainclinic)\nSo that's how rare those bags and one bag, two bags, I made to order for I made the order, and it took one year to make, and I cannot get those colors back, because they change it every year. So that's how those bags are, and the memory and the sweat, blood, that was it.\n00:13:17 - Tina Marie (profitdriversinc.com)\nI want to share something with you, because I just think that it's helpful, and it's also kind of hard. So, I'm trying to figure out the best path to this, but ultimately, and I don't know if it's good or bad. see people that have very sentimental and very attached, and I sometimes kind of envy people that have attachments, because I think there's a lot of love and a lot of feeling and a lot of emotion, and I used to have that, but I feel like kind of. numb in some ways. But then I realized that I'm not actually now my attachment is more to emotional outcomes. So when I was little, I think I just probably just do this really quick because that'll help. So my mom was abandoned by her parents at age six, and she was raised by her 14 year old sister who had a baby at the time. 14 year old, she had a baby, was married. So, you know, they weren't great for my mom. Her parents, they just didn't want their kids anymore. Alcoholism, just generations of that. And then she lived in a Catholic home, and then she went into the Air Force, and then she met my dad, and it was a very toxic and healthy relationship. He, when he was pregnant with my brother, was a year and a half younger than me, and he pushed her off a cliff. and tried to kill her for insurance money. But she didn't die. And when the baby was born, he murdered him in front of me when I was a year and a half old. And she walked in on it. And I actually still have memories of it. I was able to draw a picture of the room when I was 13 years old. I didn't know that it happened. My mom always told me he died of sitts. And so she married another man when I was seven that lasted for a couple years. But what happened was we had to walk away from things lots of times. Like we just had whatever fit in our car. And so my life was having things and losing them, having things and losing them, having things and losing them. I lost two of my kids basically to a really toxic narcissistic ex-husband. Hang on What I feel like is that like I love my house. I bought this. Nobody else has lived in it. It's a brand new house. It's kind of a wreck after four kids and four dogs. There's three now, but they've all come through. I've had a custom tree house built in the back. Like I have acquired and amassed a lot of things as a single mom working no more than 20 hours a week. I'm pretty proud of that. dropout even. I'm not because I couldn't handle it intellectually, but emotionally, you know. But I've got to the point like what I'm doing right now is having all my photo scan because the truth is anything could burn down at any minute and I can replace it all. And so what I'm attached to is growth. I'm attached to making people happy. to and I'm super competitive. So this is not I'm putting it in perspective because something just got taken from you. That that's why it's not about the game. I think the game is awesome. What I think that um something to consider is that nobody can take away the victory that you acquired. So if you on the victory and the fun and the memory that you created rather than the item. Then you can still keep playing your game and having the fun and having the beautiful things but learning to be able to just let them go and um not keep the attachment. You know what I mean? The attachment to the experience that you have with the things how beautiful they were that you won that in the first place and that it was worth you know and and and even keep playing the game and And maybe you add another game to it, which is like, what if, so, you know, you come from the Philippines, there's a lot of work that can be done there. Like, what if one of your new competitions, not instead of, but with, is what kind of charity can we create down there? kind of improvement and innovation can we create in the Philippines that is a legacy to you and to your family? Because then what happens is, even if anybody went and destroyed that, like, all the memories. For me, I've learned to just really attach the memories, experiences, relationships, and I will, even though I really like having my financial freedom, I've gone broke and bankrupt and in the mass of debt, paying other people rent bills, things like that, because I can just make money. And I keep having, so, like, my competition is, I don't know what kind of like power can I create where basically nobody can hurt me because unless I'm dead or they hurt my kids because no matter what happens I could lose everything I'll make phone calls on a borrowed phone and I'll be up in the next day if not the same day one way or another you know what I mean because of the people that I've helped because of the work that I've done because of the skills that I've acquired because of the things that put in my brain and and all that stuff and because of that like I feel pain like this year has been incredibly painful but it has also been one of the most empowering and joyful years I've ever had and the most painful and it's that duality that and it's the contrast that makes the good so good like Think about what it's like to eat a really good meal after fasting a long time. And you're like freezing cold for a long time or like you're in pain for days and days and days or sick for weeks and weeks and weeks and all of a sudden one day, you realize how good you feel. You're like, holy crap, I missed just feeling good, you know, after suffering for so long. So to me, it's actually these hard things and these bad things. They're such a gift because of the contrast, because without the contrast, like imagine you were born into a world that was always sunny and always warm. Would you ever care about the sunshine? Would you care about warmth?\n00:20:46 - Chona Sweet ( wspainclinic)\nYou take it for granted.\n00:20:47 - Tina Marie (profitdriversinc.com)\nYou would be like, so this is what it is. It's like, know, but then if all of a sudden it was dark for a week and it dropped down to 32 degrees and you guys all had the huddle and then the sun came back, it would be the most.\n00:21:00 - Chona Sweet ( wspainclinic)\nWonderful glorious thing you'd ever experience in your whole life, right? I think I definitely I get I became I don't know if you remember the mud analogy. It's so easy for me to Fall into the mud and get comfortable. So I really really have to be consciously Telling myself and consciously like literally picturing picking up myself up from the mat But because it's it's just and I think I'm kind of feeling I'm spiraling down there so I which is I recognize it I Verbalizing it to you and to mark and I just feel and even to some of my friends who asked how I'm doing I verbalize it, but it's definitely a struggle currently Like I said the moment that we got home It's a struggle between in being comfortable in the mud and getting myself out of the mud. Like today, I'm a Chanel store. wearing this and I was like, I wanted to shop. I wanted to get excited again. I'm not there yet. I feel scared and there's a part of me that's like, I am so so blessed and I just need to be grateful that we are in a position to buy maybe not everything but a lot of bags again. Like Mark set up an appointment in Paris and she's portion now over me to get stuff. I am, I'm trying to feel the feel that I'm feeling but also at the same time be grateful about it because I know Mark is definitely trying and I want him to know that I am grateful about it but in comparison to how I feel with it. I know there's some issues in his spine, like I am so so worried that I again grateful that we're in a position to have a freaking honestly shelter just to see him that day Yeah, or a neurosurgeon on the call like Because I work with her or a pain doctor another two more pain doctors that his friend and my that That I Cannot even imagine not knowing someone or that the lightning hit the plane and mark was okay And again, I don't know. I'm literally I'm generally just laughing at that It's like what else can you know, yeah, it just shows how we are with handling the problems will be okay I know we will be okay And with the spine a spine issue. I'm I'm trying not to be scared. So he's not scared Okay, but I'm just trying to be vigilant on his symptoms as I know what to do for and I make sure again multiple times that I said we have our insurance are covered we're out of country like as in my head if he has to go to surgery there he has to it is what it is yeah but um you know that's and you know his mom we're trying to make it okay for his mom it's a big birthday without his dad so it's a lot of things that is happening and um to be honest I'm behind my charts but I see what I need what I need to see what I want I need to do is done it's current I'm just needing to kind of how far behind are you on your charts I'm about 50 two days that's two days worth so let's just put it into all all perspective\n00:25:00 - Tina Marie (profitdriversinc.com)\nFirst of all, I love that you're really noticing like how you feel about Mark and because you guys have had stacks and stacks and stacks.\n00:25:09 - Chona Sweet ( wspainclinic)\nIt is stacking like which is so it just testing who we are right now actually and this is who we are and what we did how we went onto this.\n00:25:21 - Tina Marie (profitdriversinc.com)\nThat's it. It's testing how you choose to show up when these things happen and what you choose to focus on and really your priority is how you feel about the family. Now the the stuff is also part of like your energy. So that's an important thing but those things aren't more important than Mark and that's important. And you already did that. So in terms of though what you were talking about like you feel like you're spiraling into the mud. You're not. Hold on just let me let me let me tell you because you first of all You had gotten further behind in charting. had like 70 or 90 charts that you were behind once. And you got that caught up in one day. But what you also have is the benefit of the compounding of the things that you've done.\n00:26:14 - Chona Sweet ( wspainclinic)\nSo now you have a much better relationship with Dr. E.\n00:26:18 - Tina Marie (profitdriversinc.com)\nIt's Cheryl.\n00:26:20 - Chona Sweet ( wspainclinic)\nAnd now you have Bella and you need some systems and you've got these forms going. So I just can't wait to discuss to you about Bella.\n00:26:28 - Tina Marie (profitdriversinc.com)\nI am so excited for that. I'm so excited for that. And we both have calls at 12. So I want to ask you that time to get to that. But Jonah, you're not even nearly in this. You haven't gone backwards. You're still ahead of where you were two weeks ago, three weeks ago, you're ahead. The charts are the only thing that's behind. And you could fix that in a day if you want to. It will be hard. You're going to have to. Honestly, seriously, if it was me, I would go. call all my friends and be like who is the most military personal security guy you know and have some station there for a few days and and also have that dude go tap homeboy that was supposed to be watching and keeping you safe and give him a little private lesson on what he should be doing. Talk to your HOA or something like I would be man-handled.\n00:27:21 - Chona Sweet ( wspainclinic)\nHe did like Mark is so stressed right now he is on I would see he's on John Wick mode. He's like seriously he's he's giving out all the information to the detective and then he's he has PI's he's like just on top of it and I told him this is very good that you're on top of it you know it's just that I hope all the energy you keep some of energy for yourself for your company.\n00:27:50 - Tina Marie (profitdriversinc.com)\nOkay but the way men are wired he won't have any energy for himself if he doesn't do this right that's the way men are wired it right will not have peace and he will not be able to take care of himself until he's handled this and that's what the money and the power is for, is for taking care of he, the doctor, he got scared.\n00:28:13 - Chona Sweet ( wspainclinic)\nSo right now, his health, you know, the doctor, the doctor where I sent him to do his injection, I also basically trained him on some part when he's a fellow at used to work. He told he was texting me. It's like, Mark, I was about to give him some anesthesia, you know, some sedation. So he will not be too much in pain. And he's still on the phone answering emails. That is Mark. And it's like, that's just, you know, how he is. But he's definitely, I'm very proud of how he's taking care of himself. Like he's doing what he's supposed to be like, I told him, when you're, when you're picking something on the floor, you have the squat, you cannot bend.\n00:28:57 - Tina Marie (profitdriversinc.com)\nYou should anyway.\n00:28:58 - Chona Sweet ( wspainclinic)\nYeah, you shouldn't any. It's proper body mechanic.\n00:29:02 - Tina Marie (profitdriversinc.com)\nYes.\n00:29:03 - Chona Sweet ( wspainclinic)\nI just want to talk to you real quick, Bella. So every morning with a huddle, at nine o'clock, I would text her and say, good time to talk. Yes, so she's on top of it. So we're doing that. I talked to her and tell her what's the outstanding emails, whatever we need to do. So that's really like that. seems like she likes it too. And I told her I'm giving her more range to the emails. Like you are in charge of the email. I'm not going to read it. You will respond to any emails. For example, they send something you said received. you. So that's what I told her. And then I basically giving her instructions when they send something, attach it to the patient chart. So she is actually setting up appointments for me for a patient. Like today, she set it up yesterday. And she's doing what she needs to do. She puts the information to the Google Drive. Set. the digital lean and then start the chart so she's doing those we don't have a lot which is great so I'm I don't I told her are you comfortable I want to be sure she's comfortable and I thought that you know I just again make her feel like I'm always here and give her directions like you'll have to tell me if I have she didn't tell me that I have a patient today so it's a good thing we talk at nine o'clock because she she's just putting it on my zoom so I told her at the end of the day I want you to tell me like hey I put some patients on your zoom so she has access on my zoom account like she has access on my docu sign so I'm I'm comfortable I'm happy where it's at but I'm still on top of it like I'm looking at the emails and making your delegating not abdicating yes I again I'm giving her more rains and then yet the other a Cheryl, I was in the office and then one of the assistants there because I used her for Spanish interpretation, that have Spanish patience. So they, you know, they, they, again, I'm, I think I'm generally nice and whatever. So she's like, can you, can you, can you just hire me to your assistant? And the show's like, he already has one, which is about, you know, again, it's, it's good overall.\n00:31:29 - Tina Marie (profitdriversinc.com)\nknow what you might be able to do though is help train people better, like the way that you're training Bella, but maybe Cheryl isn't good at training her assistant or training Bella to work for her or anything else like that. And though it would take a little bit more time for you, it can be one of those gifts that you give that Dr. E will appreciate because it's not costing him or to hire somebody else. Cheryl will be more efficient. of my favorite things, Jonah, is to make everybody and everything better than I found it. If I can, you know, I don't be arrogant think I can do that everywhere, but I attempt to yeah The the cool thing is the law of it. mean, it's good karma, right? I Get blessed out of nowhere all the time like I feel fuzzy is when I think that to me That's like the whole thing like yeah, good job Like God wants us to do that go and people but it's just it's also science.\n00:32:27 - Chona Sweet ( wspainclinic)\nIt's reciprocity like it just I believe that mark and I believe that it's good karma and what I think what doctor What so he's right? I'm seeing a lot of lean patients like the last two days and the clinic That the lean said comes from him like whatever he's sore sad So I've been seeing that and I did some of the procedures for a couple So I'm yeah, he's he's letting me in charge I think he wanted to whatever emulate like whatever we're doing wing on my end, he wanted to do it on his hand. So, and eventually become more unified. And hopefully, have the same deal on those lean patients as well, because, you know, eventually, whatever deal, my deal for mine would be safe for his.\n00:33:15 - Tina Marie (profitdriversinc.com)\nBut even though I'm not bringing those. Something that you can look forward to, that I think that you will enjoy very much based off of the original conversations we had about being a woman in this world. And, you know, it's being a man's world. What I have learned is that by showing up and improving everything, I don't have to ask for respect. I don't have to ask to be treated any kind of way. happens is, I show up and I lead. over time, as long as I'm working with the right people that don't have, you know, terrible egos, they just become really grateful. And they realize that everything that I do is because I truly care. And I we want to make everything better and that sincerity, but also that effectiveness buys me a lot of respect. And so what happens is that there's a natural kind of, I won't say like submission or anything, but there's at least a respect. So like Dr. E will probably come to you for advice and the dynamic will shift and you'll be much more feeling peer to peer.\n00:34:27 - Chona Sweet ( wspainclinic)\nLike I think that's probably already happening. Yeah, it's already what it is in the hospital. He gets the pages because he wants to still get involved because it's his name, but he the I'm like whoever is NP there before it was one that now it's me will make our own decision, which is what I am supposed to be anyways, like as a nurse practitioner, I'm definitely being, how do I say this, being used to my fullest potential. That's where I'm at right now, which is amazing. Again, the reason why I left UCI long time ago is just that is just the worst feeling that I feel like I'm overpaid.\n00:35:12 - Tina Marie (profitdriversinc.com)\nI think I told you this.\n00:35:13 - Chona Sweet ( wspainclinic)\nI think I'm overpaid because they're not using my fullest potential. And not that I'm looking down on assistance level, but I feel like what they're using me for is an RN can do it. It's not, I feel like it's unfair to them and to me, if I'm the type of person that I'm just okay making money and then doing out of 10 hours, I do three hours of just browsing the internet and doing nothing, then I'm fine. But anyways, I'm happy with the Google meeting for us doesn't work. So my zoom meeting, the only problem we have technicality wise is When we set up Google Meet and put the patient's email, it doesn't email them directly. We have to send the link separately from our work email. So I don't know how to fix that. So we have the Google account. So he's trying to see if the Google Meet is better than Zoom. So I don't know. If you know.\n00:36:26 - Tina Marie (profitdriversinc.com)\nI personally have found Zoom to be less glitchy and more people use it. Okay. Google is more proprietary and sometimes if people don't have a Google account, everybody does. Especially older people, they've got Yahoo accounts and well accounts and things like that. that can end up being an issue. It could be a permissions issue that you have on a suite level on the G Suite level.\n00:36:53 - Chona Sweet ( wspainclinic)\nHow about when you send a, when you like set up an email, when send you set up the Google Meet, I mean, sorry, when you set up a Zoom meeting and you write the ad attendees, right? It should automatically send the email, no?\n00:37:10 - Tina Marie (profitdriversinc.com)\nYes, it should. It doesn't for ours. Zoom doesn't?\n00:37:15 - Chona Sweet ( wspainclinic)\nNo, I don't know if it's because it's my Yahoo, personal Yahoo account is connected to it.\n00:37:22 - Tina Marie (profitdriversinc.com)\nlong as it's the, I'm going to count, but here's, I always want you to remember this. Anytime you're having a technical issue like that, the first thing to do is go to support. Their experts are the ones like you did that with Evra, right?\n00:37:37 - Chona Sweet ( wspainclinic)\nYeah, yeah, which is so hard to get. I try to contact them, by the way, and I remember, remember that issue where it took the other doctors still haven't gotten permission. And it's about four months, five months now. It's like with me, I got it for a couple of weeks. Like it was a nightmare dealing with them. But I think when Dr. E, so the future. plan right now is continue doing Huddles with Bella.\n00:38:04 - Tina Marie (profitdriversinc.com)\nI just I think for right now that works for us, I think it sets the tone. That should stay ongoing even if it's just like an audio message huddle or at least like two to three times a week once you get into a rhythm because that is the inoculation for apathy and just slipped away.\n00:38:28 - Chona Sweet ( wspainclinic)\nRight. I like it. She likes it. Again, she follows what I said and I really like it. I told her because of the travel, I want us to still be untouched. I told her maybe do the Paris time and she said, I already had that.\n00:38:45 - Tina Marie (profitdriversinc.com)\nThat way I know your time. Awesome.\n00:38:47 - Chona Sweet ( wspainclinic)\nYeah.\n00:38:48 - Tina Marie (profitdriversinc.com)\nYeah, she's great.\n00:38:50 - Chona Sweet ( wspainclinic)\nAnd she sounds so nice on the phone like, you know, dealing with patients and some are not nice. But so I told her I think I will arrive in the app. the new in Paris time, that means it's morning here. So I told her, we'll keep on all doing our daily hurdles. yeah, so that's where we're at. It's just the communication is there. I'm happy with what's going. I'm going to sweet James at 1.30 after us, because I'm going to drop off. I have a 12 o'clock. Then after that, have to do maybe a little phone calls of my telemedicine patients. But the plan for the business is, once we get back from Paris, I want to do like one month or four, it will be four to five days now. It will be one month for sweet James. With Dr. E, like a lunch, just to ask them, this is a suggestion from just a lunch or something, just to kind of like what's working, what's not working, anything with the proven. But Smart said that he's also asking feedback whenever\n00:40:00 - Tina Marie (profitdriversinc.com)\nthey talk to whoever and then that's apparently good feedback so far so but you know so we'll ask that and then I'll just need to start reaching out to more attorneys when I reach out to anywhere near the mud yeah no I think we're near the mud I think we're talking about spa mud then yeah no I think the reason why I say that is just I'm not on top of my chart and then hospital I'm good but the the chart in the clinic I'm not in the believe chart I'm good and your words and your language are so powerful so if you tell yourself I feel like I'm spiraling into the mud you got to stop that yeah and what you need to do is focus on okay where was I at a month ago where was I at three months ago always take a bigger gap back because when you look at that you're like oh no we're doing great but that's what I want you to do is really stock like I think I do this week, think about the structural supports that you created and built, think about how quickly you're evolving with Bella, that you've really got to focus on those things and give yourself credit for it.\n00:41:13 - Chona Sweet ( wspainclinic)\nBut take that energy from hell, yeah, you know what?\n00:41:19 - Tina Marie (profitdriversinc.com)\nI'm knocking out at least 35 of the charts today, but really, like I'd love to see you.\n00:41:23 - Chona Sweet ( wspainclinic)\nI think you could get them all done today.\n00:41:25 - Tina Marie (profitdriversinc.com)\nYeah, I know that a lot. But then what I want you to do is tell yourself a million dollars this year. That's what I'm doing. I'm not doing it because it's a job, because I have to, or because I owe anybody anything.\n00:41:37 - Chona Sweet ( wspainclinic)\nIt's because I'm boss and I'm getting a million dollars this year. Yeah, yeah, no. I definitely, I'm on top of it. It slowed down, like I said, but I, it's okay. Mark's like, there would be days that are going to be like that as long as you're on top. And I'm going to see them today. I have, we'll have dates is face to face. And maybe there's something that they won't say over the email or phone, but I will be able to get, like, for example, that our prescription, I didn't know that initially that that's what they need more than the no time.\n00:42:12 - Tina Marie (profitdriversinc.com)\nRight, you said.\n00:42:12 - Chona Sweet ( wspainclinic)\nNow I know.\n00:42:14 - Tina Marie (profitdriversinc.com)\nYeah. There's one more thing I want to tell you to, and I really believe in the signals that we give out, right? So, by not completing our charts, we kind of energetically say, I'm overwhelmed, I can't handle more. Yeah. Yes. So if you're like, you know what? I want all of these things.\n00:42:31 - Chona Sweet ( wspainclinic)\nI'm just going to buckle down and put the signal out. I can handle it.\n00:42:35 - Tina Marie (profitdriversinc.com)\nYeah. And you are human.\n00:42:39 - Chona Sweet ( wspainclinic)\nYou are going through real things. are the way those are. It's not even hard. The lean notes are hard. So those are just quick telemedicine. Nothing really changed. I just need to. Some of them, I need to pre pre filled in our credit prescription for three months, which is like a lot of clicking, but that's not really hard. Oh, I think I'm just putting it off because I don't know. You what I didn't do today is I was overwhelmed.\n00:43:07 - Tina Marie (profitdriversinc.com)\noh, it's too much and I can't I gamify myself. So I'll be like, OK, I'm just down. And I commit to do two right now.\n00:43:14 - Chona Sweet ( wspainclinic)\nBut you know what happens?\n00:43:15 - Tina Marie (profitdriversinc.com)\nAs soon as I sit down, I get in work mode. And like, I could do a few more. I could do. Oh, I'm done. OK, yay.\n00:43:22 - Chona Sweet ( wspainclinic)\nLet's go play. Like going in early today, I was in the evening last night and I came in the morning to put it like, oh, you're early today. Like, yes, I know. That is what I wanted anyways to start there early and then come home. I was literally in and out. I mean, left the house, come back in two hours. I was done. And the charts, I already pre charted. I just there's just a section I need to put it last night. So I just need to input what happened today.\n00:43:58 - Tina Marie (profitdriversinc.com)\nYes.\n00:43:59 - Chona Sweet ( wspainclinic)\nSo I. It will be done. I'm it will be done. I know you have to. Yeah, we're good. I think we're good.\n00:44:06 - Tina Marie (profitdriversinc.com)\nYou are good. You just need to remember that. And really, like I just want you to do a mental tick box of like, okay, what happened this week that we didn't even have last week and just, you know, and then if a week isn't far enough to look back to feel good, then look a little what's it going to look like at the end of the year? If I just boss up and do this stuff and then you see that money, you see those bags, you see the competition, like really visualize what that looks like, what it feels like and borrow the energy from the future.\n00:44:47 - Chona Sweet ( wspainclinic)\nKeep that again, borrow the energy from the future.\n00:44:52 - Tina Marie (profitdriversinc.com)\nOkay, so this is the thing when we worry, we borrow pain from the future that probably isn't. even going to happen. We make real pain for ourselves now when we worry about potential future pain. But when we hope and we visualize that thing that we're creating and going to do, we borrow energy from that reality that we haven't created yet, making it more likely for us to create that thing. But finding joy right now in the visualization, we're borrowing joy from the future that we haven't even created yet.\n00:45:33 - Chona Sweet ( wspainclinic)\nI like that instead of positive energy, instead of negative energy from the future worrying something, just think of the possibilities basically.\n00:45:46 - Tina Marie (profitdriversinc.com)\nYes, and here's the other thing, possibilities turn into probabilities when you're doing the work that you're doing. It's not just possible, it's probable that you will fall at least within the realm of the vicinity that you have hit. In your mind, you'll be very close to it and you'll be happy.\n00:46:04 - Chona Sweet ( wspainclinic)\nYeah, borrow the happiness now.\n00:46:07 - Tina Marie (profitdriversinc.com)\nLike that has literally been how I've gotten through all the things in my life. I only told you like this much of the things that I've been through and those were from infancy. Oh, my mom beat me from infancy. Like it was crazy. But just thinking about what I was creating, I got at 13 by a family member. So many other things. many things.\n00:46:32 - Chona Sweet ( wspainclinic)\nYou're very alive. And for you to see how strong you are, like, you know, just, you know, that's amazing.\n00:46:45 - Tina Marie (profitdriversinc.com)\nBut makes me more full of love. Yeah, that is good. But it also makes me more of a, I just want to protect everybody, but I also know I can't protect everybody. And that I don't have to. do because if I can get through what I got through, I have to trust that these are also God's children and that he has a plan for them. So when I know I'm supposed to do something do it and when I feel like I'm supposed to just let things happen, I can have some peace about letting hard things happen and knowing that I'm not the only one who'll help, you know. But barring, barring energy from the future, barring hope from the future, oh my gosh, that got super powered me. Like I stay grounded in the here and now, but I also have a toe in the future of all that I'm creating and I get there faster the more that I practice it. So like you're on track, look at where you've grown from here and even just some four, maybe four weeks ago, five, six weeks ago, somewhere around there, because time has been flying.\n00:47:54 - Chona Sweet ( wspainclinic)\nOh my gosh, yes.\n00:47:56 - Tina Marie (profitdriversinc.com)\nYeah, you're like, I don't even know if I want to do this. now you're like I got it.\n00:48:03 - Chona Sweet ( wspainclinic)\nI think Mark also thinks that who he um refer me to he thought that they will give me more but the sweet James so far you know again I just wanted to really foster that because obviously they're the most that are giving us right now but I'm sure eventually I'm gonna meet more and it's gonna be good. Yeah yeah I definitely look forward because I know that I can when we were in Japan with the time change and I was able to make it work so I knew then that I'll be able to make this work because and while traveling too that's you know that's amazing.\n00:48:39 - Tina Marie (profitdriversinc.com)\nSo um when are you guys doing preference?\n00:48:43 - Chona Sweet ( wspainclinic)\nTomorrow. Oh my gosh okay so yeah so when um so I'm looking at the time Paris time is like 9 p.m. around this time so for next we are thinking of next week you want to I definitely want to continue with you but\n00:49:00 - Tina Marie (profitdriversinc.com)\nI just don't know the time, so yeah, let's how about we wait until Monday and see what a rhythm has been like okay The other thing was I was gonna see if we could move this when you're normal time a forward half an hour. I don't What time?\n00:49:18 - Chona Sweet ( wspainclinic)\n130 and stuff. Yeah.\n00:49:20 - Tina Marie (profitdriversinc.com)\nOh good. Okay 30 would be In Paris, so I guess we'll cut touch base basically It doesn't have to be for next week next week we can figure out and it could be another day Okay We'll we'll out what works But why don't you get settled for a few days first and kind of see like how you're feeling because I have a lot of flexibility On a you know one off kind of time.\n00:49:46 - Chona Sweet ( wspainclinic)\nOkay.\n00:49:47 - Tina Marie (profitdriversinc.com)\nUm, I think that that would probably work better.\n00:49:50 - Chona Sweet ( wspainclinic)\nOkay And that way you can maybe just be present and make sure you're taking care of mark and that his mom What's his mom's name?\n00:49:58 - Tina Marie (profitdriversinc.com)\nAnd Jeanette Jeanette Making sure that Jeanette is having an amazing time.\n00:50:02 - Chona Sweet ( wspainclinic)\nYeah, we're gonna have dinner at Joel's Wern.\n00:50:05 - Tina Marie (profitdriversinc.com)\nthink Mark set up on her birthday, the 13th. Wow.\n00:50:09 - Chona Sweet ( wspainclinic)\nSo it will be my second time. I think it's his mom's second time too. It's my mom's first. My mom will lose her mind. Good. My mom is just happy to be always invited, you know?\n00:50:20 - Tina Marie (profitdriversinc.com)\nYes, that's amazing.\n00:50:23 - Chona Sweet ( wspainclinic)\nChona, I just think about all the good things.\n00:50:26 - Tina Marie (profitdriversinc.com)\nyeah, it's amazing. I, yeah, I'm a big fan.\n00:50:31 - Chona Sweet ( wspainclinic)\nyou so much. We'll talk soon.\n00:50:33 - Tina Marie (profitdriversinc.com)\nOkay, bye.\n","contentPreview":"00:00:07 - Chona Sweet ( wspainclinic)\nHi, hi, how are you?\n00:00:11 - Tina Marie (profitdriversinc.com)\nIt's been a lot.\n00:00:19 - Chona Sweet ( wspainclinic)\nI worked, I went to the hospital alread...","processedAt":"2025-05-04T03:40:52.512Z"}