{"fileName":"Transcript for Chona(5).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Chona(5).txt","type":"transcript","priority":"medium","content":"00:00:01 - Chona Sweet\nHi. Can't hear you. You're muted. Yeah. are you? Good. Good. Just sweetest got home.\n00:00:15 - Tina Marie (profitdriversinc.com)\nLong day.\n00:00:17 - Chona Sweet\nIt's okay. But yeah.\n00:00:21 - Tina Marie (profitdriversinc.com)\nWell, how has this been gone so far?\n00:00:24 - Chona Sweet\nI mean, it's getting a little better. I still feel sometimes I. Overwhelmed, but. And I. To be honest, I have a lot of charting.\n00:00:42 - Tina Marie (profitdriversinc.com)\nBecause you just have a lot of calls or because you're behind and not doing it.\n00:00:46 - Chona Sweet\nBehind and doing it.\n00:00:50 - Tina Marie (profitdriversinc.com)\nSo why is that? How much, how far behind are you, do you think? these wise.\n00:01:03 - Chona Sweet\nI have I'm looking at it right now. have 80 notes.\n00:01:07 - Tina Marie (profitdriversinc.com)\nNot including, huh? Go ahead.\n00:01:12 - Chona Sweet\nNot including maybe I have to say not including today. Like maybe close to 99 total. No. Yeah, 99 total. And the hospital. I just got home.\n00:01:43 - Tina Marie (profitdriversinc.com)\nSo I haven't charted the hospital. When did you get started?\n00:01:46 - Chona Sweet\nhospital. was unable to do. I was able to chart every day. Like that one. I was able to do that every time. was And the lean patient that comes from me, I mean from my sources, from me, I was able to do that.\n00:02:13 - Tina Marie (profitdriversinc.com)\nSo when you say you were able to, does that mean you're not able to when you work at the clinic?\n00:02:20 - Chona Sweet\nI guess what I want to say is I feel more motivated to finish the charting on the hospitals and ones that I really don't like, there's a lot of work on the heart charting in the hospitals. I mean, I'm sorry on the clinic and I don't, I don't really want to do it. That's really what it is. I really don't, I was able to do what I need to do in terms of, in terms of, like I prescribed their medications, but I wasn't able to to finish the note. But I feel like the main job that I need to do, I was able to do that, I guess that that makes sense. But the note I know is part of it, but I just been I've just been not doing, not keeping up maybe that's the time. The telemedicine is easy notes. Yesterday's telemedicine, I did it exactly at the same time as I was doing it. Today, I sleep in, so I was only able to call all my telemedicine, but I haven't started the note. I plan to do it tonight after dinner.\n00:03:51 - Tina Marie (profitdriversinc.com)\nSo what time did you get started working today?\n00:03:53 - Chona Sweet\nI started working at 1.30 today.\n00:03:58 - Tina Marie (profitdriversinc.com)\nWhat happened to the conversation? Last week about wanting to make a million dollars a year and the only way you're going to get started in morning.\n00:04:06 - Chona Sweet\nI started the morning yesterday.\n00:04:09 - Tina Marie (profitdriversinc.com)\nWhat time?\n00:04:10 - Chona Sweet\nUm, I started at 10. Well, no, I started working the moment I woke up I mean, yes, wait, what is today?\n00:04:19 - Tina Marie (profitdriversinc.com)\nToday's Thursday.\n00:04:19 - Chona Sweet\nUm, you see, when I woke up, usually would call my telemedicine and then I would go to the hospital. Today, that's not, I just sleep in. I just feel tired.\n00:04:36 - Tina Marie (profitdriversinc.com)\nSo I gave in and. You feel like you're burnt out?\n00:04:39 - Chona Sweet\nYeah.\n00:04:41 - Tina Marie (profitdriversinc.com)\nSo, um, is, is the clinic something that has to be done? Like is in order for you to have this arrangement with Dr. E towards building the.\n00:04:54 - Chona Sweet\nI think it's my help right now because of the rolling in of. the patients, the thousands that are coming in, and apparently we're just gracing that just the top and, you know, all of us are, you know, the other end piece we would talk to each other to just say hi and they said that they're also feeling overwhelmed because everyone has new patients and they double book because some patients don't show up, some show, you know, so it's like, for example, on Tuesday I have a schedule of 13, I think, in the afternoon, or I forgot 20, and then only more than half was seen, but because it's new, it's just a lot. So that's what I've been doing now so that it will be easier for me to chart later on is I Started pre charting, but correctly while I'm with the patient So, you know, that's that's what I've been doing versus a chicken scratch of Pain in low back like this and that you know, just one word two words. I don't do that now Oh, I you tell me you started that like a week or two ago though but No, I well I started probably a week ago, I feel like I I'm not consistent in terms of Doing that, but because if I feel like I'm already I feel I'm feeling overwhelmed and then I just start doing the words But now I've been like really doing it every patient that was that way when I taught it's faster when I finish it It's faster when you say now you're doing it consistently as of what day did you start doing it consistently oh I guess yet last week Monday true because I only have clinic Monday Tuesday And then the rest is sporadic Depending if I have lean patients Your charts how far are the oldest one go back One and a half weeks Um, it's not telemedicine. I'm on top of my telemedicine notes, but it's the it's the clinic new new patients. I'm It's like I'm dreading it like I'm dragging my feet and doing it because I It's just more work because I I just feel like And also there's a part of me sometimes that questions You know, it's just it's just worth it. It would come up because I feel like I have eight hours' worth of work for what? And I, comparison to what I used to work with my old job, that I only worked three and a half hours and I get paid the same exact thing. And so there's a part of me that, yeah, I'm trying to look past this. I'm looking past this and I'm trying to look at the potential, the earning potential, because of the lean patients, lean lean cases. I'm not seeing that yet.\n00:08:31 - Tina Marie (profitdriversinc.com)\nIt's slowly coming in, but it's... lean patients will come through the clinic? Will the lean patients come through the clinic? Yeah. I'm trying to get at is, is handling his clinic patients required to build the lean version of the business? Not required.\n00:08:52 - Chona Sweet\nIt's just, I think, like...\n00:08:54 - Tina Marie (profitdriversinc.com)\nHere's what we have to really get to. So... you're having this internal wrestle and Eventually a decision is going to be made for you if you get so behind your stress levels is gonna make the decision Then you're gonna walk away Because it's too much and it's overwhelming or dr. E's gonna say don't do this anymore because you're not getting the charting done And this needs even though they're overwhelmed So I don't know where that's gonna happen at some point it breaks it either gets fixed or it breaks, right?\n00:09:28 - Chona Sweet\nI think It's not required if the answer your question is not required however Because the lean clinics maybe that's the term the lean clinics is not full running I Don't have a reason to say hey I cannot do your clinic patients now because I'm focusing on the lean we're not there yet I don't know how long look you take so okay, but\n00:10:00 - Tina Marie (profitdriversinc.com)\nOh, hold on a second and I need you to bear with me because I have a very analytical brain and I'm also very tenacious. I go after things. If there's a problem, I'm working to solve it because it's the only reason I'm here, right? So, week after week, it's been... You've got lots going on. Remember, you've got to take all this into account. There's a lot of learning, but now we're getting into where we're having the same conversation on repeat. And just so you know, I have a few cardinal rules. One of them is I don't have the same conversation on repeat without it making progress because I cost too much money to not make progress. And if that's happening, it's either that I'm not a good fit and a good batch for you, or you're not where you should be, so you're out of sync with your own self. I don't know that that's the case. But I need you to understand that that's the way that I look at things and that's the way that I process them. Okay, so I don't just care about the business. I don't just care about the money. I can't help but care about the person that I'm working with. So seeing you, you're you're having a dilemma that needs to be solved, but you are the only one who can solve it. And until you get bought into what you really want to do, you're not going to do it. And if you're not going to do it, there is no point in me showing up every week. Does that make sense? Right. So a few of the things are, for example, in terms of consistency. Now, I understand that charting is frustrating and difficult, but here's a few other things. asked you to report wins each day, just a win every day for the week and that doesn't get done.\n00:12:00 - Chona Sweet\non.\n00:12:02 - Tina Marie (profitdriversinc.com)\nSo let's see, hold on there or something else. Where's my Oh, so three weeks ago, I asked for and I asked for it multiple times, but I division of like what Cheryl does versus what you do, just kind of visualize I even started it graphically wrote it out for you. So there's some resistance that is happening. And I want to see if there's any way that I can help you with it. Without piling on, because it's very easy for everything to feel like piling on, like I can do stress. I can feel your overwhelm, I can feel your frustration, but also there's the mom in me that wants to make everything better. There's like I've got all these rolled tona, they come out and this doesn't mean I'm right.\n00:12:54 - Chona Sweet\nIt's just the way that I work. That's all I'm saying. Right. And I change it.\n00:12:58 - Tina Marie (profitdriversinc.com)\nI know. Hold on. I want to, I got\n00:13:00 - Chona Sweet\nget all the way through this.\n00:13:01 - Tina Marie (profitdriversinc.com)\nSo 99 charts to be behind on that, there comes a point where that you can't that can't not be taking up mental space and that cannot not be getting heavier. It has to start getting heavier and heavier. And so there is either an implosion or an explosion that's about to happen at some point. Now I don't know you, you might be somebody who can just like buckle down, sit down for the weekend and knock everything out.\n00:13:31 - Chona Sweet\nyou that person? Yes.\n00:13:35 - Tina Marie (profitdriversinc.com)\nWait, I just saw Mark shake his head.\n00:13:38 - Chona Sweet\nBut I am that person though. I, I, I passionate and I'm not consistent. Those are my, I know my biggest weakness. But when I sit down and buckle down, like I would be awake for three AM, four AM sending emails to the point that they asked me to like, do you sleep? but in at night or because they see my emails at 3 a.m. 4 a.m.\n00:14:05 - Tina Marie (profitdriversinc.com)\nbecause I need to send an email saying oh please get an authorization for epidural for this patient so I need to send each time so they can see that but I just feel I'm still in the overwhelmed stage and when I get overwhelmed I question if this is worth it and I start comparing what I when I used to do what I used to make before this is the problem you can't get out of overwhelm if you don't show up consistently and what you're saying is you're on an infinite loop of you're not going to show up consistently and still it it makes more sense to you but if you're looking if you're doing that math now here's the thing there's two math equations that we talked about the one is what you're making now versus what you made and then the other one is what is the potential if you see this thing through you have to decide which math you want to look at.\n00:15:01 - Chona Sweet\nRight? Because both are true. It's just some matter of what I mean.\n00:15:07 - Tina Marie (profitdriversinc.com)\nWell, well, one is potential true and one is current truth. I need to know like, are you have you decided your and now here's the other thing is you've got some room to change things just because you feel obligated to work in the clinic right now. According to what you said, that's not you need to work in the clinic enough to understand it and know how to handle the lean patients inside of his face. But you've already gotten to that point. So what would happen if you said, okay, I'll do five five patients in the clinic a day, everything else you have to handle and that make sure I stay fresh that I stay in here. But to be honest, that's not what I'm here for. I'm happy to help out in this way or that way, whatever thing you're actually willing to help out. But Jonah, if you're if you're going to build a business and if you're going to lead and create, make the rules that work for you. But what you can't do is agree to rules and then not keep them. Right. That will ruin everything even internally for yourself.\n00:16:18 - Chona Sweet\nI think if I really want to, I would. I know if you really want to, sorry. I think there's resistance within me because I don't really like the clinic work. But I know that it actually is important in building my clinic muscle, if that makes sense. Yeah. the clinic muscle is what also would help me with the lean patients in terms of recognizing, oh, this is where I'm hurting. Just the symptoms. But although even though I already know because it's just a matter of a few procedures, it still helps because the hospital patients and the clinic patients are totally different. Right. the clinic patients is comparable to the lean patients.\n00:17:17 - Tina Marie (profitdriversinc.com)\nYes, I get that.\n00:17:19 - Chona Sweet\nThat's why it makes sense for me to do this.\n00:17:24 - Tina Marie (profitdriversinc.com)\nIt's just that. Are the lean patients going to be as much work charting?\n00:17:30 - Chona Sweet\nI mean, it isn't. It isn't because it is because I'm still new on it and I'm still trying to learn the lean type of charting. It's different from how we chart. This is where Mark comes in. This is where Dr. and I'm learning through the Zoom meeting every so often on how to chart correctly. And the resistance also is Dr. E. It's Dr. signing that lean patient notes and he's a little bit resistant on how Mark thinks and how it should be done because it's different from how we do our notes for patients where we're under scrutiny and their insurance.\n00:18:20 - Tina Marie (profitdriversinc.com)\nHow you deal with that? How does that stress you out?\n00:18:25 - Chona Sweet\nI talked to Mark about it and again because I'm in the learning stage I feel I don't feel too confident to say to stand up for it but I'm still I'm still in the learning stage it's very early like Dr. E would ask me why don't we put this why because I really don't know how to answer the question I know but I don't feel confident to tell him like why are we doing And for right now, I'm just saying because this is how the rest of the PI doctors are doing it And this is what attorneys look for, but I feel like it's not enough. He hasn't bought into it yet. He's I think he's What's the right term, He's He's not fully bought in though.\n00:19:19 - mark sweet (sweetlaw.com)\nI don't think that honey like we're up to him to make changes and then we're not necessarily telling him why behind it There's some things that he understands why we're changing things like In a record, there's a subjective section and that's where most of the writing occurs Then there's a symptomology section where they're going through different tests, that's how they figure out what kind of pain Then there's a feeling portion and then there's a plan portion of pay.\n00:19:46 - Tina Marie (profitdriversinc.com)\nThis is what we're gonna do, right?-hmm.\n00:19:48 - Chona Sweet\nThat's good that right honey like yeah for a four sections subjective what the patient says Also, yeah soap note so and he and he that's not how we charge right now with her patient. So in his mind, the way he thinks is if I get called in court of this patient that you saw, because he did in the past, you know, he's been called in, what's that term litigation?\n00:20:14 - mark sweet (sweetlaw.com)\nHe's been deposed.\n00:20:15 - Chona Sweet\nHe's been deposed. So the way he answered the question is, well, this is, I'm not doing this just for the lean patients, I'm doing this is the same thing I do with the rest of my patients who's being under insurance. So that's, in his mind, it's easier to I guess defend what he does because that's.\n00:20:34 - Tina Marie (profitdriversinc.com)\nBut he's got liability for your main patients?\n00:20:37 - mark sweet (sweetlaw.com)\nOr not? Yes, because no one's signing it. So I talked because he understands his notes are not the best. I mean, he readily understands that he has false and his notes. His biggest issue was I want to leave in the different tests that we're doing with the patient and what the results are, where Fuji or pandellas or any of the ones. I worked with don't put that part in it doesn't make or break a case the only time it's a problem is that the client says I don't remember doing any of these tests and they're in the report It's the only time it's a problem. He's very open-minded to changing his subjective section at the top Because he's just got a very old-school way of doing it, but just right. Oh, it's cool Yeah, hey, and it's not born out of anything Negative like he's not It's just he just writes down what someone says.\n00:21:28 - Tina Marie (profitdriversinc.com)\nOkay.\n00:21:28 - Chona Sweet\nOh, that's how we were trained.\n00:21:31 - Tina Marie (profitdriversinc.com)\nThat's how we were trained Yeah, but here we're taking a legal side of no, no, let's get them even less go through so they well Have you said anything you say can't and we'll be used against you or the court of law I mean it's that kind of premise right that if you have more than there's more to It's actually not a lot to he he doesn't really but he gets fixated on one thing That's not written there, but it's actually very small like for example on the third part on the\n00:22:00 - Chona Sweet\nassessment part. I'm sorry on the objective part. Old school note on objective, we do it by systems. General, meaning the patient is awake, alert, oriented. Respirations, patients, long sounds. We don't do that on the lean patients. I don't put the card, your card jack is the heart rhythm normal. Like I don't do that because we don't, I don't assess it because it's the, it's a lean patient. We're focused, like Dr. Fuji's note is on the Dr.\n00:22:34 - Tina Marie (profitdriversinc.com)\nFuji's note, he says focus physical exam.\n00:22:37 - Chona Sweet\nE wanted more than three systems. He wants psychiatry, skin, you know, like the old school.\n00:22:45 - Tina Marie (profitdriversinc.com)\nSo can you find examples of old school or more appropriately appear? So someone his age in this business that does it your way.\n00:23:01 - Chona Sweet\nYeah, we killed him. He showed him and he says is someone who's in the same area.\n00:23:07 - mark sweet (sweetlaw.com)\nYeah, roughly the same amount of practice who he's actually buy out and what he's doing. Here's the thing though. What Dr. E wants to add in doesn't make or break a case.\n00:23:18 - Chona Sweet\nIt doesn't.\n00:23:19 - Tina Marie (profitdriversinc.com)\nYeah. How much time does it take? What's the burden?\n00:23:21 - mark sweet (sweetlaw.com)\nWhat's the issue? Not massive.\n00:23:24 - Chona Sweet\nI'm asking Jonah because it's not a lot. Right now what I've been doing for lean patients is just the general appearance of a patient, a neck and a musculoskeletal back. I could add psych. could add skin. Then that's it.\n00:23:44 - Tina Marie (profitdriversinc.com)\nYou know, in two minutes, tell me why you're doing any of this.\n00:23:51 - Chona Sweet\nWhy am I doing the lean?\n00:23:56 - Tina Marie (profitdriversinc.com)\nYes, all this work with Dr. E in two minutes.\n00:23:59 - Chona Sweet\nI'm sorry. which one like all of it or yeah any of it like why do you show up to work every day I show up to work every day because I have to and I have I have to and I want to do the let work in the especially in the hospital I really do hold on a second hold on a second so I need you to tell me but I also need it to be true do you have to I feel like no one will be no one will be able to replace me to see those patients or I guess they can I guess they can replace me but I don't know I mean as much as I'd love to say I'm irreplaceable it might take four people to do my job but I'm not irreplaceable I don't think yeah they're right but we need to be real about the language because here's the thing if you don't tell the whole trip your brain is gonna find a loophole and it's going to tug at that\n00:25:00 - Tina Marie (profitdriversinc.com)\nand take you off track. So 100% all true, why do you show up to work every day?\n00:25:07 - Chona Sweet\nI need to work.\n00:25:08 - Tina Marie (profitdriversinc.com)\nI need to make money. No. Do you need to?\n00:25:13 - Chona Sweet\nI need to.\n00:25:14 - Tina Marie (profitdriversinc.com)\nWhat will happen if you don't?\n00:25:17 - Chona Sweet\nI mean, and then I won't have money. I am going to rely on Mark, which I don't like that.\n00:25:25 - Tina Marie (profitdriversinc.com)\nSo you feel compelled to because the feeling of relying on Mark doesn't feel good, but the truth is you don't need to and your brain knows that. Probably that's why there's no probably about your brain knows you don't have to, which makes you feel like you've got room to make choices and the choice can be, well, I'm going to do it this way and whatever happens happens. They don't have to. That's what's happening every day.\n00:25:59 - Chona Sweet\nThat's what the wrestle is right don't have to and no matter how you phrase it the powerful chona inside knows you don't have to right so that can't be if you tell yourself that story you're wasting time and you're lying to yourself and you're setting yourself up for failure so something happens the other day and i just want to say it and then you tell me then then why because dr e was in the hospital yesterday for a he did a procedure for one of our patient and then he asked me he called me i did the procedure for the patient do you want me to rounds on the patient because i'm already here that's what he says but then you know it's up to you whatever you want to do because he's that kind of doctor he's fine he's i'm here do you want me round down many patients do we have and then i said oh we only have i believe 17 or 18 then i told him no i no it's okay i'll i'll\n00:27:00 - Tina Marie (profitdriversinc.com)\nround.\n00:27:01 - Chona Sweet\nSo what does that tell you?\n00:27:04 - Tina Marie (profitdriversinc.com)\nI am, you know, because maybe I'm not eating it because I want to see my patients. You like the hospital though?\n00:27:11 - Chona Sweet\nI do. That's different.\n00:27:13 - Tina Marie (profitdriversinc.com)\nBut that's not the issue. Here's, here's the thing is where you're not showing up. That's the only issue. But you have to show up. Like you either need to be all in or get out because you're talking about building a business. And even if you were an employee, if I have somebody that was that far behind after a week and a half out of fire done, I didn't care what helped their giving me. I need to know that they're going to show up consistently. Now that's my particular baseline. That's not everybody's I hire differently, I train differently, I fire differently. It's just, but business has to be nuanced and it has to match the person, the visionary. You do have a very specific clear vision. But as we said, you're building in somebody else's house. Okay, you have to take that into account and you have to decide are you going to make your own? Which can mean I will do five clinic patients a day no more so that I do get familiar with it But because they are slightly different than lean patients because I only going to take notes this particular way when they're Lean patients and also because I just don't like it and you have the freedom to be truthful about it What's he going to say no I don't want the lean patient money? No, I don't want you to help me with at least five patients Which is 25 patients a week? Why would anybody say that? Do you know what I mean?\n00:28:38 - Chona Sweet\nRight?\n00:28:38 - Tina Marie (profitdriversinc.com)\njust feel like we're not I think what here's what I do here. Chona. I think that you can take more power Actively rather than possibly you're taking the power by not doing your work. That's possibly And actively you can take the power by saying I don't like this may sound bad, but that's the reality. love the hospital patients. Great. Some people probably don't like any of the patients. You should be happy about that. You are going to do some helping with the clinic patients and you're going to bring in lean business, which is going to help him have an entirely new income stream that wasn't available. That is sufficient. That is enough value. You live in a world where, first of all, as a woman and then also as a minority, but especially the women in your culture even, you're taught to take care of everything and to do the job and to be happy about it and to smile while we're doing it. But Feisty Chona is inside of there too and she's like, I don't like it. I don't want to do it. And Mark is nice. He can't care of myself. There's all these things going on. Chona, you're not- bad, or mean, or angry, or a , because that's what people like to call you, not you per se, but women, when they act the way that they want to act, you're not doing anything wrong. If you say, don't like this, it's burning me out. I may not even get to growing the lean business if you just crash and burn. So how about we put some guardrails on this, and we say, I'll do five, maybe 10 lean patients a day, 50 max, and I will do my charting day of, and I will agree to that. And I catch up, catch up this weekend, and just put the walls on it that actually works so that you can't get burned out. And then if you're still getting burnt out after that, you really need to have a heart to heart with yourself about what you're doing.\n00:30:48 - Chona Sweet\nSo, right, that makes sense on the five patients a day, because I feel like right now, that's what I have, but I compacted. Monday, Tuesday, which gives me more free time on Wednesday, Thursdays, and Fridays to put in and also it's hard. I feel like I cannot Go fully tell him that oh, I'm just gonna do the lean because that we don't have a Lot of lean patients yet.\n00:31:23 - Tina Marie (profitdriversinc.com)\nWell, okay, pause pause again This is an issue with you feeling like you owe him something or you're gonna please him or something. Hold on Let me see this all the way through You're building a business the business not there. That doesn't mean like, you know, if you let's say you open up a store and you're like well I'm not gonna I don't know what it is, but let's say you just open up a practice and it's a doctor's practice And you're there But like I'm not gonna be here because there's no people you're gonna stay there and and do the job You do what's there the lean business is the perfect reason that you're that If that didn't exist, would you even be doing any business with Dr. E if that wasn't a potential?\n00:32:05 - Chona Sweet\nNo, I wouldn't.\n00:32:07 - Tina Marie (profitdriversinc.com)\nOkay, so your logic doesn't really make sense and because to me that's like guilt and you feel compelled like you're supposed to do something to please somebody else.\n00:32:21 - Chona Sweet\nHe did verbalize it to me to mark that yeah, that he needs help with the clinic.\n00:32:29 - Tina Marie (profitdriversinc.com)\nOh, he can hurt people. How is that your problem? Now you guys, you can fix me.\n00:32:35 - Chona Sweet\nI'm coming at it.\n00:32:36 - Tina Marie (profitdriversinc.com)\nThis is this is what I do. If I'm wrong, tell me I'm wrong.\n00:32:40 - mark sweet (sweetlaw.com)\nI mean, there's some good news in all this because I talked to Dr. E was yesterday because he's bringing on two more hospitals. He understands children prefer his hospital over clinic practice that this is not a surprise to him because she does. She really enjoys the hospital setting and they probably like her if she likes it then. Dr. He's one of the guys where it's just yeah, whatever like he's.\n00:33:03 - Tina Marie (profitdriversinc.com)\nNo, I mean the patient.\n00:33:04 - mark sweet (sweetlaw.com)\nSo Are you kidding me like they love her right? Okay, so keep going sounds good be I mean The goal is to get her to be primarily hospital link right this right Maybe one day a week because five a day wouldn't make her run around more where it would be efficient got it week And clinic would make more sense. Okay, you can see everyone a single day and use the clinic because I grew it You got to be used to clinic. You're gonna do lean treatment. I Put this is like when I started my firm like you kind of got to go through You don't necessarily like to reach the brass ring that you're going for it's short-term pain for long-term payoff But he definitely is drowning in the clinic But that being said he will take whatever lifeboat he can get at the moment Because he just needs whatever helping you get but it's still his boat chona.\n00:33:59 - Chona Sweet\nThis is what I need you same.\n00:34:01 - Tina Marie (profitdriversinc.com)\nIt's his vote to manage. So if you want to help, help under your terms in a way that does not burn you out, but then let him handle the rest of it and be a grown- man. don't mean it disrespectfully to Dr. E. I'm using hard language because I need it to be very clear because your language, you dodge things a little bit and it's not to your benefit. I'm trying to, this is not just you by the way.\n00:34:35 - Chona Sweet\nYes, yes.\n00:34:36 - Tina Marie (profitdriversinc.com)\nOther people do this. We do this. want to be peacemakers and find the thing and sometimes the truth is uncomfortable. But you have so much power in you and it's, I definitely feel, I'm sorry, it's okay.\n00:34:54 - Chona Sweet\nI definitely feel not confident and not comfortable with my lean. notes and it's frustrating to um rely on mark to correct it.\n00:35:08 - Tina Marie (profitdriversinc.com)\nDo you remember the driving analogy?\n00:35:10 - Chona Sweet\nYes.\n00:35:11 - Tina Marie (profitdriversinc.com)\nYou're not going to get comfortable until you have a certain amount of experience under your belt and you have to either be okay with that or let it ruin you.\n00:35:21 - Chona Sweet\nAnd also like I have a lot of question because I'm seeing the patients. I'm writing the preliminary notes but Dr. E is signing it and then I ask Mark about this. Like should we write something in the bottom saying initially seen by nurse practitioner? I don't know.\n00:35:39 - Tina Marie (profitdriversinc.com)\nLike should I ask the questions? Are you are you do you have access to ask the questions?\n00:35:46 - Chona Sweet\nLike if you have a question can you ask Mark can you ask anybody that you need to? Yeah no I asked him he said no I don't need to I don't know Dr. E just accept whatever I do and I don't want him been trouble. I don't want us to be in trouble because it's it's it's all Dr. East, but he's not seeing the patient I am. So can you handle emotional discomfort very well? Not very well.\n00:36:14 - Tina Marie (profitdriversinc.com)\nDo you want to be able to handle emotional discomfort?\n00:36:21 - Chona Sweet\nI feel like I do, but not probably. I feel like that's a very well.\n00:36:29 - Tina Marie (profitdriversinc.com)\nWhat do you want to have emotional discomfort? means when it comes, do you want to be able to handle it and work through it so it doesn't dominate you?\n00:36:37 - Chona Sweet\nYes, of course.\n00:36:39 - Tina Marie (profitdriversinc.com)\nYes. Okay. The only way to get there? That's a muscle. That muscle, you know how hypertrophy works, right? Tear, heal, grow. It's hypertrophy that you need to have happening in you on an emotional level. This is uncomfortable. It's going stay uncomfortable, the only way to get comfortable is to continue to do it. And to do it consistently, it will happen fastest with the most consistency. And I will say in addressing the issue, so if you get an unsatisfactory answer, you need to push for more specificity. So if you can't get it from go to mark, and then you remind us to look, you guys, we're in business. I'm the one that has to do this thing, and I, I'm not going to do it. If I don't feel confident that I'm doing it right, my brain doesn't work that way. I will stress myself out to death if I can't feel confident in it. So maybe there's some level of discomfort I have to deal with, but at the very least, you can give me an accurate, clear answer, and I don't care. Nobody gets to give you and I don't care.\n00:37:57 - Chona Sweet\nYeah, I definitely. It's the amount of confidence Dr. E is putting on me, it is, you know, it's definitely scary because I would do the notes. Do you care about your job? Yes.\n00:38:18 - Tina Marie (profitdriversinc.com)\nYou try really hard.\n00:38:20 - Chona Sweet\nNot hard enough, baby.\n00:38:22 - Tina Marie (profitdriversinc.com)\nhow it asks you. I said do you try really hard?\n00:38:25 - Chona Sweet\nI think I try hard.\n00:38:26 - Tina Marie (profitdriversinc.com)\nDo you know anybody that does any job perfectly?\n00:38:29 - Chona Sweet\nNo.\n00:38:33 - Tina Marie (profitdriversinc.com)\nSo, are you holding yourself to unrealistic expectations?\n00:38:40 - Chona Sweet\nNot sure.\n00:38:45 - Tina Marie (profitdriversinc.com)\nThere's a few things that we have to work here. The biggest thing, this is a loop. We're caught in a loop right now. This is your lack of confidence and your first with the finances and because you're comparing apples to right now, the other job you had and how much it made versus this job plus the potential with also you like the hospital work but not the clinic work. So you've got all these things and those things are causing you to not show up. You not showing up is causing you to not get good at the things which will give you confidence. The only way through this is for you to make a firm decision period and then show up regardless of what it feels like. Do you have the ability to force yourself to do that and if the answer is yes the things have to change first. Do you have the fortitude to make the changes even if you feel uncomfortable by leaving him hanging because he needs more help.\n00:40:06 - Chona Sweet\nYes, the answer is yes. I can do that.\n00:40:10 - Tina Marie (profitdriversinc.com)\nOkay.\n00:40:11 - Chona Sweet\nIn your words then, what can you Um, well, I wanted to do continue the hospital to telemedicine and limit the time.\n00:40:33 - Tina Marie (profitdriversinc.com)\nSo, like one day a week, like Mark was saying, so you're not driving there so often.\n00:40:37 - Chona Sweet\nRight now it's two days a week, right now it's Monday, Tuesday.\n00:40:40 - Tina Marie (profitdriversinc.com)\nWell, cutting it down just Monday helped you out. Make a difference.\n00:40:45 - Chona Sweet\nI think it will. I will have to tell him about it.\n00:40:51 - Tina Marie (profitdriversinc.com)\nSo I'm going teach you about energy sandwiches.\n00:40:53 - Chona Sweet\nBecause right now they, they schedule a way in advance.\n00:41:00 - Tina Marie (profitdriversinc.com)\nSo, you're going to have to get through that, but I'm going to tell you this really quick for your difficult conversation, okay? Before you have to go do something that really, really, really sucks, do something that you really, really like in kimbooster energy, could be your favorite song, if there's a song that comes on and you can't wiggle, there's like a billion of those for me, put that on. If it's eating something, if it's going outside, if it snuggles, it does not matter what it is. If there is something that fills you up and makes you feel good, do that first, and then plan for something good, also like it, especially if it's physical. Physical activities are very good for helping to get stress out of the body, a workout, but any good physical activity of a husband, I'll let you be creative. I'm just telling you, it's important to understand the ways to manage stress and difficult things. When you're growing through difficult periods and you have to do uncomfortable things, it's really important to be conscious about what you're doing before. or after because you can help yourself get through those things without residual stress, which helps prevent or alleviate existing burnout. You're already burnt out. This is a danger zone. I do everything I can in all of my stuff to prevent burnout. All of the systems that I create, all of the processes I create are to prevent burnout because once it happens, and businesses crash, people quit, relationships go to crap, all kinds of bad things happen. Burnout is really dangerous on a physical level, on a stress level. It keeps psychiatrists and psychologists in business. It's a big thing and you're here right now. So the only way to get this is to power through it. But there are tools that you can give to kind of stack the depth for you. And it's just being conscious of the things that physically in a moment can Boost your energy like without fail. It might be sabotage to go eat cheesecake before you go have a difficult conversation But if that conversation is life-altering and it's gonna change the course of your career one cheesecake I'm gonna kill you. Don't tell my doctor. said that I have diabetes, but whatever. I Don't care I use tools. I use energy so sunshine when the Sun is out I am a bear in the winter. struggle so bad because I'm so affected by the weather today I napped for hours and I didn't want to because it was slushy like when when Whenever the weather's like that the black oak hurt and I don't even know it's bad and I still feel different Anyway, energy is really important and you have to manage it and it will help you mentally Be able to get over things you have to put things in the parameters that will work for you and Stop doing it because you feel like you have to do something you have a conversation with Mark like does it? to be like this. What happens if I do this? Not, will he be mad? Not will I not be helping enough? That that's not your job. Your job is to go bring in a new source of income. Inside of that, there are things that you need to know. You need to know how to work in his office. You need to know how to do the charting correctly for the liens because it's a legal issue versus just, you know, but if you know that you love the hospital and he's got patients that you can be helpful with air, if you know that you're understanding the clinic enough that as the lien patients come in, you're going to do a good job. And in the beginning, you can spend extra time with Mark, any other doctor that can help you out, make sure that you're covering everything right. Then you need to trust that over time, it's going to be like driving the car. All of these scary decisions that you have to mentally process are just going to be automatic.\n00:44:57 - Chona Sweet\nGreat.\n00:44:59 - Tina Marie (profitdriversinc.com)\nBut... But it starts with getting up, going to work, catching up on your part and not getting behind. If you have, you catch yourself getting behind, then have a threshold where like if I'm 20 behind, if I'm 30 behind, I don't go anywhere, I don't sleep in, don't anything until I've caught up. Like created, I don't know what the number is, I just were out of number, but you need to create that because here's what you need to remember is that if you get over a threshold, you will burn out. It just will happen. There will be a burnout threshold. You've already hit it. So keep all of those things in mind. And then the other thing I need you to know is that I think we were together good. really like it. But if I need you to do the assignments, so like sending me the wins, I'll tell you the reason that I ask for them is because of energy. want you to focus on something good at the end of today. I want to purposely shift your energy to something that you're happy about. Right. Just because I asked now, if you said, Tina, I don't want to do that, we wouldn't do it. You didn't. You just didn't do the work. And I'll give you an example. So I used to ask Mark to do a gratitude journal. And we talked about talked about and he didn't do it. And he's like, I don't really want to do that. That's not my thing. Like, okay, he's like, but this is what I am doing. I'm taking Dolce for a walk and we go for walks in the morning. And you know, so he came up with his own system that helps affect his energy that worked for him. So you don't need to follow anybody blindly. That is not going to be where you find the most joy or success. It's where you go, okay, I see the concept. I think for some value in that, but that system that you're coming up with, Tina, that doesn't work for me. How about we do this or how about I do that. Like I want you to drive. I'm here to facilitate not to drive. Does that make sense?\n00:47:08 - Chona Sweet\nRight. It does. I think I'm definitely not good and I tell Mark and I don't tell you. That's that's the difference. And I tell him like my wins. I was we were just talking when I was driving and I said this is what happened today. This patient said this and this to me. There's positive and negatives and I'm taking the positives. So I'm not good in telling you that but I do tell Mark. And I do like the sending voicemas. Sometimes though I get so I feel bad sending you late late at night.\n00:47:55 - Tina Marie (profitdriversinc.com)\ndon't know. No I put everything in.\n00:47:57 - Chona Sweet\nDo not disturb.\n00:47:57 - Tina Marie (profitdriversinc.com)\nYou can send me anything you want to. Anytime.\n00:48:00 - Chona Sweet\nOkay, because I, I'm sure there are those messages before that it was so late.\n00:48:07 - Tina Marie (profitdriversinc.com)\nNo, you've never thought of me.\n00:48:08 - Chona Sweet\nI'm surprised that you respond sometimes.\n00:48:11 - Tina Marie (profitdriversinc.com)\nUh, I have teenagers, so we sleep when we sleep. Also, I was born an insomniac. I'm not an insomniac. actually sleep really good, but I'm a, I wake up at night. can be exhausted all day for three days in a row. I can exercise. can do everything to wear myself out and be exhausted around 10 o'clock.\n00:48:31 - Chona Sweet\nMy body goes, let's go.\n00:48:33 - Tina Marie (profitdriversinc.com)\nSo that's annoying.\n00:48:34 - Chona Sweet\nYou, you mentioning that that actually is something I needed to say is ever since I start working there long ago now. Is it one and a half month, huh? I started September, but one and a half month, I wake up at three and four and I know when that happens, I'm stressed out. So I think, and then I try to sleep more.\n00:48:56 - Tina Marie (profitdriversinc.com)\ncan't, that's why I'm sleeping in. You know that that's when quarter\n00:49:00 - Chona Sweet\nAll peaks two to three o'clock in the morning.\n00:49:02 - Tina Marie (profitdriversinc.com)\nDid you also know that one of the biggest reasons that happens is late nine meals? I learned that recently.\n00:49:09 - Chona Sweet\nYeah, I've been eating bait because sometimes I would finish my charting 11, 30, 12.\n00:49:15 - Tina Marie (profitdriversinc.com)\nI actually forced myself to sleep. So one of the things that I learned is that if you just take like a 20-minute walk after whenever you eat, even if you're just walking in place and pacing around the house, I know that because I do that. It can offset that cortisol spike at two or three o'clock in the morning, which generally is combined with a potty break because the cortisol empties your bladder. I don't know if you know that but that happens a lot.\n00:49:42 - Chona Sweet\nSo that happens even when I fast. do fasting sometimes. do long fasting and that happens even with that. So I think you're right. It's just that I feel, I do that when I'm grieving Yeah\n00:50:00 - Tina Marie (profitdriversinc.com)\nBut I'm stressed out so it's I would back it back to energy management and stress management and knowing yourself and doing whatever just Do you do like do you know what actually it calms you and makes you peaceful? Is there anything that you know of that? I just do that.\n00:50:20 - Chona Sweet\nYeah, I just playing and by doing nothing Just doing this What are you doing when you're laying in bed, but I would read stories or I would do tik-tok just mindless And I want something funny. I want to laugh like I would When I when I see something funny and then I read the comments that makes me laugh So I laughing is is very good for me.\n00:50:46 - Tina Marie (profitdriversinc.com)\nI'm a big snuggler snuggler's work for me But there's only one person and he's in Arizona So I don't get that access a lot my my grandbaby though. I got to hold her that would do it for me Um, when it's summertime being out in the pool. I'm that's so happy. When I get lots of sunshine, I'm very happy. um, massages, my masseuse is amazing. Um, she does reflexology. That's something, but you could also, you know, I don't know when's the last time you went to the doctor and had your lab checked, had your personal levels checked.\n00:51:19 - Chona Sweet\nHave you thought about me doing that? Sure.\n00:51:22 - Tina Marie (profitdriversinc.com)\nknow.\n00:51:23 - Chona Sweet\nI know where the worst patients, I know this mark. I remember when meeting Mark long when we first met, I went the one like encouraging him and pushing him on to seeing his doctor and do this, do that, get, get your vaccines. then now he's very good in taking care of himself. And then I am not so amazing in these lives that I've worked with.\n00:51:50 - Tina Marie (profitdriversinc.com)\nI'm like, not because of me.\n00:51:52 - Chona Sweet\nI mean, I've just watched it is what I mean. Yeah, I know he's very good in taking care of himself and, you know, that's commendable. But you probably want you to take care of yourself, too, right? I Don't want to say that I'm giving myself grace and isn't you know in during this grace period But I I feel like I am in that grace 90 day period of this new place When you're building a business, it's it's grit that you need more than grace and Now look Right, it's a shift of mindset. I'm not I feel like I'm not totally there yet This is the first time I'm doing this and I feel It's not fully shifted my my mindset and Can I ask you a question that Just ask me okay Do you talk your do you are you good at talking your way out of things and have you done that your whole life? Oh, yeah, you think you're doing that now, right? I'm rationalizing why why I do what I do or how I why I\n00:53:00 - Tina Marie (profitdriversinc.com)\nwhat I feel. Is that getting you where you want to be?\n00:53:04 - Chona Sweet\nNo, but I feel it's what I need at the moment to comfort myself.\n00:53:09 - Tina Marie (profitdriversinc.com)\nSo that goes back to you. Do you want to deal with be able to deal with emotional discomfort?\n00:53:17 - Chona Sweet\nI mean, that would be emotional comfort, but do you want to be able to deal with it? I feel like we've been dealing with it.\n00:53:24 - Tina Marie (profitdriversinc.com)\njust don't know if it's the right thing. what just we're gonna have next week's call and if you think I'm right about anything, all I want you to do is just say you're right and just not explain it, not anything and just sit with it. It's really gonna suck. I want you to be able to sit with things being uncomfortable and not need to fix it or try to make a feel better. Will you do that with me next week?\n00:53:57 - Chona Sweet\nOkay.\n00:53:59 - Tina Marie (profitdriversinc.com)\nDo you see? any benefit in doing that?\n00:54:01 - Chona Sweet\nYou mean, like, for example, what's you mean?\n00:54:06 - Tina Marie (profitdriversinc.com)\nLike, well, if I went through and looked at the notes from today's call, we can talk about multiple reasons, multiple issues that we brought up, and then you explaining what's happening. And I don't want you to do that. I want you to acknowledge, there's something that isn't going the way that adopt you, and just sit in it, and not explain it. Just let that sit there and not try to make it feel better. Does that doesn't make sense now? don't know. I probably didn't change it at all.\n00:54:39 - Chona Sweet\nThat makes sense.\n00:54:40 - Tina Marie (profitdriversinc.com)\nSo it's just practice. It's just acclimation. I am a type A perfectionist. I was picked on a lot, and also, firstborn daughter, so people pleaser. But also, I learned, because I'm a very angry abusive mom, literally abused me. And so I got really good with dodging the hand with my mouth by saying things to placate and please and excuse and to justify. And I'm also very smart, I'm good at doing that, but I was blessed to have people call me out of my crap. And because of them, I grew and I want to grow more than I want to be comfortable. I want to grow more than I want to be right. That wasn't always true because being wrong was so uncomfortable for me. It physically painful, I still get physical anxiety, I will replay everything I've said every day to everyone, even if they thought it was great and look at all the ways I did wrong. Still, I'm 48 years old. should not be... doing it. So now I do it way less than I used to. But there's still a lot of anxiety. And I feel like crying telling you about it. It's a physical, visceral response. Like I could hang up and just go cry for five minutes. And it's stupid to me. I don't want to do that. That's annoying. It's frustrating. I'm strong. And that crying would not keep me from doing the hard thing. But I'm like, I don't say the things that would make me uncomfortable or say all the things that made me uncomfortable. But Chona, there is so much liberation in being able to sit in emotional discomfort and being able to be wrong and being able to be exposed in wrongness and learn the ear with people who will be like, okay, so Mark and I work with Dan. Also, it happens with Mark. I'll say something and I'll be completely wrong. Just cool. is wrong, not understand something, Dan will just completely disagree with me. he'll make that sound, but he's not being disrespectful. He's just got his thoughts and his opinions, and it's a safe space. But because I was able to sit and not try to be like, why did you say this? no, I didn't mean that, you know, and try to make it better. I've learned that I can just be myself around people, but also I can ask difficult questions, or I can say some of my crazy thoughts. And a lot of times they're right, and they're good. And because I'm bold enough to do that, because I'm okay with being wrong, I get to have the joy and the experience of being bold, right? And I also get to have the learning experience of being wrong and being corrected quickly, or redirected, or instructed quickly. So, or you can just get a new perspective, because I'm willing to say things and be vulnerable. Most people don't like it. make a lot of people uncomfortable, especially my Sunday school teachers. Most of them can't stand me. that's okay. But because of that, I've just found my niche in this world and it's amazing because I felt hated all of my childhood and a good portion of my adulthood, especially I married somebody that treated me just like my mom did. So my point is is that the only way to get comfortable and to not feel trapped by emotional discomfort is just to kind of embrace it. But I can tell you like not many people can from experience the power of the contrast between being trapped by trying to avoid that discomfort and the power of just fully embracing it and asking difficult questions, making demands like, okay, I'm not going to work more than one day a week. And you know what, I'm only going to do one day a week every other week because I really don't like it. And I'm just going to take this whole week off like whatever whatever it is you've got to figure out what works for you. But trust that if you're managing it that way, you're going to be in your superpowers. That means like when you're at the hospital taking care of hospital people, you're going to be the best down nurse protection they've ever seen. And they're going to love you. And you're going to do amazing. And then when you do the lean patients, you're going to have more energy for that because you're not burning out with the other things that you don't want. Nobody is going to architect the ideal situation for you, but you can. You just have to be honest about what you're doing, why you're doing it. What you don't want to do, stop doing what you don't want to do or tell yourself, I'm going to, because it really is going to be the only way that I get to what I want to. But whatever it is, make sure that you're telling the same story all day, every day, or what you're going to have is this dissonance inside of yourself, and it's really going to rip at you.\n01:00:22 - Chona Sweet\nUnderstood.\n01:00:26 - Tina Marie (profitdriversinc.com)\nWhat do you think about that more than understood?\n01:00:30 - Chona Sweet\nI know that I'm not doing really good, I'm not 100% in. I feel that I'm just doing it because to show face right now, I could, myself, because to show face for myself. self. I know that I'm not consistent.\n01:01:06 - Tina Marie (profitdriversinc.com)\nDo you think you can have these?\n01:01:07 - Chona Sweet\nI know, I know I can be. just have to make that decision that I'm fully fully in. I mean, you know, yeah, I just feel I'm not there yet because I don't want to be. I'm not.\n01:01:30 - Tina Marie (profitdriversinc.com)\nThat's true. That's what that's what you need to do is be flexible.\n01:01:34 - Chona Sweet\nYeah, I'm not decision that you're that you're in yet. Yeah, I thought I would be in and then I realized Oh, this is this is a lot of work. I don't write. I don't like this.\n01:01:46 - Tina Marie (profitdriversinc.com)\nSo ask this question though Is there a way that you see where you can be in like maybe you only do clinics twice a month one day every other week? I know that might sound extreme to you and I don't know. that's reality. But what I'm asking you, is there a way that you can craft the situation?\n01:02:06 - Chona Sweet\nYeah, I think I think I I think I've become money focus. And the reason why I say that is I noticed myself committing more to my lean patients in clinic patients. So I will work around, I will drive to wherever I set the page. For example, I called the patient and I gave them two options where they can go and they go far from Huntington Beach. They went there, they went to the south location. So I drove there no problem early, like 9.30, like I don't have a problem. So I noticed that I definitely lit up when I know that this is and make me more. I think that's where it's that. And I feel that the current one is it's not where it's at. That's why I don't like it. And that's the truth that as much as I say, I don't want to treat patients just because of the money. But the lean patient, it's hard not, it's hard not to admit that it is the truth.\n01:03:18 - Tina Marie (profitdriversinc.com)\nSo you could stop judging yourself and that's okay, that's what motivates you.\n01:03:24 - Chona Sweet\nYeah, it does motivate me like, okay.\n01:03:28 - Tina Marie (profitdriversinc.com)\nYeah, so be okay with that. Practice being able to say the whole truth exactly as it is. I'm not insinuating your lying or anything. I'm saying is just that's emotional discomfort also to claim what you want and who you are and be okay with it.\n01:03:47 - Chona Sweet\nBy the way, what I just told you is totally against my ethics would work. Because I don't, this is, and I've worked with, I work at Cedars, I work with UCLA. We were, I take care of whatever from homeless to Prince of Dubai or whatever. I know that's the one thing that I hate is, but I just need to say because I don't know why because it's it's it's against what it is that everybody is there is no such thing as altruism.\n01:04:21 - Tina Marie (profitdriversinc.com)\nAnd I'll tell you why if I do something just to make you smile and make you feel good, this side effect is going to be, I know I made you smile and feel good and it's boost to my ego and I get the joy of your energy. I know I get something back even if it's just feeling like I did something for you. There is no real pure altruism. We are all motivated by what we get back, whether we acknowledge it or not. Right. There are different currencies. Sometimes we get happiness back.\n01:05:00 - Chona Sweet\nwe get comfort back. Sometimes we get a favor back.\n01:05:03 - Tina Marie (profitdriversinc.com)\nSometimes we get a paycheck, but we all receive a currency for our currency that we extend out to others. So then everybody's out of right?\n01:05:17 - Chona Sweet\nOr nobody is.\n01:05:18 - Tina Marie (profitdriversinc.com)\nSome people are just more honest about it than others. Let ask you one more thing. If you go and make a million dollars, are you going to keep it all to yourself?\n01:05:29 - Chona Sweet\nAre you going to spoil the people that you love? I mean both, definitely, because I would love to spoil, you know, if you, and then what did I get from that? go, I get what you're saying, but I guess what I'm trying to say is because when I used to work, I work as an employee in my mind. I'm just, I'm doing this because of my job, but not directly because I'm getting, it's hard to explain yourself that not what I'm going to tell you. Yeah, just the mindset, the shift on the business mindset is different. And I don't, Knowing if I'm if I'm overthinking it Judging yourself.\n01:06:05 - Tina Marie (profitdriversinc.com)\nYeah, that's what you've been doing with everything. You're judging your handwriting You're judging your language. You're judging your motives, and you need to stop that If you want to be happy You've got to just embrace who you are and know that other people are blessed for knowing you this guy loves you Like there's got to be something good about you. Your patients love you Your family loves you, I would assume You just being you I mean not all families, but so Just love you and be okay with that and know that You getting what you want and what energizes you and motivates you makes you a more potent version of you Makes you get more good things done Whatever the children of things are you're gonna be more empowered because you're gonna Stop being held down by a judgment and direction and shame and doubt.\n01:07:02 - Chona Sweet\nRight. Right. I could. I could do a lot more with being having a routine and having time management because controlling my own schedule is the best and that more thing that can happen to me.\n01:07:21 - Tina Marie (profitdriversinc.com)\nYes.\n01:07:23 - Chona Sweet\nSo we can talk about that, but ultimately you're the only one who can do anything about it.\n01:07:29 - Tina Marie (profitdriversinc.com)\nRight. It has to be a bigger thing other than I'll be more productive if I have a better schedule. have bigger reasons. You'll sleep better. You'll probably make better decisions because we know cognitive function drops when you're tired and exhausted. You'll be more healthy, more consistent. The close levels will be more level, which means your cravings will be more level, which means your energy levels will be more level. Like if there's, if you want to sit there and have lots of conversations to try to motivate yourself, we could do that. the end of the day, it's going to come down to rob discipline.\n01:08:04 - Chona Sweet\nRight.\n01:08:05 - Tina Marie (profitdriversinc.com)\nThe discipline is a muscle. You work it slowly, you grow it slowly. It doesn't happen all at once.\n01:08:13 - Chona Sweet\nAnd almost always, it looks like this. Right. Mark wakes up very early and well, initially for Dolce, but you know, even without Dolce, still wakes up early.\n01:08:27 - Tina Marie (profitdriversinc.com)\nAnd you guys are opposite like circadian rhythm types.\n01:08:33 - Chona Sweet\nRight. I'm work, I sleep late, I woke up late. I mean, even if I sleep early, I woke up 3, 4 a.m. then I sleep in again.\n01:08:44 - Tina Marie (profitdriversinc.com)\nAnd there's not a solution to everything when it comes to sleep and schedules. Some of it is just rough. That's life. We can't solve for everything.\n01:08:55 - mark sweet (sweetlaw.com)\nAll sort of saying, I am for me in our office.\n01:08:58 - Tina Marie (profitdriversinc.com)\nIf I want to sleep in late, I really couldn't. Yeah, so what I want you to think about is what can you be the architect of what can you change and I don't mean just yourself like Did I have your read that book switch?\n01:09:12 - Chona Sweet\nNo, I haven't that's fine.\n01:09:15 - Tina Marie (profitdriversinc.com)\nI will power.\n01:09:16 - Chona Sweet\nI need you to read that book. I have it on like audible That's another thing we've talked about that you said you were doing didn't do it. need.\n01:09:24 - Tina Marie (profitdriversinc.com)\nYeah um, I said you'd like to read at night.\n01:09:28 - Chona Sweet\nIt's relaxing No, it's I listen to I like listening to the books.\n01:09:33 - Tina Marie (profitdriversinc.com)\nI start listening to the 48th, but that I wasn't able to Complete it do you switch because it's how to make change when change is hard Right and it's entertaining. They did a good audible version.\n01:09:46 - Chona Sweet\nIt's very good. So I would say though that in terms of Cheryl I think we were able to go past the resist I mean in a way because now for example the two patients that comes in they emailed me first we are only two months in by the way that's pretty good yeah they emailed me first and then i see see her and then the other person that you know is in charge with the lien it's cast and Cheryl i emailed them so they're part of that loop of email with this case manager of this lawyer so and it's been work i send them the the notes and then cast send the bill of she sent my name on the bill as a provider or as the medical provider i told her changes make it dr e which she did it it worked so it you know architected that you know saying you did it your way right i wanted that yeah she she said she said no tell them to email me it's like no no no no that's not how it's going to work but also i've become i i you know she we just celebrated her but at her birthday the other day and I was there. I'm showing up for the other non-work part. I really wanted to be okay with not just with her but everyone. I don't know about pug stuff, was cute. Yeah, he's a dog person.\n01:11:18 - Tina Marie (profitdriversinc.com)\nSo he got her a pug. That's a good thing.\n01:11:21 - Chona Sweet\nlike dog people.\n01:11:23 - Tina Marie (profitdriversinc.com)\nI know she's four not dog people.\n01:11:25 - Chona Sweet\nShe's never met a person who's not a dog person that I liked. She works hard too. think she realized now that okay I'm not trying to take away or be not including you. She's included on everything that I do.\n01:11:41 - Tina Marie (profitdriversinc.com)\nThat's really good growth in two months.\n01:11:43 - Chona Sweet\nSo I feel good about a lot of the things that are happening but and also if you're not okay well that was that's a test um but\n01:12:00 - Tina Marie (profitdriversinc.com)\nI do. I we have to get, um, you know, anyway, we talk about pacing, but also looking at the clock and I think somebody's got plans tonight.\n01:12:10 - mark sweet (sweetlaw.com)\nYes, we do very pretty soon, but this is really, really, really important because it's or get off the pot kind of type situation. You know, those when I use language like that. We have a prostitution analogy today.\n01:12:23 - Tina Marie (profitdriversinc.com)\nOh my gosh, but you're not serious. I already had to apologize to God today.\n01:12:30 - mark sweet (sweetlaw.com)\nAnyway, either here nor there. Next up, these things about me anyway. I think for tell me if I'm wrong, but this seems like what you want to do because you understand how it's different than what you were doing before in terms of what your long-term potential is and correct me if I'm wrong because I think what's in this saying and I don't mean to speak for you again, but if you were much happier what you were doing before and you want to be handcuffed or only earning a certain amount. you are able to physically show up and not have the flexibility that you want or the ability to make more money, but do you have to work differently and harder? There's nothing wrong with that. It's just admitting to yourself, this is what I want. And I know I nudged you in this direction pretty hard, but if this isn't what you want, it's better to say now than in a year from now.\n01:13:23 - Chona Sweet\nMm-hmm. I think it's definitely hard for me not to compare, especially when I'm feeling tired and I feel like I'm doing much more work as compared to that. And I'm not even touching the potential business potential, earning potential, the other earning potential, but I'm understanding or I'm accepting that it's part of it. It's part of it, I guess.\n01:13:55 - Tina Marie (profitdriversinc.com)\nI just, so here's what I want like, you know, Ponderon is being the architect, okay? So when you tell yourself something about what you have to do, I want you to ask yourself, but is that true? What is actually true and what else could be true? Because sometimes opposing truths exist and it's difficult to understand how they can because it exceeds our reasoning, right? But we can sense, there seems to be evidence that this truth is true and this truth is true, but how they don't make sense. So think about, is there a way to change things so that it's not feeling like it's draining you? And also be the architect of the dialogue in your head. are you telling yourself? you catch yourself comparing the old jobs, Are you looking for a way to talk yourself out of doing your work or justifying not doing your work or making yourself comfortable with an uncomfortable situation, and ask yourself the things that I want is what I want most to make myself feel better about how I'm doing, or do I want to get to this thing and be able to deal with discomfort for a little while. So think about this conversation a little bit. If you want to send you the notes, don't know if you would read it and go back over it and look at some of the highlights, or I could just give you the bullet points of these are the things that kind of contemplate that we were talking about today. And here's the thing when you're when you're going through a growth period, your perspective shifts. I can't think of the word that I want right now. It's just I feel like my blood sugar is one of my crazy. hold on.\n01:15:58 - Chona Sweet\nAnyway, it's too much.\n01:16:01 - Tina Marie (profitdriversinc.com)\nYou're dark, but that's also, um, um, you change drastically, your perspective changes drastically, you're operating from a different standpoint, your motives and your opportunities are shifting. Um, in your perspective is shifting and part of it is allowing yourself to be honest and just say, I'm motivated by money as a healthcare worker. Fuji, I'll give you an example. I don't think he would be upset that I said this, but I asked him, you know, so why do you become a doctor? He's like, money, he's like, like, you know, he's like, I shouldn't say this, but the truth is it was a path to financial freedom and I felt like it was leverage and it's what I want. And so, you know, I talking, you know, and taking a path because I think his motives and M.O. is this, but it's really here. So just be honest, you're not the only one and I will tell you what this world would be screwed if it wasn't for the capitalistic types because they're the visionaries that actually change everything because they're honest about it and they understand psychology because they're honest about it and they're not trying to say one thing and be another. Let yourself be that way. Think about all the good that you're doing being just exactly as you are.\n01:17:37 - Chona Sweet\nBy the way, when I say that I like the money that makes me feel bad, but at the same time, it makes me feel bad that I feel bad about it. I don't know if I added that. I want to have that mind shift of I want to make more money because I can see in Mark, but I can see in Dr. E. They have a different look in them. It's hard to articulate, but it's like, it's the business people in them like, oh, I'm doing it.\n01:18:10 - Tina Marie (profitdriversinc.com)\nyou ever read the book at this fund?\n01:18:13 - Chona Sweet\nNo, what is that? You said, you said, at it, do you have the hand ran book?\n01:18:24 - mark sweet (sweetlaw.com)\nYes. Let me ask you a question then before we finish, because you were with so many people in all different stations in business from startups to very established businesses to people taking over for someone who and different education and class levels like, yeah, especially the ones who are just starting or have shifted, right? How often do you see it in a slingshot where there feels like they're running through the mud? feels like they're running through the mud hitting their head against the wall. So close to quitting and then just one. Hey, it feels like one day. It's not different in your way ahead.\n01:19:05 - Tina Marie (profitdriversinc.com)\nAlmost every time, but I will tell you that there is one commonality between all of them, and that's consistency. I don't see it and people who don't show up consistently. I see those people fail and sabotage without exception. I have seen people hear me, acknowledge the truth, and show up consistently for the first time in their lives, really, for the hard things. I have seen that. I do believe it can happen, otherwise I would quit with people as soon as I see they don't show up regularly. It for sure is in there. And I would tell you what the litmus test is. had it tonight. It's talking about it. And when I ask you to not make excuses or anything, you're just like, okay, Most, anybody else that isn't going to do the work will still argue there. You didn't. So I have hope for you, but I will tell you that that catapult slingshot comes from consistency. So what you do is you build up tension. It's a compounding effect. And you have done all the things and it's almost like driving the driving lessons again. Only the difference is you're revving the engine right there and pretty soon you get to let off the gas and just go. And it in my favorite way of looking at that is a one year period. So for Mark, let's use Mark as an example. He is always the slingshot. He will just will be talking about talking about talking about things like Mark, when you're going to do this, when you're going to do this, let's just give up and stop bugging him for a little while or whatever. You'll be thinking about something and it just will piss him off and he'll just be like this driving he does I'm gonna go fix this and then he'll go into a deep dive and He'll find a solution and he'll fix it. I didn't do any of it. I'm a facilitator. Sometimes I'm a catalyst, but I don't really fix anything Sometimes I show the solution like chat GBT or cloud AI or something But really that's not the solution. It is the visionary It's the one is like, you know what what I could do and then they they get to work at it And he does that and the the pace of that is probably every several months that there's a slingshot type effect but there's one at least every year and What I was about to say was I like the Looking back over a year because I can always find a look at this Like look at this that happened to look at this that happened There's always if you think you can stack and go wow like we didn't have that last year That's pretty awesome and then it can also go I can look at some of the conversations that we had that ended up being the catalyst for that.\n01:22:04 - mark sweet (sweetlaw.com)\nSo, two months we did that today when we're looking at the year of, you know, we're signing things, we're looking at December and you see, like, go to the top, and then, like, pop. But it was constantly, like, running into a wall doing stuff. don't like to do repeatedly. Yes.\n01:22:22 - Tina Marie (profitdriversinc.com)\nknow. don't like doing Like, you know what? You're right. I just got to do it, and you go do it, and it's amazing. And the growth, I mean, so sweet law, when we started, we were getting about 32, 30 retainers a month on average. And now, we're anywhere from, like, 82, we've had 100, over 100, or 100.\n01:22:50 - mark sweet (sweetlaw.com)\nYeah.\n01:22:52 - Tina Marie (profitdriversinc.com)\nLorenz, we've been working with Lorenz for, it's been six months now, but his 30 days, we've taken his average. of closing the cases to 30 days in six months and considering Lorenz's normal pace is sloth. I mean it with respect.\n01:23:10 - Chona Sweet\nreally like him. He's a big sloth. He's huge.\n01:23:15 - mark sweet (sweetlaw.com)\nHe just moves slowly. He's very just very slowly and that's not a knock on him. It's just how he is and that's okay. But what's he saying like he now knocked off 10% of what he's doing which means he will make more money. He will be less stressed out. But it took you three, four, five months to get him to that point.\n01:23:35 - Tina Marie (profitdriversinc.com)\nI actually started seeing the change in August when I was looking at the reports. It was very slow. It was about 10 days. So I would say about every two months there was a 10 day kind of shift and I didn't know how much confidence I felt in it like I was talking about today. I'm like I don't know how much of a difference it actually makes. But that's the thing perspective, personalities, body, these chemistry, childhood trauma, it all comes into the mix, which is why I take holistic approach to it and don't like take a Harvard business process to it.\n01:24:12 - Chona Sweet\nJust doing all that coffee is not good still.\n01:24:17 - Tina Marie (profitdriversinc.com)\nAnyway, but the thing is I love what I do and I didn't always and that changed everything. It changed how much I earned. It changed how much I earned per hour because that when I became more joyful in it, I had more energy to go study, to read more books, to hone my craft, to develop my systems a little bit better and bring them back to my people. If you spend more time in the hospital, less time in the places that are draining you, that could be a potential benefit that maybe you haven't thought about because you haven't had the perspective of, I give myself permission to build the business that I want to build, the way that I want to build it, knowing that I will go bless others if I build\n01:25:00 - Chona Sweet\nbusiness that blesses me. Right and I actually love that part that yes wanted to make more money I want to see more patients because I get paid for patient but at the same time I as compared to how I was in the past I've been very much open and grateful to appreciation when patients express oh I want to like today I want to talk to the nurse practitioner who I talked to last month because I want to thank her that is me you talk to me and yeah no thank you the procedure that you recommended I did it and it worked my pain is over 70 percent better so again I have a patient the other day like I need your card because I want to make sure it's a hospital patient I want to make sure that they keep you I just had an epiphany because you're talking about you know the lean patients and it making you money but that's the hospital doesn't make you more money right?\n01:26:00 - Tina Marie (profitdriversinc.com)\ndoesn't I get paid stick would be real quick because we're going to close this up and I think Oh, I remember you telling me that what you liked about the oh actually maybe it's the other way around in the hospital you can give them the treatments that they need or is it in the clinic in the hospital it's quick instant relief and I tell I can see it the next day like today like multiple times I gave something or I did something and then they're much better the next day and they go home early that was it so part of what I think makes you happy is you actually get to help people feel better so yeah so but I want you to remember that that is a motivator for you or you wouldn't like the hospital so much right though you taking care of people is very important to you making them feel good and be better is very important to you it's okay that it's also true that making more money and not doing tedious charting is something that you\n01:27:00 - Chona Sweet\nI'd better.\n01:27:00 - Tina Marie (profitdriversinc.com)\nSo it's okay for you to be nuanced and complicated. You're a woman.\n01:27:07 - mark sweet (sweetlaw.com)\nBut I don't remember any time you come home from the site hospital.\n01:27:11 - Chona Sweet\nNo, I honestly don't know.\n01:27:14 - mark sweet (sweetlaw.com)\nIt's true that was thankful to you. Or that you saw this and the pain went away because of your recommendation.\n01:27:21 - Chona Sweet\nAnd in the last month, there's been four, five, six.\n01:27:24 - Tina Marie (profitdriversinc.com)\nThat is really good column. That's really good column.\n01:27:29 - mark sweet (sweetlaw.com)\nMoney exactly the same. And you had to work a little bit harder with the hospital stuff, but you got that sense of joy.\n01:27:37 - Chona Sweet\nYeah. No, the patient.\n01:27:40 - mark sweet (sweetlaw.com)\nup with it.\n01:27:41 - Chona Sweet\nEven Tina, she saw you light up with it. It's a completely different change with you. Yeah.\n01:27:46 - mark sweet (sweetlaw.com)\nyou know, this bag, you get all excited.\n01:27:50 - Chona Sweet\nWell, the one who I talked to today is a phone call. Yes, it's longer. I talk to them every month. But patients light up if I give them their We feel which of narcotics, which is fine, whatever, but this is different when they say hey, know, you know, you really think you or, you know, I don't know.\n01:28:11 - mark sweet (sweetlaw.com)\nThey've been trying to sell their pain and they've been trying to get someone to help them and you help them solve an issue that's been killing the sickle cell person talking about where watching it off, you spent time to figure out a solution that actually helped them.\n01:28:22 - Chona Sweet\nYeah, whether the black patient because that's not neglected even there. Yeah, yeah, no, I have a, I have a little bit of a bias with sickle cell patients because I, it's a painful disease and they get very dependent to it and they were dubbed as seeking because their pain is not controlled.\n01:28:47 - Tina Marie (profitdriversinc.com)\nAnd I just, why people don't understand it that's why I'm serious medicine and a lot of treatments where you'll find the greatest innovation is where the people with the money. have experienced it and so they've innovated in that particular area. It's not even a racist thing. That's just that that's just the reality.\n01:29:09 - Chona Sweet\nSo anything. Yeah, no, it's true. That's why you know, not a lot of people like what I do. lot of people I talk to like, why are you in pain? Is this deal with the patients who are in pain and they're addicts and they're they're it's.\n01:29:23 - Tina Marie (profitdriversinc.com)\nMy sister works in a methadone clinic.\n01:29:24 - Chona Sweet\nDid I tell you that? Yeah, you did told me not everyone not everyone likes to work even psych patients. And I have a, you know, I know, Marcus, it's very, very hard on me. I take in a lot of of it, but I feel bad for them. everyone wants to help them.\n01:29:42 - Tina Marie (profitdriversinc.com)\nAnd it's it's sad, you know, but that's all the more reason why that by the way, the skill of being able to sit in negative energy and not let it be taken in is a really important skill.\n01:29:56 - Chona Sweet\nYeah.\n01:29:57 - Tina Marie (profitdriversinc.com)\nAnd it's not deflecting it. It's letting it be there, but not letting absorb and impact you, right?\n01:30:05 - Chona Sweet\nRight.\n01:30:07 - Tina Marie (profitdriversinc.com)\nAnd that's something that I can help you with. God put me through it from infancy. So that was a skill that I got to develop. But you have so much to give. I really want you to practice not judging yourself and just being able to speak openly about how you feel about things. Yeah. And ask, you know what, can this be done in a different way that I actually like? Yeah. And understanding that you liking something is not being petty or impetuous or anything like that. It's you managing energy. And with you having maximized energy, first of all, better quality life, better quality relationships, but also better quality service. Your brain works better. thoughts will be more creative. You'll be more powerful and potent in all ways. Right. need to justify making the way that you want to. It's because you'll bring better everything to every table.\n01:31:04 - Chona Sweet\nYou go to right Yeah, I know like I always feel better when I talk to you I'm glad because I did so much.\n01:31:12 - Tina Marie (profitdriversinc.com)\nI don't know she's gonna like me tonight, but I know I do and again, I Appreciate the nudge.\n01:31:20 - Chona Sweet\nI appreciate them honesty because it's what I needed, you know when I need it I know I'm not I know I there's a lot of things I need to do it's just a matter of me.\n01:31:30 - Tina Marie (profitdriversinc.com)\nIt's you baby wanting to do it.\n01:31:32 - Chona Sweet\nI don't I don't pay anybody to tell me what I need Well, we do all need to go because we need to be And get a clock so we have woman to get dressed in chains. Thank you so much.\n01:31:45 - Tina Marie (profitdriversinc.com)\nI feel very special. I'll let you go bye Thank you Thank you You\n","contentPreview":"00:00:01 - Chona Sweet\nHi. Can't hear you. You're muted. Yeah. are you? Good. Good. Just sweetest got home.\n00:00:15 - Tina Marie (profitdriversinc.com)\nLong day.\n00:00:17 - Chona Sweet\nIt's okay. But...","processedAt":"2025-05-04T03:40:52.516Z"}