{"fileName":"Transcript for Maria & Tina🪄(14).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Maria & Tina🪄(14).txt","type":"transcript","priority":"medium","content":"00:00:08 - Maria Gudelis (Maria Gudelis)\nHey, hey.\n00:00:09 - Tina Marie (profitdriversinc.com)\nHey, What's going on? When did I need my name?\n00:00:15 - Maria Gudelis (Maria Gudelis)\nBecause I'm sick. Sick has got the blood drawn yesterday morning and you're just having.\n00:00:21 - Tina Marie (profitdriversinc.com)\nNo, my daughter came home sick and she got. So I've got my inhaler and been taking my silver and I already feel better but I'm still like.\n00:00:33 - Maria Gudelis (Maria Gudelis)\nGot it.\n00:00:35 - Tina Marie (profitdriversinc.com)\nAnd then this morning my daughter comes in and she's flashing light in the darkness in my eyeball. And I'm like and I never say Jesus Christ and I say Jesus Christ.\n00:00:48 - Maria Gudelis (Maria Gudelis)\nSorry.\n00:00:53 - Tina Marie (profitdriversinc.com)\nI was like, I thought she was talking about my daughter for a minute.\n00:00:58 - Maria Gudelis (Maria Gudelis)\nIt could be a dog.\n00:00:59 - Tina Marie (profitdriversinc.com)\nYeah. Dog. I walk out and I smell this god-awful smell. I'd never smelled before and The dog was filming at the mouth.\n00:01:08 - Maria Gudelis (Maria Gudelis)\nI'm like what's going on. I'm like it's got me a skunk But it didn't smell like a skunk, but it was filling up my whole house the smell Oh God.\n00:01:16 - Tina Marie (profitdriversinc.com)\nYeah, it smelled like chemically and Not like a skunk, but it had to have been just a weird skunk We've had these experiences before it did permeate through the whole house if my daughter Mm-hmm up just smelling her dog. Yeah, she got sprayed right in the mouth dog So that's how I woke up and it wasn't even seven o'clock yet in the morning Yeah, so that on top of being sick and we had like body aches in my just yeah But and I feel good enough I get the job done, so Walk up and did my missionary stuff and I snuck like a shower during one of the calls because we're not on video and I muted myself and I'm like I'm just gonna listen and get my shower and right after I got out they like had a question for me so I'm like nobody knows and it's okay so so what did you do with the dog then what's happening with the dog right now she's okay okay yeah she it just had happened so she hadn't processed it and body but she had some water and she was too a lot just making that face and she's okay and I couldn't believe how much this because we have medical grade at HEPA filters throughout the house since COVID but also we all have asthma and the pollen around here is insane yeah so it did a really good job of clearing out smell pretty well and I can't believe it. leave because I prayed. I'm pretty sure miracles are just happening because the oils in the skunk are just they're pervasive. They take a long time to dissipate and go away. She didn't get a bath or anything but it's yeah it's the worst and the best skunk experience we've ever had. Worst as in how bad it was but best isn't how quickly it's it's like we still smell it but anyway she's okay she's out barking her head off right now. Oh my gosh and you're on fire yeah your pad just being like breaking it down. I watched while I was on my training for a minute because there were some because there was the board so I was like that's awesome.\n00:03:48 - Maria Gudelis (Maria Gudelis)\nYeah yeah no yeah yeah I'm excited and I had a really good call this guy yesterday that's potentially more like just for me on the off offer stuff because he had a funnel builder that was doing stuff for him and that funnel builder just changes business model to not have any customers anymore and he's just gonna focus on his own offers. So he was wondering if I could take over and run ads for him and all that jazz. So I'm like, okay, cool. Yeah, let's do it. So yeah, that's kind of what's happening now is is to later on today, I told him said I want him to think I was a what do you go? Desperate of this that so he asked if I could send him just a detailed either a contract or or send him a details of what's more out of scope. That's what he'd like to learn more about. Not what's in scope. was going and so 5,000 months didn't phase him at all. So let's do it for 90 days, but obviously if you don't like it or you're You don't like it, you know, whatever, like I'm not going to hold you to the 90s, but I feel we should have that at least, but you got legs like I looked at his funnel. He just needs to optimize it. And I think it'll rock for him. And I also believe I don't know if you're like this now to I don't believe high ticket sells so well in this economy. So he needs in the real estate niche. He's a realtor. He's very successful what he does. And he's got a great book.\n00:05:23 - Tina Marie (profitdriversinc.com)\nI think he wants to become like the next brand new chart, which I think is really cool. I don't it's the economy.\n00:05:27 - Maria Gudelis (Maria Gudelis)\nI want to talk after that. Okay, sure. Okay, yeah, yeah, we love to talk. This is that is a podcast episode or video for us to do. So, but yeah, so he's trying to send them into a $3,500 thing. And I said, you know, honestly, if I run your shoes, I really feel you should have more 500 or 900 or 300 thing to assemble too. And I think that's going to make you 50k months easily with this funnel because the real estate niche have been in it. I'm very experienced and I even how I was there when Chris Michore just started because I was with the ad agency So, you know, saw her when she was nobody and everybody knows who she is, but she started in real estate now She teaches all things business, but uh, so anyways, um, yeah He's certainly open to that because I really feel You're setting yourself up for fail failure because then you have a sales team then you gotta deal with this and he doesn't want that He makes good money in his real estate business.\n00:06:25 - Tina Marie (profitdriversinc.com)\nHe doesn't want to deal with that or manage people.\n00:06:27 - Maria Gudelis (Maria Gudelis)\nSo anyways Um, he's Looked like he's a yes. Uh, yeah yesterday on the phone. He and he on zoom call We energetic are really aligned the Ford for his book was written by one of his friends who's Bob Berg of the go-giver So like he's very heart centered Um, person so um, anyways, I understand he just wants to know what's in scope. What's not in scope Is it okay? I'll just craft you I told him I'd do it tomorrow, is today So once I have that then that will alleviate a lot of pressure to have five thousand Coming in for that, plus he's a fun guy to work with.\n00:07:03 - Tina Marie (profitdriversinc.com)\nThat's what I thought as soon as you said the price point, and for 90 days I'm like, okay, that just created the space that you need it. But it's actually because, but what you also need is you need the boon of what's been, what you've been having to deal with is the energy of it. wouldn't say it started with Carina, but it definitely maybe was probably most noticeable and painful with Carina of not being respected. That is an emotional heart pain, and you had Rudy, and I'm coming from these kinds of experiences as well. I'm speaking because I know what they feel like to not be honored, especially when you show up and give everything.\n00:07:53 - Maria Gudelis (Maria Gudelis)\nWell, yeah, let me turn my box around. And this is to have some\n00:08:00 - Tina Marie (profitdriversinc.com)\nbut nickel and dime you.\n00:08:02 - Maria Gudelis (Maria Gudelis)\nYeah, try to be miserly with you.\n00:08:05 - Tina Marie (profitdriversinc.com)\nBut say, I see your expertise at that price makes sense to me, at least like it isn't a done deal yet. But yeah, once you start dealing with people who honor you, you are your energy is completely different. You're not coming from a defensive and making space and now your creativity flows.\n00:08:27 - Maria Gudelis (Maria Gudelis)\nAlso your generosity increases because your fear can diminish because you know that there are good people out there.\n00:08:34 - Tina Marie (profitdriversinc.com)\nIt's very cathartic and releasing and powerful. But when you're already a generous person, it actually increases your generosity because somebody kind of restored your faith and humanity a little bit, you know. But something to think about. So in terms of the economy, there is just as much money as there always has been. If not more, it has shifted. There's a greater priority, but the bigger issue. is the economy of trust. The trust economy has what's been most damaged. So there are too many people stealing and promising big things. And hey, I'm so and so, and you just get my time. You get access to me, you get access to my community.\n00:09:17 - Maria Gudelis (Maria Gudelis)\nThat's worth $10,000, it's not.\n00:09:21 - Tina Marie (profitdriversinc.com)\nI need results for $10,000. So and most of these things are just, here let me throw all of this information at you, but there are a lot of gaps. It's not actionable. There, there isn't a support system where you can ask a specific question where you need to get. So for most people, they have realized, so this is the trust part, it's part of the trust is that they need, if they're going to spend that much money, it needs to get them a certain level of results. They're really, like people didn't ask this question. and have this realization that they're giving to you this week, which is I need an implementer because they realize they're not the one. So people that used to throw money away and the whole just kind of energy that you could do this throw money away and you would get something out of it doesn't exist anymore. There's a whole new market, but the market is coming in more educated realizing I can't just give five or ten thousand dollars and my life is going to change. So that's the big issue. can't there will be people who will pay money just for access, right? that's one thing that's my guy who's always told people people will pay for access and that's true. They will pay a lot of money to get into somebody's world. But that's not everybody. That's a small person and that person already knows what the value and the benefit of being in\n00:11:00 - Maria Gudelis (Maria Gudelis)\nin that connection is, right?\n00:11:02 - Tina Marie (profitdriversinc.com)\nSo the results, they've already calculated, they've already done that. Everybody else, which is the majority of the people need to have a tactical result, which is this thing that I can't talk myself into building, or I can't even comprehend how to build front like backwards and forwards, where I can build, but I don't know how to mark it, where I can mark it, but I don't know how to build that kind of thing that there's always one of those gaps, right? Yep. They need to have that solved. So for the person selling something, the person selling has to decide what do I want to deal with, okay? So we already know what we want to give and what we can sell and what we can offer, but there's a burden involved in fulfillment. So if the thing is we want to help realtors be better realtors. I want to help realtors be better realtors, but I just want to share with them what I know. I don't want to deal with customers. support. I don't want to deal with one on one calls. I don't want to deal with live events, right? So then you get a lower ticket thing that just says, here's what you can learn, okay? I just created a material for you. I don't have a lot to deal with it, so I'm going to give it kind of inexpensive, but I can give it over and over and over again because I know how valuable it is. So that person, you know, your guy who doesn't want to do a lot might consider that. The other thing he can consider is bringing in so maybe you create community and then you're looking for the excited kind of go-getters or the experienced person and then you deputize them and go, hey, would you be interested in being a moderator? Would you be interested in being a junior coach or whatever? And so now they build into the model, you take somebody that you acquired through the funnel to begin with to be a leader and those leaders, they're different because they're also loyal now. not like you went out and hired somebody. They found you, they already been sold and converted and they drank the Kool-Aid. So they're ideal to support your community and now you can charge a higher tier because now you can offer support but you're not doing it. You're facilitating it, you're paying for it, you've created a system that brings the leaders in, you create a system that can train the leaders so you can train your trainers but you don't actually do it. So he could be working with some high level people on occasion which helps him keep his saw sharp and just you know keeps tucked into his business and so like if the market ever just crashes he's got this other thing over here. love the market crashes he's not going to be a selling that very well. But anyway something to consider about that but I don't think so the economy is definitely bad but it's really mostly bad for people who struggle to get jobs in the first place. who, so for entrepreneurs if they're targeting broke people That was already an issue, which is Karina.\n00:14:03 - Maria Gudelis (Maria Gudelis)\nAnd that's why her business. So I had put the glasses on and I prevent ice cream. Yeah, I really feel that sort of Karina in a way happened to her with her list. And that's why. Yeah, because they just weren't responding anymore. Like it was hard to get sales from the compared to a year ago. Same emails, right? So, yeah.\n00:14:22 - Tina Marie (profitdriversinc.com)\nYeah, so that target matters. the people, but everything flows uphill, right? So, food chain. So if these entrepreneurs were targeting the rogue people who barely had money to begin with, who were just thrown it out because they couldn't, they're not getting paid. So these people that used to pay these people, these people aren't getting as much money. some of these people are creative and pivoting. So some of these people are getting that money. But these up here, you know, they're like having different conversations and pivoting more. So the majority of the shortage is here. The next level is here. The next level is here and so on. So the money and the money is flowing up, the shortage, but it's still there, it's still being generated and it's still being spent, it is the difference of who's targeting whom. Are you targeting people that have money or are you adjusting your offer to make it more available to them? But in addition to that, are you shifting what you're offering and support so that if you reduce your revenue, you're also reducing your burden, right? So maybe I'm still helping you, but I'm not giving you the one-on-one hand holding, because this price point doesn't allow me to do that, but I still want to lift you up and help you. Yeah.\n00:15:43 - Maria Gudelis (Maria Gudelis)\nthat make sense?\n00:15:47 - Tina Marie (profitdriversinc.com)\nAnyway, that's my feeling about how it's going, because there's still a lot of people just throwing money just going, yeah, no problem.\n00:15:54 - Maria Gudelis (Maria Gudelis)\nLet's go. Yeah. Yeah. Yeah. Well, I've evidenced by the sudden guy reached out to me, he sold his\n00:16:00 - Tina Marie (profitdriversinc.com)\ncompany after the harmoses and so he wants to start a new funnel in the fertility nation wondering if I can help with that and they said yeah sure uh so you know we're just uh I should need to get back to them too so after we finish this call I need to go back to these people that are hanging loops what do you call it unfinished loops I would be happy to help you create your really clear and don't don't create the potential for scope creep because I don't want to see you be stressed out for your own reasons but for my selfish reasons too because then if you're stressed out then I don't get to play against myself yeah yeah yeah how must you do you mind if we a you You\n00:20:00 - Maria Gudelis (Maria Gudelis)\nYou Back hey, oh my god. She's painting the like she bugs me for food I gave her her food and then she walks away from her nose turned up Yeah, yeah Cuz she wants I put sometimes put a little bit of sliced ham on it, but I'm not gonna do that every single meal for her So she didn't like that. Yeah, she didn't eat it at lunch at two hours ago So I picked up put it back in the fridge with those cuz the wet food and expensive. It's like $4.50 for a little can of this cat food and she goes through a can of day and plus her dry food and so she turns and knows about it and so I put in the fridge and then now she was bugging me bugging me for food and so I put it back down on her when I was making my coffee and she looks at me and walks away.\n00:21:14 - Tina Marie (profitdriversinc.com)\nThat's hilarious. Is it too much cheaper than that?\n00:21:19 - Maria Gudelis (Maria Gudelis)\nUm you know it some of it is special ones on sale um that is Canadian dollars so 450 is probably 350 US or excuse me um but um I have given her tuna sometimes too but I guess with the special product a more holistic brand it has kind of more in it but the problem is she likes chicken flavored and Merlin the burnadoodles are allergic to chicken so if he gets in the cat food that's why he lifted he then gets the runs like the night two nights ago I was up three times during the night because he kept pawing at me go outside so you know it's not nearly as much of the painting you had this morning food.\n00:21:56 - Tina Marie (profitdriversinc.com)\nYeah and then I had to change their dog food um It's always like throwing up or dragging their butts across the ground and there's a lot of stuff outside that they can get into so I don't really know what's what but I was reading how much corn is in all the dog food and how bad it is to digest for any any of us really but so I got some food from Chewy that doesn't have any corn in it and they've been a lot better but yeah I can't see no little fur babies got to take care of them I know I know they are beautiful like oh no she's eating her wet her dry food so she said no to the wet food that's really expensive and the dry food is expensive nowadays too but anyways now she's stomping at that oh my god anyway um yeah so did you see my video that I did on my facebook page today I saw part of it I didn't get to see all of it but I thought that was awesome yeah and who I'm calling out now 50,000 And I'm embedding the seed, right?\n00:23:06 - Maria Gudelis (Maria Gudelis)\nyeah, if I come over here, so, yeah, 50k months from different parts, I'm just kind of embedding the seed. So, so, yeah, yep. All right, so I got this going. Let's go. You cool to start on this now or is that.\n00:23:28 - Tina Marie (profitdriversinc.com)\nYeah, let's do it. So, I think the fastest way to start would be what do you already know that he wants to do so that what is the existing goal? Actually, that would be that's what I do is I reverse engineer every single time. What is the outcome that is desired? And then I work backwards and think about what has to happen to make that. And then I figure out what is the simplest way to accomplish that and what are the guardrails to make sure that I'm not. called out of it. If there's potentially something that could scope creep, I build that in and say, okay, if this needs to happen, you will pay for this. Maybe I'll manage it. Maybe I'll lead it, whatever. But just to be clear, if this is needed, I'm not doing it.\n00:24:17 - Maria Gudelis (Maria Gudelis)\nOkay. So he's got a couple outcomes desired. I'll just write them all down and then we can succinctly make it better if you want. So so the first thing is that the overall big outcome is that his avatar of and obviously this isn't going to go in a minute like this of who he wants to become is like a Brooke Castillo.\n00:24:44 - Tina Marie (profitdriversinc.com)\nDo you know Brooke Castillo? No.\n00:24:47 - Maria Gudelis (Maria Gudelis)\nOkay. She is the owner of owner of the life. Basically he wants to become a high-performance coach like a Tony Robbins Brooke Castillo. Okay. Or Brandon Bouchard, right? owner of life. So he wants to use the real estate RE course as a springboard to other other missions. don't know what you want to call it, but EG, he has a productivity course course. I think he'd love to have a relationship course. This is down the road like he'd like to just help people, right? His offer is called, his name's Grant Mueller.\n00:25:36 - Tina Marie (profitdriversinc.com)\ndon't know ever heard of him. He sounds very all over the board.\n00:25:39 - Maria Gudelis (Maria Gudelis)\nWell, no, no. This is for long term. No, I could just go into the short term. Why call me? just you know that it's good, but it does help to have the overall thing. Yeah. So, I mean, the initial scope is basically optimizing this funnel. Also, he'd like to get to let me find the actual URL top of that yeah top of heart offer and this is converting not bad it's at 7% conversion so it actually isn't bad um he showed me the conversions but uh top of hearts he booked Bob Berg's written the four that's his friend as well but um you know as far as uh you know if we were just to go down to the real outcomes that he wants to um make a profit with this uh little ticket funnel funnel and that's called top of heart offer make a problem that's um he also said that it'd be he says i can afford the 5k right now no problem but it's coming out of my real estate business but i'd like your 5k month to be funded from this event as well. But basically, I think you'd like to get to 20k profit per month. I need to say an exact number. He kind of just said he wants to make it profitable. So let's just get rid of this.\n00:27:20 - Tina Marie (profitdriversinc.com)\nIs it currently like, does it lose money?\n00:27:23 - Maria Gudelis (Maria Gudelis)\nWhat is that? Yeah, so the history is he hired this other guy, Vinny, to create the funnel like two, three months ago and run ads. And so the deal he had with him is that he charged in 10,000 to build the funnel and doesn't include up so one or upsell two, which is kind of like my little ticket offer. But he also runs ad for it. And because he knew that he had a $3,500 high ticket, he said, when you make your $10,000 back in sales of your high ticket, then I'll charge you $5,000 a month for continuing run ads and optimize the funnel. So Vince, a few weeks ago, decided to stop doing being an agency, um, you stopped everything. And he still likes Vince. He says, a good guy, but I have no one now, right? So the goal is to make it profitable. So he didn't really have the greatest numbers right now. And he was embarrassed about it, but said, I kind of need to know your numbers. He shared screen yesterday into his go ahead level account. That's why I knew he was converting at two at 7%. But no, he's, I don't know if he's profitable. I say no, because his average order value is probably only between seven and $10 because he had zero conversions of his order bump and zero conversions of up cell one. So I said, okay, right there, I know I can help you tremendously. So I already know you're under water because you're probably paying at least $40 cost per purchase. But I didn't want he was going to give me access to account. But I said, no, until we have a working relationship, I don't want to work, like expand my brain energy on that. But I know I can help you.\n00:28:52 - Tina Marie (profitdriversinc.com)\nSo how where is his current lead to coming from?\n00:28:57 - Maria Gudelis (Maria Gudelis)\nIt's a new funnel. So paid traffic, Facebook ads.\n00:29:00 - Tina Marie (profitdriversinc.com)\nOkay. And what's, what's he paying? What's he getting? How many eyeballs are seeing it?\n00:29:08 - Maria Gudelis (Maria Gudelis)\nWell, I don't know.\n00:29:09 - Tina Marie (profitdriversinc.com)\nThat's what I mean. I didn't want to look at his eyes. Okay. Okay.\n00:29:11 - Maria Gudelis (Maria Gudelis)\nYou don't know about it. Yeah. Yeah. Um, basically in the last, like, I think Monty had like 29 buyers. oh, he said he was spending 15, uh, I guess Vinny's deal with he does with people. He was spending 15, uh, $50 a day. And he's been running it for about six weeks. He said, these are all like, what happened, which I thought was kind of . But I'm not going to go into detail, slam, anyone or anything. But, um, because there's always two stories to it. Um, there was a slack channel that Vinny had with his clients that had all these numbers on it. And, uh, Vinny closed the slack account down. So, all that was gone. But still, that's up to him as the entrepreneur that he should have had a Google Sheet that showed weekly ad spend weekly So he also didn't know what he doesn't know, but he really, ideally the outcome is make this profitable, use it as a once he kind of feels he has it dialed in and knows doing like maybe launch other low ticket offers. Right now it's, you know, $7 offer. And he's got a lot of bombs and all that that I'd have to totally redo because they're not working. To a $3,500. I take it. Take it with more coaching. So, so the outcome desired is simply. Yeah, make a profit with the little take a funnel right. Yeah. Yeah. Yeah, that that includes paying for me but I'm not going to say that in the document here. Oh, yeah.\n00:30:57 - Tina Marie (profitdriversinc.com)\nlet's do some quick math. which I shouldn't, I mean, basically, 5,000, 100 hours, hold on, let me do that. I thought, no, that's right. So roughly, if we were going to keep your EHR at 500, we'll, we'll make it 250, because 250 is still better than you've been doing, right? if you worked 20 hours a month for roughly five hours a week, that's roughly an hour a day. So that's I'm not saying that that's what you should do. And I don't think that you're necessarily in a situation to do that. I think you can do much better. And I think that even if you spend two hours a day for him every day, which would be 10 hours a week, which would make your effective hourly rate about $50, hold on a second, that's 5 out of 40, $125 an hour. So if you worked two hours a day, every pre-day of the week, your EHR would be about $125 an hour, which is still not bad. And I think that this is a process that you should do on a regular basis, just to kind of have an idea before you say yes, no to anything, whatever.\n00:32:13 - Maria Gudelis (Maria Gudelis)\nAnd also it helps create the kind of scope.\n00:32:17 - Tina Marie (profitdriversinc.com)\nin the two hours a day, there's a lot that you could do. There's a lot of research, there's a lot of copywriting, there's reporting time, there's all kinds of things that would go into. One of the things I always do for my clients, which very few people do for them, is I set up something for them and then make them owners. So I used to use base camp. Now I'm using Trello because base camp is more expensive and it's more convoluted than it used to be. And Trello is still very simple. It's just camben boards and I can invite them and then I can make them owner, where you can't do that with base camp. You can't somebody to an admin owner whatever. But that way, because you want to teach them, and this is a gift that you're giving them. to own their reporting, own their data, own their stuff, no matter who they work for. So a lot of people, and this is again kind of my leadership style and what I give to them is I teach them, delegate, don't abdicate, but most people abdicate. They say, they think, I give you my money, this is your responsibility now, no, because they don't care about your business like you do, they don't, you know, all that, anyway. So, so keeping all of these in mind, one of the things I would do is, let's say, and I would write this down, and I can, I can take some bottom notes too, but I would start with one of the things I'm going to do for you is create a project management suite there. So it's going to be a Trello board where we're going to track all of the things that are going to get done, and I'm going to task by everything so that you will be able to see what I'm doing, when it's due, or whatever is doing, if we end up hiring somebody to do something, and you will be be able to see everything that happens as it happens and you'll have a record of it moving forward. So if you want to duplicate this across another one of your products, you'll have the project mapped out that you could find what's usable and duplicated to the next one. So this is an asset I'm creating for you that you'll be able to use again and again. Because now you're value-stacking, right? not like I'm just not just getting you the money that you want. I'm creating assets and value that are going to have compounding benefits for you. But the other part of that is now you've got something that shows your work and keeps people from breathing down your neck. Well yeah but Maria didn't get me the results, I didn't get the sales, I wanted whatever. Okay well you can see Maria strategically went down through the list and your offer still didn't convert. know that because you can't make everything convert well whatever. There's a lot that goes into that. Anyway, so the next thing I would do, but I would have done this before coming into it since your job is conversion, I would have looked at the ads. And I would have looked at the ad account because just even though you know the conversion rate, you don't know how bad or good the ads are. Like if they're really good ads and he's spending $50 a day and can only get that, that's a red flag, that's an issue, that means you're going to have an uphill battle.\n00:35:27 - Maria Gudelis (Maria Gudelis)\nNo, no, because because he doesn't have his funnel done, it's only front end funnel at seven bucks.\n00:35:33 - Tina Marie (profitdriversinc.com)\nWell, yes, so that's an additional part, but if you have a hard time getting even front end sales with $50 a day, then that would be a concern that I would have, but if it was a really good ad, I doubt that that's the case, but I would have wanted at least that much information before I said yes for sure, like, at least show me one of your ads, so I know and look at it and go, yeah. There's so much opportunity.\n00:36:01 - Maria Gudelis (Maria Gudelis)\nYeah, he was willing to put me on the ad account, but I just, and also I've worked with him before.\n00:36:04 - Tina Marie (profitdriversinc.com)\nHe is good at ads. almost hired him a while ago for a client for ads.\n00:36:07 - Maria Gudelis (Maria Gudelis)\nLike he's, so no, I think the ads are performing because for him to get seven percent conversion on 50 bucks a day on the fact that the funnel doesn't have any conversions on the order and no conversion upsell one. Like to me, there's so much opportunity there and just optimizing the funnel.\n00:36:25 - Tina Marie (profitdriversinc.com)\nSo, um, if you did one of your calculators and put in two order bumps, like, um, just next level, right? Do you, so you'd have to know what does he have that he could give in between an offer, um, between the seven and the 3500?\n00:36:46 - Maria Gudelis (Maria Gudelis)\nIs there anything that he sells? Yeah, that's my job to figure out because he does have stuff and he gave me access to his whole drive to look at it. I said, look, we just need to create for you like a 297 product or a thousand dollar product.\n00:36:59 - Tina Marie (profitdriversinc.com)\nHow much did that, would you, have to do.\n00:37:01 - Maria Gudelis (Maria Gudelis)\nWell, I don't have to create it, but what I'll do is probably will take me only hour to look at all of his existing assets, because he even said, honestly, Maria, Vinny had me create three bonuses for this similar product. And one of these bonuses, I think, could be the $297 if I just flush it out more. Nice. So yeah, it's kind of like what I did with Crena. Like, Crena had that $20 funnel, $50 average order value working with me. I increased to like $105 or more average order value. And instead of sending people to her $4,800 thing, I said, we just need to create a $1000 product. Oh, you're, she already had it. She already had it. So I said, we just need to create a decent enough sales page for it. Here's your VSL script for it. I outsourced the power graphics for it. And we also created the payment plan or 12 for 99, 12 months, and people stay in several months, and she's going to get 15%.\n00:37:55 - Tina Marie (profitdriversinc.com)\nSo yeah, your most of your work is getting to done in the beginning. One thing I would require is a 90 day contract because you're going to spend most of your time in the beginning and not in that end. And so you kind of get cheated. And that's the thing that I would say is, okay, 5000 a month, this is a target, but it has to be a 90 day. And I would tell him because I'm going to work extra hard in the beginning. And so if you cut me out of because you're going to have to do the research, do the strategy, write the copy, create the ads, do the targeting, manage the ads, tweak the copy and the ads, according to whatever happens, create the nurturing sequence or the ascension or any of any of the follow up sequence. is in order to get people from opt-in to buying and then buying to upsell and so on until they've exhausted all of that. You know you're going to look at his email deliverability because you're not going to want him using email and then you're not touching it. I imagine you would anyway, I can't imagine you're not taking a peek at that and making a suggestion, right? So your mental energy is going there. there's probably going to be some graphics that need to be created in order to support the ad campaign, the landing pages, things like that. And the sequences, now we're talking about automations to an extent. It may be minor and it may be just people consider that part of the job, but it's still your knowledge and expertise.\n00:39:54 - Maria Gudelis (Maria Gudelis)\nThis is a lot that's happening.\n00:39:56 - Tina Marie (profitdriversinc.com)\nYeah. So technically you're doing like three people's jobs. So well, four. So the media buyer, the copywriter, the graphic designer, and the automation expert, those are for roles that if you have a decent team, you're going to have those four roles are going to be different people, and you're doing all of it. So the other thing that you might build in is say, okay, if I get you to X point, then I get a performance bonus. And I will have earned it.\n00:40:39 - Maria Gudelis (Maria Gudelis)\nRight. I know my friend Kira, and she's this is how she dealt with student McLaren and another gal that she's now running huge ads for the dinner clients for three years. She started out at 2500 a month plus 10% of ads. And now she's at, I think, 3000 month, the 10% of ads, but she makes 30,000 month for me client. because she grew, she's so good at what she does. Actually, I trained her that, um, you know, she, she got them to be able to profitably scale ads.\n00:41:08 - Tina Marie (profitdriversinc.com)\nSo you need to include that in your pedigree. Yeah, I'm in the notes.\n00:41:15 - Maria Gudelis (Maria Gudelis)\nWhat's her name? Cara. Sure.\n00:41:17 - Tina Marie (profitdriversinc.com)\nShe probably wouldn't want she. No, no, you don't have to tell her name. Yeah, I was gonna say her name. No, I don't like telling people's names. I, I'm not going to do that in myself. I'll describe the company because it just feels not good. You know, I don't want people talking about my business. My business is my business and I don't do other people. Um, but, but I want you to tell that story. So Cara, I'm going to put this in a highlight as a task that add that to your thing that you train somebody that does this. Like that's part of your pedigree.\n00:41:47 - Maria Gudelis (Maria Gudelis)\nYeah, there's a few, Kimmy is the same. She's making a killing and she was my practice for a few years.\n00:41:53 - Tina Marie (profitdriversinc.com)\nYeah. Yeah. but does she do all of these things that you would be doing or does she?\n00:41:59 - Maria Gudelis (Maria Gudelis)\nNo, she, she, she, She just does the ads because these people have a team, Stu McClellan has a copywriter, he has a copywriter, but what I could do, I could tell them the graphics design cost is out of scope. I could say I know what I want from the graphic design, but I could say that's out of scope, that the cost of outsourcing graphic design elements. And it's not going to be much, but still, know, it could be 100 to 200, don't you think I figure, right?\n00:42:31 - Tina Marie (profitdriversinc.com)\nYeah. It depends on what you need. if you're creating, if you're creating a pretty PDF, that takes a lot more time and energy, even for one of my Filipinos, like I might pay $100 just for that, just for the PDF. But then to get the 3D images and what might be $25. So those parts are not that expensive. But when you, when you are creating a new e-book, the PDF itself targets, it's expensive. So the graphics, not so bad. content that needs to be beautified. That's a little bit more expensive.\n00:43:09 - Maria Gudelis (Maria Gudelis)\nBeautiful. Yeah, because the book's not really beautified.\n00:43:17 - Tina Marie (profitdriversinc.com)\nNo, but in the presentation matters. Like if I give you a piece of chocolate cake, have I told you this example before? No, tell me.\n00:43:29 - Maria Gudelis (Maria Gudelis)\nIf I give you a brand new company, Tina, I'll talk to you girl.\n00:43:33 - Tina Marie (profitdriversinc.com)\nAnd I actually learned this in terms about presenting the gospel.\n00:43:38 - Maria Gudelis (Maria Gudelis)\nIt was funny, but it has universal applications.\n00:43:43 - Tina Marie (profitdriversinc.com)\nPresentation matters. So if you see me go cut a slice of a beautiful bakery cake, and I put it on a lovely elegant plate and hand it to you with a fork and a napkin, you know, that's one presentation. Now if I throw it on a paper plate, give it to you with a plastic fork. That's another level, but it feels a little bit different. It feels more elegant when you give it to me with all of that, you know, and it feels special. And but then if you give it to me on a paper plate with a fork, I'm just like, it's delicious, dig in, you know, I'm still here. Now, if you scoop it out with your hand and you put it in my hand, I'm like, I don't think I want it. And if you take tape cake and you throw it on the floor and then you pick it up and give it to me, I'm like, you crazy, go away. Right. it's the same. If you eat it other than the dirty part, it's the same, but how you present it matters. So our content, especially when you're talking about like ADHD, executive dysfunction, and also just depression and anxiety, based on color psychology, we know that colors have energy and they evoke emotion. So if you've just got a plain ugly thing, the emotion, you're not, you're not optimizing the emotion. But if you can create it in colors that create warmth and trust, so like blues and yellows and greens and oranges, that's why. If you look at the biggest brands, almost all of them use blue. Look everywhere. Any kind of thing. There is blue. Google uses it. You go look in your bathroom, go look at the biggest brand names that you buy. There is blue all over them. Because blue is trust. So green is travel, oranges, action, black is luxury, red is luxury also. But anyway, all these kinds of things, yellow is calming, but also trust. blue and yellow are used a lot. Anyway, but then if you like, if you have large chunks of text and it's small text versus the parallax type of design, right, and images. broken up through here so that the eye flows left to right and it's not glorious because or let's say they want to go back to a piece of content and they lost their place for a second and now they got to go through this chunk of text but but that chunk of text they wanted was right next to this particular image and they can find it easy. Most people aren't thinking about this the mental effort that people have to go through to consume their content. Yeah this makes a big impact because how can they be raving fans if they never consumed your stuff. So anyway this is something that again you you can just bring to the mix and you make beautiful images and you do this naturally but most people don't.\n00:46:45 - Maria Gudelis (Maria Gudelis)\nYou know it's true whenever I've hired someone to help with graphic design Tina I'm just like oh you really suck at colors.\n00:46:53 - Tina Marie (profitdriversinc.com)\nI can do this better.\n00:46:55 - Maria Gudelis (Maria Gudelis)\nYeah like like like that's what I'd say to people like Sally lover and she's been a client of mine for for 15 years in customer mind. Cara, by the way, too, she was one of my first testimonials 10, 12 years ago. you know, now she's doing rocking, rocking it. yeah, when they put stuff together, I'm just like, oh, that's like, come on, girl, let's fix this up.\n00:47:18 - Tina Marie (profitdriversinc.com)\nYou have so much to bring to the table.\n00:47:19 - Maria Gudelis (Maria Gudelis)\nSorry. I know, I know I'm excited about that. So, so, yeah, okay. So, so, so I've got a lot in here. This is a lot of stuff in here. Um, do you want to just want to lock it down?\n00:47:30 - Tina Marie (profitdriversinc.com)\nI am here for whatever and you can tap me down. I get excited about everything. I'm the same way in Sunday school.\n00:47:37 - Maria Gudelis (Maria Gudelis)\nSo you can just be like, Tino can wait.\n00:47:40 - Tina Marie (profitdriversinc.com)\nSo, should I include the longterm outcome or no, that you said, I do. So, but I break things up and stages. So I'll give the full vision because I want them to see that I can see this and I want to get excited about it. And if I like working with them, I want to stay with them. So I'm going to draw the whole picture out. But I won't scare them with a commitment of, you know, you don't have to we don't have to do all that together. I can start with just this, but I want you to see that this is what I see that we could be working on.\n00:48:14 - Maria Gudelis (Maria Gudelis)\nSo, so, so how do I quantify or say the full vision? just said, you know, Brooke is there. So yeah, actually I'm like coach certified by her lover. And I think she scaled too fast, though. And I know she's having some issues. But he said that that's I just love her thought model. I love what she does for people, helping them be better you and stuff. And that's what I eventually want to be in. He has, I noticed in some of this stuff in his book that I started reading, he has talked about high performance like himself. This is his first email that sucks, by the way, but this is the book. And you're right, the, the, the, this is not bad top of heart. I got my attention, I saw that. But he definitely is kind of talking about himself as more of a peak performance person, how to approach your business, save my life. I think I save yours too. We talked about how he almost died because he was a mathematics and a dealer. So I've only read the first quarter of it last night and it was interesting. It did hook me. But yeah, I think he could make this better. This is because I think it was on Amazon. think it's kind of like this because it was a written book as well.\n00:49:21 - Tina Marie (profitdriversinc.com)\nAnyway, what I would do too and what I want to do with everybody that I work with where I'm any kind of operator is I need to know what the values are but I need to know the overarching value. What is the most important thing? So why does he want to be like Tony Robbins? Does he want to be hero worshiped or does he want to help as many people as he can? Now, he's not going to tell you he wants to be hero worship. Your job is to pay attention then to figure out if he's congruent or not. And here's what you need to understand also if he was a meth addict, he has an addictive personality. Addicted personality means he needs that dopamine hit and he can get that from hero worship. So those are red flags that you have to watch out for is that they need a drug and that can get in the way and that can cause them to sabotage business. So you don't have to fix all that you just need to be aware of it and so but but what you can start with so look at that and you know there's love that he is feeding off the energy that is his drug and it's okay because we all have our stuff but you just you just want to know that you understand why he's all over the but board is because he's chasing dopamine he's chasing his hit. So if you can in managing the business provide the hits. right? Then then he's going to be happy. Whether he can speak it or not, what he needs is to feel feel that that energy coming back to him. So if we could go back to your document?\n00:51:17 - Maria Gudelis (Maria Gudelis)\nYep. I just lay that down chasing dopamine.\n00:51:20 - Tina Marie (profitdriversinc.com)\nYeah. Yeah.\n00:51:21 - Maria Gudelis (Maria Gudelis)\nAll right. There it is.\n00:51:23 - Tina Marie (profitdriversinc.com)\nYeah. Okay. So, um, there is like, what did Tony Robbins do before he became Tony Robbins? then the Tony Robbins we know now is not the Tony Robbins we knew 10 years ago, 20 years ago, whatever. Now he's doing stuff with his wife and leading women. And so one of the things you want to do is put things in perspective as to where he has now, where he was five years ago, where he wants to be. And to know that there is a pace that you can influence.\n00:51:54 - Maria Gudelis (Maria Gudelis)\nif you try to force it, you're going to break things.\n00:51:57 - Tina Marie (profitdriversinc.com)\nYeah. So this is why I talk about sustain up growth. And people that are that have addictive personalities, which I would say that I do, but I've worked on that a long time and didn't very conscious of it. So I didn't make me get a crowding it.\n00:52:14 - Maria Gudelis (Maria Gudelis)\nWas that me too probably as well?\n00:52:16 - Tina Marie (profitdriversinc.com)\nYeah.\n00:52:19 - Maria Gudelis (Maria Gudelis)\nthat me?\n00:52:19 - Tina Marie (profitdriversinc.com)\nkind of lost my train of thought. But anyway, it was that they'll sabotage things by if they're not filling what they need to do. So you kind of need to help crowd them. And so chunking things out so full vision is just kind of building out what the process is. So we could say, okay, you're here. Here's where you want to be, you know, Tony Robbins level. So one of the things that I would ask him, which is way beyond the scope of support, but it will help you knock this out of the park. If you want to. Um, would be, what is it about Tony Robbins and Brooke that you specifically want to have? Is there anything about them that you're not interested in having in their business? And I would describe, I would have them describe, you know, what does that day look like? does that, that year look like the year in the life of, um, grants?\n00:53:24 - Maria Gudelis (Maria Gudelis)\nSo, Tony, do me ask him that messenger right now?\n00:53:27 - Tina Marie (profitdriversinc.com)\nNot yet. I'll send you these notes so you can go do that later. Um, so then you could say, all right. Well, we know that we can't get there by the end of this year, but maybe we could get there in the end of five years. But in the meantime, you need this to be profitable. And then you want to build out the next offer and the next offer, right? So, we would say the first, you know, six to nine months, our job is to build out, um, is to optimize. This particular offer and do it so well that when you get to creating the next offer that we've got the system down and we can basically replicate it for your next offer. So you're priming him to and that's in a sum to close. We're going to be working together nine months from now. If you want it, right? And that's not manipulation. It's just what I've noticed after the fact. I always operated like that. And then somebody told me, I like your sons of clothes. I'm like, what? What is that? I didn't know. It wasn't a technique. It was just me being me.\n00:54:36 - Maria Gudelis (Maria Gudelis)\nI was just like, well, of course, like, why would I not think about it that way?\n00:54:40 - Tina Marie (profitdriversinc.com)\nSo basically six, nine months build out this offer to profits and do it so well, we'll replicate it for other niches you mentioned productivity relationships. Yes, but immediately after you say that, you're going go now, don't think that I mean it's going to take nine months to profit. I mean that we've matured it to the point that we can now replicate it to the next product. So now you break out the timeline for making this profitable. So me knowing you, I think within the next 30 days, you will have mapped out two order bumps, created the sales pages, landing pages, and ads, whatever necessary for those order bumps.\n00:55:34 - Maria Gudelis (Maria Gudelis)\nOne order bump and then optimize, just because I don't know if go high level has the ability to order bumps.\n00:55:40 - Tina Marie (profitdriversinc.com)\nSo I don't want to get into technology. Okay. So, yeah, that's a technical language as to how it works, but you know what I mean? think is really what we call it differently. order bump, cell one, there we go, which I always think is not about just dropping the price. Hey, if you didn't like it, that price, here's another one, because that sounds out of integrity. But if you didn't like that, here's a smaller version of it at a lower price. Anyway, so in 30 days, all of that should be mapped out and live. Now, they might balk and think that that's not fast enough. But there's a lot that goes into getting that done correctly. And he's going to have to create more ourselves. So we want to make sure that that happens. 30 to 60 days, then, from day 30 to day 60, is we're observing and potentially, by the way, at the end of 30 days, also having a split test mapped out for headlines or call to action or price, but not all of the above for each of the things that we have going on. So one split test. for every landing page mapped out an on deck for live by the end of 30 days. That's a total agency because everything you're telling me now if I had you five years ago we'd be 50 million a year. I did actually and incredibly fast. It's Arthur Tubman and yeah and and then he ruined it by overselling and pissed me off and I quit and then he got a divorce and yeah and he was also a drug addict. Got it. Recovering. Yeah I do know what I'm doing actually. Yeah I'm scaling agencies but but I also know they're the biggest reason I have most of the guardrails I have is because this is a very difficult model and the clients that you take are make or break because most of them are high pressure and if you get these people who have these arbitrary goals and they're They throw a ton of money at an agency and the agency says yes when they shouldn't have because the client was out of integrity Trying to 10x and it just destroys everybody along the way And yeah, okay, so can we scroll back down when you're when you're ready? Okay, so matter of fact, I have phases mapped out I don't even remember what they are, but I know what I would make and I have all these phases for growing the agency But day 30 to 60 is just monitoring optimization and it's more split testing Split testing the abs again headlines call to action and images Sometimes price point kind of just depends on what's happening but Um The thing about split tests, which I know you know is that you have to have a certain amount of conversions before you can declare a winner, so that requires the amount of volume to be happening. And so people will be like, well, okay, did it win or did it not win? You can't force the declaration of a winning split test until you have volume period, because you want to be confident that you know, and it takes roughly 100 conversions to have some certainty. And that depends on how big the gap is anyway, on the split test. Today 30 to day 60 is optimizing and seeing how it's doing. And it's also getting some customer feedback. And it's filling the holes. So something probably got missed, maybe on an automation level, maybe a pixels not firing, maybe the data is not reporting correctly. But it's fixing anything that got broken during the first phase of 30 days, while we were building something always goes wrong, it needs to be fixed and handled and that takes time.\n01:00:03 - Maria Gudelis (Maria Gudelis)\nOne thing is that if Karina, that's working really well, mean put this as a post and nothing held back as just value add. The VA, I told her to hire from online jobs.ph, I told her to look at hiring someone with higher IQ because we're service and so this person is not a setter that calls to like, what could call the person was just simply texting and messaging the buyers to, hey, did you get your purchase? I gave you simple process of that, because of that good will or good karma, then those people are more likely to buy other stuff from that map. Then what she also did, because we've been running ads for so long, went back to all the old ads, the actual posts, like within the Facebook ads ID, the actual posts, because she messaged the VA, messaged every single person commenting, hey, just wondering if you're still looking for this did you get value from this did you and then from that that increased like she's making about 10k now a month in sales organically for that for an $800 person and but the reason why we had that asset she's running ads for two years right and so you should put that in 60 in the 60 to 90 days slot so coffee shop millionaire how to click bank penalizes you when you have too high of household and so they got penalized big time and all that I implemented was zendesque and an FAQ section and we dropped it down to less than 2%.\n01:01:40 - Tina Marie (profitdriversinc.com)\n38 reduction in refunds by having good customer support so yours is actually proactive support rather than reactive right and in that went to there's a saying in sports that the best off best defense is a good offense you don't even need a defense, if your offense is so good that you're always on their side of the field and not on yours, right? So what you did was you had a great offense, right? You're going out so hard that you're actually converting them to the next level of sales. There doesn't even come up an issue of customer support.\n01:02:16 - Maria Gudelis (Maria Gudelis)\nThis just happens probably in the same conversation. You don't think we can add an FAQ section like in between day 30 to 60?\n01:02:25 - Tina Marie (profitdriversinc.com)\nI don't think you should. I think the whole point of creating this scope is not overdoing it. This is a lot of mental work. They, oh, yeah, they zero to 30. Sorry, 30 to 60. You could be starting to do this. Yes. But you, maybe you have the VA do it. So if you do out of scope of support is outsourced VA, then you delegate the VA to start capturing frequently asked questions. As long as you're not doing it, that's okay.\n01:03:01 - Maria Gudelis (Maria Gudelis)\nSo, here, start capturing.\n01:03:04 - Tina Marie (profitdriversinc.com)\nNo, 60 to 90, not 0 to 30, or I mean 30 to 60, 30 to 60 is okay, but not before that. I'd probably have that more at 60 to 90 because we don't want to overwork your brain. There's a lot of data to process in 0 to 30 and 30 to 60. Less than 30 to 60, but now 60 to 90, to me, that's optimization, which FAQs and customer support to me is in the optimization realm, but it could be considered fulfillment. So 60 to 90, I mean 30 to 60, it could be in there. It depends on what you want to do and how zealous you feel about it.\n01:03:53 - Maria Gudelis (Maria Gudelis)\nI was thinking it was my funnel. I would want to start maybe in a section.\n01:03:59 - Tina Marie (profitdriversinc.com)\nYes. And I. I like the golden rule methodology of things.\n01:04:02 - Maria Gudelis (Maria Gudelis)\nIf I were doing it, if it was my business, this is what I would do. How about refine?\n01:04:08 - Tina Marie (profitdriversinc.com)\nYes. So that is an ongoing process. It should always continue to be refined. And also, what I would be doing in that portion is looking at how do we use AI to improve it?\n01:04:21 - Maria Gudelis (Maria Gudelis)\nCool.\n01:04:25 - Tina Marie (profitdriversinc.com)\nAnd as far as you going, any services that you offer, knowing what is AI tools and staying on top of that technology to know what can be used to scrape and automate those questions, and because it has the ability to say, somebody asked this question, and this verbiage is different, but it's pretty much the same question. So I'm going to count that as a number. That didn't exist a few years ago, and it does now, so we could create. Additionally, building in here a chatbot for sales and support, 60 to 90 days, or you know now we're getting into phase two of just kind of optimizing and growing scale.\n01:05:16 - Maria Gudelis (Maria Gudelis)\nAny eye chatbot?\n01:05:19 - Tina Marie (profitdriversinc.com)\nYeah.\n01:05:20 - Maria Gudelis (Maria Gudelis)\nBut that's out of scope of the 5000 month, isn't it?\n01:05:24 - Tina Marie (profitdriversinc.com)\nYes, so that could be the next 90 days. And you could say, now this is above and beyond creating and optimization, but this is optimized in scale. first 90 days is create, establish and grow. And second 90 days could be like grow and optimize, optimize, grow, whatever. And then I don't even know you want to put grip, but the third phase is just maintenance and scale. scaling, which seems like they're not the same thing, but when people neglect maintenance and they focus on scaling, then there's problems.\n01:06:11 - Maria Gudelis (Maria Gudelis)\nSo, so we try to, day zero 30 is phase one, optimize and grow?\n01:06:16 - Tina Marie (profitdriversinc.com)\nNope, day, phase one is 90 days. So that's why the whole point of the long term view, like we have six to nine months. Six to nine months allows for the three phases. the first phase is just really creation. The second phase is optimization and the third phase is scaling. And the third phase is the third 90 days.\n01:06:49 - Maria Gudelis (Maria Gudelis)\nSo, day 90 to like next 90 days. Yeah. Phase two.\n01:07:01 - Tina Marie (profitdriversinc.com)\nYes.\n01:07:04 - Maria Gudelis (Maria Gudelis)\nIs it you just call it optimization or scale?\n01:07:08 - Tina Marie (profitdriversinc.com)\nOptimizing and preparation for scale. Prepare for So the first thing that you do is look at, you know, maintaining anything from phase one, anything created in phase one. And then now you're going to look for what are...\n01:07:44 - Maria Gudelis (Maria Gudelis)\nHold on. Let me just hit pause for second. a comment here, but it's one.\n01:07:47 - Tina Marie (profitdriversinc.com)\nI'll hear you.\n01:07:48 - Maria Gudelis (Maria Gudelis)\nI got about 20 more minutes. But this is for them.\n01:08:00 - Tina Marie (profitdriversinc.com)\nlike what you're we could so many days we'll average I'm excited because I have so much stuff in my brain that I would love to teach and love to get well to use but I won't do it by myself Maria so yeah you're capturing a lot of stuff yeah sorry yeah we can sell this as a consulting kit because everyone wants to start an agency make a current revenue can go high level like this we could totally certified people in this and sell it and we've got the notes from every call okay so phase two is we're maintaining everything that was created in in phase one including the split test process right in the customer support process but most of what phase two is it's continuing to optimize right so understanding our split test results and improving them but the other thing is before we get to scale is where have we left money on the table is there a compliment Mentory or supplementary offer we didn't put out there that we should have that we're getting the feedback from our customers Right so if somebody through the FAQ is in the customer support I said, you know what I have this knowledge this gap this gap in knowledge And it's not being addressed here. How do I get this addressed or? I want more hand-holding. How do I get more hand-holding? or Okay, well you taught me how to do all of these things, but I don't know how to outsource it You're not teaching me how to outsource it. Can you teach me how to outsource? now we create an outsourcing product. So the next 90 days is learning from our customers what we could do better and How do we increase the lifetime value of the customer and but also the average order value? You So, that's it, that's it, that's it, it's just massage everything and make it as good as we can. Phase three is scale and it's, you need to look at the pace of scale and the cost of scale. Is that your mama?\n01:10:33 - Maria Gudelis (Maria Gudelis)\nAmanda.\n01:10:34 - Tina Marie (profitdriversinc.com)\nI should just cut back. Okay. Tell me about Amanda. Yes, bye. Yeah. Anyway, so I saw you smiling in the earbuds or so. Anyway. Um, so scale is first, you have to create the strategy for scale. Right. So that's a long discussion. That's not a one off conversation. That's not a one off meeting. That's a whole process. And here's why you doing everything in Trello for them is so important, is because you will have kind of an inventory of what it took to get to where you're doing and what it's taking to manage the current business, right? So you know how many people it takes to fulfill, and hopefully by phase two we've learned how to fulfill well what we're currently fulfilling. So if we were to two X thoughts or three or four X that, what would it take in fulfillment and who's running it and who's leaning it and who's managing it? So how much high-level mental power and energy and leadership is that taking? And can we do that with the existing people? Can we two X with our existing team? Can we four X with our existing team if we can, then we just go through that process. Keeping in mind and making sure that our content. I understand that you can't just go, especially with Facebook and I don't know about other platforms, but especially with Facebook, you can't just go double your ad spend and they double you get a lot of the times that backfires you immediately your ad spend and all of a sudden you're losing the leads that you get it makes zero sense, but I've seen it happen repeatedly.\n01:12:22 - Maria Gudelis (Maria Gudelis)\nYeah, I think this one is more look at other profit sources as well.\n01:12:28 - Tina Marie (profitdriversinc.com)\nYes, but that's really to me that was happening in phase two.\n01:12:32 - Maria Gudelis (Maria Gudelis)\nPhase two, oh, okay, but no, yeah, I mean, maybe, no, no, no, okay, so phase two, we need to profit sources.\n01:12:41 - Tina Marie (profitdriversinc.com)\nwas thinking about this right complimentary products that were missing, but you're talking about channels.\n01:12:46 - Maria Gudelis (Maria Gudelis)\nNo, no hidden money. Yeah, I was thinking about complimentary products, but scale here is like expand other marketing channels.\n01:12:55 - Tina Marie (profitdriversinc.com)\nYeah, add channels. Okay, got it.\n01:12:57 - Maria Gudelis (Maria Gudelis)\nYeah, I totally agree with that.\n01:12:59 - Tina Marie (profitdriversinc.com)\nYeah, okay. So how can we replicate our marketing across channels? You know what, if we map this out really well, and then we go get Maui or somebody to make this into a beautiful PDF or slideshows, and then you're presenting this to your clients. Oh my gosh, like a pitch deck. Girl, kind of like just close it.\n01:13:32 - Maria Gudelis (Maria Gudelis)\nOh, yeah, like, because, you know, ages ago, when I worked as a strategy, chief strategy person for the, we see what's her name, Emily Hirsch. I actually created for her because she just had a document like that. I said, you know, if you want to close more clients, because I learned that from work for the big consulting firms, we need graphics, right? So we would, I'm just showing you, we would make of these kind of sales projection graphics. See that within sense, they send conversions. And then we would make, let's see.\n01:14:10 - Tina Marie (profitdriversinc.com)\nI know what I want now. What do you want? I want to work in companies like you with you. All the things that I've been doing. I want you to be the CMO. I want to be the COO. But I just want to have the teams. only want to have one or two meetings a week.\n01:14:25 - Maria Gudelis (Maria Gudelis)\nEverybody do their stuff.\n01:14:26 - Tina Marie (profitdriversinc.com)\nBut I love using my brain.\n01:14:29 - Maria Gudelis (Maria Gudelis)\nYeah. So I created this on paper and then I hired someone on fiber to put it in digital format. But like, so we could mimic this because it's so beautiful. Mimic this with what you just talked about. Yes. Three phases.\n01:14:48 - Tina Marie (profitdriversinc.com)\nOh, we are magic together.\n01:14:51 - Maria Gudelis (Maria Gudelis)\nWe are. thing is, he's expecting the proposal today, though. So I think I need to give it to him word format, just so he has it because I told him I'd give it to him. And he really wants to know what's out of scope. But I think I have enough from you right now, but I agree.\n01:15:03 - Tina Marie (profitdriversinc.com)\nI think eventually we make a pitch deck like this That's what this is right.\n01:15:07 - Maria Gudelis (Maria Gudelis)\nYeah, this is actually the guy that does the guy her Lee So let's use the guy that on the MacGyver show. He's the writer for MacGyver. That's amazing. This guy.\n01:15:17 - Tina Marie (profitdriversinc.com)\nYeah, yeah Here's what I think I know you have to go in a few minutes if you close this guy Yes, then and I'm happy to spend any of our time during the week just helping you Mm-hmm. you don't need help But if we can speed it up so that we can get to some of this stuff together then then again I'm always looking out for me. I'll be honest But what I would love then to do is is take what's happening there because so You know how to go make all the money But what you can see is a light outline the operation and it immediately comes out of my brain like it doesn't take any time Next step, next step, next step, I can go hire the people, I can bring them in, train, insert, whatever. But anyway, if we take all of this stuff in our, in whatever free time is available, and now you've got enough money and you'll be okay, then let's go pitch a client or two max. But they got to be doing 50,000, I would rather see them doing 100,000 a month with roughly 40% profit margins, and they want a COO and a CMO who work together, who will take everything top to bottom and execute it. And we put out killer, like we just put out a few skills that show what we do, and we just wait until somebody takes us up on it, because your money's coming in enough, mine's coming in enough, and we'll wait until the perfect match comes in, and then we get to play together and build this, and then get testimonials from that. So it's a slow pace, but it means we're not For you mean or replicate to other nope, so I call it face so face three and beyond The face three and you're kind of always in face three every product or Like I don't know what you would call it offer every Product offer type Once you get to phase three, is no additional phase. That's it's to infinity because that's scale Unless base four would be selling mean exit the business.\n01:18:34 - Maria Gudelis (Maria Gudelis)\nmean yes, God, got Well, did you say before like what was initially face three and Replicate based on it's just scaling and until you can't scale anymore or you want to sell and exit So for for this, that's it For one product market offer type whatever that's this is it It's just continuing\n01:19:00 - Tina Marie (profitdriversinc.com)\nno optimization, sell the offer, sell the business, it both they're there, they can be separate because sometimes, you know, you, you can sell something off piece by piece. So, but then, so what I would do beyond this is go, um, uh, so that's step one of getting towards the Brooke business, right? After phase three, step two, so this is not a phase, but this is, this is a step on the mission, right? Um, um, is launch the next product. And I don't know how that fits into her model, because I don't know anything about her.\n01:19:41 - Maria Gudelis (Maria Gudelis)\nDoes she have all these different types of products? Does have now and she has lot of coaches underneath her and stuff, so she has a 25 case certification, but she stopped it all that. I won't go into detail now because I think I'm ready to send this to him because I know he's expecting it. Um, I have to go for massage and\n01:20:00 - Tina Marie (profitdriversinc.com)\nlike 20 minutes.\n01:20:01 - Maria Gudelis (Maria Gudelis)\nterrible. I know, yeah. So, so, but, um, so in scope, I can just keep us assets. creating for you assets.\n01:20:14 - Tina Marie (profitdriversinc.com)\nI really like bullets too.\n01:20:16 - Maria Gudelis (Maria Gudelis)\nI think bullets just help the eyes. My problem is that I don't know Google sheets that well, so you want to do bullets to ads?\n01:20:23 - Tina Marie (profitdriversinc.com)\nYeah, so it's just line breaks and then highlighting it. What do you mean? Let's do this under assets. Yeah, essentially. I was gonna say, if you could share it, I'll just do it for you real quick. But, um, okay.\n01:20:40 - Maria Gudelis (Maria Gudelis)\nI'm happy to help. It is. Copy link.\n01:20:49 - Tina Marie (profitdriversinc.com)\nOh, um, can you do T net profit drivers? That's my main. That's what I'm always in.\n01:20:55 - Maria Gudelis (Maria Gudelis)\nEither one without profit drivers.\n01:20:57 - Tina Marie (profitdriversinc.com)\nI'll leave them. Actually, I'll leave them both of them, but, okay.\n01:21:01 - Maria Gudelis (Maria Gudelis)\nAnd then I could also put the link in the chat.\n01:21:04 - Tina Marie (profitdriversinc.com)\nThat's probably fast. Then I'll go do it super quick. Okay. That way it helps with this eyeballs and, um, okay. So where are we at?\n01:21:12 - Maria Gudelis (Maria Gudelis)\nUh, right. Then I can see what you're doing too.\n01:21:14 - Tina Marie (profitdriversinc.com)\nBecause I. Should be able to work. Okay. if that doesn't work, here's what we do. We just go up here. There.\n01:21:26 - Maria Gudelis (Maria Gudelis)\nYeah, I am. I'm seeing what you're doing. I was just like, screw it. either take it into Canva or hire someone to fix it.\n01:21:35 - Tina Marie (profitdriversinc.com)\nYeah. But so that just, and sometimes I will do things like, um, uh, like, I'm not telling you to do this for this one. But anyway, just the little bit of color pop. On things that are really important. Oh, so actually what I would do is do it right here. Oh, shoot.\n01:21:55 - Maria Gudelis (Maria Gudelis)\nThat is not a good color. Sorry.\n01:21:57 - Tina Marie (profitdriversinc.com)\nAmazon color. Yeah. It's just, it's. Just a little bit of yeah. Anyway.\n01:22:03 - Maria Gudelis (Maria Gudelis)\nYeah.\n01:22:06 - Tina Marie (profitdriversinc.com)\nAnything I can do to help energize them immediately and help them focus. And when I'm talking to them, keep them, because everybody's distracted by the phones where you're talking to them, they're looking at all these alerts and notifications or whatever. So if I want them to pay attention to the value I'm bringing and I'm trying to make a sale, or I'm trying to persuade them to say yes and do the thing they need to do, everything I can do to keep their attention focused is for their benefit, but also my clients. I won't drag people. little things to psychologically help them stay focused means that we get there going faster. because I know most entrepreneurs have ADD of some sort or another have focus attention. I'm always trying to be like focus on what I'm having to focus focus. Anyway, I know you got to go.\n01:22:56 - Maria Gudelis (Maria Gudelis)\nI hope this is helpful. This is really helpful. So, so. the rest of document, though, we didn't finish what's out of scope, though, right?\n01:23:04 - Tina Marie (profitdriversinc.com)\nWell, anything beyond this is out of scope. So, um, like, if you want to write a brand new sales letter, are you doing it? Or are you hiring our copywriter?\n01:23:17 - Maria Gudelis (Maria Gudelis)\nUm, well, in the existing funnel of specific upsell one, upsell two, yes, that's in scope.\n01:23:25 - Tina Marie (profitdriversinc.com)\nOkay. that's the type of thing I'm thinking. So like you already put graphics out there, a VA is out of scope. So for like following up with customers, that's out of scope. Customer support is out of scope.\n01:23:40 - Maria Gudelis (Maria Gudelis)\nYeah. Hiring and paying a VA. I want to customer support.\n01:23:46 - Tina Marie (profitdriversinc.com)\nYeah. would include help desk, FAQs, et cetera. Chatbot, is that in scope of support or out of scope of support?\n01:23:58 - Maria Gudelis (Maria Gudelis)\nI think I can help strategize to chatbot.\n01:24:00 - Tina Marie (profitdriversinc.com)\nBut actually creating it, I think that someone else should. So chatbot creation and then in parentheses, I will create the strategy. Somebody else must implement or execute, or that's an additional fee. So like, if you want to do it and manage it, even if you outsource it, you need to be paid for that. Yeah, most contracts are not this detailed.\n01:24:28 - Maria Gudelis (Maria Gudelis)\nI know, yeah.\n01:24:30 - Tina Marie (profitdriversinc.com)\nAnd then something you might put in parentheses is to improve the beautifying, improve customer content consumption, and execution. Maybe parentheses at the end of it.\n01:24:51 - Maria Gudelis (Maria Gudelis)\nWell, or should I just take that out for now? Just graphic design? Yeah, maybe he's really proud of the playbook when I\n01:25:00 - Tina Marie (profitdriversinc.com)\nit's awesome.\n01:25:01 - Maria Gudelis (Maria Gudelis)\nYeah, that's smart.\n01:25:03 - Tina Marie (profitdriversinc.com)\nYeah, yeah, I'll end up later.\n01:25:07 - Maria Gudelis (Maria Gudelis)\nYeah, yeah, yeah, oops.\n01:25:10 - Tina Marie (profitdriversinc.com)\nI like one idea.\n01:25:14 - Maria Gudelis (Maria Gudelis)\nAnything else on a screen?\n01:25:17 - Tina Marie (profitdriversinc.com)\nNo. Well, I mean, um, weekends? Yes.\n01:25:24 - Maria Gudelis (Maria Gudelis)\nOkay, so like I'm not available via text.\n01:25:28 - Tina Marie (profitdriversinc.com)\nI'm not available after this hours unless there's a fire. I always put a fire. So the only thing that, um, a fire is orders are broken and they don't work. But I would still say, um, if you want somebody to fix that type of thing, we have a developer on call.\n01:25:45 - Maria Gudelis (Maria Gudelis)\nI'm not your developer. Yeah. Oh, the list is a fire.\n01:25:52 - Tina Marie (profitdriversinc.com)\nIn which case you're only available for consulting, not operating or something, whatever.\n01:25:56 - Maria Gudelis (Maria Gudelis)\nYou just say unless there's a fire and then elaborate on a call what that is. Yeah, how about you say weekends? I'm not an electrified balance. So there's fire. That's fine. I think that's, um, I was going to say one more thing that I just thought of. It's important. Oh, cost of the ads.\n01:26:13 - Tina Marie (profitdriversinc.com)\nOh, yeah.\n01:26:15 - Maria Gudelis (Maria Gudelis)\nYeah, it's the actual. That's been spent is in your account. On the credit card. I know that's very detailed, but.\n01:26:28 - Tina Marie (profitdriversinc.com)\nI should put my half these pink migraine glasses. I should put them over here because they really do help with I string to.\n01:26:35 - Maria Gudelis (Maria Gudelis)\nI would scope would be a brand new low ticket offer. How about that? A brand new low ticket. Well, as that would be an additional.\n01:26:46 - Tina Marie (profitdriversinc.com)\nSo I would say anything outside of what is on this document is out of scope of support.\n01:27:12 - Maria Gudelis (Maria Gudelis)\nOkay, that's kind of what is on, I would say, what is on this document is out of scope. Oh, sorry.\n01:27:20 - Tina Marie (profitdriversinc.com)\nYou like what? What is on this document? What is on the scope of this document? Because then it's kind of like redundant.\n01:27:29 - Maria Gudelis (Maria Gudelis)\nDo you think I'm sorry what is on this document? Okay.\n01:27:43 - Tina Marie (profitdriversinc.com)\nI would make these bullets. And highlight the required 90 day contract. And I would use the brighter yellow for that one, bold bullet. Okay. Thank\n01:28:00 - Maria Gudelis (Maria Gudelis)\nI was going to take out, if you look at the biggest brands, the moans use blue because he uses blue and his branding, but I think we'll just leave it as optimizing the emotions.\n01:28:10 - Tina Marie (profitdriversinc.com)\nYeah. going to do this really. What the heck?\n01:28:14 - Maria Gudelis (Maria Gudelis)\nYeah. I know. don't.\n01:28:15 - Tina Marie (profitdriversinc.com)\nYeah. That's what I hate Google Docs for. Did you copy and paste anything into here?\n01:28:20 - Maria Gudelis (Maria Gudelis)\nNo.\n01:28:21 - Tina Marie (profitdriversinc.com)\nIt's weird. It's not that bad. Okay. Cool. Um, out of scope and then we'll do, you know, there we go up on do, okay.\n01:28:35 - Maria Gudelis (Maria Gudelis)\nI say contract, but really it's not really contract to say required 90 day commitment.\n01:28:39 - Tina Marie (profitdriversinc.com)\nWhat about? Yeah. There we go. Out of scope. And I would actually make this like, well, that's harsh. Hold on. That's what I'll do. This is. That's. That's. That's. And that.\n01:29:12 - Maria Gudelis (Maria Gudelis)\nGraphics Designer, as far as telling them what to do, because graphics designer, I'm saying the outsourcing graphic designer.\n01:29:23 - Tina Marie (profitdriversinc.com)\nGraphics creation. Because you'll direct what graphics are needed to be creative and not create them yourself.\n01:29:33 - Maria Gudelis (Maria Gudelis)\nDirector, how's that?\n01:29:35 - Tina Marie (profitdriversinc.com)\nOh, yeah.\n01:29:37 - Maria Gudelis (Maria Gudelis)\nGraphics design direction. To increase. I guess I would scope as cost of software is right as well.\n01:29:54 - Tina Marie (profitdriversinc.com)\nYes, for sure.\n01:29:58 - Maria Gudelis (Maria Gudelis)\nI think that sums it up.\n01:29:59 - Tina Marie (profitdriversinc.com)\nYeah. Awesome. I'm excited for you to have that call. can't wait to hear about it. I'll be like, tell me you got the sale, tell me you got the sale, and you get paid before any other conversations happen paid up front, not after the fact upfront.\n01:30:16 - Maria Gudelis (Maria Gudelis)\nYes, yeah, because it's just the stock and the loan gives in the plan.\n01:30:20 - Tina Marie (profitdriversinc.com)\nYeah, and yes, and that has lots of value. Okay, so you're amazing. You\n","contentPreview":"00:00:08 - Maria Gudelis (Maria Gudelis)\nHey, hey.\n00:00:09 - Tina Marie (profitdriversinc.com)\nHey, What's going on? When did I need my name?\n00:00:15 - Maria Gudelis (Maria Gudelis)\nBecause I'm sick...","processedAt":"2025-05-04T03:40:52.478Z"}