{"fileName":"Transcript for Maria & Tina🪄(17).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Maria & Tina🪄(17).txt","type":"transcript","priority":"medium","content":"00:00:01 - Maria Gudelis (Maria Gudelis)\nHey!\n00:00:03 - Tina Marie (profitdriversinc.com)\nHey! so sweet.\n00:00:06 - Maria Gudelis (Maria Gudelis)\nYou look great. Your hair is perfect. Were you doing videos?\n00:00:10 - Tina Marie (profitdriversinc.com)\nNope. This normally what I do. I've just been really exhausted and seminary has disrupted my routine.\n00:00:18 - Maria Gudelis (Maria Gudelis)\nGot it, got it. I'm smoking.\n00:00:22 - Tina Marie (profitdriversinc.com)\nI'm wall-stinging. So dry. Let's talk. Oh, I got, I got a new, you can't see it. Mike. Nope. Oh, because of the virtual background.\n00:00:40 - Maria Gudelis (Maria Gudelis)\nI playing with backgrounds. Oh, nice. Nice, nice, Do you, I got back to everyone. I'm going to follow up the personalized room as well.\n00:00:50 - Tina Marie (profitdriversinc.com)\nMappier commented as well. Do you know him? I know of him. Look, it's a road up. I don't know how good it sounds. it's Yeah. So, It's $100 like the Yeti mic and but it sounds way better. It sounds as good as the Shure SMB 7 or something like that. Yeah, I know I've heard good news. Yeah, but it's USB, not XLR and it doesn't need any and it can plug into your phone and it doesn't need anything.\n00:01:20 - Maria Gudelis (Maria Gudelis)\nNo cloudlifter not phone to yeah.\n00:01:23 - Tina Marie (profitdriversinc.com)\nYeah, so I mean, I like technology. I play around with a lot of things and because one of the things that I want to do is create some recordings that are like, you know, I was talking about some of the like inspirational, but also specifically calming, soothing to get frustrated. sometimes you hear something good that is specifically engineered towards getting us the energy that we want to have in business. Anyway, I think sound quality is important. So. but also I like shopping sometimes. Only online, not in person, do not like in-person shopping. I don't generally like shopping in general, but I do like the new technology thing that I would share that. Okay, so Neil, what I know about him is I got some of his stuff. He does like war reform products and...\n00:02:21 - Maria Gudelis (Maria Gudelis)\nYeah, yeah, I was just checking out his page. Looks like he's got a pretty slick thing for shorts and stuff. But yeah, I think he would be... I don't know that well, but I imagine it'd be a really good client too. think a lot of these people... Yeah, they need the combo. They need the combo. I think it's unique. I think we've hit something and then I think we should also create some kind of low ticket offer that leads into this for them as well.\n00:02:46 - Tina Marie (profitdriversinc.com)\nWho leads into it? Yeah, because I was thinking yesterday about how do we serve people who can't afford this, aren't ready for it. don't know if you heard it. And I thought I left it in the message, but I'm pretty sleepy. So I was saying that it was around the Cory Michelle thing, too.\n00:03:08 - Maria Gudelis (Maria Gudelis)\nI was thinking, I think I did here, yeah, after that.\n00:03:11 - Tina Marie (profitdriversinc.com)\nBut I was like, there are going to be some people who are not ready for the investment. Oh, OK, it was when, because you were talking about 5,000 or 6,000. And I was saying, I think it should be 6,000. And I don't think that we should do less and that it's more about that price will match for the person who's ready for it. Like, this is really targeting a specific type of person. I put the requirements in the document. And that $6,000 should be fine for that person. Now, some people, especially that are already on your list, are or you're going to want to serve them and help them. And so the tendency is, like you were talking about that lady who had a sliding scale. I'm like, sliding scale will modify the offer, so we won't modify the price. So the offer can change, which changes the price, right? So you get a different version. It isn't one-on-one, but what you could have is maybe just the plan, like that it's more generic, and how we would come about the plan. So here's how we would come about the plan. We would ask you all of these questions, and we would look at all of the things that you have. And here's some examples of how we would package things together, right? you can apply this logic to whatever offerings you have. And then this is the business plan, and this is the logic that we use to come up with this business plan. So you can kind of formulate your own based off of what we did as examples. Now, if you want to say, hey, Here's what I came up with is this is a good idea and have vox or access to us. Here is our $200 a month coaching or $400 month code, like whatever the vox or access would be. Yeah. And then, you know, maybe a call a week or two calls a month where you can come in and you could get like hot seat reviews, that type of thing.\n00:05:21 - Maria Gudelis (Maria Gudelis)\nYeah. Um, so it's okay.\n00:05:24 - Tina Marie (profitdriversinc.com)\nWay cheaper. And it's along the same line. So we're staying in our lane, right? And which means that we'll get the testimonials and the referrals that we get will all be concentrated around the offer that we have, which, so all the traction, all the energy that we get, it will all be relative, which means that, that anybody coming to us should be hot and targeted, right?\n00:05:53 - Maria Gudelis (Maria Gudelis)\nYeah, I love that idea. Like I was just going to say, that's sort of a little bit like, um, what do you call it? Alan Sotanic, what I pay 500 a month for, once a week he does a call, he's got the forum, right? But he doesn't do chat support or voxer support, but he's sort of in discord answering some people everywhere as well. And then on his three, four hour calls on Thursdays, you could ask a question. Um, so, so I do like that concept of what you're talking about, like you're thinking, because these people are excited and they don't, um, you call it qualify.\n00:06:39 - Tina Marie (profitdriversinc.com)\nSo what else can we give them? Is that kind of where?\n00:06:41 - Maria Gudelis (Maria Gudelis)\nYes.\n00:06:42 - Tina Marie (profitdriversinc.com)\nAnd I'll tell you what I like about this court is you can do audio recordings and replies and video recording and replies. then it's a, it's a chat and generally the people that are in discord are either active or they're completely negative not which is there's not a bunch of just but they're coming there for a purpose so they're either talking to each other or they're completely out of it because they don't like it and they only go in for you send them email here's the content so this is another option and thing to be because of the clips specifically the audio interaction.\n00:07:22 - Maria Gudelis (Maria Gudelis)\nWell yeah and what's interesting so you know is the discord what Alan does on his $20,000 mess run that I joined last year he will do a loom video for the feedback and he'll just give you the loom link so that's kind of cool as well.\n00:07:45 - Tina Marie (profitdriversinc.com)\nYeah and I would totally be willing to do that too but I don't want to do that for like a $200 offer of 400 or 500 would yeah so what are we really talking about them because like for me and I can just\n00:08:00 - Maria Gudelis (Maria Gudelis)\nopen up Google and we can just start writing because the auditory I won't remember but if I open up Google Doc. So, well actually why don't we do a customer map? What's your customer map? File, we'll make a copy in our position. So, so technically we have like let's just call it high ticket, right? Right? Technically we have this one for the pocket CMO, right?\n00:08:49 - Tina Marie (profitdriversinc.com)\nLet me zoom in bigger. Want me to share this with you as well right now or do I want to wait? That would be great but I'm good with watching you while we do this though.\n00:09:11 - Maria Gudelis (Maria Gudelis)\nI said in the Google background, if you saw that change to 12K in 2025. I love that. Yeah, six people.\n00:09:27 - Tina Marie (profitdriversinc.com)\nThen we have to back that up and do that, and then I think that we could change the 12K also to 12 months and maybe also put in like a call once a quarter or something like that so that the value is stacked a little bit more.\n00:09:47 - Maria Gudelis (Maria Gudelis)\nYeah, so what you're saying, so repeat kind of what you're thinking here, I was thinking like a full on low ticket funnel, but you were saying something else. It's like a lower fee subscription.\n00:10:03 - Tina Marie (profitdriversinc.com)\nSo I was saying, like, and I wouldn't really want to offer this until after we've done a couple of these because it would give us the framework to make that so much easier. But basically, they would get the same thing, but it would be a do-it-yourself version. So here is because what we're going to do is we're going to take a survey form that is thorough. It's basically an intake form that gets all this information from people. And from that intake form, we're going to figure out all the assets that they have and the skills and abilities that they have and formulate an offer stack for them, right? Front and like a low ticket, mid ticket, high ticket, if possible, and different types of offers and packaging that they can give and not necessarily that they should offer all of them, giving them some options. and showing them how they could package their products slash services differently. And in order to just have something, first of all, that's scalable, potentially. So potentially low ticket, mid ticket, high ticket, potentially something that is recurring, but it really depends on who they are and what they're offering. That doesn't work for everybody. But that's what we'll be looking at is what is the best way to leverage, whatever is that you have to offer to people. And then, do you want me to finish the?\n00:11:37 - Maria Gudelis (Maria Gudelis)\nTry and thought, yeah, yeah.\n00:11:40 - Tina Marie (profitdriversinc.com)\nOK, so are you talking about what is the low ticket? So then the other thing would be we're going to create a business plan and say, here's the strategy that we would go about for you to make sure that you're not overextending yourself, like minimum viable product, really laser-targeted marketing using existing organic traffic. them. Coming up with the most leveraged business plan that they could have to mitigate loss and maximize profits. So that is very custom. That's what we're offering to people who's going to be talking to us one on one, which is a little bit more detail than I've given in the past, but since we've talked about this. But what this front end version could be is like here's examples of what we've done. We're not doing this for you, but we're going to show you our logic and we're going to give you these case studies or examples, right? So that you can put your own stuff through it and come up with a plan on your own and try to apply what was done because you can't afford it, or whatever reason, just choose not to invest in us on a higher level. But if you want support doing that, if you want some feedback, if you want to be able to get some help with it. And again, still don't want to pay the $6,000 price, then you can join our monthly group and you can quit anytime you want to. There's no commitment. So let's just say you want to come in and ask a bunch of questions. Then you get access to us for $400 a month. You can ask questions. You can, we'll have two live calls a month and it can be a couple hours long and bring your stuff, ask your questions. So that's still so it could be the front end is here's how we did it. Here's the framework, $97. The next upsell was if you want support while you came up with it, if you want feedback on your plan, if you want us to look at it and see how we would tweak it, adjust it, then you can come into the membership group for whatever $400 a month. And we'll give you feedback and if we're giving good feedback and it's going to take you what a launch that I imagine you're going to save for a few months, right? That's not enough you want to get there faster and you want us to really plan it out if you want access to a roll of X and who we would hire for this type of thing then it's the $6,000 one.\n00:14:38 - Maria Gudelis (Maria Gudelis)\nYeah, I still can't visualize picture of the front end same thing but do it yourself version. Here's how we did it.\n00:14:46 - Tina Marie (profitdriversinc.com)\nHere's how you can model it. So you won't probably until we've done it for somebody and I was just about to say maybe we need to run through the client stuff and you know see most of you all but so yeah it'll look kind of. kind of like our calculators. like you've got the the funnels like right you've got that. So they would be able to get one of those and plug their stuff into it. I have a different version of things and we would have an outline of maybe it's a Trello board like a project suite that says because we can share Trello boards people can copy them and this would be stage one stage two stage three kind of thing or maybe copy just graphics development all the different moving pieces and create them into tasks that they would then you know modify but they at least have a framework and we could put etas of how long this type of task should be should take to do so really break down the whole cycle into actual task and in actual project management suite that they just import and so let's say they get a developer they just assign those tasks to their developer and maybe instead of school they're using circle or Facebook groups or whatever so they modify a couple of things but for the most part it's gonna be pretty duplicatable. I think that's super high value and I'd be okay with giving that away for $97 because I think we want to over-deliver below them away with everything that we do and basically prove like how much we know and understand and how valuable we are so because at some point they're gonna go this takes way too long even with all the amazing tools that we give them they're like I want more help and that's that's what we want is we want them to be sold on how helpful we are so that we're not trying to you know we don't have to work for sales calls they should basically be begging to work with us because they know what we know, they know where they answer and they're happy to give us their money. It completely changes the energy and the dynamic of their relationship versus when you go in like and somebody hires you and they're like okay prove to me you're worth my money.\n00:17:17 - Maria Gudelis (Maria Gudelis)\nYeah. Yeah yeah so yeah like we had like for my car for magic we have like I'm just going to share screen or show this we had a product called high ticket toolkit as well and it had like yeah four calculators crush your launch creating proper headache offers easy but and then we had a whole excel or csv so where they could just import into a sauna and have like all the tasks they have to do like\n00:18:00 - Tina Marie (profitdriversinc.com)\nYeah, I actually have a base camp project template that I use for my freedoms, huh?\n00:18:06 - Maria Gudelis (Maria Gudelis)\nYeah.\n00:18:07 - Tina Marie (profitdriversinc.com)\nThat I used to use for my freedom systems and if I, let me see if I can find it in my drive, I use a new project template, let me share screen with you for a second, is that okay? So this actually came from, this came from starting with building Ryan Moran's Shear Strength Labs, the 12 months to a million bucks you wrote. So, um, Well, let's see, project discovery, that's a whole new thing, right, is kind of defining the avatar. These are, these would be tasks that you start with, conversations that have to be had, meetings, exploration on the team. Like, it depends on who you're at, but if you're doing this for your, as your agent agency, then you're doing it for a client and you're doing it with them. So, and the note is here, remove any items that are not applicable to the funnel, but what we'll do is have it where it's, you know, project suite specific and just be able to export from one to another. But these things, right, define what it is, title was the price, who's responsible for creating the content. So, like, if the copywriter has one part, the graphic designer has another part, that type of thing. sometimes before you even get to the copywriter, you have to give. of product-specific information, so then it's kind of three part, right, because it's the product owner who has to inform the copywriter, and then the graphic designer should be entitled what they want, and generally the copywriter probably is going to inform that if they're really good at marketing and you're hiring a copywriter. Due date, stages, dependency tasks, things like that. Yeah. core offer up sales, that admin instruction tasks, labeling base camp tasks properly, creating client project folder and Google Drive, creating the following sub-folders, all these things for approvals.\n00:20:43 - Maria Gudelis (Maria Gudelis)\nThere's a lot. So you can like make some like this, but in Trello, so it looks really pretty, people go all about it from a marketing perspective?\n00:20:50 - Tina Marie (profitdriversinc.com)\nYes. And also, this could be a PDF that is broken down a little bit more and explained a little bit more, dressed up and made pretty. um, um, explain with some videos, like this could be a product all in and of itself. Um, I was going in a totally different direction.\n00:21:12 - Maria Gudelis (Maria Gudelis)\nI was going more, um, the front end, like a true low ticket funnel, like more about the end result, getting them on, whether it be go high level or system I owe, so that they become a customer that way. Like, so, so for instance, like, the thing could be a 37 or $27 in $14, like a lot of Alan's tannic students are making, you know, multi-million dollar low ticket files and they're using a $14.40 price. But I could be, we have to figure out who our avatar is on this one, but like, so for instance, it could be just one around, um, you know, here's like, just to get them hooked is that, you know, here's like, whatever, five years of winning Facebook ad formulas and actual ads that have helped me build to million dollar funnels. You could have this and even if it's five bucks, right? And then when they get that, say, you know, the thing that made it work, though, is a really good funnel software as well, besides the copy and everything. And so the next page, bump can be like, get all of our snapshots or templates, you know, here's some examples of some winning, you know, know, pages. I mean, that's what Anac Sentinel did. Like he at low ticket funnels. He's not the expert at it, but he just claimed ourselves a frickin' expert because he saw all the money in being a go-high level affiliate, right? So he bolted on front end to make a boatload of money on it. Like, there's sort of a joker down to 10x thing going. This guy never even made a million off of a lot things in funnel. Now he's like, but he's doing it. He's getting away with it. And of course, he's a great guy. He sells other stuff about information products. That's good. But uh, but anyways, so I was going around that angle, like, yeah.\n00:22:57 - Tina Marie (profitdriversinc.com)\nYou made me think of something now. So that's type of organization, that is what I've inserted into every company that has become a million dollar company that wasn't before I got there.\n00:23:10 - Maria Gudelis (Maria Gudelis)\nSo how do we, and I'm not going to have the answer right now, and maybe you haven't, but how do you make that ? Because when I looked at it, my eyes glossed over little bit because I'm creative, right?\n00:23:21 - Tina Marie (profitdriversinc.com)\nSo the results are what ?\n00:23:23 - Maria Gudelis (Maria Gudelis)\nThe work is not .\n00:23:25 - Tina Marie (profitdriversinc.com)\nThere's a saying that says something um, looks like work and dressed like overall success, something like that is success. Looks like work, dressed in overalls. I don't remember what it is. Hold on a second. Opportunity is missed by most people because it is dressed in overalls and looks like work.\n00:23:46 - Maria Gudelis (Maria Gudelis)\nYeah, I love that quote.\n00:23:48 - Tina Marie (profitdriversinc.com)\nSo that's the thing is I am not going to if you like sucking your thumb, we are not going to work.\n00:24:00 - Maria Gudelis (Maria Gudelis)\npart together, right? If you're looking for passification, if you, I'm an I am a fast twitch explosive kind of person.\n00:24:10 - Tina Marie (profitdriversinc.com)\nI cannot sit still for long. If you're and now I am also like, I used to think I was lazy because I was always looking for the shortcuts. I'm not lazy, but I get bored easily. And I want to do lots of things. And I want to feel that explosive energy. So I gamify everything. There is no faster, easier way to do and to grow than what I've created. Because if there were, I wouldn't go into companies and have their mind blown every time. just that is why it's a fundamental like a lever is the most basic kind of tool you have a fulcrum. like a rock and a plank and the lifting power is exponential based on the size of the lever. It is as simple as it gets. You still have to do the lifting. You don't have to get the pull from. You still have to get the lever. It still works. But the power that you can do once you understand the lever and you do it, is amazing. Let's imagine that this guy is like, I can't do this job because I got to hire five guys to lift this big old thing and Joe blow up over here and he's tiny. like, I got you $25 and he brings out a rock and a stick and he gets it done by himself. That's magical. He's blowing the mind of these early dudes and five of them do it and it was so much more expensive. That is the power of working smarter or harder. Everybody tells you to do it. Nobody tells you how to do it. This is how how you do it. So it isn't . The work isn't . The results are . So, you know, you have to decide if you want front or back, but you don't get both.\n00:26:14 - Maria Gudelis (Maria Gudelis)\nBecause if it's on the front, which means I don't do any work, you're not going to get big results.\n00:26:20 - Tina Marie (profitdriversinc.com)\nYou're not going to get big profits. You're not going to have a great company. You're not going on the front. You actually are smart and you do some of the work and you're organized and structured. Guess what you get on the back end? All this .\n00:26:37 - Maria Gudelis (Maria Gudelis)\nAnd you get to keep it.\n00:26:39 - Tina Marie (profitdriversinc.com)\nSo I'm not trying to convince somebody and try to sell them and let them hear what they want to hear. If you want to go buy a diet pill instead of go to the gym, I'm not a person. If you want to go buy a lottery ticket to make your money, I'm not your person. And I want to be very clear about that. Yeah. But what I will tell you is. I've got the best plan for the gym. And I literally, Maria, for real, I go to the gym, I spend about 15 minutes, I do a leg press, and I do this one movement overhead. But it works. of those movements get all of my core.\n00:27:16 - Maria Gudelis (Maria Gudelis)\nI'm sore from head to toe. My daughter went with me, she's like, that's crazy.\n00:27:20 - Tina Marie (profitdriversinc.com)\nMy strength grows every week. I can lift more. only do it every couple of weeks. I have lost size. I don't eat less. I don't like, I'm not, you know, tiny or anything, but the power of that, and I found somebody else that explained it, but I have way less pain. I sleep better. I have more energy because I'm not exhausting myself going to the gym, building up cortisol. I still go to the gym. I'm just going to the gym way less and more powerfully than most people are doing.\n00:27:57 - Maria Gudelis (Maria Gudelis)\nAnd it's the same thing in business.\n00:27:59 - Tina Marie (profitdriversinc.com)\nYeah, I'm doing. Project management like other people, but I'm precision about it and I'm getting the most out of the least every single time. So like, that's how you make it is that, you know, it is work, but it's the least amount of work that you can do to get the greatest amount of results. If you're not looking for great results, then this isn't for you.\n00:28:22 - Maria Gudelis (Maria Gudelis)\nYeah. So, so, um, yeah, and essentially because if I look at my most successful companies, there's no doubt that at the beginning stages is because whether it be me or someone else, we had a really good project management or just more than that, everything you talked about because I remember I had base camp and even for every private client then that came to me, I actually put them on base camp and they had their separate workspace just for that, you know, um, so yeah. interesting, interesting. So I'm just trying to think and train of thought. And I might just have a bias that I need to remove. You know, the famous guy wrote the book Pay Yourself First, Profit First.\n00:29:24 - Tina Marie (profitdriversinc.com)\nYou know that guy?\n00:29:24 - Maria Gudelis (Maria Gudelis)\nProfit First, yes. He was a client. Yeah, he was a client of Emily Hershey's and there was another very famous guy like that in that same area too. Like a lot about like a little bit about what you're talking about too. And we never could get ads to work for them. Like it just wasn't at the beginning that to teach them that. lot of people were like, yeah, but I get it. So yeah, it's just not coming to me with that front end would be though what we call it and all that. But you're right.\n00:30:00 - Tina Marie (profitdriversinc.com)\nMaybe we just\n00:30:00 - Maria Gudelis (Maria Gudelis)\nneed to do it a couple of times for some clients first.\n00:30:02 - Tina Marie (profitdriversinc.com)\nSo I mean, we could call it a profit accelerator. It could be a business accelerator because accelerating is what it is, but it's also sustainable growth. So this is one of the biggest reasons I haven't created stuff because coming up with a hook is hard. That's where the longevity and the long play comes in, right? So people who are already familiar who just know, like this off, when you did a pocket CMO and COO, that created an immediate, there was an image that they could draw. They know what a CMO is, they know what a pocket is. They can imagine, I've got access, OK, that's actually really clear while still being incredibly ambiguous. Yeah, yeah. But they drew the picture in their own mind. So, using language that allows a person to fill in the blanks and draw the picture in their own mind is what we want to do, right? So, we want to allow them to draw the conclusions like, that's why we have words like blueprints and toolkits and accelerator that have been used in IM for, the beginning, blueprints gives you an instant thing, like, you know, like, that is the schematics, that is the line, that is everything top to bottom, you know, you like, I got to get work done, that's the thing, accelerator, all of these types of things, they, know what they mean, even if we don't know exactly the way that they would apply to work, and we don't even know that the person that's selling it actually.\n00:32:00 - Maria Gudelis (Maria Gudelis)\nactually has anything good.\n00:32:01 - Tina Marie (profitdriversinc.com)\nIs it a good toolbox or did you step from the dollar store? Like, you know, the power and the results are different. Is it a good blueprint or did you have a really bad architect and there are things missing and the measurements are off? assume that everything with those words are good. Yeah, that's what they were created for, but it doesn't. And so the value is a tied to that particular word less so than the actual product that's being sold.\n00:32:33 - Maria Gudelis (Maria Gudelis)\nDoes that make sense? Yeah, it does. It does.\n00:32:36 - Tina Marie (profitdriversinc.com)\nIt does. can find that type of word for any of these offers that conjures up an image in a person's mind of the power. And by the way, it's a leverage power. So the leverage of a blueprint is clarity. know step by step what I have to do. leverage of a toolkit is is that when I have to put a name, into the wood. I know I have to do it, but how am I going to do it? I need the right tool, right? So that implies that I'll have what I need to accomplish the work. Accelerator means that it's going to go faster than it would if I didn't get this. It's an implied leverage to each of and they automatically kind of fill in the blanks of the value.\n00:33:34 - Maria Gudelis (Maria Gudelis)\nYeah, yeah. There's someone just message me that I know a little bit not super well, but pretty well from another group. She was there for the program. She just messaged me. This is include implementation of the marketing plan. I said no, but if I was consulting on it, as you implement it in team to hire and more, team is behind the scenes expert behind hugely names like that of scale, like Dan Meredith, and you can pop on a comment with me and Tina if you want.\n00:33:59 - Tina Marie (profitdriversinc.com)\nI'll just see what she was. But yeah, you would even say, don't know if they know him, but Ryan Moran of capitalism.com Yeah, 12 months to $1 million because I'll say that should name of capitalism.com. Yeah. He also has an event called Capcom every year. He gets Damon John. He gets lots of big people.\n00:34:24 - Maria Gudelis (Maria Gudelis)\nwhat's this book?\n00:34:26 - Tina Marie (profitdriversinc.com)\nWhat's the book called? Pretty sure it's 12 months to him. Your first year, right? that. Yep, Ryan Moran, Ryan, Daniel Moran, 12 months to $1 million. Not that he bothered acknowledging me.\n00:34:48 - Maria Gudelis (Maria Gudelis)\nAnd the fact that we put it in base camp.\n00:34:51 - Tina Marie (profitdriversinc.com)\nYeah, did all of that. And I was.\n00:34:54 - Maria Gudelis (Maria Gudelis)\nWhere's. She said, I don't need marketing strategy.\n00:34:58 - Tina Marie (profitdriversinc.com)\nFor me, it's all about the integration at this point. Another word people call me is integrator When rocket fuel came out and that word came out that was like two people like you're an integrator. That's what you are Tina Is everybody likes labels?\n00:35:25 - Maria Gudelis (Maria Gudelis)\nI Think because everyone knows me as marketing they're assuming it's marketing yet.\n00:35:33 - Tina Marie (profitdriversinc.com)\nI thought the docket was pretty clear about Operations and team and stuff that is interesting Yeah, so then maybe giving a background of who I am and what I've done and that like if they've ever read Traction or rocket fuel that I am the integrator for several seven and eight-figure businesses or have been. Do I have it?\n00:36:16 - Maria Gudelis (Maria Gudelis)\nWell, we'll see what she says. She's been planning with me for the last three months, so I don't know if she'll pull the trigger because I don't know what she's just shopping around and cheap, I'm just gonna say that. Because then when I say playing, I mean, asking me questions too in Facebook questions or before being paid a dollar for stuff, right? but that is a perfect example where I find that fascinating. And maybe we just need to get more you and I together on video, Tina, because it is like even the product boss, how do they really get to one million? besides my marketing strategy, I had them hire an integrator as their first hire, right? You know. Oh, because, yeah, that I just like, oh, sorry.\n00:37:05 - Tina Marie (profitdriversinc.com)\nThis is what Matt said, um, just to make a correlation to things that people actually can know and do some research on. So he doesn't say share certain lives, but I get results. She came into our company when we were having some growing pains and needed help cleaning up our systems. that point, we were doing a few hundred thousand per month. Fast forward 12 months and we've increased our revenue 10 fold. Tina played a huge part and helping us do this. Robert released. took our ideas and visions and made them a reality. And we couldn't have grown this fast without her. Okay. So Matt, this is the partner of, oh, I'm not sharing that part of my screen. Sorry, stop sharing, share. Um, really not good.\n00:37:51 - Maria Gudelis (Maria Gudelis)\nYeah. What I can do is in the Google doc or if you want to, you can just put in some screenshots of more people, but this is all good feedback, by the way, right? To show, Hey, here's behind the scenes of these people, right? Um, I just know, um, like even Karina, how she got to me, she got disgusted with someone else. She paid 5k for. She didn't say the name. forget was, but this is like three, four years ago. She I bought it because included in her program was a, was a business plan. I really wanted the business plan, but the girls program didn't lead with that. The girls program was probably something like the 10k a month program, like it led with something like that. But the business plan was boiler template and she was so mad. And the coaches weren't the guru. It was $25 an hour. People she had hired, you know, so she was just like, ah, so, um, anywho, uh, yeah, um, I wonder.\n00:38:45 - Tina Marie (profitdriversinc.com)\nDan's always offering to share stuff for me, but he's also doing his own thing. So I don't know. I talked to my guy too, because they're business partners. Um, My guy is who got Dan Meredith to do, to even be recognizable at all. So I'm Dan's first coach that he ever hired. And then because we worked together, I introduced him to my guy who has, you know...\n00:39:19 - Maria Gudelis (Maria Gudelis)\nHold on, I'm just want to make sure that Kat's not pinging so much.\n00:39:22 - Tina Marie (profitdriversinc.com)\non. Okay.\n00:39:42 - Maria Gudelis (Maria Gudelis)\nOkay, it's okay. No, I think she must have just been playing with something, but you know when Kat kind of do the scratch, scratch, before they go pee? Yeah. So that's what I was worried so no I think she must have just been trying to get a spider or something in the corner.\n00:39:59 - Tina Marie (profitdriversinc.com)\nThat we might be able to get more. for eyeballs on it from a group that is familiar with me.\n00:40:02 - Maria Gudelis (Maria Gudelis)\nwhat I do is what I was saying. Yeah. Yeah, yeah, yeah, yeah. But I also think maybe Friday, instead of a webinar and all that stuff, we're trying to figure out. Maybe it's you and I doing just a true podcast style interview. We're just talking to each other and I'll just say, Tina, why is having systems so important? And we just we have a little bit of a structure, but it's really just us talking saying, hey, we're doing this video because some of you may not know me or you, Tina, then we both share it with our audiences, something like that. Because my people, I think they're so used to me being, I'm just going to say, at low price and do stuff for them.\n00:40:52 - Tina Marie (profitdriversinc.com)\nLike remember the last offer was $2,000.\n00:40:55 - Maria Gudelis (Maria Gudelis)\nI'll create the whole front end. So I think they're having sticker shock, right? eight um so potentially because she hasn't um she said send me a link and i'll and i'd love to talk to you you too this is this on a girl amanda but uh amanda who hines hines she does wholesaling she's in my laurel portay seven dollar month ads group that i'm in um and uh so uh uh i'm definitely open to it send me a link to discuss and i can match it to my availability so um yeah i think i'll just have to send her a link to when you and i are available to to talk to us but uh i i don't want to fight from the business either oh i won't yeah so so it's like you know she's already trying to position herself you know i mean um so versus like i can just put up and nothing held back now like hey five hundred dollar run out of her one hour our strategy cash injection plan with me. So just to piece, you know, for the next week for casual, but I don't want to fight for her. Like, you know, she doesn't see the value. I'm not going to, you know, yeah.\n00:42:13 - Tina Marie (profitdriversinc.com)\nNo, I didn't even do like a one-on-one call. So here's the thing. What I would say is if you want to do a call with us, first you have to fill out the form. Okay, like I told you before, you don't get to talk to me unless you're qualified to talk to me. And if you aren't, if you need to be convinced, go convince yourself or I'll find somebody else, but I don't, you're not worried about you.\n00:42:41 - Maria Gudelis (Maria Gudelis)\nOh, yeah.\n00:42:42 - Tina Marie (profitdriversinc.com)\nWhere I'm coming from is that all fairness, all these people don't know who you are, right? No, that's okay, but I'm saying for you too. Like, you don't need to be worried about them. So if they need to be sold on you, but for your time, like your one-on-one time, even... or like a sales call, look, before, because you don't want to sell somebody who's not qualified.\n00:43:06 - Maria Gudelis (Maria Gudelis)\nSo, they just call it like, yeah, you know, she makes enough and all that. Yeah, yeah, because I'm in the same group, Laurel. That's why she wanted to hire me for ads because her low ticket funnel is really done well. She's done well and she sells a low ticket funnel on how to do wholesale real estate investing. And it's done really well. But she's still not the ideal perfect avatar, don't think, because the other ain't danger.\n00:43:34 - Tina Marie (profitdriversinc.com)\nThis is a good conversation we're having because who we want to really help.\n00:43:37 - Maria Gudelis (Maria Gudelis)\nYeah. The other day, just having someone who just started making money online and just, you know, started to have success with their funnel. So, they're going to be very, most of them, unless they've run real business before with people and stuff, they could be very, probably how you disrupt court and show. They could be very like, just like, yeah, you know what I mean? just, you know. Needy or cheap or whatever and so like you like like the perfect avatar and obviously he's a friend So he wouldn't do it right wouldn't make sense to be my friend Derby right who's run many companies He's in his early 50s or late 40s probably 50. Yeah, no, he's definitely was 50s. think but you know He's already made millions of dollars in the past. He's also lost it but he hasn't really Stuck with something he's a little bit like me So he wasted 25 grand on Russell Bronson's circle thing about two years ago Why did you buy that and then now he's struck it rich again because he's always striking rich He'll always keep trying stuff. He's making about 40,000 a month or recurring from his Airbnb He converted one of his apartment village in New Jersey It was like eight unit into Airbnb's and he's now making grants making 35 to 40 grand a from like 15 years ago doing SEO consulting for local businesses And he's still getting $500 checks from businesses from 12 years ago. So he has a funnel I created for him last year for it. And it was doing pretty good. But he got frazzled because he was trying to do everything.\n00:45:12 - Tina Marie (profitdriversinc.com)\nThose are the perfect people that that's who needs me the most. Because I think I've experienced a little bit how quickly I can focus you. And so instead of like you, you still are thinking about other things, but you're staying in a lane and you're not letting it. So you're not doing the things at the cost of what's most important. That's generally what people do. And so I can literally just a text message, a boxer message, whatever, very short thing, get somebody anchored. So like my attorney's wife, my client who's an attorney hired me for his wife. And she is a nurse practitioner, but there's a business opportunity in community. and helping organize things and structure things. But she's never operated like this before. She is not native to America. She doesn't speak English, but it's not her native tongue. There's a lot of things that she's frustrated with, but she's very smart and she's very capable. And so she's had some issues that have kept her from doing the things that she needs to do. In simple text messages that took me five minutes to write, she shifted and shifted immediately and for the rest of the time. then so once a week I just text her, see how she's doing. She tells me the things that's stressing her out. give her a quick little, it's like an inspirational message. But it's tactical. It's like, this is what's happening. This is why it's happening. So now that you know it's happening and you're conscious of it, now you know why it's happening and you're conscious of it. Here's a strategy that should work according to what I know about your personality that you can implement. And then they get buy-in because they say... you're right, I will do X and now in a matter of minutes, something that because there was no clarity, they weren't conscious of it. They weren't clearly conscious of it. They weren't conscious of the cost to them or a tactic to stop the thing from happening. Yes, I can give that to people in minutes. So, you know, having a conversation about that, teaching people and that gets back to jeans, shorts, levels of awareness, right? What do you call that? don't know, but I know it exists and I know it can find it and I know it can be fulfilled. Yeah. Technically, I think that's what, like, so I've never called myself a business coach. Other people call me business coach. I hate it. I've said consultant, operation manager, project manager, like operations consultant, but I get called business coach.\n00:47:57 - Maria Gudelis (Maria Gudelis)\nPeople just call me coach. Hey coach. Hey coach.\n00:48:00 - Tina Marie (profitdriversinc.com)\nI need that yeah, and it's because you know, it's it's strategy. It's tactics but it's also look you need to do this you need to do that and and it's not a specific thing right it's business related so if you hire a soccer coach soccer coach might tell you how to eat might tell you how to think might tell you to get to bed on time I tell you it's a homework done so you're it's not in your head might tell you all kinds of things it has nothing to do with soccer per se yeah impact your game so the same thing with business coaching is you know but there are a lot of crowd people out there and there's not a lot that can do what I do and then there might be people who like well if she's so good why is she just doing this well because my priorities mom I'm serving the mission I'm going to school I'm not out here trying to get a yacht I'm just living my life and help you along the way so that's an uphill battle because people have scripts in their head about what people look like what successful people look like and that kind of thing. So anyway, that's all the stuff that we're dealing with. But once you start to get testimonials and come up with a particular name that has that word that conjures up something, right, like blue kit and blueprint, like toolkit, things like that.\n00:49:22 - Maria Gudelis (Maria Gudelis)\nif we get some names for that particular offer where they're like, this is what happened, this was amazing and they tell them Yeah, like really, when you think about it, and it might just be people just need more exposure as well. It's sort of a bit like the strategic coach. I think I mentioned that guy to you before. He's in Canada and like Scott Alford hires him, like a lot of people work at steel hires him. Let me see, like a lot people already making a lot of money, know, or , got to hire this guy because I don't have a life after I've, you know, done. I'm so well in my business, so let's see all these things, or if anything to Dan Sullivan, that's it, that's just a DJ coach, this guy, I mean they don't go in implement for people, like they're like, yeah, you know, Dan Sullivan, as in like the class, like the marketer and copywriter, like that's been around for decades business. He's picture of this guy.\n00:50:38 - Tina Marie (profitdriversinc.com)\nI don't know what he looks like, but yeah, no, no, I'm sharing screen right now.\n00:50:43 - Maria Gudelis (Maria Gudelis)\nI know, I still don't know what Dan Sullivan looks like. Oh, got you got you got it.\n00:50:47 - Tina Marie (profitdriversinc.com)\nOkay, but yeah, he's on par with Dan Kennedy and a lot of ways in terms of like how long he's been around and, and yeah, so. Business strategy is definitely a huge part of what I offer and do But I don't have a brand and I don't have you know a pedigree.\n00:51:09 - Maria Gudelis (Maria Gudelis)\nSo You're also not paying his prices. We have results. We have the results. Yeah, okay, so Other than that where were we so And that's just one person, right?\n00:51:28 - Tina Marie (profitdriversinc.com)\nThere's plenty of other people that I just said the Google Doc too So I'm interested in in talking to Neil and seeing I mean I don't know what or your forum stuff and I don't know how he organizes his business. So I Don't know enough, but I know that he knows a lot about business I know he knows a lot about the market. So if he's interested in it, I would imagine there's I Know some need not being met for him and I'd be curious what what sparked his curiosity in it.\n00:51:59 - Maria Gudelis (Maria Gudelis)\nHmm.\n00:52:00 - Tina Marie (profitdriversinc.com)\nAnd one of the other conversations to start having is, like, raise your hand if you've heard of rocket fuel and raise your hand if you've heard of an integrator, like, has anybody looked at that go? I wish I had an integrator. Well, that's what Tina is, and that type of thing, because again, it's a correlation to something that they already have a definition for in their head, and they've already attached a value to it if they're familiar with it. So, by translation, by saying this integrator thing that you've already got, and it's established about saying she's that, and she's been doing it for these companies to go, oh, wait a minute, okay, I could have access to that, like, and Maria's standing, like, working with her, so Maria must think that that's useful and good. You could even tell any, like, if you have anything to share about anything that you feel like I brought value to you for, like, you will imagine. And we were just talking we weren't even like I didn't hire anything, but just in talking Yeah, I felt this did this and this is how I feel about it now and because not everything is going to be a like it's going to be an indirect financial game, so We had a conversation about your center and your values and I didn't say anything about Karina, but you Took what was said and you knew like this is where I'm stuck right now I'm not doing what I should be doing and I need to make a change. didn't know that I you knew that but I Facilitated a thought in your head that made that happen with clarity for you and then you went and did that and and that's the type of thing It's very difficult to explain how that happens unless you've had the experience. Yeah, yeah-hmm But you've been on fire since you let that weight go\n00:54:00 - Maria Gudelis (Maria Gudelis)\nOh, I know, I know, it gets down a little bit because that later I had to finish that 2K Final Four, which still burns me because she paid the 2K on Thursday and Friday and so Karina got like 1200 of the 2K and the next day Karina's like, I don't think this partnership is working, you know. I met with her today to go over her customer journey and everything, hey, this is almost done. She, so this is digital products, right, think she's going to do really well because she does well on Etsy selling some of these digital planners for co-parenting custody and productivity for months. And then she goes, well, no, I'm going to buy Karina's $5,000 one-on-one coaching site because I want to stick with, I want to also grow my e-com store because I started with her. I'm just like, oh, . She's never going to make that back. She's been with Karina for over six months and she's only broken even, you know.\n00:54:54 - Tina Marie (profitdriversinc.com)\nI their lessons.\n00:54:56 - Maria Gudelis (Maria Gudelis)\nhad to learn yours. That's true. theirs. Yeah. Yeah, yeah. So I was just like, I really was shocked because, um, yeah, I, like, because she thought I could run her traffic for her for like really cheap, she goes, oh, next week we start traffic for this. So wait, that's not not in scope for the 2K, you know, and so I, I was just like, if you want that, I could still honor the traffic package I offered a while ago for, for people if it was just one campaign and managing the ad spend is $1,000 a month, which is like it should be like 3K month.\n00:55:31 - Tina Marie (profitdriversinc.com)\nso anyway, uh, your effective hourly rate should never be less than 500. You, Maria specifically, know, shouldn't be less than 500. So I need you to engrade that, engrain that in your head, um, because that's the result you get. So if somebody is not qualified to pay that or doesn't want to pay that, that conversation can end very quickly and it's okay.\n00:55:53 - Maria Gudelis (Maria Gudelis)\nYes. Well, exactly. And I think the issue has been because I've been around Crena's crowd, right? These are all people who who just barely can make paying the shop if I'm not paying You know what you should do is you should write a pedigree post.\n00:56:07 - Tina Marie (profitdriversinc.com)\nThis is my history. This is who I am. This is what I've done. And for a little while I've been playing small. You don't have to say anything about it. Now this is not to say I don't believe in low ticket funnels. I do. I think that there's a lot of value in it, but because I think because I've seen them grow you know million dollar per year or whatever businesses, but I want to be very clear that I am not a low ticket person. This is the value. This is what I bring to the table. And somehow sometimes people make a correlation between the low price of an offer and the low price of time with me and let me make sure that you understand that they're not the same thing.\n00:56:51 - Maria Gudelis (Maria Gudelis)\nI love that. Because it's not your results speak for themselves.\n00:57:00 - Tina Marie (profitdriversinc.com)\nSo yeah and it's maybe or even rethink having the school group as free like I'm tempted just to put a you know whether five buck a month or 47 bucks a month on it right now because I notice it's attracting a lot of people as well that are uh do you want to do you want to turn that into something we do together we can split the school price and just start go let's go create let's start having conversations in there every week um we can have a couple every week if you want to and just go like gangbusters on learning them but them learning us because there's no way we start talking and people show up and they're not going to get that really smart I went to traffic conversions one time and Richard Linder was not a partner yet and he was teaching email stuff and I'd been managing email list for a while and I knew a lot about deliverability and sender score this was 13 years ago almost 12 years ago people didn't know this then um but I did because our emails weren't getting through and I needed to figure out why because that was costing us a lot of money and I don't like losing money. By the way, while getting paid $15 an hour to turn a company into a million dollar company and going bankrupt while getting divorced, like I got some issues. Anyway, so I kept asking questions and he's like, you're really smart, aren't you? then I walked out of that room and I could hear people pointing at me whispering about how smart I was in digital marketing. So this isn't about arrogance, it's a point like I stand out even in crowds of smart people. There are a few that I get around and I'm just like, they're their brilliance and I see that they do a lot of what I do but they're also very quiet. They're not out there doing big things like big things publicly privately. There is many like eight figures, seven, eight and nine figure businesses and they're the masterminds behind it that nobody knows about. But when you hear them talk, you know, yeah, you're like that, but you've been, you focus on the marketing so much. But when you talk about strategy, people are like, holy crap, every single time, but yeah, well, that's why Emily hers hired me to be the strategy director. Yeah, like it was I never heard of her until one of my clients hired her, but then they went back and because they undid everything she did because ultimately it didn't work for them.\n00:59:34 - Maria Gudelis (Maria Gudelis)\nOh, yeah, she was I don't know if she's changed now, but back then she was pretty bad.\n00:59:38 - Tina Marie (profitdriversinc.com)\nLike it was like two years ago.\n00:59:40 - Maria Gudelis (Maria Gudelis)\nOh, really? Oh, well, then it's just she grew too fast and like some of the ads managers are really good. So it's maybe some bad. But yeah, for her, basically, then a strategy director, I would be helping like not helping that be crafting the strategy for Amy Porterfield, Mary Forley, I look at Gabby Burstein, those were her clients, right?\n01:00:00 - Tina Marie (profitdriversinc.com)\nI don't know that.\n01:00:01 - Maria Gudelis (Maria Gudelis)\nYeah. Yeah. Um, I think she still has those clients.\n01:00:03 - Tina Marie (profitdriversinc.com)\nShe kept in the referral because she started. you that's, that should be part of your, like your pedigree.\n01:00:11 - Maria Gudelis (Maria Gudelis)\nYeah.\n01:00:12 - Tina Marie (profitdriversinc.com)\nSeriously, Maria, just spend like the next week riding down the, the who's who, the stories, the money, the whatever. That should be a whole thing. Because the next time somebody is like, well, you know, it'd be like, hold on, go take a read down and then make it done.\n01:00:32 - Maria Gudelis (Maria Gudelis)\nNo, I think that's good. So, and, and then, so, yes, a member I suggested maybe we just share school group. So I think the freebie group, even though they say that's good, was like having a free Facebook group, because school, the nature of school, you're getting a lot of people who just want to spam others. We always have to keep spam. if we make it 10 bucks a month or five bucks a month, it'll keep those people out and it could become like a newsletter alternative.\n01:00:56 - Tina Marie (profitdriversinc.com)\nOr we decided. So that was one of the things I was thinking about with the community. is rather than email because you also can email, but only like once a week or three times a week, something like that. I don't remember. Once a day school, you can't. So if you do a post, you can email that out. It will send an email notification to people, but there's a limitation to three days. Okay. Yeah. So that's fine. But either way, putting out content like that, right? So rather than not instead of email, but in addition to for people who don't necessarily want email, but they like the groups and they like socializing. But yeah, yeah, yeah.\n01:01:37 - Maria Gudelis (Maria Gudelis)\nSo what do you think? We could always just keep increasing it every month, maybe five bucks for this month, 10 bucks next month, 15 next month, or do you think we just go right to 27 a month?\n01:01:47 - Tina Marie (profitdriversinc.com)\nI mean, we could just go with the dollar. So we keep people there and then say, okay, month, and let's go just add value.\n01:01:54 - Maria Gudelis (Maria Gudelis)\nSo we immediately stop the spammers because you have to put in a credit card, right? Correct. Yeah, they affiliate markers and I'm I'm pretty sure we should be able to convert a free school community into a paid Yeah, you can you can and obviously we can we can just call this digital marketing or something like we don't I again. I never claimed the URL because we could change it whatever we want so Yeah Well that guy looks good and I don't let in people they don't have Anything you know what I mean and I'm almost almost tempted to not like guys in anymore Cuz all the free onboarding calls I've had that I stopped now the good ones were with the females But the guys just said just want to pure like what about this? about this? about this here?\n01:02:39 - Tina Marie (profitdriversinc.com)\nYou know, it wasn't enjoyable the energy was different Maybe just a business acceleration because it's not just marketing. We're going to be talking about everything business acceleration strategies or Something like that\n01:03:05 - Maria Gudelis (Maria Gudelis)\nSo, yeah, looks like we can do that.\n01:03:07 - Tina Marie (profitdriversinc.com)\nYep.\n01:03:09 - Maria Gudelis (Maria Gudelis)\nSo I'm making a buck right now.\n01:03:10 - Tina Marie (profitdriversinc.com)\nYeah. Five bucks, 10 bucks, whatever you feel like just. So people that don't pay it. I don't know how that works. Like, do they get to stay?\n01:03:20 - Maria Gudelis (Maria Gudelis)\nI don't know what happens, but. No, they all get grandfathered in.\n01:03:24 - Tina Marie (profitdriversinc.com)\nOkay. Okay.\n01:03:25 - Maria Gudelis (Maria Gudelis)\nSo, so if you do month and annually. they do five bucks a month for the year, usually five months. Five times five is 55, 55 for the year. 8%.\n01:03:36 - Tina Marie (profitdriversinc.com)\nJust can't wait. Five times too long. Yeah, because otherwise it'd be 65.\n01:03:41 - Maria Gudelis (Maria Gudelis)\nYeah.\n01:03:43 - Tina Marie (profitdriversinc.com)\nWhoa.\n01:03:44 - Maria Gudelis (Maria Gudelis)\nWell, okay. Yeah. Yeah. So instead of 55, it's not making a 40. I just want to make it five months worth. Five bucks gets seven months free. But how do I. . Oh, that's. Yeah. All right. I think it just means that these people are free and the rest have to pay five bucks, I think.\n01:04:03 - Tina Marie (profitdriversinc.com)\nYeah. Anybody else?\n01:04:04 - Maria Gudelis (Maria Gudelis)\nAnybody now? Yeah. So let's just go incognito and I have a call in five minutes. Is there anything else that you want to cover before I jump off the call?\n01:04:17 - Tina Marie (profitdriversinc.com)\nNo. So if we're going to do that together, you can make me an admin. If you want, you can build me for half of the thing. Like, let's talk about the details and whatever, how, you want to do it. We can talk about branding and strategy.\n01:04:35 - Maria Gudelis (Maria Gudelis)\nknow I'm $25 a month.\n01:04:38 - Tina Marie (profitdriversinc.com)\nYep. then I think let's, let's build out a scale of like what is going to be next month and through the end of the year and just I don't know. Like, I think that would be a good plan. Oh, that's my love. I want to get him.\n01:04:52 - Maria Gudelis (Maria Gudelis)\nAll right.\n01:04:53 - Tina Marie (profitdriversinc.com)\nOh, catch up.\n01:04:55 - Maria Gudelis (Maria Gudelis)\nWe'll catch up soon because he's like, oh, I love it.\n","contentPreview":"00:00:01 - Maria Gudelis (Maria Gudelis)\nHey!\n00:00:03 - Tina Marie (profitdriversinc.com)\nHey! so sweet.\n00:00:06 - Maria Gudelis (Maria Gudelis)\nYou look great. Your hair is perfect. Were you doing ...","processedAt":"2025-05-04T03:40:52.476Z"}