{"fileName":"Transcript for Chona(8).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Chona(8).txt","type":"transcript","priority":"medium","content":"00:00:00 - mark sweet\nCan you hear me?\n00:00:01 - Tina Marie (profitdriversinc.com)\nYes. Shona's not here yet though.\n00:00:06 - mark sweet\nYeah.\n00:00:09 - Tina Marie (profitdriversinc.com)\nYeah. Everything okay?\n00:00:17 - mark sweet\nYeah, in Vegas right now.\n00:00:20 - Tina Marie (profitdriversinc.com)\nI will text her real quick and see. Oh, well I said it was little don't I see it.\n00:00:34 - mark sweet\nFor easy like how important it is to go and meet the doctors face to face. It does take a lot of time, but especially in other states.\n00:00:44 - Tina Marie (profitdriversinc.com)\nYeah.\n00:00:46 - mark sweet\nYeah, it makes a big difference because there's more and more of these California firms just like going through or doing what they're doing and just trying to separate ourselves little bit and put a case to a name and whatever. I think it spends some time with them because the people generally like me a lot once they meet me.\n00:01:08 - Tina Marie (profitdriversinc.com)\nI've noticed.\n00:01:09 - mark sweet\nYay.\n00:01:12 - Tina Marie (profitdriversinc.com)\nThere's our trauma. I admit.\n00:01:20 - Chona Sweet\nWhat? Hi.\n00:01:21 - Tina Marie (profitdriversinc.com)\nHi.\n00:01:23 - Chona Sweet\nI was in Google. don't know what happened.\n00:01:27 - Tina Marie (profitdriversinc.com)\nIt's um Um, sometimes the the events just have it there by default. Um, if I and if I'm not careful and don't delete it.\n00:01:39 - Chona Sweet\nSo oh, uh, yeah.\n00:01:42 - Tina Marie (profitdriversinc.com)\nI've had zoom issues all day. I literally just got it installed and marking it like 601 and had to uninstall it after fighting with it. So I'm audio only today. um, yeah. Okay. Let me go to my notes real quick. Oh, it was good. I've been exhausted all week after just getting back late and then taking my daughter to seminary. then this morning, she wakes me up at 4.53 a.m.\n00:02:18 - Chona Sweet (3)\nshe's like, mom, I'm late for seminary. And I get up and I'm like, my heart's racing and everything because I'm like, oh, I slept through my alarm. And then I look at the clock and I'm like, you don't go for an hour.\n00:02:29 - Tina Marie (profitdriversinc.com)\nthere was no catching up on sleep.\n00:02:33 - Chona Sweet (3)\nI tried to with their like little tiny windows here and there.\n00:02:35 - Tina Marie (profitdriversinc.com)\nSo I'm just like, yes, that's been fun. But she's doing good. So anyway, how's your charting been going?\n00:02:46 - Chona Sweet (3)\nIt's, you know, it's still a challenge, but I feel like I'm getting better. I feel like it's really yeah. It's still a challenge.\n00:02:57 - Tina Marie (profitdriversinc.com)\nIt's a work in progress. Whoa.\n00:03:00 - Chona Sweet (3)\nshow me explain to me what's getting better um i don't wait maybe more than two days to chart so i guess that's a like an improvement i thought you told me you were gonna do your charting at the same day yeah it was getting difficult um how many people are you seeing each day so like um yesterday it's just telemedicine but two days before it's um i have almost almost 35 and 90 i would say 80 percent of that is like new patients because of the new contract we have like influx of new patients and yeah did you just tell me you saw a 95 patients on one day no no no no I said 90, 80%, 30 plus patients, actually I feel like it's more than that I have to count because it's like 18 in the morning and I think I have almost 20 in afternoon and like 80 plus or 90% of that are new patients. So when it's like new patients I was just a lot more charting because they're new.\n00:04:35 - Tina Marie (profitdriversinc.com)\nSo what's the average length of time to chart for a new patient?\n00:04:40 - Chona Sweet (3)\nI honestly do not.\n00:04:42 - Tina Marie (profitdriversinc.com)\nI feel like I don't really time it but that's the first thing that we need to do. And so here's what I'm to tell you, Chana. I said it in the beginning but now you're getting to the point where like we can really kind of feel it. This is tedious.\n00:05:00 - Chona Sweet (3)\nin the beginning, right?\n00:05:01 - Tina Marie (profitdriversinc.com)\nIt is tedious in the beginning. But if you will do the things that I ask you to do, we will get through the tedious faster than any other way. So timing yourself and observing the things I'm going to ask you to observe is adding tedious on top of tedious. But the fastest way for me to help you systemize and simplify what you're doing and to speed it up. Is to be able to understand what the baseline is first. Yeah, and I can send you notes at the end of this too.\n00:05:40 - Chona Sweet (3)\nLet me go make sure my note taker is working because I feel like it's definitely more work for new patients. I definitely find myself. So, you know, getting, you know, I'm trying not to, because I'm trying to, I know it's going to be all hard work. It's just that I feel, I know early on that when I get busy with the PI stuff, I know which one to cut. And I don't, and I know, when I say I have to cut means, I know what to tell Dr. E, which one I don't like.\n00:06:37 - Tina Marie (profitdriversinc.com)\nWhat do you mean, like between what you're doing in PI stuff?\n00:06:42 - Chona Sweet (3)\nNo, because the PI stuff, because it's like, remember the one, two, three, I'm on number one, which is the main word. And out of the number one, there's three categories, I guess, if it says that, first it's the hottest. Hospital rounding and I haven't even get to that because I have yet to get the privilege from the hospitals So there's one the second one is the clinic work, which I Don't know I guess from the beginning. I already know that I don't like clinic Mm-hmm, but the clinic setting are like the bread and butter of a Pain clinic basically, so that's where the bulk of our patient population is and that's where the Remember if you if you remember the the contract that I was saying that he the doctor He recently acquired that's where the majority of patient will be and then the third category is the telemedicine Which is you know, just how it tells tell them medicine phone call, but it's best basically medication refill or ordering other treatments for the patients. And yeah, so the number one cat, a number two category of seeing patients in the clinic is my least favorite because I feel like it's just more work in terms of charting. Seeing patients in the clinic, it's not my favorite thing ever since I become a nurse, I don't like clinic work, maybe because of the charting and I mentioned before to you, I really don't like writing a lot, but the hospital setting is very much focused charting. I think that makes sense, oh, the patient have pain here, it should be the same, but for some reason that clinic charting has more charting and it's just annoying. However, I know that the PI or the pain or the personal injury cases are considered clinic patients, but obviously I feel that I'm putting a lot more effort on the PI clinic patients if that makes sense. Yeah. And I'm trying not to in a way because I don't want to be that person that I have to take care of the patient more because I'm getting paid more on it, you know, but I talked to Mark about this the other day and I don't know, it doesn't sit well with me, but I know it's the reality of the situation and not just me. I'm sure everyone that gets paid more on PI patients, you know, day. It kind of like I have to give a little bit more I Just work on it.\n00:10:07 - Tina Marie (profitdriversinc.com)\nI just find myself catering to them more and Kind of don't like it in a way, but at the same time I do I the reason why I said I don't like it I want to treat everyone the same I guess that's why I'm trying to say okay so Let me ask a few questions and figuring this out will It'll take a while it'll it'll take multiple conversations, which is gonna take multiple weeks But what do you like about your job?\n00:10:43 - Chona Sweet (3)\nI like when Ever since I become nurse it's been typically A management, which was 11 years ago. I like that I Work as an NP, which is a different level of autonomy As compared to being an RN, a bedside nurse, I like that I can give what I think would help with the patient. I can order it right away and I can see the results right away, of like ABC type. I like that. And then lastly, I like it when a patient with, you know, the instantaneous gratification of saying thank you because it helps them. Eventually, the most difficult one is in the pain population, they're one of the most difficult ones because there's a lot of, I feel like, negotiation skills that I'm doing, you know, like, I can't give you more narcotics, but trying to convince them that narcotics is not the only treatment, there are other treatments. It's difficult, but it's fulfilling once they've Realize it themselves.\n00:12:03 - Tina Marie (profitdriversinc.com)\nUm, so like what, what kind of treatment do you suggest? I'm like sure you have all kinds of different types of pain and levels and options. But what are some of the non narcotic options that you suggest?\n00:12:21 - Chona Sweet (3)\nSo like, um, I guess I'll talk to it based on my experience. I can do things like my experience in the hospital, which is the bulk of my experience. Because I work in a hospital, you know, as a pain and P is in the instantaneous result of I can order IV tylenol and some people don't even know that exists or IV magnesium or IV vitamin C for pain. And some people would not even think that even helpful. Yeah. Um, or even can. I mean, ketamine is anesthetic, it's not narcotic. So that's why I like hospital setting a lot. It's very instantaneous that there's more access. I just realized that just now, maybe that's the reason why I like hospital setting more. But now doing the clinic setting, while I'm awaiting to work in a hospital, like doing the clinic setting, I feel like I'm limited in a way and it's geared towards more intervention type procedure, which I was not, that's a new thing for me. Anything like if the patient has back pain and they will look at the MRI and see, oh, you have stenosis, you have narrowing on the disc and that's why the PT medication doesn't work for you. So we may recommend you to have an epidural which is done by the anesthesiologist. So notice that that thought process is very much common in the clinic setting, and that also correlates with PI patients.\n00:14:06 - Tina Marie (profitdriversinc.com)\nOkay, and so do you imagine that there's a path where you can understand the nuance of the clinical setting and so I understand that the limitations that you have access to options in the hospital that you don't have access to in the pain clinic and when you know that something could be really helpful and it doesn't require an invasive procedure and it doesn't require a narcotic which comes with all kinds of other side effects and issues, dependencies and whatnot, that that can be frustrating. But do you feel like you can and work with the options that are there and just and feel any kind of like personal satisfaction, knowing that you're giving the options that maybe aren't the same as the hospital, but that you're giving the best that's available to them in the place that they went to.\n00:15:17 - Chona Sweet (3)\nYeah, yeah, I do. And I know that it's temporary until I have the privilege in the hospital. And I think it's designed that way to not make us feel that, you know, like just set stationary, like, oh, we're just doing clinics every day of the week, day to day. So how it's, so I in my head, it's temporary, so I understand. And I know that I need to understand the clinic culture and setting anyways, because that's how I can succeed with my PI cases, which is this, Number two, out of the three source of income. But also, there's one thing that is new, that I haven't fully utilized by myself because I'm not an experienced on it, is I can do injections on my own too. That is intervention, but that is something that I can do, and it's exciting to explore because I've done it multiple times without the E, but I haven't done it by myself. So I almost did it by myself the other day, but Dr. E is available, so I'd rather him do it with me. Yeah, well, that's in and of itself, it's a procedure, but it's not as, I guess, it's excessive like an epidural interest, yeah.\n00:16:51 - Tina Marie (profitdriversinc.com)\nYeah, so what we'll do every week is try to figure out what are the, Because even in the beginning while you're still wrapping your head around everything and waiting for access and whatnot, there should be something that we can do. And even if it's just a perspective shift, like earlier in the week, we talked about writing your own story, know, that what you feel like your limitations are culturally, language, that's not permanent, you know. You, there are different things that you can do, and we talked about just the practice using, using translate tools, using chat dbt, whatever to help you overcome the language barrier. And then over time, because there's, there's only so many things you're going to have to write over time. Obviously, there's a wide variety, right? But eventually the repetition is going to kick in and you're going to know the same phrasing and you're going to know it in proper grammar and you're not going to feel embarrassed anymore, and you're not going to feel like you're less than for any reason. We know that the only way that's going to happen is over time. So we can't shortcut that per se, but we can kind of expedite it with the tools that you use. And then the other thing we can do is just you just remind yourself that your story today isn't your story next year. So and kind of looking forward to that. And a year is one of my favorite perspective tools. So it's really difficult to to map out significant change when you're evolving as a person, even more so than professionally. Sometimes professionally you can do it, but the the wow effect really doesn't happen in a month. It doesn't happen generally in a quarter in the six months, but the wow effect is almost always happening. Like I've never not had that happen with anybody I'm working with in the course of a year. You look back over a year, like, that was significant, even when it's just kind of. still subtle, you can clearly see some measuring points where this was, you know, significantly different or that was significantly different and then you can kind of add in the compounding. So one of the things I just want you to do every day is remind yourself that, first of all, define and I think I asked you in text but I'm going to ask you now as kind of write down what you want this to look like a year from now. How do you want to feel about charting? How do you want to feel about the way that you write? You know, I don't love writing. I hate it. I'm 48 years old. I'm never going to love writing it and now typing but if I could just automatically download everything I wanted to say, then I'd be happy but that's not going to happen. So anyway, you know, it doesn't mean that you're going to love it or feel like you're great at it but what we do want to do. Um, is at least not feel so much resentment or frustration about it and, um, if it's one of those things we just have to bear down, then you bear down, but there are dictation softwares.\n00:20:14 - Chona Sweet (3)\nYeah.\n00:20:15 - Tina Marie (profitdriversinc.com)\nYeah. so are you using anything to help you with that?\n00:20:18 - Chona Sweet (3)\nYeah. So, um, Dr. E actually just called me today and say that, um, he bought a, the, the dragon for healthcare. They, that's what they like.\n00:20:28 - Tina Marie (profitdriversinc.com)\nYeah. Yeah.\n00:20:30 - Chona Sweet (3)\nbut I can't use it on the apples. So, but he, he said he got me a lots of which I'll, I'll get it tomorrow. So, I'm excited for that. I'm sure I still have to be vigilant on editing it because of my accent until it, until it adopts, I guess, to my accent, but, um, I, I, you know, I, I think what I feel to do today. I feel okay. I, I don't feel like. It just waxes and wanes how I feel on, you know, feeling quote, unquote, less than, but I'm happy with what I've been doing. I mean, it's not perfect. It's a work in progress, but I, I feel like each part of the three, the streams of income, I'm working towards like the, like, I told you the Washington, I submitted that already. So I contacted my university to submit my transcripts to Washington State, and I'm happy about that.\n00:21:34 - Tina Marie (profitdriversinc.com)\nokay, that's an accomplishment. Yeah. Um, so I just did a quick Google search on how do I do new patient charting faster and I put pain clinics.\n00:21:44 - Chona Sweet (3)\nSo the first thing I came up with is use dictation software like dragon.\n00:21:47 - Tina Marie (profitdriversinc.com)\nThe other one it said was electronic health record can help you chart faster by automating tasks and allowing you to chart from anywhere.\n00:21:58 - Chona Sweet (3)\nAnd yeah, we can. Yeah, which is what I do that I feel like being having the capacity to chart at home It's a blessing and occurs in in a way to me because I feel like I Have this sense of okay. I finished seeing the patient boom boom boom. Maybe do a quick You know jot down a few notes on each basin and just tend the note and then chart at home So that means I'm finishing my work at home versus finishing it at work Which I think I should not dab it as a good as bad. It's just how it's just what I I'd rather be at home And chart at home be comfortable, but that means I'm bringing work home at home And sometimes I push the limit on maybe I can do it a little bit later and then yeah I'm up till 2 a.m. It's a slippery slope.\n00:22:51 - Tina Marie (profitdriversinc.com)\nYeah, so this is where you really want to define your values When when I talked about like writing your story what so this is this is not not. This is going to be an iterative process as well. So what I would like you to do is kind of map out your ideal week. Now, it's not going to be the same all the time. Some weeks you're going to have special events, trips, things that you want to do. Some days you might have an extra load of patience. days, know, we're women, there's an entire week that sometimes just feels terrible once a month. It's all kinds of things that can affect you and reduce your productivity, reduce your mental capacity. So you have to take that into account when we when we map out the ideal week. There are people that will call it like a perfect day exercise. There's no such thing, but the ideal week and you want to look at like what is your work day look like? When do you start? How are you starting your morning? do you want to feel in the morning? do you want to think in the morning? What do you not want to feel? And then a negative match list is really, really important because a lot of times it's easier to write the positive things by putting in the negative attributes. for me in the morning, I don't want to feel stress at all. It's bad for me physically. cortisol is dangerous. It's really difficult to capture goodness in the rest of the day and to be productive. But also the morning time and in the evening is when I'm with my girls the most. And so I don't want to spoil or even infect them with negative energy and stress. So I don't check email. I don't look at anything that could cause me stress. And also I'm most creative in the morning and late at night. So it's kind of the wee little quiet hours around the house. don't know if it has to do with timing or just has to do with around. But for me, those are the creative times. So in those times, I want to make sure that my schedule is not, I don't want to be having conversations. So I don't schedule calls until after 10 or 11 during the day because I want to do my creative organizational administrative tasks in the morning and in the evening as well. So I don't have calls during that time. So those are some of the things that I've figured out for myself in terms of types of tasks. other thing I've realized is that I have my best phone call time between 11 and 2, 10 and 1. Kind of depends on the day. But I want to help people. I have more energy during that time. My brain is functioning well at the time. And because of what my clients pay me, I want to give them my best brain for problem solving and also my best energy for other people's problems. So now you've got a different kind of schedule. don't have as much flow in that, but what you do have is what kind of home life do you want? What do you do anything in the evening that you want to protect? Is there a dinner time? Is there a snuggle time? Is there a you want to go for a walk? Is there a hanging out with friends? I'm like, whatever those things are, and maybe it's not the same every day, but whatever those are, you want to kind of plan how you do your charting and whether or not you take it home that night based off of the things that you want to do. And you also need to be aware of your discipline and your tendency to let the work creep into the most important things. So, and I'll tell you another kind of filtering process that I use to make some decisions, because generally the choice. that we make aren't between whether it's a good thing or a bad thing, which is easy, right? Because if I know it's bad, I'm not going to do it. But it's degrees. So a lot of times it's between good or better or best. But because you've only got 24 hours in the day, and you're only conscious for approximately, you know, 14 of them will say, allowing for the waking up and then going to sleep and actually being asleep. But and then there's only so much that you're not commuting and you're you only have control over what you're doing. If you say, if you give your yeses to the good things, to just good things, then you don't have yeses to give to the better things. And you don't have yes to give to the best things, because you're already committed by doing good. Well, it's not bad that you're doing good, but it's not the best. And you know, we get one life, we get one day at a time to do things. So thinking about, do you want to have your best day or You want to have a good day, obviously. Nothing wrong with a good day, right? But good days are just that and they're not necessarily inspiring or as fulfilling. So just kind of thinking about if you finish your charting at work, do you have your best chance at having the best night or a good night, you know what I mean?\n00:28:27 - Chona Sweet (3)\nYeah, I mean our market's traveling right now, but we really are kind of like, I forgot the term used, but we like to walk at night or late at night even, like 9, 8, but I find myself charting, like if it's not here, if it's here I find myself charting. So I feel I'm not a morning person. So I like to do things in the afternoon or night time, so like the clinic work, it really starts at 9.45. So before I go to a clinic and if I have telemedicine, let's say I have 12 or 10 patients I need to call, I try to call that first while I'm at the house before I get to the clinic. And then Dr. E is like, oh it's a quick two, three minutes, four minutes phone call, but for me being new, I found myself talking to them for a longer time, that I don't think it's necessary, but I could have probably make it more necessary.\n00:29:49 - Tina Marie (profitdriversinc.com)\nYou know what you might do, I don't know if you'd be willing to do this, but call control skills are a big thing. I've talked to Mark about it because his people could use it. Most people don't have have great call control skills. Some people do, but it is a skill to kind of finesse a conversation and keep it on track, especially when you want everybody to feel good and you want to make sure that they're happy and they feel taken care of.\n00:30:20 - Chona Sweet (3)\nYeah, they don't feel right.\n00:30:22 - Tina Marie (profitdriversinc.com)\nYes, but you can to accomplish isn't whether or not they feel rushed. It's whether or not they felt heard, seen, understood, and taken care of. The timing is not relevant to them. So if you can deliver an effective conversation where they feel heard, seen, understood, and taken care of, they don't care if it took three minutes. They just care that it was effective.\n00:30:50 - Chona Sweet (3)\nDoes that make sense?\n00:30:52 - Tina Marie (profitdriversinc.com)\nRight, right. That's true. If you have the ability to record some of your phone calls and have Dr.\n00:30:58 - Chona Sweet (3)\nlisten to them and say, Okay, what could I have? down to tighten this up then maybe he can give you a couple of scripting type ideas like say if this comes up this is what you should say if this comes up this is what you should say or he might say things like chon never ask this question because it's always going to lead to way too much like and if you deal with this type of person like i'm sure since he gave you that kind of time frame he's probably got some finesse type skills that he's picked up that he could give to you but he might not even know where to start unless he hears you and goes oh yeah here's where you're messing up and you could tighten this up does that make sense right it does um although i probably feel like in a way dr e is the quintessential doctors that are i don't know how to say it but i'm pretty sure i understand what you're saying so it's like uh you're doing good no changes oh how's your kid okay great so Let me first let me refill your medications. We'll talk to you next time. Okay, that's it. So And I feel like in a way, I feel I need to ask more. I am sure because I'm still, you know new to the group and I don't usually call patients on the phone and end up just prescribing them narcotics, whether they're on it for a long time or not. Like today, for example, I was talking to a cancer patient. Cancer patients were more lenient with narcotics, right? want them to be comfortable, right? I'm talking during the phone and she sounds very, very sleepy. And I can hear there's family in the background coaching her what to say. I said, I can hear your family in the background, I can talk to them if you're okay. with that. And so I ended up talking to the husband and the daughter. And I was very, very clear to have to be clear that, you know, if you think he's being very sleepy, do not give the needed narcotics is the last thing you want is for her to stop reading. And, you know, things like that, I feel like there's just no way around it. I just need to make sure that they understand what I'm trying to say. yeah. And then the other day, there's a patient like, I'm done talking to with her. And then she's like, oh, okay. And I'm kind of like saying goodbye. And she said, you're the first person I talked to today. I feel bad, you know.\n00:33:45 - Tina Marie (profitdriversinc.com)\nAnd if I told her, I told her, maybe you need to go out and talk more to your neighbors.\n00:33:50 - Chona Sweet (3)\nI don't Yeah, those are the examples.\n00:33:57 - Tina Marie (profitdriversinc.com)\nSo, I I understand that there's a reason I'm a business for myself, and I make my own roles, because I want to do what I want to do and how I want to do it. And you have to operate according to the dictates of your own conscience, but you also have to realize where you're at and what's compatible. So one of the things is that I didn't get to a place where I could be how I wanted to be just because I wanted to be there. I had to create and I paid a price. I walked away from all income while I had four daughters to raise by myself four different times. It was terrifying. At one point I was on food stands because I just wouldn't take crap from clients that it was making me unhappy. So when I say I'll pay a price, I'll pay a price that most people would never pay in order to get what I want. But that's not, you know, but there are some things that I did tolerate because I just needed to and because of the bigger mission. required it and it made me a better person because it is important I think to learn how to work within certain parameters and not just give up or want to grenade everything. I'm really good at grenading things and just be like, you know, blow it up. So there are areas I think where you you might be like I'm I have an opportunity to serve and I feel like I need to and there might be other times where you feel that you have an opportunity to serve and comfort but this probably isn't isn't the time and isn't necessary and some of the parameters might be and it's going to be hard asking yourself so the conversation with the lady who's lonely that's a that's a whole therapy session right there it is and I feel\n00:36:00 - Chona Sweet (3)\nBad and to even say goodbye to her, but I redirected it in a way that gave suggestion, maybe a need to, you know, talk to your neighbors or call your family too. He's elderly. And again, I.\n00:36:21 - Tina Marie (profitdriversinc.com)\nSo I'm going to pause you just for a second because it you're not going to have the answers right away, but one of the things is you can kind of develop your own toolkit sort of thing. Right. So some of these scenarios that you run into and you know, this is going to take time. If I were to handle it the way that I wanted to handle it. But if I spend that time, then I'm going to lose my time with market nights because I have to spend more time charting because I spent too much time on phone calls. Or I'm going to be impatient with somebody else who also needs me because I spent too much time doing this and that's not fair to the next person. So there's all kinds of different reasons why it's important to. within boundaries because what they want and need most is is the medical attention that you've been assigned to give them. But what you can do is come up with some kind of scripted responses for certain types of things. So if you get somebody who's just lonely and you're working in a particular area, there might be resources that you could send to them and maybe you could say, hey, maybe you could get their email. Maybe you can just send them a letter and it's scripted and you have it pre-written. Like here are some things like I really want to spend more time talking to you, but and obviously there are probably things you just shouldn't say. Maybe you shouldn't have said that, right? You have to be careful what you say to anybody. Maybe you can say, hey, I didn't know. Maybe you didn't know about these resources and maybe it's a senior center and maybe it's a visiting program where people visit the elderly or or some sort of something where you've got a list. of resources for different types of needs that people might have. Maybe you have a cancer patient-specific type of list of resources like, hey, these are the things that you need to know and understand. For example, if they're too sleepy, here's the risks of taking narcotics. So is it more important to you that they feel absolutely no pain or is it more important to you that they live? You know, because sometimes those are the choices. again, just because I'm saying this doesn't mean that's the right thing to do. In the medical world, you have to be very careful with what you do. So I would run anything that you want to do and say by Dr. E, maybe by Mark, and just make sure that what you're doing is okay. But what I would say is try to find a way to satisfy that nurturing need that you have inside of you that loves and cares for people and why you went into that.\n00:39:00 - Chona Sweet (3)\nprobably. I think, yeah.\n00:39:02 - Tina Marie (profitdriversinc.com)\nYeah, but also keep it keep it in perspective that if you give everything to one person, then it takes away from the other people that you're giving to you. And so kind of balancing it out and also that you can't fix everybody's everything. Right. You're not their therapist, you're not their daughter, best friend, sister, whatever. But you can be the person that takes great care of their pain and use them the resources and make sure that they know that there are other options, actually cares. Even if they don't feel that you care, Jonah, you know if you care. So that has to be something that brings you comfort too. Because if you took this outside of the pain management, how many times have you said something to someone with good intention and care and concern and they acted like you said something bad? or tried to hurt them or didn't care about them and totally took what you said the wrong way. It happens a lot, right? Yeah. Okay, so, right, so but you wanna make this personal and bigger when it happens at work because it's work and it's important and they have needs but it doesn't change the fact that people will take things the wrong way. People will get offended. People will project their other issues onto you. You have to be able to deflect that. There's no way that you're gonna be successful in this long term and be happy if you don't learn how to compartmentalize and deflect that projection and those issues that they're just not yours and it's not heartless. I'm like, I'm a bear at heart, so.\n00:40:54 - Chona Sweet (3)\nRight. And I think it's just a matter of, I think I've been with him. for a month, but it it's only been the last week that I'm really on my own. Yeah. he, I don't know, I think he's just wanted to make sure that I'm supported and I said that I'm fine, but I do have, I still have, I still find it challenging or difficult to complete the charting each day. That's still, that's still an ongoing issue, but it's not a new issue for me, per se, like I tend to procrastinate, especially if it's something that I'm not, like, if I just, if I know I would, I'd like to do something, I can finish it in like a few minutes, if I really, really want to. So yeah, I'm gonna ask you a word question.\n00:42:03 - Tina Marie (profitdriversinc.com)\nAre you cold? I Get cold easy Okay, cuz you're hugging a pillow and I want to know if it's because they're colder because they're stressed out and it's a defense Oh, I know the pillow is my comfort. Yeah, it's comfort.\n00:42:18 - Chona Sweet (3)\nYeah Here like if I don't feel I guess It's like comforting because of other issues like You know with my you know other Insecurities with my body when I know that that's what I thought that that was and I just wanted to check if it was You just happen to be cold and it was warm or because Yeah, but when you got it And the way that you hugged it it kind of was an indicator that that that you that's that's this is trustful little comfort it definitely might comfort and I Get Well, I feel like the body image issues one thing, but this work, I don't like it when there's no, I don't have the flow because I just don't have it yet, it's beyond my control. So until I have that flow, until I know exactly what I'm doing in a week or two weeks, I would feel a little uneasy about it. But I'm trying to control what I can't control, that's where I'm at. Learning things about the PI and just, I feel like I'm trying to do things like simultaneously.\n00:43:46 - Tina Marie (profitdriversinc.com)\nYou're doing a lot right now, it's a lot to learn and it's not just a lot to learn. I would imagine there's some things that go through your head like, I don't really have to do this because you don't have to do it. It's one thing when you have to make money and take care of your family. It's just not, you know what I mean? But you have bigger aspirations and you have goals about how you want to see yourself.\n00:44:12 - Chona Sweet (3)\nYeah, I definitely, you know, that's what I did the Washington right away and, you know, Mark is helping me kind of start the conversation about having clients from different chiropractors.\n00:44:26 - Tina Marie (profitdriversinc.com)\nYeah.\n00:44:28 - Chona Sweet (3)\nI know it may not happen until early next year, but at least I get my licensure and then hopefully we can start. I guess Mark is saying that I need to have a different LLC for Washington. Oh, yeah. I don't know. But, you know, that's like one thing and I definitely need organization with my receive. I don't know. What I'm doing now is taking a picture and putting it under my favorite. But with the upgrade updates of the iPhone, like I cannot see the favorites right away So I Just need to be more organized with that. don't have a lot of You know expenses right now, but the other thing that comes up is you know, I I need There's a lot of good things happening in my life my career like I really need to take care of my my body myself So I start working out and the instructor that I mean them The instructor that's helping me she have a scheduling system that texts people and I know markets kind of working on that as well But a keyword is mark is working on it and not mean I feel like like you're waiting I feel like I cannot it appreciates me that I have to wait for him before I can move forward I trust what he says, but it doesn't mean it doesn't frustrate me. Also, I understand that I'm not ready to eat my own in that honor itself also frustrates me. I feel like, you know, in my head, I cannot be super ready for this. I know I just have to like learn as I go, and I'm trying my best to understand as much as I can. And I also understand that with me doing this affects marks reputation. So that worries me, makes me anxious, but that's a conversation I have within myself that, you know, I know I'm new, but I have, I'm not new to what I'm doing medically. So that's just, it's like just all those things that I... My question is to Mark about this and you know, I'm sure it's just that growing process of this having a new thing.\n00:47:11 - Tina Marie (profitdriversinc.com)\nYeah, that's the biggest thing is the newness of adult, everything's new. relationships are new, the processes are new, the pressure is new, time management is new, the knowledge of some of the things including business and different responsibilities. That's all new. Like you're having to wrap your head around and your body and your energy and your schedule and your routine and your mindset around all of these things all at once. And that's a lot, but you can do it. And one of the things I would love for you to do is just every day tell me something that went good, tell me something that you're proud of. So like you've got the Washington stuff done, that's great. Every day, just every work day, just send me something that you're like, I'm proud of myself for this. If you're struggling to find something like that and you tell me tonight, I don't have anything I'm proud of today, I'm going to ask you a bunch of questions until we find out what your product is, because there's no way you didn't do something that each day.\n00:48:17 - Chona Sweet (3)\nOh yeah, I know. I feel like I'm already proud of, I know I've been there for, I think, on my third week, I was able to get the electronic prescription that my colleagues that's been there for a while apparently took them two to three months to get while I get it in three weeks. I was proud of that. Good job. I was at the other doctor that came at the same time with me, that started at the same time with And he texted me, and he said, how are you able to get get the, the, he he he he said, He skipped fast, so I tried to help him. But anyways, I was proud of that. But I don't know if I'm too, I'm proud of how I get it, but how did you do it? So I can call them multiple times, and it's frustrating. And there's a multi-step process that they have to verify cross match with your credit score and all of that. And for some reason, they cannot verify me. So I created an email. I created a ticket. And on that ticket, I wrote a long email, basically saying that I do not understand why their company or their system cannot verify me while the other government institutions like the DEA. Okay, for the California Board of Nursing, things like that, I mentioned names, these bigger government institutions can verify me, and your system cannot.\n00:50:14 - Tina Marie (profitdriversinc.com)\nAnd how hard is that?\n00:50:16 - Chona Sweet (3)\nWell, I was, everybody, that's my favorite thing, is just be like, listen, so yeah, I kind of basically also said that, look, the way that your system is holding me back on taking care of my patients, so yeah, I was, I was initially part of it, but then I didn't know that Dr. E's manager can also see the text, and we talked to each other and she's like, man, I saw your text, I'm like, ooh, Jordan can be spicy, and it's like, I was annoyed.\n00:50:52 - Tina Marie (profitdriversinc.com)\nLook, first of all, you're going to be able to take care of patients better, and maybe somebody got a little fire lit under them, they probably didn't, but You know, their apathy is a plague in almost every type of business and definitely inside of government institutions and good for you standing up, but good for you articulating. And here's the thing, because you keep talking about like what you can't do with your English and grammar and whatever, but your ability to articulate the, that's a good lawyer tactic by the way. Also, that argument was indefensible because you're like, wait a minute, like all these other people can verify me. The same information is available to you, yet you can't seem to be able to do it. I'm not going to tell you your inept, but basically I showed you your inept and also it's costing my patience.\n00:51:47 - Chona Sweet (3)\nGirl, I was shocked when someone responded to me via email on a Saturday. I was like, I keep on responding to them back and forth, I like caring. I try it again. I keep on trying and then I kind of said it like not ultimately but kind of I said this is the third and last time I'm going to try this. If this doesn't work your system needs to override me. That's what I said and they did. So I was actually shocked it worked but yeah.\n00:52:20 - Tina Marie (profitdriversinc.com)\nI'm not that's my go-to move if I have problems with people. I don't have problems with Mark because Mark is always nice and good and everything but like if I like teachers, principals, whatever somebody not handling business very well, accompanying.\n00:52:37 - Chona Sweet (3)\nYou know what this reminds me actually and I was telling Mark this that I really wanted to become a lawyer when I was in college but anyway that's a different story.\n00:52:48 - Tina Marie (profitdriversinc.com)\nOh it's your but it fits perfectly with what you're doing because patients need an advocate and an advocate is another word for what attorneys do right. They advocate for their clients. Well, you need to advocate for your patients and that's all that you were doing as you were advocating for all of them by being able to have this process and do that so good.\n00:53:10 - Chona Sweet (3)\nSo that what I was doing is Dr. E would let me see all his patients either with him or by myself just until I get used to it and then he has to order the medication for me and then the patient starts to get upset at me coming back or calling to the office saying you didn't set my medication but it's not my fault it's Dr. E's fault because he doesn't do it on time. So I have to do work around on that one where I said you're here, log in and I'm gonna order this and let you look at it before I send it so that's what we've been doing and I don't like that. I want to do it my own on my own my own time.\n00:53:52 - Tina Marie (profitdriversinc.com)\nSo yeah. Okay, so here's what we're gonna do I need you to time five new patient charts. and five follow-up patient charts okay okay just do it as accurately as you can it just will give us a baseline to kind of figure out what it's doing and and we'll see what we get from there okay you're using drag and dictation that has to train that takes a little while there could be some shortcuts some abbreviations things like that it'll take a little while to figure out how to optimize your charting system as much as can be done and then the other thing the other assignment is I really want you to map out and and write out what does your ideal week look like are there particular times of the day or times of the day on specific days of the week where you're not charting you're not staying up late you're doing something else going for walks with Mar watching TV, resting, whatever, like whatever the things are working out.\n00:55:05 - Chona Sweet (3)\nYou want me to think of like in the future or my ideal in the period.\n00:55:12 - Tina Marie (profitdriversinc.com)\nSo how about now like what is compatible with your life as it is right now and what you would like it to be a year from now?\n00:55:22 - Chona Sweet (3)\nOkay because I feel like with the Washington it's gonna be busy. That's why I mentioned once that starts and you know took off then I will have to pick and choose what I do with Dr. Lee.\n00:55:41 - Tina Marie (profitdriversinc.com)\nThat's part of the benefit of this exercise is that we compare it with what you actually have to do and what's actually in your life and go do these things match up so either you're giving up some of what you ideally want in order to do these other things and maybe it's temporarily or you optimize your day and your time a little bit better because you want to do the work and also you want to have these other particular times. So the biggest part is just consciously evaluating what has to be done, what is wanted to be done, and how the two are compatible and where the compromises have to happen if you're going to do it all and what compromises maybe you're just like I'm not I'm didn't sign up for this this is not what I want to do but where you probably will be like instead of that and that extreme like okay I want to do all of this so how do I get more done in less time how do I and then it probably will because you're taking a lot on figure out which things are best for you whether because it's more satisfying to you it earns more money, maybe it's something that you and Marc get to do more together of in the PI stuff, even though you don't like that, like there's all these different things that have to be evaluated and they all have different pros and cons.\n00:57:15 - Chona Sweet (3)\nRight. I think eventually when that time comes, and I call it as a retirement career, because I feel like I will always want to do something using money, is that I can travel, and Marc can never talk about this, I know that eventually our goal is to be able to travel and still make money. Yeah. Well, like if I do the telemedicine, even if I call a certain amount of patients finding that sweet number is the goal later on, that will still make me money.\n00:57:55 - Tina Marie (profitdriversinc.com)\nYeah. Yeah. And when there's also point where you make enough that your money can be the way that you make your money through investments and other types of things. So if you have any type of interest in that, that's, that's, and just how long do you work? Do you want to work five years, 10 years, 15 years? How much do you want to work? How much do you want to earn? How much do you want to have in your investments making money for you? not just because it's money, but because you, you had, you wanted to feel like you did something productive and meaningful. And the one thing about earning your own money is that you feel like you can put it towards the things that you want to. Like, it's a different level of satisfaction. It's not about the money per se. It's about what it unlocks for you to be able to do. It's just a resource. you have your own time. Sometimes you have your own energy, right? have, but, but money is just another currency exchange that, that we use.\n00:58:53 - Chona Sweet (3)\nSo it's not, but anyway, not the end of, you know, it's, it's, Yeah, it's not my, I want that so I can buy or do something that I want. make the travel and make money, think that's like the best thing I have.\n00:59:11 - Tina Marie (profitdriversinc.com)\nI mean, my work is portable.\n00:59:14 - Chona Sweet (3)\nI can take it anywhere that I want to.\n00:59:16 - Tina Marie (profitdriversinc.com)\nAnd I think about money for me and like energy. I don't, I don't want a lot of things that other people do, but beauty is important to me. scenery is important to me, experiences are important to me and they energize me. And with that energy, it increases my creativity, but also I take that energy back to my people. So, you know, being poor is not compatible with serving people the way that I want to serve them because I want to be thinking low level thoughts instead of high level thoughts. You know, there's a lot to take into account anyway, but so every day. Just tell me something that you're really proud of and that that and just celebrate the wins. You can tell me the things that you're frustrating. with you but we have to end it on this is what I did good or learned this is how I grew this is like some kind of something like that every day because it will just help keep things in perspective I need you to and I will write this out map time five new patient charts and five follow-up charts yeah every day just using dragon and getting a practice at it and just kind of seeing and observing do you feel like it's getting better just kind of just kind of watching the process and seeing what you can do and that's a start like that's a lot to do for this week and then the ideal week like what does the ideal week look like now and then a year from now knowing that it's going to change knowing that we're never going to have that picture exactly but that we have the greatest chance of creating something that you're really happy with by being intense. Intentional in terms of how you create it Yeah Thank you You're welcome. Do you have any questions or anything? No, I um, I just yeah I I need to that's a very you know like actionable I said like I need to tie myself Yeah, and don't don't stress and obsess but you do wanna always push yourself like you committed to giving your best and I'll so I'll tell you one last thing real quick before we go and this is kind of my own Tool that I use and I call it an energy sandwich So if I have to do things I don't like Anything I don't like drains my energy and it makes me in a bad mood. don't like doing there's a lot of things to do But so the first thing I will do is I'll start that activity before I start that activity I'll do something that I like um It could just be snuggling with the dog. It could be talking to somebody I like. could be I had a good lunch. It could be a nap. It could be all kinds of different things. It could be good music. It could be sunshine breaks. I like to go outside and just let the sun absorb into my skin. I get the energy from it. It feels good. And then the other thing is afterwards I plan something that will boost my energy as well. doesn't have to be long. Sometimes it's just putting on headphones and listening to something that without fail I cannot be still. It makes me dance. It makes me just feel good. So I use music really strongly like that especially if I don't have a lot of time. And the other thing is if I do something that's super stressful then I need to go do a physical activity because the tension is in my muscles. So like a little walk that might be when I go to the gym depending on how much time I have. I might do some housework. Sometimes I will just pace back and forth. but it still gets all the energy out. So just kind of noticing how your activities are impacting your energy and trying to sandwich good things in between bad things, even if it's just for five minutes here and there so that you're not staying in negative energy for any excess of amount of time. Okay, I know I've talked your air off already.\n01:03:25 - Chona Sweet (3)\nI'll let you go. Thank you so much. don't know where Mark is but he's probably asleep now.\n01:03:32 - mark sweet (3) (sweetlaw.com)\nAll right. I will talk to you guys.\n01:03:33 - Chona Sweet (3)\nI'm here.\n01:03:36 - Tina Marie (profitdriversinc.com)\nOkay. That's if I were you because I wouldn't want to listen to myself talk that long. anyway, have a great night.\n01:03:43 - Chona Sweet (3)\nI will send you an email in a few minutes with all those assignments. Okay.\n01:03:46 - Tina Marie (profitdriversinc.com)\nThank you, Tina. Welcome. Bye.\n","contentPreview":"00:00:00 - mark sweet\nCan you hear me?\n00:00:01 - Tina Marie (profitdriversinc.com)\nYes. Shona's not here yet though.\n00:00:06 - mark sweet\nYeah.\n00:00:09 - Tina Marie (profitdriversinc.com)\nYeah. Eve...","processedAt":"2025-05-04T03:40:52.513Z"}