{"fileName":"Transcript for Basis(1).txt","filePath":"/Users/tinamarie/dev/SecondBrain/apps/ai-writing-system/writing_samples/transcripts/Transcript for Basis(1).txt","type":"transcript","priority":"medium","content":"00:00:01 - Tina Marie (profitdriversinc.com)\nHello.\n00:00:02 - Dan’s iPhone\nHello.\n00:00:04 - Tina Marie (profitdriversinc.com)\nAnd how is Dan Ryan today? Mark's dog has pneumonia.\n00:00:13 - Dan’s iPhone\nYou won't.\n00:00:15 - Tina Marie (profitdriversinc.com)\nRonin.\n00:00:16 - Dan’s iPhone\nYeah. I'll call him said dog.\n00:00:18 - Tina Marie (profitdriversinc.com)\nYeah. The neighbor dog had pneumonia and they didn't tell.\n00:00:24 - Dan’s iPhone\nThe neighbor.\n00:00:26 - Tina Marie (profitdriversinc.com)\nYeah.\n00:00:27 - Dan’s iPhone\nOuch.\n00:00:29 - Tina Marie (profitdriversinc.com)\nYeah.\n00:00:30 - Dan’s iPhone\nYeah. That's... pneumonia is communicable among dogs.\n00:00:35 - Tina Marie (profitdriversinc.com)\nIf it's viral, it is. Well, you also know. Because there's viral and bacterial pneumonia. back then, viral is always contagious. And he has to be on 10 days of medication. he said they have to cancel their trip to New York. So I'm guessing at his mom and somebody. I don't know who, but... And him and Jonah are on a vacation together right now. So... that's probably super stressful for him.\n00:01:03 - Dan’s iPhone\nOh yeah.\n00:01:04 - Tina Marie (profitdriversinc.com)\nOh my gosh. My dog. She's got this weird like dark spot growing like her hair. She's getting this dark spot all of a sudden. She's a poodle and a bichon frise so they don't have spots and it's dark and it's wiry and I'm like what the crap is going on? I don't have a tumor or something and she bit as she tried to like bite a skunk in the butt before the sun even came up a couple days ago. That was a terrible way to wake up because my daughter's like mom she's foaming at the mouth and I didn't know if she was my daughter or the dog because she was just going to seminary.\n00:01:51 - Dan’s iPhone\nYeah. we discussing right now?\n00:01:53 - Tina Marie (profitdriversinc.com)\nI'm just like I'm trying my best not to cuss everybody out right now but don't tell me nothing like a name. Stop.\n00:02:00 - Dan’s iPhone\nFollow me.\n00:02:01 - Tina Marie (profitdriversinc.com)\nYes.\n00:02:01 - Dan’s iPhone\nWhoever it is.\n00:02:02 - Tina Marie (profitdriversinc.com)\nYeah. Yeah, it still smells. So it's been a good doggy week. All right, let's get on to this. It's funny because when I go into my notes, I have it's just weird, actually. I don't know if this was a new notebook because because this, hold on, these cannot be from 2022. The notes date says October 2022, but like thing I'm a jig and is in here.\n00:02:37 - Dan’s iPhone\nThat's 2022.\n00:02:39 - Tina Marie (profitdriversinc.com)\nReally?\n00:02:40 - Dan’s iPhone\nThere's no way we're talking about that recently.\n00:02:42 - Tina Marie (profitdriversinc.com)\nWell, no, I know, but I think it was way longer ago than that.\n00:02:46 - Dan’s iPhone\nOh, no, probably not.\n00:02:48 - Tina Marie (profitdriversinc.com)\nI'm to go look at my notebook and see if like there's more here or something because usually, anyway, the oldest note is at the top. I feel like there must have been... whatever. that was just funny. Okay, here's the call log for fan flow remarks had sent it to Dan, but I've saved it to the fan flow you know as well. What do I want to call log for fan flowy? Oh, fan flowy, not okay. Okay, that's what that is what I wanted.\n00:03:32 - Dan’s iPhone\nI got it.\n00:03:37 - Tina Marie (profitdriversinc.com)\nOkay, taking a break from G4 because we're working on fan flow in mom and mapping out all the stuff, ads, ad copy, lead, mac and neck, superfan, band growth system and waiting for the book And Stacy was supposed to give you a task to complete your GA for container by the time we'll for goes live. So we're trying to do that happen.\n00:04:12 - Dan’s iPhone\nI don't log into team works.\n00:04:14 - Tina Marie (profitdriversinc.com)\nI couldn't tell you. Well, did you did you create the content where we are?\n00:04:19 - Dan’s iPhone\nWhat's today that I have a created container now, but it's not. When he first he's working launching. I actually did work on it a little yesterday. It's worth of percentage value.\n00:04:39 - Tina Marie (profitdriversinc.com)\nBut even though you don't work log into teamwork, are you still meeting with Stacy and Eric Monday, Wednesday and Friday?\n00:04:46 - Dan’s iPhone\nYeah, I'm just saying that like I don't like if she I thought you were asking, did she create the task and teamwork? I literally have no idea. Um, I use teamwork only to respond to like tasks that exist. So I know. Yeah, sometimes I log in, like mostly I respond to email, but if I have to upload stuff, I tend to log in. So I just logged in to respond to Greg.\n00:05:14 - Tina Marie (profitdriversinc.com)\nOkay, are you still meeting with them every Monday, Wednesday, Friday?\n00:05:19 - Dan’s iPhone\nYep.\n00:05:20 - Tina Marie (profitdriversinc.com)\ngood. Write it down.\n00:05:23 - Dan’s iPhone\nJust going to get more. Their favorite meaning.\n00:05:37 - Tina Marie (profitdriversinc.com)\nSo does Stacy ask you about tasks then?\n00:05:40 - Dan’s iPhone\nWe do a thing called, so we also have like a, I know if you know this. But maybe if you've heard this one before. So once a month, we have an in person meeting. It's the last something of the month. Again, I forget what the schedule is. Pick it to Friday. I think it's the last Friday of every month, and in that meeting, we go through everything. Anything like it's old, it's new, it's anything that she has on this other sheet that she maintains. And then the Thursday after that meeting is called Old Test Thursday, where I'm only supposed to work for kind of old tasks, which is another sheet that she maintains that I reference when it's that Thursday. And sometimes I knock those things out, but that list is getting shorter and shorter and shorter. We might not need to keep doing that. A bunch of them are woofer based, they'll be done at this moment. But yeah. So yeah, we go over everything, topped about them on that one thing, and then on that she just pings me like, hey, have you seen this? Someone commented back on this, right? So, Like, that was what just happened, somebody, like, I didn't know it, but for like a month, my basis email wasn't working. So I wasn't getting emails from anybody at all. So if they emailed to that note, I was emailing out from D&D or whatever, but I figured it, and I fixed it. But she'll like pin me on tasks that are like static or, you know, sitting there, she's like, Hey, someone, they comment to back, you need to go look at this. But she'll bring that up on the calls to, Hey, sometimes she sends slacks and opens, let's go look at it right now. Yeah.\n00:07:38 - Tina Marie (profitdriversinc.com)\nOkay. Well, I have a couple of questions for her and teamwork. So that will help me. so have you, this is what I thought was going to happen, but just wanted to check, did you not work on anything with GA before between last weekend now?\n00:07:56 - Dan’s iPhone\nNo, I do. Oh, you did start. Yeah, I just started. Mapping out like, some of the stuff from Mercer was like, he uses these, I think they're called templates. Am I ever wrong? But there's, I think they're templates. There's template libraries in GTM. We have never used them. So I was mapping out like, hey, we're not going to do, giving you an example, clarity. So Microsoft Clarity, we're doing it the old way, where you paste the HTML. The new way is to use the Clarity template. The same thing would apply to like Hotjar, but we don't use Hotjar anymore. But it may be Wistia. I was looking at like, okay, we got to start using templates where there are templates. So yeah.\n00:09:04 - Tina Marie (profitdriversinc.com)\nlike they have templates for Hotjar and Wistia or there.\n00:09:09 - Dan’s iPhone\nOkay. Yeah, it's like a look. There's like search area where you can search for templates. So there's those and then there's like one other one that I cannot remember the name of. So yeah, don't think that one exists anymore. That was one of the questions I asked them, but they were referencing another one that doesn't exist or so we'll be using that. I asked them how we're doing that now. They explained it to me. can't learn one.\n00:09:36 - Tina Marie (profitdriversinc.com)\nYou're getting super deep and growly voice where I can't understand you.\n00:09:42 - Dan’s iPhone\nListen, I can't help my voice.\n00:09:45 - Tina Marie (profitdriversinc.com)\nYou can help your voice.\n00:09:47 - Dan’s iPhone\nGod gave it to me.\n00:09:48 - Tina Marie (profitdriversinc.com)\nYou sing.\n00:09:50 - Dan’s iPhone\nSo you definitely know how to help your voice. Sorry. Yeah, so that's it. Just like, oh, hey, we need you. templates where there are templates but these are the templates that we use and then like we're no longer like hot showers out where we that used to be part of our container will no longer be in our container. Oh the other bit is uh well I didn't do this but I just remember this kind of uh gotta send this to Norio but they said do not use visual website optimizer in GTM which I've experienced that issue but they're like yeah don't do it. I gotta figure out a way if we can put that I'm gonna have Norio add like a scripts area to the GTMizer that I can just load grips in which is probably good secret.\n00:10:46 - Tina Marie (profitdriversinc.com)\nYou need to have Norio add scripts area to what?\n00:10:50 - Dan’s iPhone\nGTMizer I mean it's literally for PWA on our communities. for theirs. It should just be like VWM and no one would use it. I mean, you could use it otherwise, but we'll maybe mark it as VWO.\n00:11:19 - Tina Marie (profitdriversinc.com)\nOkay. Does Optimize that you've been existing anymore or Crazy Egg?\n00:11:23 - Dan’s iPhone\nI don't know about Crazy Egg, but Optimize that he does, I believe.\n00:11:27 - Tina Marie (profitdriversinc.com)\nYeah.\n00:11:29 - Dan’s iPhone\nBut I've got like this grandfather account with VWO and never letting it go. Yeah. Yeah. 60 bucks a month.\n00:11:38 - Tina Marie (profitdriversinc.com)\nNice.\n00:11:39 - Dan’s iPhone\nYou mean these?\n00:11:42 - Tina Marie (profitdriversinc.com)\nAll right. Wait, what the? Oh, I must have it open into windows. That's not useful. So, let me look at this. What date is this October 4th? So you came up with the model, so the SaaS model plus coaching plus buying catalogs plus sign artists slash rev share plus distribution revenue streams and you might not say you need to model how the revenue will look percentages of each of that. for you and the guys. So what's the situation with buying was it lands down.\n00:12:33 - Dan’s iPhone\nSuperrolls, oh, lands down. I don't know. I'm really talked about. I met with.\n00:12:42 - Tina Marie (profitdriversinc.com)\nRight.\n00:12:44 - Dan’s iPhone\nI was going to run up by Rhonda because so meet with her next week, I think I was going to run up by her, but then I met with this dude. This guy that. Joe interviewed on his podcast of the two. Oh, so the podcast the guy said. a couple of interesting things. So, many, many years ago, think it was Ezra Fierstown. I don't know where he said this, but he, I don't know if he was on a podcast or something, but he was talking about like, you know, he started making all this money and then he had like a tax person and then the whole, the whole thing, right, like around and he said, but then he was also starting to get around people had more money than him. And one of those guys said to him, hey, if you're a tax person and CFP makes less money than you do, then you need a new tax person than CFP. And he's like, because they can't, they, how can they possibly do that, right? They don't know what it's like to make that much money, like they don't know what it's like to, and I was like, that's an interesting point, like, like, why would I like, I wouldn't go hire someone to run ads that hadn't run as as well as I had, right? So I'm like, what would you, right? But you don't think about it in those terms of the thing. That sort of stuck with me, but I never really did anything about it. And then like, you know, Rhonda, not the bag I'm wrong, but right. Rhonda doesn't listen to me, right? Rhonda's executing Rhonda's plan, which I get, right? So her plan is like conservative. have a target. We're trying to, we're trying to end up where you're maintaining the same lifestyle until into your 90s so that you never run out of money. And that's a common sort of plan. It's certainly better than the plan I had. And so she's working that plan. And then the dude that Joe was interviewing said something like, you have a tax preparer, or do you have a tax planner, these like a tax. preparer looks backwards and then says this is how much money you owe. He's like a tax planner looks forward and they say they look at how much money you might owe and then they put strategies in place to mitigate that. And he's like if you have a tax preparer you need to have a tax planner and he's like that makes a lot of sense. And then he was doing some other stuff like you've probably seen the whole infinite banking or the family bank thing that comes up every five years. It's back.\n00:15:35 - Tina Marie (profitdriversinc.com)\nI think is always thinking about that and wanting to work on it.\n00:15:39 - Dan’s iPhone\nWell, I'll send you this dude. I like this dude. I talk to this guy. So there and then my buddy actually wrote a book on it. That's how I actually got it. I actually heard about it somewhere else and then this dude that I know here actually wrote a book on it and he sells those policies. Well, what these guys do like I've seen other their people do is like, it's the basis of their sort of wealth pyramid, literally. yeah, when you start with that, and then they also go into like alternative investments and tax strategic investments. one of the things that he said on the call was like, yeah, you he's like, if you're, oh, the other thing he said in Joe's thing was, hey, if you're someone that's got like an eminent, um, crazy use, whatever. It was basically like, if you're someone that's going to be selling your business and you're going to have a huge influx of cash, he's like, you need, you need to have a plan before that happens, right? need to be, you need to have your tax strategy laid out so that you're not paying 40%.\n00:16:50 - Tina Marie (profitdriversinc.com)\nYou're not paying this huge cap gains. What Dexter would tell you is instead of a tax planner or taxpayer or accountant at all, what you would want is a wealth manager.\n00:17:00 - Dan’s iPhone\nthat's what these guys are.\n00:17:01 - Tina Marie (profitdriversinc.com)\nYeah, they know the laws even better.\n00:17:06 - Dan’s iPhone\nSo what he's saying is like, hey, we have like a whole suite, right, that we have lawyers, have tax people, we have the accountants, we have the investors, and we're all sort of following the same program, and we all investment opportunities, and then they also will help you sort of go through one, so like my example is like, what if I want to buy multiplex?\n00:17:38 - Tina Marie (profitdriversinc.com)\nlike, I don't know about that.\n00:17:40 - Dan’s iPhone\nSo yeah, oh yeah, no, we can bring it to you can bring it to us, bring it to bring it to the group or whatever, bring it to this mastermind, whatever the hell you want to call it. And then we could walk you through how to do the deal, like they're not in on the deal, but they tell you what to look for and what to, you know, negotiate about. Okay, yeah, that's exactly.\n00:18:00 - Tina Marie (profitdriversinc.com)\nwhat I want but he's like we don't help you find the deal but he's like we do find other deals that you can invest in or not but one of his things was like he's saying that you invest in energy you invest in oil and that these create these huge tax offsets but he's like what do you think you're paying tax right now I said I honestly don't know like it's got to be 40% he's like I could probably cut so sorry I was just thinking because Seth is big on trusts and he's like been studying this for years and like I am wanting to have conversations about it but so that I can understand it better because it's a scary kind of thing but basically and I just out of curiosity you might want to talk to him I don't I don't know how rebellious you want to be I already helped up\n00:19:00 - Dan’s iPhone\nThat's my problem is that like the parts that make sense to me. I've executed right. So it made sense to me years ago have a solo 401k. I don't know why I set it up. And then when I got with Rob, she was like, how did you do this? It's like, how did you even know to do this and how did you do it? And then she's like, is this real? got as far as I know and it's real. And she took it over. And that was the right thing right now. It's this vehicle that I use. And then I got like, I have this one insurance policy with Denise and I, this was the dude that does the whole life. Like, I wasn't ready to commit the whole life at the time because I did. I mean, I understood it, but I was like, I don't think I could do that. I could definitely do it now. I don't think I was like financially really where I thought I could do it and not put myself in position where it might come back to bite me in the , but although I sort of think that isn't actually real thing. knew we were going to move, right? So I was like, I might need money for the house. I can't have money tied up in anything, so whatever. So I didn't do it then. But what I did do then was he had this other life-in-term thing. It's like a second to die policy. And it's basically like, essentially once all's been done, it's like the if I die or Denise dies, one of us dies, the other one gets like $3 million, something like that. And so he was like, this is how the policy works. And I told it to Ronda and Ronda was like, there's no way. There's no way it works like that. She's like, I need to meet with this guy. And we met with him. We went through the numbers and Ronda was like, holy , it does work the way. She's like, what the? And she's like, yeah, you could do that. I got the trust. So I set that up first. I think I got that. But then, What is this? His name is David Dark Angelou. He was like a friend of a friend.\n00:21:07 - Tina Marie (profitdriversinc.com)\nI heard that name before.\n00:21:09 - Dan’s iPhone\nHe used to work with Tony Roberts bunch.\n00:21:12 - Tina Marie (profitdriversinc.com)\nWay back in the Roberts or Robins.\n00:21:15 - Dan’s iPhone\nRobins, sorry. He's like he's never really been in the Internet marketing world.\n00:21:22 - Tina Marie (profitdriversinc.com)\nYeah. I know I've seen that face too. long time ago. Oh, not that dude. Okay. Go away.\n00:21:31 - Dan’s iPhone\nSo he was like someone that I met years ago and like he actually recently hit me up. was actually going to hit him up about this whole life thing because I know that he knows that game. Right. He knows where to find the policies and yada yada. So when I talked to this other dude, I was like, well, hey, don't have to buy the policy through us. So they're like, we just help you. Oh, dude. Sorry.\n00:21:57 - Tina Marie (profitdriversinc.com)\nLet's try to get it. Subscribe to him so I don't forget.\n00:22:00 - Dan’s iPhone\nThey just show you like all the strategies and then they have like investment opportunities. Your paying for access is basically what it blows down to, access to people that are doing the same thing. he's like, look, you'll be in the room with people that have $100 million, just straight up just so you know, but I could show up with the whole life policy of, yeah, you don't have to buy it through us. Okay. I thought it was interesting and it's like, okay, so your base thing is not the thing that you're making money on, like the thing that you're telling everyone to do first. He could make money on it, but he's like, no, you can, you're ready to trust that up, would just make sure you can just go through the checklist and make sure it's set up the way it should be. Okay.\n00:22:44 - Tina Marie (profitdriversinc.com)\nYeah. Um, all this stuff fascinates me and I think that my guy is finally going to be done with crap in a few months, I don't know, I really hope so, because 10 years is a long time. Yeah, it is. It would break most people or they would move out of the country or just be thrown in prison because they tie your hand so bad you do something and that's the consequence, which is why I'm actually interested in having these conversations with Seth about trust and stuff, even though I'm sure he already knows a lot of that but doesn't want to talk about it because they just scared the life out of you. Anyway, um, lands down.\n00:23:32 - Dan’s iPhone\nOkay, so, so, anyway, I'm to talk to Rhonda about that. And I did talk to, I did talk to this, this Dave person about it. So like, you can bring, I was like, so I could talk to you about like these things and I'm considering things like, yeah, and I think I gave them that as an example. And I go right. I could like, oh, the other thing I asked them because I actually weirdly or not, right. for this dude, shut up. I started looking into whole life again on my own. I was like, can you everything I looked at? Like, you couldn't pre-fund it. And so I asked him, I said, can you pre-fund one of these? He's like, you can. He's like, you just got to, it is possible. You can do it. It's like, you just got to make sure that that's the setup that you get yourself. then you can pre-fund it. Because what I was reading was like, you have to fund it for three years before you can actually then take a loan against it. So in my version of the world, I would fund it. And then if I do the Lansdown thing, I borrow the money from myself, which is the whole point of doing that . And then use that to buy Lansdown. Then I pay the interest on Lansdown with the money that I'm making from Lansdown. So I make a little less. Whatever. And then he's like, again, you just pay back at any time, right? not like a real loan. then, of course, that's where you use to like buy your kids. Give your kids a loan for their house. Oh, like if you have enough money there, it's like, okay, cool.\n00:25:05 - Tina Marie (profitdriversinc.com)\nOkay, so that's still on the table. Let's see. I'm looking at last week or actually probably the last couple of weeks with mom course development or just stack or offer or anything.\n00:25:45 - Dan’s iPhone\nSo Sean is evaluating circle as the community and it sounds like it sounds like it's so funny. He's like, I don't think this is going to work. It would be great if it did this. So he's doing this all via text and he's basically just texting himself. like he's texting questions to the group. And then in the course of like nine texts, he figured out he convinced himself the circle was the right solution.\n00:26:09 - Tina Marie (profitdriversinc.com)\nWas I glad you worked that out with yourself.\n00:26:17 - Dan’s iPhone\nBut he's sold on it now. He's like, Oh, course, this is what I was saying the whole time. So we got to get that set up. It's set up. It's on the trial, whatever, but we got to get it set up. So that's now going to officially be the thing. Then that's where the course would live. So now we got to figure out I got Greg like finished the cover today. And then I just sent him a message. was like, Hey, I can either just drip. He did the cover in the first worksheet. I said, I can either drip the worksheets on you one in a row, one in time, or I can dump them all on you like in a priority order. Let me know. but you prefer. So based on his answer, I will do whatever he says, my plan is just to go, because he did literally did the first one on the book. So then we'll do the second one, the third one, fourth one, I think there's like nine to 12 or the other. So we'll get all those done, and then the book's done, and then I had sent Eric and Abhishek, those guys, the book funnel, all I was like, we can build this on new bases, right? they're like, yep. Then I sort of told Maria, hey, don't be surprised if I can tell you women a project here in the near future center. I don't think I sent her anything though. just emailed her back for me, but she told me.\n00:27:46 - Tina Marie (profitdriversinc.com)\nI got her. She's getting big co-honies now. She put out a $15,000 offer and a done for you instead of the $2,000 stuff, and she's just feeling good. and she's got people who are would be a good fit for that.\n00:28:06 - Dan’s iPhone\nSo then the course that we would have to make is the do it like just walking them through like how to do all the ads and stuff. So we got to sort of map that out because it's like I guess we'll just we'll do it like we'll make the email portion but then put it in your CRM and then the CRM we're going to show on the screen is ours. It's family but it's like you would just send her in your CRM whatever it is. I do mail chimping like in whatever is. And then I was going to hit up the super res guys I was thinking about that and I'm like I was just probably so I was going to hit them up and be like hey let's do like a hybrid hybrid non-commercial model. So it would be I pay you to customize it. I get to call it fan flowy. I am not going to sell it. Right, so that eliminates me competing with you not only am I not going to sell it I'm only going to allow people that have already become a lead for me to get access to it So it's not even good like you won't even be able to go download it from the site Right, so it's like it's sort of behind It's gated to whatever degree And then I'll pay you The customization fee and then I'll pay you a rip Like a quarterly rip on We're either a flat monthly licensing fee. I have no idea how many people are going to download this, right? So that's probably the best course of action like hey, you're making a Thousand bucks a month. I'll pay you 200 Let's pay you 200 a month to have to as a license fee and then we can sort of work out Another deal after that, but also I will I will helping market super-us. If you really think it's that great, I'll help you market it, but you have to cut me in on super-us.\n00:30:10 - Tina Marie (profitdriversinc.com)\nYeah. I vacillate instantaneously between their short-sidedness, but also the fact that, like, maybe reality is a little bit...\n00:30:26 - Dan’s iPhone\nI mean, I get it. It's big idea to see us, right? It's like they're so married to this thing. It's like... And then I'm not risking anything, right? It's like the only risk I'm taking is that they'll cut me out, but then I'll lock them into like a five-year deal. Like I want a five-year deal that you cannot back out of, and it will be very similar to what we did with like exam matrix when we got, we licensed their software and rebranded it, but we did sell it. And then... And we had a five-year deal that they were locked in. when they sold it, that contract went with them. when that guy sold it, that contract went with them until the final buyer was starting to be an addict and started re-interpreting the contract. And we were already on the path of building our own software in the background. And then lo and behold, when our contract ends, we had our own software.\n00:31:27 - Tina Marie (profitdriversinc.com)\nOops. I feel like y'all didn't get left again at the same time. I slept terribly last night.\n00:31:37 - Dan’s iPhone\nI'm not sure if I was sleeping anymore.\n00:31:39 - Tina Marie (profitdriversinc.com)\nthought I like, oh. I stopped wearing my Applewats and my Aurorang because I sleep better without them. But I also got a lot of data for a long time. So I know, you know, got my baselines really good. But I also ate garbage yesterday.\n00:31:56 - Dan’s iPhone\nSo there was that.\n00:32:00 - Tina Marie (profitdriversinc.com)\nI needed. that it was a girl thing. was like, I'm eating cake and Mexican.\n00:32:04 - Dan’s iPhone\nAnd cake.\n00:32:05 - Tina Marie (profitdriversinc.com)\nYeah. Okay. Yeah. Okay. let me go through this. So one of the things that we're talking about was defining who should I have a community because they're not for everyone. Like, how big should your following be? What's the criteria? there's, I think I already said following size, that kind of thing. Have you guys talked about that at all?\n00:32:39 - Dan’s iPhone\nUh, no. I don't think that came up on the call like it was supposed to.\n00:32:47 - Tina Marie (profitdriversinc.com)\nOkay. So I'm going to do this and say, oh, What would you call that call that a mom call or?\n00:33:07 - Dan’s iPhone\nYes, Monday.\n00:33:11 - Tina Marie (profitdriversinc.com)\nMonday what?\n00:33:12 - Dan’s iPhone\nMom.\n00:33:13 - Tina Marie (profitdriversinc.com)\nYeah.\n00:33:14 - Dan’s iPhone\nI think it says rent. mean, I think the meeting is like to rent the table.\n00:33:20 - Tina Marie (profitdriversinc.com)\nOkay. Oh, actually said that earlier to her. Oh, fan flowy call log fan flowy call. Dan wants to discuss nine thirty nine sixteen seven twenty nine. I don't want to. I don't to a document making brand new change and I don't even have to edit access anyway so I'll put that in there um I'll just mark bring a list of stuff stuck on the call because he clearly has one where does it live I never got that you just get that yeah where does where does that how does that happen the google doc okay um what are you yesterday yes she said that that it that must be the fan flowy call-up google doc or something else huh yeah that's it so it's not I thought it was a transfer to my what what transfer why are you some of the transfer I guess that's what's called I'm no idea oh yeah what are minutes of you maybe more like it let's see That's interesting. Beta testers for the seating planner.\n00:35:17 - Dan’s iPhone\nHow that going? What am I Google answer? I went through my email and I found every Google ads rep that's ever reached out to me. He's like, I guess they just cycled her and give you a new one every quarter. I emailed all of them. Okay. And the oldest one, which is weird. So I just got a new one like after this started. So I think I got a new one on like Tuesday, randomly emailed her, emailed the one back to me yesterday. And we're like, are you still having this problem? And I just emailed them like, yes, still having this problem. They're like, oh, because they're like, if you're in the problem, I can escalate it. It's pretty run a mic. So hopefully it'll get escalated and solved. But I'm still stuck. Like, I cannot get ads to run on these accounts that have this payment or a file issue. Oh, and also, I don't want to run this on Mark's card, even though Mark's like, oh, you can put on my card. No, I can't, because it's mine. This is not yours, Mark. This is mine.\n00:36:41 - Tina Marie (profitdriversinc.com)\nSo you can't get beta testers, because you need to run ads? OK. OK.\n00:36:54 - Dan’s iPhone\nIt can lead to your car. The leads will lead to beta. to test versus the thought yeah no I got that um yeah no it's just the thought now we're gonna breathe it oh you're red is great let's see what is the like status of that project I did one and I sent it to Sean and was like hey can you peruse this and see us right I don't know if he's like that yet I'm pretty sure I'm right um and I'm doing the other one but the other one the chat TPT was nowhere near successful with the second round I don't know why because it's the language is a little more nuanced than whatever so when it categorizes a bunch of stuff they're all wrong but a lot. I have to manually go through and like recategorize them and there's just taking forever. So I'm doing chunks. And then, of course, I screwed up and resorted the sheet and then lost my place and I couldn't resort it back to where it was. And I was like, oh, great. So I didn't start over, but I'm probably doing duplicative work because I don't recognize stuff that I had already done. But whatever, just don't sort it again.\n00:38:31 - Tina Marie (profitdriversinc.com)\nYou cut out for a minute. So I know. I think I got that just a minute.\n00:38:38 - Dan’s iPhone\nI'm doing a second one. So the first one worked out.\n00:38:41 - Tina Marie (profitdriversinc.com)\nI did a second one. You know, I have, I'm wondering sometimes now because chat GPT like about two and a half months ago, maybe three months ago now, probably two and a And I'm wondering if like. like if that's well obviously I think something actually happens because I used it too many times for that logic to make any sense for it to like be less logical and it is less logical so there are two kinds of things that I think about is it is it a I don't know like I wonder if it's setting it up so that we are wowed by the next version so much because it's so much better than this version because they backtracked it or if I don't know like throttling access and we're not really getting that for like I don't know what it is with something change and it is not as good right it's not precise but just stupid people started using it with us and therefore they make it dumber yeah but I will send you to your windows user what your windows user oh no you're windows can Good or so or no? No, I haven't.\n00:40:02 - Dan’s iPhone\nI use I have I've had both a parallel Huh? Do you parallels? Can you run windows on Mac?\n00:40:11 - Tina Marie (profitdriversinc.com)\nI don't know. I don't I mean I don't have it set up like that What is parallels?\n00:40:16 - Dan’s iPhone\nIt's not like it's so later. Yeah So Nvidia has their own gpt And it's like we started using the yesterday, so I won't send it to you unless it's good But it's it's called like Something like chart RX, so it's like specifically for dealing with data So I gave I had Eric install parallels and that yesterday and then he uploaded like all of Mark's blog posts and we gave it 40,000 records and Now I want to query that data set and say Tell me every city California city that is mentioned in these 40,000 posts, and then see how it does. And then I because I really just need the city names, and I'm like, how the hell am I going to get these across 40,000 posts?\n00:41:11 - Tina Marie (profitdriversinc.com)\nRight.\n00:41:12 - Dan’s iPhone\nAnd then see how it does, and then be like, all right, now tell me the frequency of those cities, then be like, Hey, me what counties are mentioned. But I guess first, I don't know if have to teach it first, like, Hey, here are all the California cities and counties, that's easy to get. Well, we're going to see, but then it's also like, we're going to feed it the categories that SEO people created. And we're going to say, All right, anywhere. It's actually hard to do this. But what I wanted to do at the end is spit back out the CSV, and then add a column for categories, and then give it like, if there's a city make that a category, if there's a county make down a category, and then I'll prioritize the category. or the blog post category is for lack of a better term. And then I'd say if any of the blog post categories exist, you're allowed to add two. I don't want any more than four categories for any post. So you can add two by priority. if hit and run were the number one priority and hit and run was there, you'd use hit and run. And then whatever, right? And see if it can do that because we need, I need four categories applied to every blog post across 40,000 posts. All right. I'd like doing that manually. So let's see. But chat TPT borked, I thought I could even read the sheet.\n00:42:45 - Tina Marie (profitdriversinc.com)\nYeah, I'm interested to see. I mean, so is NVIDIA stuff using OpenAI?\n00:42:54 - Dan’s iPhone\nI actually don't know. I just stumbled on it. Just one of those weird random things, like an all of a sudden. two days later, I'm like, oh, we can do this. It's like, I wasn't looking for it. I don't know why it came into my purview, my view, well, whatever. There's another one too. There's one called, I don't think it's gonna be good for this, it's called base.ai. And it allows you to launch your own serverless agents, I think, is, I thinking that might be for something else. Then my buddy is like all into like just building your own rag environment, like on your computer and just running into LLM locally.\n00:43:42 - Tina Marie (profitdriversinc.com)\nRag environment?\n00:43:44 - Dan’s iPhone\nYeah, I forget what it stands for, but that's the thing. you set up a rag, and we're going to there.\n00:43:51 - Tina Marie (profitdriversinc.com)\nSo I'm like, I'm- It's generation.\n00:43:53 - Dan’s iPhone\nYeah, I'm not going down that road at all.\n00:43:57 - Tina Marie (profitdriversinc.com)\nWell, I actually wanted to have like You can. Good night. server but I don't the thing is it's not like a there's two ways to look at it in one way it's not a great use of time because it's tedious and long there's a huge learning curve it'll take a while but on the other end of it the what we know about it and and what it and this goes back to kind of my whole generalist approach to business anyway is that my speed of implementation with whatever comes out will be so much faster and more leverage because I will have an internal understanding of how it works and also when it comes down to like cost and customization being able to have something on a server level and then also privacy to have your own server like and I think that that's going to be really important and I think that anyone I think that at that kind of privacy and having our own servers is going to be more commonplace than it's ever been before because of that's the biggest thing right now right is having everybody's data accessed all the time and how that's used. Did you see there was a there's these kids from Harvard that made and they connected their meta glasses to chat GBT and they built a program that would scan faces of people they are looking at and be able to pull up their name address phone number and all that kind of identification of course yeah I mean we knew that going to happen soon but that is already here like that's the thing and that's what we know about.\n00:45:53 - Dan’s iPhone\nDid you see Elon's robot that they just put out yesterday? Duke, people having a conversation with it. It's frightening. It's frightening. Like, oh my God, it sounds like a person. Like, it's way beyond what I thought it would be. oh, okay. And he's like, this is gonna be the best song product we ever make. Like, okay. I mean, we can it. I'm full on like, Rhonda by Tesla because they are not a car company. Period.\n00:46:30 - Tina Marie (profitdriversinc.com)\nNot a car company. No, van.\n00:46:33 - Dan’s iPhone\nI just see Robo van. Have you seen that? Oh, yeah. think you're up.\n00:46:38 - Tina Marie (profitdriversinc.com)\nThat's crazy. The truck's getting rocks.\n00:46:41 - Dan’s iPhone\nThe taxi. Yeah, it was a taxi to van and the robot or the piece of the rolled out yesterday.\n00:46:48 - Tina Marie (profitdriversinc.com)\nIt is crazy how fast, like our sci-fi movies are coming. Oh, yeah. Yeah. That's the thing about pacing, though. is it's always been faster than well it's not always been faster like but but it is now faster than people think it is but but the the rate of increase is way faster than anybody thinks it's going to be yeah because of the compounding effect and all the brains working not necessarily together but they are all being able to pull from other people's learning curves and technology like there's so much access to a hive via the internet but also the worldwide networks of people who know people that's never existed before like it does now no no and my buddy is always like he thinks everyone should have their own like personal AI that's like really built around their data set that's sort of like what you were saying a minute ago and I ever\n00:48:00 - Dan’s iPhone\nEvery day, I'm like, oh, yeah, that's, I could see where that would be helpful. And especially if you could have it sort of use your local data set and then also be tapping into the LLM, right? it's like, oh, and maybe you prioritize like I want, you know, consider this data source first and then if there's something missing, then go out.\n00:48:23 - Tina Marie (profitdriversinc.com)\nYeah, and the, anybody that understands if this, then that logic will do really well because it's conditional logic that those things need to go with, right? If this does not, and if not this, then this, that type of thing. And there are a lot of brains that don't do that. There are a lot of that do, but percentage wise, most of them don't. so the opportunity for all these micro markets around AI exists and the, and I'm not had this thought before, but thinking about it now, that's where competition will still be is because it's the same way. Basically, it'll be like the same reason why one particular flavor, one person's particular flavor of voice would draw them to their business coaching over, let's say, Tony Robbins or some other big corporate mega name, right? would be the same reason somebody would buy that lower level AI because whatever, just that whole kind of nuance of personal connection and voice match and things like that. Anyway, interesting or fascinating, but to the point of the server, like I have these machines, but none of them are fast enough and I want to get it, but it's been so long since I've built a machine and know the components and I'd have to upgrade the motherboard and I'm like, oh, do I really want to do this? I wish I could just get one of my kids, like, train No, but there you've got their own interest and they're not here. So like here like in that interest. Anyway, oh, speaking of kids, how's Abel and doing?\n00:50:11 - Dan’s iPhone\nYou text here and there text to her today.\n00:50:13 - Tina Marie (profitdriversinc.com)\nShe respond when I saw she read it. And yeah, somebody's going to teach her how to turn that off.\n00:50:24 - Dan’s iPhone\nI thought she did. I think she did in our group chat, but she didn't turn it off and but yeah, well, it's positive.\n00:50:35 - Tina Marie (profitdriversinc.com)\nShe doesn't turn it off. Probably a good thing. She's adjusting. Well, she doesn't, but it's hard.\n00:50:41 - Dan’s iPhone\nHow's Denise?\n00:50:43 - Tina Marie (profitdriversinc.com)\nIt's fine.\n00:50:44 - Dan’s iPhone\nShe's just, which Mary was the one like Mary was just getting. You know, your kids self diagnosed themselves with mental problems. Yes. What is up with that? Like, I don't understand this generation.\n00:51:00 - Tina Marie (profitdriversinc.com)\nno. Oh, it's not just the generation, but it's the access that they have. So it's been a phenomenon in medical students since the beginning, where if they read about symptoms, then they can add, yeah, yeah, in fact, in my classes every year, they warn us like, don't think you have this just because you read it, because that's what everybody does and don't freak out. Oh, and yeah, so it's just that they've got so much access to this information that it happens. They see themselves in this thing. And what they don't realize is the nuance of it and the overlap and all these other conditions again, if this than that type of thing, but there's this also need to feel like we're seen and understood or to give meaning or logic to emotions that we have. And so when you find a label that seems like it fits, now you've feel like you have some understanding. And so that's the logic behind it, like, oh, okay, I understand this now. And also, I'm not accountable. not my fault.\n00:52:12 - Dan’s iPhone\nSo she's going through this series of self-diagnoses. And it's like she's literally trying to find one that we'll ascend to. And then because then the natural step after that is to go talk to your therapist. And we're like, okay, but first she had ADD. And I'm like, you do not have ADD. hate to break it to you, but like, you're born with that. And it would have shown up way before 16 and PS.\n00:52:47 - Tina Marie (profitdriversinc.com)\nnothing, girls.\n00:52:48 - Dan’s iPhone\nWell, she doesn't have it. Like there's nothing ADD about you at all, at all. But it's like you can sit there and draw for hours on end. literally hours. I'm like, 80 people cannot do that. then she was like, and she's like, well, I don't have the HD part. I'm like, well, there you go. Now you're reading definitely too much. Then that turned into, then she started saying, I can't sit still. going crazy. can't sit still. Like, yeah, no. Okay. You literally can't sit still. You don't say you can't sit still. It's like you'd be bouncing around the river together. Then it was stress. Okay, well, what's stressing you out? And then she liked that one. And now she's sad all the time, mostly.\n00:53:41 - Tina Marie (profitdriversinc.com)\nI'm like, yeah.\n00:53:43 - Dan’s iPhone\nAnd I'm like, what are you doing? So then she keeps, she won't say it to me because, you know, I'll be like, try to solve it. And then with Denise, Denise is like, well, I could find like a Catholic counselor. And why does that have to be Catholic? Why does it have not have to be? it's like, do you want a counselor or not? So now it's going to be a specific one, which one? Which one should it be?\n00:54:06 - Tina Marie (profitdriversinc.com)\nIf you know so much.\n00:54:09 - Dan’s iPhone\nSo, yeah.\n00:54:13 - Tina Marie (profitdriversinc.com)\nIt's hard.\n00:54:13 - Dan’s iPhone\nIt was homeschooling. At some point, she wanted to be homeschooled and that went away. It's like, okay.\n00:54:20 - Tina Marie (profitdriversinc.com)\nYeah. Yeah. I had one that she got her GED last year and, but she was, talk a class through everything, math, science, all that stuff. Then you get to high school and a lot of the teachers just are spazs. They're not even good at what they do. Sometimes they're dumber than my girls. They're poor leaders. It gets really frustrating. And then you're dealing with all these other students that have poor parenting, poor hygiene, not that intelligent. Like, it's just such a, you nothing out. in the world is like high school and it's it's rough while everybody's got volatile hormones and their brains are going through all these different changes their emotions they're not getting enough sleep and school starts super early even though their circadian rhythms are jacked up at this time it's fun it's lots of fun yeah yeah um okay let me so uh so you can't run any ads still at all is that what you're I cannot run ads in four accounts but the other ones that have the same payment profile well perfectly fine but how many are those oh i don't know like it's there you know there's a bunch of old accounts that i don't even use anymore but um so probably like three maybe and i don't want to\n00:56:00 - Dan’s iPhone\nI them because I'm like, I don't want to mess with those accounts and I don't want to mess with, you know, these are none of these are connected to another 71, luckily. And they're, you know, my opinion profile isn't connected to marks. So I was like, I don't want to, I don't know why this is happening. don't understand why it's happening. My account is approved and it has been for years. like, something's off somewhere. Maybe it was because I I don't know why. don't know why. I think it's associated with one and they're applying it to the other is what I think is going on. Yeah.\n00:56:37 - Tina Marie (profitdriversinc.com)\nAnd you're like, sorry.\n00:56:40 - Dan’s iPhone\nNo, I just don't know what's going on.\n00:56:43 - Tina Marie (profitdriversinc.com)\nYou're, um, so you were saying like last week or Monday, I think you said you got that new ad rep and you sent them a bunch of stuff, but then you're like, they keep changing. So is, do you have somebody working on it for you?\n00:56:59 - Dan’s iPhone\nSupposedly right now. It's more deep the ad rip from six months ago. That's the only one that responded. No one else is responding. I'm sure it'll go into Google speed, which is not found.\n00:57:14 - Tina Marie (profitdriversinc.com)\nYeah. This is the the the the the time of it's not what you know but who you know kind of thing.\n00:57:27 - Dan’s iPhone\nRight. That's why I jumped into my emails. was like, well, like they contacted me.\n00:57:33 - Tina Marie (profitdriversinc.com)\ncan't like them.\n00:57:34 - Dan’s iPhone\nRight. I just think it's hilarious that the one that just got assigned to me and specifically is assigned to D&D as a respondent.\n00:57:43 - Tina Marie (profitdriversinc.com)\nSo we found out that so my guy had they got shut down and he went through all of his contacts to find an old connection that I get like you out like had or maybe like you I don't remember how nothing to do with that particular one but anyway Well, what somebody told him who shouldn't have said anything was that it it appeared to be competitor causing problems That got them shut down that's the thing so like Google Amazon and Facebook They own the majority of the media space and we're in election time where the space is like More valuable and I don't know what the overlap is like because there's only So much ad space on any particular thing and does that like does not related info Take up space like is that a reason I don't know but competitors for sure like Amazon like there That's this whole thing and That's even more reason why the who we know like you have lots of conversations with people Knowing who can help you on any of the the Media platforms cuz cuz all it would take would be for somebody Who competes with another 71? to get you guys shut down like playing a dirty game that's totally possible and And Like what do you do after that? They you're so much And that's to also why diversifying traffic sources is going to be so important diversifying and then Maintaining the most powerful relationships you can where it comes to The the main media sources, which is almost impossible, but it doesn't mean But and you know what happens synergistically Divinely universally whatever, you set that intention and things become more possible. that's, that's the dirty game that we are all at risk of is that if we, if the business is dependent upon ads from one of those big three where you can get shut down for anything, you don't know what it is, they won't tell you, you can't get a hold of a real person. There's no rhyme or reason or logic behind it.\n01:00:28 - Dan’s iPhone\nLike if that's the bread and butter of your business, you're screwed.\n01:00:32 - Tina Marie (profitdriversinc.com)\nYeah.\n01:00:32 - Dan’s iPhone\nAnyway, lovely, colorful thoughts.\n01:00:36 - Tina Marie (profitdriversinc.com)\nhaving this week. Holy , like you could just destroy a huge company. I will, I guess it's not really huge like when you think about it, but it's not but still there's like a few families that are dependent upon it. I guess it's not really huge. It is to the average person who's like millions of dollars.\n01:00:58 - Dan’s iPhone\nWow, you know, when they're\n01:01:00 - Tina Marie (profitdriversinc.com)\nI think that these platforms have been, yeah, like with all the crap that we've gone through with Wolfer for on brain tree, like brain tree doesn't give a about the account.\n01:01:13 - Dan’s iPhone\nYeah, give a . They're the that they've essentially like crippled.\n01:01:18 - Tina Marie (profitdriversinc.com)\nThey would have been out of business. We didn't switch the stride.\n01:01:21 - Dan’s iPhone\nYeah. It's taken weeks and get it's still not done. It's unreal. And then brain trees shut down, reset you, just shut them down. And I was like, really? Locked up their money, shut them down, and said it was because they were selling supplements. Where? Where are there supplements for sale on this site? And then there's, and it's our decision is final.\n01:01:49 - Tina Marie (profitdriversinc.com)\nDon't bother writing back.\n01:01:50 - Dan’s iPhone\nWow. Your decision is based on nothing. It's final. Okay, sounds great.\n01:01:57 - Tina Marie (profitdriversinc.com)\nYeah, so always having another option and back door, but like, how do you do that? How do you, like, how do you have a secondary option that's even comparable to GMB?\n01:02:07 - Dan’s iPhone\nYou don't, you don't.\n01:02:11 - Tina Marie (profitdriversinc.com)\nThat's crazy. Yeah.\n01:02:13 - Dan’s iPhone\nBut, but I think, but I mean, I mean, problem there is that, but like, their entire business, like what, that's like with Mark three years ago, Mark last monkey three years ago, he was up .\n01:02:27 - Tina Marie (profitdriversinc.com)\nIt's great. Yeah.\n01:02:28 - Dan’s iPhone\nNot so much.\n01:02:30 - Tina Marie (profitdriversinc.com)\nIt made me think about, though, the strategy between car accident claim center is like, what if you have two and you'd have to run them on completely different accounts, probably using a VPN, completely different IPs, completely different business names, like, is all the separation you could possibly have. And one is branded traffic and one is non branded traffic, just in case, and maybe to help mitigate, doesn't mean that they won't be you're out and shut you down, but um.\n01:03:03 - Dan’s iPhone\nOh, yeah, yeah, totally. Yeah, you wouldn't want to mix, especially the other one works for both work. You want them separated. That's why I'm gonna, I want to copy the valiant thing through a different domain. So it's like, oh, I'm gonna use similar domain, but it's different.\n01:03:21 - Tina Marie (profitdriversinc.com)\nYeah, I think, yeah, that's the. Anyway, that's that's the thing that we have to be thinking about is what is what is the. It's not the variable, but but what diversity can we create even within the environment as a a backdoor, kind of not a backdoor option, but just a backup option that maybe isn't as powerful, but still. And honestly, maybe it is a data on a traffic plan. Like you have kind of like this parallel business that looks like the whole point of it is, you know, generating traffic for multiple businesses and you're selling leads, but really it's a if everything hits the fan I'm funneling all those leads to my own business. I don't know You don't want to fund your competitors, but Maybe sell the data to somebody who's not competing But still interested in relative data. I Don't know what that looks like, but either way, I feel like that's the chess move is to Know that traffic can get shut down. And so how do you have a backup traffic source on the same platform? That could be redirected to an existing business if it got shut down and maybe it's not the same amount of volume, but it keeps you from like going from Everything to zero and maybe you only lose like 50% of it or something While you work it out Yeah, I mean that's extremely difficult to do on google for sure Um, that's like Is it this this business was?\n01:05:00 - Dan’s iPhone\nthat dependent on that one source.\n01:05:03 - Tina Marie (profitdriversinc.com)\nYes. Yeah. It was the thing that blew it up.\n01:05:08 - Dan’s iPhone\nRight. And it's also the thing that blew it up in both directions.\n01:05:12 - Tina Marie (profitdriversinc.com)\nYes. But it's because of the nature of the business that it's the kind of thing that people go and get local reviews. So, and they were all tied to this one account. So it's definitely a learning lesson. Um, but it, but it, the growth was explosive and fast. And so was a shutdown, although, but it did get turned back on, but it was, it was crazy. Um, this whole thing again, back to pace of the evolution. It's, it's hard to, you have to be consciously thinking about the pace and the potential change and the potential destruction at all times to be able to be even remotely prepared for things happening because apathy. for even like a month or a few months could put you in a situation where something happened and like you took your eye off the ball and that the ball is your building up against this platform yes and you don't control any of it right totally yeah anyway all right well sir that's Friday huh oh how was how was mom time yesterday it was good i mean she's definitely like she was like who's your who's your sister who who's your person i go who's my person i know you have a secretary i go no who helps you i go stacy i'm going to reach out to stacy and tell her to put bomb lunch once a month in your calendar i said she'll do it i'm going to i'm going to reach out to her i don't know she really will she might we'll see um so she clearly wants that and then we went and visited my\n01:07:00 - Dan’s iPhone\ndad and he is oh man he is so much worse i was like he didn't remember anybody like any any of other than like the immediate family like he thought his brother was dead his only brother that's alive he thought he was dead and then he couldn't he didn't know my cousin sadly my cousin just passed away like last week and he didn't know who she was who's kid michelle who's michelle your brother's daughter what brother Paul Paul Paul has a daughter like Paul has two daughters he does i don't remember that but that was the interesting thing is he kept saying i don't remember that i don't remember that then he didn't remember he didn't remember his other brother's son who has the same name i was like are you talking about Jackie and you write so the That's Jack and the son's Jackie and what are you talking about Jackie? Who's Jackie? I'm like, Jack's son. I don't remember that. Is Jack have kids? Other kids were like, no. he goes, is he the oldest? And we're like, no. Like the fourth. And so I like, oh boy. And then he didn't like, didn't remember Lisa. He thought Lisa had a job somewhere. I don't know where he thought she worked, but he didn't remember that. He thought that my brother's garage, where he lived, was not remodeled. He's like, I want to go finish that.\n01:08:37 - Tina Marie (profitdriversinc.com)\nwant to go.\n01:08:37 - Dan’s iPhone\nI think we should build that out. We're like, it's filled out. He's like, no, no, I mean, like, put up insulation, put in wallboard. No, dad, that's all we're done. They put in wallboard? Who? We're like, okay. So, and then when we left, my mom's like, he is so much worse than the last time I was here. I was like, really? She goes, yeah, it's a. A lot of work seems to get open, which I thought.\n01:09:04 - Tina Marie (profitdriversinc.com)\nwas like, this seems worse. Does your mom have, like, good friends?\n01:09:10 - Dan’s iPhone\nNo, doesn't. Like, she did. The woman across the street, they were, like, besties. then she passed away. So there's one. And then her nephew moved in. He just moved out because he couldn't afford to live in California anymore. So that was dated. So David's gone. So all she's got is my brother. And then my brother's hilarious, right? she got that operation. So like, they're living together, which is going to be a lot. So she told me, I got a lot of my brother for this. So she'll come out and start talking to him, and he'll just look at her and go, Mom, it's quiet time right now. And then I go, what do you do? She goes, I go back into my room, sick. I'm like, that's a very nice way of putting it. She's like, no, I respect it like he's, you know, he's come. been working all day. You got to be on it.\n01:10:03 - Tina Marie (profitdriversinc.com)\nWell, she's a mom, so she probably gets that, but.\n01:10:07 - Dan’s iPhone\nYeah, I mean, she's very much still with it, right? she's still very sharp, and it's like, OK, yeah, she can't drive, right? So she just lost that. And then, you know, she does, the Ubers are so expensive. And then she's been trying to find an alternative to Uber. then they're all ludicrous. It's like, there's this other service. It's a minimum $150. It's three hours, minimum three hours, $150. And then they're a nurse. And she's like, I don't need a nurse. I just need like a sidekick. But how would you even like provide a service like that, right? have to do background check on these people, like, you know. So yeah, how much?\n01:10:53 - Tina Marie (profitdriversinc.com)\nIs she like interested in retirement community at all?\n01:10:57 - Dan’s iPhone\nNo. Well, then another. money, right? All the money is going to my debt. Yesterday, she literally said this. She was like, we'd all be better off if I died. And I was like, that's where you're at. And she's like, well, it would just make things easier. And she's like, you know, then he'd get all the money, and then he'd get even more money because I passed away. And she's like, this is eventually going to like, I'm eventually going to run out of money. And I like, well, do you don't have to worry about it until that happens. No, I don't think that's the problem. Like, it's not where she's living.\n01:11:39 - Tina Marie (profitdriversinc.com)\nIt's like, how do you?\n01:11:41 - Dan’s iPhone\nWell, love me. You're gonna be thinking about it right now. It's like, kind of be some sort of thing network thing that you can tap into where they come pick you up. Like, it's gonna be some sort of group affair. Yeah.\n01:11:54 - Tina Marie (profitdriversinc.com)\nLike, if you look at longevity, the people that live the the longest longest are the people.\n01:12:00 - Dan’s iPhone\nthat live in multi-generational houses and have basically like open door policies and people visit each other a lot and she's like super at that because the joke was we should just get you in a joining room here she's like I'm not I'm not moving into a place like this and I think she just means in general like she doesn't want to live but she would literally arrive because she everybody loves her and she everyone times she was she's the one that like it's like she has an invisible couch that she takes around and they lay down on it and just spill their guns she would you'd go into the store to get like a loaf of bread you know pick a milk and she'd come out with like someone's life story I'm like oh my god you were only in there what is that making it be like take care of other people for a little bit each week or could you do this just for three months or six\n01:13:00 - Tina Marie (profitdriversinc.com)\nonce or whatever and frame it like she's there to help other people which would be true because what she did she was a nurse that was right but but that's what I'm saying but like maybe she needs it to be positioned as this is a thing that you need to go do for other people could you go do this for other people for a little while and just because like they're lonely they need help and they don't have anybody who will do it because everybody's busy and up in their own world but and then maybe she just finds what she needs because we all especially women like men do too many projects that are things and women need projects that are people and yeah so the other thing she can't do right now is because of this recovery from the surgery right so right now it's literally just about like she just needs interaction outside of my brother i think she's but she can't get it because she's homebound really\n01:14:00 - Dan’s iPhone\nCome on, better turn. Luckily, she's got the dog. The dog does help. They never had a dog. We never had a dog run up. She loves this dog. The dog's the best, Aw.\n01:14:12 - Tina Marie (profitdriversinc.com)\nMan, I can't turn off mom mode, but I also can't turn off daughter mode and sister mode and all that other stuff. And it just breaks my heart, like, how much loneliness is in the world when there's like, but everybody's not everybody's lonely. But like, so many people are lonely. I'm like, you know, you guys could solve that if you would just, like, spend time with each other. Right. anyway, okay, I will be quiet.\n01:14:38 - Dan’s iPhone\nI will let you go.\n01:14:39 - Tina Marie (profitdriversinc.com)\nwait, I don't know if we're talking to Mark Monday. I will check on that, because he is on vacation. But I know how he is. He pretty much doesn't have our council air calls. I will check. And then I will let you know if there's any change. Otherwise, we will soon. I will talk to you Monday.\n","contentPreview":"00:00:01 - Tina Marie (profitdriversinc.com)\nHello.\n00:00:02 - Dan’s iPhone\nHello.\n00:00:04 - Tina Marie (profitdriversinc.com)\nAnd how is Dan Ryan today? Mark's dog has pneumonia.\n00:00:13 - Dan’s iP...","processedAt":"2025-05-04T03:40:52.521Z"}